
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1507:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1504:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1507:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::once_flag
         0 |   unsigned long __state_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale::id
         0 |   struct std::__1::once_flag __flag_
         0 |     unsigned long __state_
         8 |   int32_t __id_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__basic_string_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>
         0 |   class std::__1::allocator<char> (base) (empty)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
         0 |   class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
         0 |     class std::__1::allocator<char> (base) (empty)
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<char>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |     class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
         0 |       class std::__1::allocator<char> (base) (empty)
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<wchar_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2>
         0 |   class std::__1::allocator<wchar_t> (base) (empty)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> >
         0 |   class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2> (base)
         0 |     class std::__1::allocator<wchar_t> (base) (empty)
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |           union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<wchar_t>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> > __r_
         0 |     class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2> (base)
         0 |       class std::__1::allocator<wchar_t> (base) (empty)
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |             union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::money_base::pattern
         0 |   char [4] field
           | [sizeof=4, dsize=4, align=1,
           |  nvsize=4, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__bitset<0, 0> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct B1
         0 |   int v1
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f994edb29a8 <object_model_refined/3_data/08_pointer_to_data_members.cpp:14:1, line:16:1> line:14:8 referenced struct B1 definition
|-CXXRecordDecl 0x7f994edb2ac8 <col:1, col:8> col:8 implicit struct B1
`-FieldDecl 0x7f994edb2b78 <line:15:5, col:9> col:9 v1 'int'

Layout: <CGRecordLayout
  LLVMType:%struct.B1 = type { i32 }
  NonVirtualBaseLLVMType:%struct.B1 = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct B2
         0 |   int v2
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f994edb2be0 <object_model_refined/3_data/08_pointer_to_data_members.cpp:18:1, line:20:1> line:18:8 referenced struct B2 definition
|-CXXRecordDecl 0x7f994edb2d08 <col:1, col:8> col:8 implicit struct B2
`-FieldDecl 0x7f994edb2db8 <line:19:5, col:9> col:9 v2 'int'

Layout: <CGRecordLayout
  LLVMType:%struct.B2 = type { i32 }
  NonVirtualBaseLLVMType:%struct.B2 = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct D
         0 |   struct B1 (base)
         0 |     int v1
         4 |   struct B2 (base)
         4 |     int v2
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f994edb2e20 <object_model_refined/3_data/08_pointer_to_data_members.cpp:22:1, col:20> col:8 referenced struct D definition
|-public 'struct B1'
|-public 'struct B2'
`-CXXRecordDecl 0x7f994edb2fc8 <col:1, col:8> col:8 implicit struct D

Layout: <CGRecordLayout
  LLVMType:%struct.D = type { %struct.B1, %struct.B2 }
  NonVirtualBaseLLVMType:%struct.D = type { %struct.B1, %struct.B2 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct P3
         0 |   (P3 vtable pointer)
         8 |   double x
        16 |   double y
        24 |   double z
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::ios_base
         0 |   (ios_base vtable pointer)
         8 |   std::__1::ios_base::fmtflags __fmtflags_
        16 |   std::__1::streamsize __precision_
        24 |   std::__1::streamsize __width_
        32 |   std::__1::ios_base::iostate __rdstate_
        36 |   std::__1::ios_base::iostate __exceptions_
        40 |   void * __rdbuf_
        48 |   void * __loc_
        56 |   std::__1::ios_base::event_callback * __fn_
        64 |   int * __index_
        72 |   size_t __event_size_
        80 |   size_t __event_cap_
        88 |   long * __iarray_
        96 |   size_t __iarray_size_
       104 |   size_t __iarray_cap_
       112 |   void ** __parray_
       120 |   size_t __parray_size_
       128 |   size_t __parray_cap_
           | [sizeof=136, dsize=136, align=8,
           |  nvsize=136, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ios<char>
         0 |   class std::__1::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     std::__1::ios_base::fmtflags __fmtflags_
        16 |     std::__1::streamsize __precision_
        24 |     std::__1::streamsize __width_
        32 |     std::__1::ios_base::iostate __rdstate_
        36 |     std::__1::ios_base::iostate __exceptions_
        40 |     void * __rdbuf_
        48 |     void * __loc_
        56 |     std::__1::ios_base::event_callback * __fn_
        64 |     int * __index_
        72 |     size_t __event_size_
        80 |     size_t __event_cap_
        88 |     long * __iarray_
        96 |     size_t __iarray_size_
       104 |     size_t __iarray_cap_
       112 |     void ** __parray_
       120 |     size_t __parray_size_
       128 |     size_t __parray_cap_
       136 |   basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       144 |   std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=152, dsize=148, align=8,
           |  nvsize=148, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ostream<char>
         0 |   (basic_ostream vtable pointer)
         8 |   class std::__1::basic_ios<char> (virtual base)
         8 |     class std::__1::ios_base (primary base)
         8 |       (ios_base vtable pointer)
        16 |       std::__1::ios_base::fmtflags __fmtflags_
        24 |       std::__1::streamsize __precision_
        32 |       std::__1::streamsize __width_
        40 |       std::__1::ios_base::iostate __rdstate_
        44 |       std::__1::ios_base::iostate __exceptions_
        48 |       void * __rdbuf_
        56 |       void * __loc_
        64 |       std::__1::ios_base::event_callback * __fn_
        72 |       int * __index_
        80 |       size_t __event_size_
        88 |       size_t __event_cap_
        96 |       long * __iarray_
       104 |       size_t __iarray_size_
       112 |       size_t __iarray_cap_
       120 |       void ** __parray_
       128 |       size_t __parray_size_
       136 |       size_t __parray_cap_
       144 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       152 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=160, dsize=156, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f994db64960 prev 0x7f994e0d2120 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, line:386:1> line:231:24 referenced class ios_base definition
|-VisibilityAttr 0x7f994db64a60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7f994db64aa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, col:24> col:24 implicit referenced class ios_base
|-AccessSpecDecl 0x7f994db64b40 <line:233:1, col:7> col:1 public
|-CXXRecordDecl 0x7f994db64b98 <line:234:5, col:33> col:33 class failure
| `-VisibilityAttr 0x7f994db64c50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:681:47, col:71> Default
|-TypedefDecl 0x7f994db64cb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:236:5, col:26> col:26 referenced fmtflags 'unsigned int'
| `-BuiltinType 0x7f994d032c60 'unsigned int'
|-VarDecl 0x7f994db64d40 <line:237:5, col:41> col:27 referenced boolalpha 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db64dc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db64da0 <col:41> 'int' 1
|-VarDecl 0x7f994db64e40 <line:238:5, col:41> col:27 referenced dec 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db64ec0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db64ea0 <col:41> 'int' 2
|-VarDecl 0x7f994db64f40 <line:239:5, col:41> col:27 referenced fixed 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db64fc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db64fa0 <col:41> 'int' 4
|-VarDecl 0x7f994db65040 <line:240:5, col:41> col:27 referenced hex 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db650c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db650a0 <col:41> 'int' 8
|-VarDecl 0x7f994db65140 <line:241:5, col:41> col:27 referenced internal 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db651c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db651a0 <col:41> 'int' 16
|-VarDecl 0x7f994db65240 <line:242:5, col:41> col:27 referenced left 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db652c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db652a0 <col:41> 'int' 32
|-VarDecl 0x7f994db65340 <line:243:5, col:41> col:27 referenced oct 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db653c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db653a0 <col:41> 'int' 64
|-VarDecl 0x7f994db65440 <line:244:5, col:41> col:27 referenced right 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db654c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db654a0 <col:41> 'int' 128
|-VarDecl 0x7f994db65540 <line:245:5, col:41> col:27 referenced scientific 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db655c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db655a0 <col:41> 'int' 256
|-VarDecl 0x7f994db65640 <line:246:5, col:41> col:27 referenced showbase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db656c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db656a0 <col:41> 'int' 512
|-VarDecl 0x7f994db65740 <line:247:5, col:41> col:27 referenced showpoint 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db657c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db657a0 <col:41> 'int' 1024
|-VarDecl 0x7f994db65840 <line:248:5, col:41> col:27 referenced showpos 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db658c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db658a0 <col:41> 'int' 2048
|-VarDecl 0x7f994db65940 <line:249:5, col:41> col:27 referenced skipws 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db659c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db659a0 <col:41> 'int' 4096
|-VarDecl 0x7f994db65a40 <line:250:5, col:41> col:27 referenced unitbuf 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db65ac0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db65aa0 <col:41> 'int' 8192
|-VarDecl 0x7f994db65b40 <line:251:5, col:41> col:27 referenced uppercase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db65bc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db65ba0 <col:41> 'int' 16384
|-VarDecl 0x7f994db65c40 <line:252:5, col:56> col:27 referenced adjustfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7f994db65d88 <col:41, col:56> 'unsigned int' '|'
|   |-BinaryOperator 0x7f994db65d20 <col:41, col:48> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7f994db65cf0 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7f994db65ca0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f994db65240 'left' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7f994db65d08 <col:48> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7f994db65cc8 <col:48> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f994db65440 'right' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7f994db65d70 <col:56> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f994db65d48 <col:56> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f994db65140 'internal' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7f994db65e18 <line:253:5, col:53> col:27 referenced basefield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7f994db65f60 <col:41, col:53> 'unsigned int' '|'
|   |-BinaryOperator 0x7f994db65ef8 <col:41, col:47> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7f994db65ec8 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7f994db65e78 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f994db64e40 'dec' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7f994db65ee0 <col:47> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7f994db65ea0 <col:47> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f994db65340 'oct' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7f994db65f48 <col:53> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f994db65f20 <col:53> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f994db65040 'hex' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7f994db65ff0 <line:254:5, col:54> col:27 referenced floatfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7f994db660d0 <col:41, col:54> 'unsigned int' '|'
|   |-ImplicitCastExpr 0x7f994db660a0 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | `-DeclRefExpr 0x7f994db66050 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f994db65540 'scientific' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7f994db660b8 <col:54> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f994db66078 <col:54> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f994db64f40 'fixed' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-TypedefDecl 0x7f994db66168 <line:256:5, col:26> col:26 referenced iostate 'unsigned int'
| `-BuiltinType 0x7f994d032c60 'unsigned int'
|-VarDecl 0x7f994db661f0 <line:257:5, col:36> col:26 referenced badbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db66270 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db66250 <col:36> 'int' 1
|-VarDecl 0x7f994db662f0 <line:258:5, col:36> col:26 referenced eofbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db66370 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db66350 <col:36> 'int' 2
|-VarDecl 0x7f994db663f0 <line:259:5, col:36> col:26 referenced failbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db66470 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db66450 <col:36> 'int' 4
|-VarDecl 0x7f994db664f0 <line:260:5, col:36> col:26 referenced goodbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db66570 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db66550 <col:36> 'int' 0
|-TypedefDecl 0x7f994db665f8 <line:262:5, col:26> col:26 referenced openmode 'unsigned int'
| `-BuiltinType 0x7f994d032c60 'unsigned int'
|-VarDecl 0x7f994db66680 <line:263:5, col:36> col:27 app 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db66700 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db666e0 <col:36> 'int' 1
|-VarDecl 0x7f994db66780 <line:264:5, col:36> col:27 ate 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db66800 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db667e0 <col:36> 'int' 2
|-VarDecl 0x7f994db66880 <line:265:5, col:36> col:27 binary 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db66900 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db668e0 <col:36> 'int' 4
|-VarDecl 0x7f994db66980 <line:266:5, col:36> col:27 referenced in 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db66a00 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db669e0 <col:36> 'int' 8
|-VarDecl 0x7f994db66a80 <line:267:5, col:36> col:27 referenced out 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db66b00 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db66ae0 <col:36> 'int' 16
|-VarDecl 0x7f994db66b80 <line:268:5, col:36> col:27 trunc 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f994db66c00 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f994db66be0 <col:36> 'int' 32
|-EnumDecl 0x7f994db66c70 <line:270:5, col:32> col:10 referenced seekdir
| |-EnumConstantDecl 0x7f994db66d30 <col:19> col:19 referenced beg 'enum std::__1::ios_base::seekdir'
| |-EnumConstantDecl 0x7f994db66d80 <col:24> col:24 referenced cur 'enum std::__1::ios_base::seekdir'
| `-EnumConstantDecl 0x7f994db66dd0 <col:29> col:29 referenced end 'enum std::__1::ios_base::seekdir'
|-TypedefDecl 0x7f994db66e30 <line:273:5, col:26> col:26 io_state 'std::__1::ios_base::iostate':'unsigned int'
| `-TypedefType 0x7f994db661c0 'std::__1::ios_base::iostate' sugar
|   |-Typedef 0x7f994db66168 'iostate'
|   `-BuiltinType 0x7f994d032c60 'unsigned int'
|-TypedefDecl 0x7f994db66e98 <line:274:5, col:26> col:26 open_mode 'std::__1::ios_base::openmode':'unsigned int'
| `-TypedefType 0x7f994db66650 'std::__1::ios_base::openmode' sugar
|   |-Typedef 0x7f994db665f8 'openmode'
|   `-BuiltinType 0x7f994d032c60 'unsigned int'
|-TypedefDecl 0x7f994db66f00 <line:275:5, col:26> col:26 seek_dir 'enum std::__1::ios_base::seekdir'
| `-EnumType 0x7f994db66d10 'enum std::__1::ios_base::seekdir'
|   `-Enum 0x7f994db66c70 'seekdir'
|-TypedefDecl 0x7f994db67010 <line:277:5, col:30> col:30 streamoff 'std::__1::streamoff':'long long'
| `-ElaboratedType 0x7f994db66fa0 'std::__1::streamoff' sugar
|   `-TypedefType 0x7f994da39fb0 'std::__1::streamoff' sugar
|     |-Typedef 0x7f994e0e0b58 'streamoff'
|     `-BuiltinType 0x7f994d032c00 'long long'
|-TypedefDecl 0x7f994db670f0 <line:278:5, col:30> col:30 streampos 'std::__1::streampos':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f994db67080 'std::__1::streampos' sugar
|   `-TypedefType 0x7f994da3a040 'std::__1::streampos' sugar
|     |-Typedef 0x7f994e0e07b8 'streampos'
|     `-TemplateSpecializationType 0x7f994e0e0710 'fpos<mbstate_t>' sugar fpos
|       |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|       `-RecordType 0x7f994e0e06f0 'class std::__1::fpos<__mbstate_t>'
|         `-ClassTemplateSpecialization 0x7f994e0e0600 'fpos'
|-CXXRecordDecl 0x7f994db67178 <line:281:5, col:28> col:28 class Init
| `-VisibilityAttr 0x7f994db67230 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXMethodDecl 0x7f994db67360 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:284:48> col:40 flags 'std::__1::ios_base::fmtflags (void) const'
| |-AlwaysInlineAttr 0x7f994db673f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f994db67440 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f994db67580 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:285:62> col:40 flags 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f994db67490 <col:46, col:55> col:55 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f994db67620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f994db67668 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f994db67740 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:286:61> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f994db676b8 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f994db677e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f994db67828 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f994db67a00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:287:78> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags, std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f994db67878 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-ParmVarDecl 0x7f994db678e8 <col:63, col:72> col:72 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f994db67aa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f994db67af0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f994db67c00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:288:58> col:36 used unsetf 'void (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f994db67b40 <col:43, col:52> col:52 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f994db67ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f994db67ce8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f994db67da0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:290:54> col:42 precision 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7f994db67e38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f994db67e80 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f994db67f90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:291:69> col:42 precision 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7f994db67ed0 <col:52, col:63> col:63 __prec 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7f994db68030 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f994db68078 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f994db680d8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:292:50> col:42 width 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7f994db68170 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f994db681b8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f994db68290 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:293:65> col:42 width 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7f994db68208 <col:48, col:59> col:59 __wide 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7f994db68330 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f994db68378 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f994db68420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:296:5, col:37> col:12 referenced imbue 'class std::__1::locale (const class std::__1::locale &)'
| `-ParmVarDecl 0x7f994db68398 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f994db68510 <line:297:5, col:21> col:12 referenced getloc 'class std::__1::locale (void) const'
|-CXXMethodDecl 0x7f994db685d0 <line:300:5, col:23> col:16 xalloc 'int (void)' static
|-CXXMethodDecl 0x7f994db68710 <line:301:5, col:28> col:11 iword 'long &(int)'
| `-ParmVarDecl 0x7f994db68680 <col:17, col:21> col:21 __index 'int'
|-CXXMethodDecl 0x7f994db68898 <line:302:5, col:29> col:12 pword 'void *&(int)'
| `-ParmVarDecl 0x7f994db687c8 <col:18, col:22> col:22 __index 'int'
|-CXXDestructorDecl 0x7f994db68988 <line:305:5, col:23> col:13 ~ios_base 'void (void) noexcept' virtual
|-EnumDecl 0x7f994db68a28 <line:308:5, col:58> col:10 referenced event
| |-EnumConstantDecl 0x7f994db68ae0 <col:18> col:18 referenced erase_event 'enum std::__1::ios_base::event'
| |-EnumConstantDecl 0x7f994db68b30 <col:31> col:31 imbue_event 'enum std::__1::ios_base::event'
| `-EnumConstantDecl 0x7f994db68b80 <col:44> col:44 referenced copyfmt_event 'enum std::__1::ios_base::event'
|-TypedefDecl 0x7f994db68e50 <line:309:5, col:65> col:20 referenced event_callback 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-PointerType 0x7f994db68de0 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
|   `-ParenType 0x7f994db68d80 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' sugar
|     `-FunctionProtoType 0x7f994db68d30 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' cdecl
|       |-BuiltinType 0x7f994d032b20 'void'
|       |-EnumType 0x7f994db68ac0 'enum std::__1::ios_base::event'
|       | `-Enum 0x7f994db68a28 'event'
|       |-LValueReferenceType 0x7f994e975c80 'class std::__1::ios_base &'
|       | `-RecordType 0x7f994e0d21c0 'class std::__1::ios_base'
|       |   `-CXXRecord 0x7f994db64960 'ios_base'
|       `-BuiltinType 0x7f994d032bc0 'int'
|-CXXMethodDecl 0x7f994db69070 <line:310:5, col:60> col:10 register_callback 'void (std::__1::ios_base::event_callback, int)'
| |-ParmVarDecl 0x7f994db68ee0 <col:28, col:43> col:43 __fn 'std::__1::ios_base::event_callback':'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-ParmVarDecl 0x7f994db68f58 <col:49, col:53> col:53 __index 'int'
|-AccessSpecDecl 0x7f994db69118 <line:312:1, col:8> col:1 private
|-CXXConstructorDecl 0x7f994db69260 <line:313:5, col:29> col:5 ios_base 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f994db69178 <col:14, col:28> col:29 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7f994db693e0 <line:314:5, col:40> col:15 operator= 'class std::__1::ios_base &(const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f994db69320 <col:25, col:39> col:40 'const class std::__1::ios_base &'
|-AccessSpecDecl 0x7f994db69480 <line:316:1, col:7> col:1 public
|-CXXMethodDecl 0x7f994db69580 <line:317:5, col:51> col:17 sync_with_stdio '_Bool (_Bool)' static
| `-ParmVarDecl 0x7f994db694b8 <col:33, col:47> col:38 __sync '_Bool' cinit
|   `-CXXBoolLiteralExpr 0x7f994db6b978 <col:47> '_Bool' true
|-CXXMethodDecl 0x7f994db696a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:319:49> col:39 rdstate 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7f994db69738 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f994db69780 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f994db69860 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:320:5, col:41> col:10 used clear 'void (std::__1::ios_base::iostate)'
| `-ParmVarDecl 0x7f994db697a0 <col:16, col:34> col:24 __state 'std::__1::ios_base::iostate':'unsigned int' cinit
|   `-ImplicitCastExpr 0x7f994db6b9b8 <col:34> 'std::__1::ios_base::iostate':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f994db6b990 <col:34> 'const std::__1::ios_base::iostate':'const unsigned int' lvalue Var 0x7f994db664f0 'goodbit' 'const std::__1::ios_base::iostate':'const unsigned int'
|-CXXMethodDecl 0x7f994db699c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:321:60> col:36 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f994db69940 <col:45, col:53> col:53 __state 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7f994db69a68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f994db69ab0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f994db69b10 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:323:43> col:36 good '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f994db69ba8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f994db69bf0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f994db69c50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:324:42> col:36 eof '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f994db69ce8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f994db69d30 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f994db69d90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:325:43> col:36 fail '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f994db69e28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f994db69e70 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f994db69ed0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:326:42> col:36 bad '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f994db69f68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f994db69fb0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f994db6a010 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:328:52> col:39 exceptions 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7f994db6a0a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f994db6a0f0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f994db6a1c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:329:64> col:36 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f994db6a140 <col:47, col:55> col:55 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7f994db6a268 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f994db6a2b0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f994db6a2e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:331:5, col:44> col:10 __set_badbit_and_consider_rethrow 'void (void)'
|-CXXMethodDecl 0x7f994db6a398 <line:332:5, col:45> col:10 __set_failbit_and_consider_rethrow 'void (void)'
|-AccessSpecDecl 0x7f994db6a430 <line:334:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f994db6a4a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:337:16> line:336:5 ios_base 'void (void)'
| |-CompoundStmt 0x7f994db6b9d0 <col:16, line:337:16>
| |-AlwaysInlineAttr 0x7f994db6a550 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f994db6a598 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f994db6a648 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:339:5, col:25> col:10 referenced init 'void (void *)'
| `-ParmVarDecl 0x7f994db6a5c0 <col:15, col:21> col:21 __sb 'void *'
|-CXXMethodDecl 0x7f994db6a778 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:340:64> col:33 rdbuf 'void *(void) const'
| |-CompoundStmt 0x7f994db6ba68 <col:47, col:64>
| | `-ReturnStmt 0x7f994db6ba50 <col:48, col:55>
| |   `-ImplicitCastExpr 0x7f994db6ba38 <col:55> 'void *' <LValueToRValue>
| |     `-MemberExpr 0x7f994db6ba00 <col:55> 'void *const' lvalue ->__rdbuf_ 0x7f994db6b388
| |       `-CXXThisExpr 0x7f994db6b9e8 <col:55> 'const class std::__1::ios_base *' this
| |-AlwaysInlineAttr 0x7f994db6a810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7f994db6a858 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f994db6a938 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:347:5> line:343:10 rdbuf 'void (void *)'
| |-ParmVarDecl 0x7f994db6a8b0 <col:16, col:22> col:22 used __sb 'void *'
| |-CompoundStmt 0x7f994db6bbe8 <line:344:5, line:347:5>
| | |-BinaryOperator 0x7f994db6bb18 <line:345:9, col:20> 'void *' lvalue '='
| | | |-MemberExpr 0x7f994db6baa0 <col:9> 'void *' lvalue ->__rdbuf_ 0x7f994db6b388
| | | | `-CXXThisExpr 0x7f994db6ba88 <col:9> 'class std::__1::ios_base *' this
| | | `-ImplicitCastExpr 0x7f994db6bb00 <col:20> 'void *' <LValueToRValue>
| | |   `-DeclRefExpr 0x7f994db6bad8 <col:20> 'void *' lvalue ParmVar 0x7f994db6a8b0 '__sb' 'void *'
| | `-CXXMemberCallExpr 0x7f994db6bb90 <line:346:9, col:15> 'void'
| |   |-MemberExpr 0x7f994db6bb58 <col:9> '<bound member function type>' ->clear 0x7f994db69860
| |   | `-CXXThisExpr 0x7f994db6bb40 <col:9> 'class std::__1::ios_base *' this
| |   `-CXXDefaultArgExpr 0x7f994db6bbc8 <<invalid sloc>> 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7f994db6a9d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7f994db6aa20 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f994db6ab00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:349:5, col:32> col:10 referenced __call_callbacks 'void (enum std::__1::ios_base::event)'
| `-ParmVarDecl 0x7f994db6aa40 <col:27> col:32 'enum std::__1::ios_base::event'
|-CXXMethodDecl 0x7f994db6ac38 <line:350:5, col:33> col:10 referenced copyfmt 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f994db6abb0 <col:18, col:32> col:33 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7f994db6adb0 <line:351:5, col:24> col:10 referenced move 'void (class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f994db6ace8 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7f994db6af28 <line:352:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:352:10 referenced swap 'void (class std::__1::ios_base &) noexcept'
| `-ParmVarDecl 0x7f994db6ae60 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7f994db6b098 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:358:5> line:355:10 referenced set_rdbuf 'void (void *)'
| |-ParmVarDecl 0x7f994db6b010 <col:20, col:26> col:26 used __sb 'void *'
| |-CompoundStmt 0x7f994db6bcc8 <line:356:5, line:358:5>
| | `-BinaryOperator 0x7f994db6bca0 <line:357:9, col:20> 'void *' lvalue '='
| |   |-MemberExpr 0x7f994db6bc28 <col:9> 'void *' lvalue ->__rdbuf_ 0x7f994db6b388
| |   | `-CXXThisExpr 0x7f994db6bc10 <col:9> 'class std::__1::ios_base *' this
| |   `-ImplicitCastExpr 0x7f994db6bc88 <col:20> 'void *' <LValueToRValue>
| |     `-DeclRefExpr 0x7f994db6bc60 <col:20> 'void *' lvalue ParmVar 0x7f994db6b010 '__sb' 'void *'
| |-AlwaysInlineAttr 0x7f994db6b138 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7f994db6b180 <col:48, col:71> Hidden
|-AccessSpecDecl 0x7f994db6b190 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:360:1, col:8> col:1 private
|-FieldDecl 0x7f994db6b1c8 <line:362:5, col:21> col:21 referenced __fmtflags_ 'std::__1::ios_base::fmtflags':'unsigned int'
|-FieldDecl 0x7f994db6b220 <line:363:5, col:21> col:21 referenced __precision_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7f994db6b278 <line:364:5, col:21> col:21 referenced __width_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7f994db6b2d0 <line:365:5, col:21> col:21 referenced __rdstate_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7f994db6b328 <line:366:5, col:21> col:21 referenced __exceptions_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7f994db6b388 <line:367:5, col:21> col:21 referenced __rdbuf_ 'void *'
|-FieldDecl 0x7f994db6b3e8 <line:368:5, col:21> col:21 __loc_ 'void *'
|-FieldDecl 0x7f994db6b498 <line:369:5, col:21> col:21 __fn_ 'std::__1::ios_base::event_callback *'
|-FieldDecl 0x7f994db6b4f8 <line:370:5, col:21> col:21 __index_ 'int *'
|-FieldDecl 0x7f994db6b550 <line:371:5, col:21> col:21 __event_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7f994db6b5a8 <line:372:5, col:21> col:21 __event_cap_ 'size_t':'unsigned long'
|-VarDecl 0x7f994db6b6b8 <line:376:5, col:24> col:24 __xindex_ 'atomic<int>':'struct std::__1::atomic<int>' static
|-FieldDecl 0x7f994db6b730 <line:380:5, col:21> col:21 __iarray_ 'long *'
|-FieldDecl 0x7f994db6b788 <line:381:5, col:21> col:21 __iarray_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7f994db6b7e0 <line:382:5, col:21> col:21 __iarray_cap_ 'size_t':'unsigned long'
|-FieldDecl 0x7f994db6b840 <line:383:5, col:21> col:21 __parray_ 'void **'
|-FieldDecl 0x7f994db6b898 <line:384:5, col:21> col:21 __parray_size_ 'size_t':'unsigned long'
`-FieldDecl 0x7f994db6b8f0 <line:385:5, col:21> col:21 __parray_cap_ 'size_t':'unsigned long'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f994e0da5f8 parent 0x7f994e0d2088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:482:78> col:64 class basic_ios definition
|-public 'class std::__1::ios_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f994e3986e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7f994e3987d8 prev 0x7f994e0da5f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:583:1, col:28> col:28 implicit class basic_ios
|-AccessSpecDecl 0x7f994e398870 <line:586:1, col:7> col:1 public
|-TypedefDecl 0x7f994e3988d8 <line:588:5, col:20> col:20 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f994e3988a0 'char' sugar
|   |-TemplateTypeParmType 0x7f994e360b00 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f994e360ac0 '_CharT'
|   `-BuiltinType 0x7f994d032b60 'char'
|-TypedefDecl 0x7f994e398968 <line:589:5, col:21> col:21 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f994e398930 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f994e360b70 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f994e360b28 '_Traits'
|   `-RecordType 0x7f994e0da560 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f994da44488 'char_traits'
|-TypedefDecl 0x7f994e398a70 <line:591:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f994e398a20 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f994da45fd0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f994da447e8 'int_type'
|     `-BuiltinType 0x7f994d032bc0 'int'
|-TypedefDecl 0x7f994e398b40 <line:592:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f994e398af0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f994e38d490 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f994da448b8 'pos_type'
|     `-TypedefType 0x7f994da3a040 'std::__1::streampos' sugar
|       |-Typedef 0x7f994e0e07b8 'streampos'
|       `-TemplateSpecializationType 0x7f994e0e0710 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f994e0e06f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f994e0e0600 'fpos'
|-TypedefDecl 0x7f994e398c10 <line:593:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f994e398bc0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f994e38d580 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f994da44850 'off_type'
|     `-TypedefType 0x7f994da39fb0 'std::__1::streamoff' sugar
|       |-Typedef 0x7f994e0e0b58 'streamoff'
|       `-BuiltinType 0x7f994d032c00 'long long'
|-CXXConversionDecl 0x7f994e398c68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:605:60> col:22 operator bool '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f994e398d38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e398d88 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:608:69> col:32 operator! '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f994e398e30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e398e78 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:609:81> col:35 rdstate 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7f994e398f20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e398ff0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:610:91> col:32 clear 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f994e398f68 <col:38, col:56> col:46 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7f994e3990a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e399170 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:611:87> col:32 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f994e3990e8 <col:41, col:49> col:49 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7f994e399220 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e399268 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:612:70> col:32 good '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f994e399310 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e399358 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:613:69> col:32 eof '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f994e399400 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e399448 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:614:70> col:32 fail '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f994e3994f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e399538 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:615:69> col:32 bad '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f994e3995e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e399628 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:617:85> col:35 exceptions 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7f994e3996d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e3997a0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:618:95> col:32 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f994e399718 <col:43, col:51> col:51 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7f994e399850 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXConstructorDecl 0x7f994e399b00 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:622:68> col:14 basic_ios 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f994e3999b8 <col:24, col:64> col:64 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f994e399bc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7f994e399c38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:623:5, col:24> col:13 ~basic_ios 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7f994e399e90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:627:50> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7f994e399f38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e39a270 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:629:95> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f994e39a128 <col:48, col:87> col:87 __tiestr 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f994e39a320 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e39a4e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:632:54> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7f994e39a588 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e39a8c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:634:97> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f994e39a778 <col:52, col:93> col:93 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f994e39a970 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e39aaf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:636:5, col:46> col:16 copyfmt 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)'
| `-ParmVarDecl 0x7f994e39aa28 <col:24, col:41> col:41 __rhs 'const class std::__1::basic_ios<char> &'
|-CXXMethodDecl 0x7f994e39abf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:639:22> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (void) const'
| `-AlwaysInlineAttr 0x7f994e39ac98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e39adf0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:641:34> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7f994e39acf0 <col:20, col:30> col:30 __ch 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7f994e39aea0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e39af70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:644:37> col:12 imbue 'class std::__1::locale (const class std::__1::locale &)'
| |-ParmVarDecl 0x7f994e39aee8 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7f994e39b020 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e39b1b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:647:47> col:10 narrow 'char (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, char) const'
| |-ParmVarDecl 0x7f994e39b078 <col:17, col:27> col:27 __c 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| |-ParmVarDecl 0x7f994e39b0d8 <col:32, col:37> col:37 __dfault 'char'
| `-AlwaysInlineAttr 0x7f994e39b268 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e39b370 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:649:31> col:15 widen 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (char) const'
| |-ParmVarDecl 0x7f994e39b2b0 <col:21, col:26> col:26 __c 'char'
| `-AlwaysInlineAttr 0x7f994e39b420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-AccessSpecDecl 0x7f994e39b468 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:651:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f994e39b4b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:654:17> line:653:5 basic_ios 'void (void)'
| `-AlwaysInlineAttr 0x7f994e39b568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e39b770 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:656:60> col:10 init 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f994e39b6a8 <col:15, col:56> col:56 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f994e39b820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e39b940 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:659:31> col:10 move 'void (class std::__1::basic_ios<char> &)'
| |-ParmVarDecl 0x7f994e39b878 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7f994e39b9f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e39bb40 <line:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:662:47> col:10 move 'void (class std::__1::basic_ios<char> &&)'
| |-ParmVarDecl 0x7f994e39ba78 <col:15, col:27> col:27 __rhs 'class std::__1::basic_ios<char> &&'
| `-AlwaysInlineAttr 0x7f994e39bbf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e39bd18 <line:709:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:665:10 swap 'void (class std::__1::basic_ios<char> &) noexcept'
| |-ParmVarDecl 0x7f994e39bc48 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7f994e39bdc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e39bfd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:667:65> col:10 set_rdbuf 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f994e39bf08 <col:20, col:61> col:61 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f994e39c080 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-AccessSpecDecl 0x7f994e39c0c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:668:1, col:8> col:1 private
|-FieldDecl 0x7f994e39c1e8 <line:669:5, col:44> col:44 __tie_ 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
|-FieldDecl 0x7f994e39c260 <line:670:6, col:23> col:23 __fill_ 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' mutable
|-CXXConstructorDecl 0x7f994e39c2e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:482:64> col:64 implicit basic_ios 'void (const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7f994e39c2e8
| `-ParmVarDecl 0x7f994e39c410 <col:64> col:64 'const class std::__1::basic_ios<char> &'
`-CXXMethodDecl 0x7f994e39c478 <col:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7f994e39c478
  `-ParmVarDecl 0x7f994e39c550 <col:64> col:64 'const class std::__1::basic_ios<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ios" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f994e0db6b8 parent 0x7f994e0d2088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:1085:82> col:64 class basic_ostream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f994e4f68d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7f994e4f6b10 prev 0x7f994e0db6b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:151:1, col:28> col:28 implicit class basic_ostream
|-AccessSpecDecl 0x7f994e4f6ba8 <line:154:1, col:7> col:1 public
|-TypedefDecl 0x7f994e4f6be0 <line:156:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f994e4f69a0 'char' sugar
|   |-TemplateTypeParmType 0x7f994d37c530 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f994d37c4e8 '_CharT'
|   `-BuiltinType 0x7f994d032b60 'char'
|-TypedefDecl 0x7f994e4f6c48 <line:157:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f994e4f69e0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f994d37c5a0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f994d37c558 '_Traits'
|   `-RecordType 0x7f994e0da560 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f994da44488 'char_traits'
|-TypedefDecl 0x7f994e4f6d50 <line:158:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f994e4f6d00 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f994da45fd0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f994da447e8 'int_type'
|     `-BuiltinType 0x7f994d032bc0 'int'
|-TypedefDecl 0x7f994e4f6e20 <line:159:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f994e4f6dd0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f994e38d490 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f994da448b8 'pos_type'
|     `-TypedefType 0x7f994da3a040 'std::__1::streampos' sugar
|       |-Typedef 0x7f994e0e07b8 'streampos'
|       `-TemplateSpecializationType 0x7f994e0e0710 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f994e0e06f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f994e0e0600 'fpos'
|-TypedefDecl 0x7f994e4f6ef0 <line:160:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f994e4f6ea0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f994e38d580 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f994da44850 'off_type'
|     `-TypedefType 0x7f994da39fb0 'std::__1::streamoff' sugar
|       |-Typedef 0x7f994e0e0b58 'streamoff'
|       `-BuiltinType 0x7f994d032c00 'long long'
|-CXXConstructorDecl 0x7f994e4f7170 <line:163:5, line:165:25> line:164:14 basic_ostream 'void (basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7f994e4f7068 <col:28, col:69> col:69 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f994e4f7230 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXDestructorDecl 0x7f994e4f72a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:166:5, col:28> col:13 ~basic_ostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7f994e4f7358 <line:167:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f994e4f74a0 <line:169:5, line:170:40> col:5 basic_ostream 'void (class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7f994e4f73b8 <col:19, col:35> col:35 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7f994e4f7560 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7f994e4f76b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:175:5, line:176:51> col:20 operator= 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7f994e4f75e8 <col:30, col:46> col:46 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7f994e4f7760 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7f994e4f7880 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:178:5, line:180:55> line:179:10 swap 'void (class std::__1::basic_ostream<char> &)' inline
| |-ParmVarDecl 0x7f994e4f77b8 <col:15, col:30> col:30 __rhs 'class std::__1::basic_ostream<char> &'
| `-AlwaysInlineAttr 0x7f994e4f7930 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXConstructorDecl 0x7f994e4f7aa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:183:5, col:65> col:5 basic_ostream 'void (const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7f994e4f79b8 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-CXXMethodDecl 0x7f994e4f7c30 <line:184:5, col:65> col:20 operator= 'class std::__1::basic_ostream<char> &(const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7f994e4f7b70 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-AccessSpecDecl 0x7f994e4f7ce0 <line:189:1, col:7> col:1 public
|-CXXRecordDecl 0x7f994e4f7d08 <line:192:5, col:32> col:32 class sentry definition
| |-CXXRecordDecl 0x7f994e4fab90 prev 0x7f994e4f7d08 <line:242:1, col:60> col:60 implicit class sentry
| |-FieldDecl 0x7f994e4fac28 <line:244:5, col:10> col:10 __ok_ '_Bool'
| |-FieldDecl 0x7f994e4fadc8 <line:245:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXConstructorDecl 0x7f994e4faf50 <line:247:5, col:25> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7f994e4fae48 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x7f994e4fb110 <line:248:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7f994e4fb048 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x7f994e4fb1c0 <line:250:1, col:7> col:1 public
| |-CXXConstructorDecl 0x7f994e4fb3d0 <line:251:5, col:57> col:14 sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| | `-ParmVarDecl 0x7f994e4fb2e8 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXDestructorDecl 0x7f994e4fb4c0 <line:252:5, col:13> col:5 ~sentry 'void (void)' noexcept-unevaluated 0x7f994e4fb4c0
| `-CXXConversionDecl 0x7f994e4fb570 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:256:45> col:9 operator bool '_Bool (void) const'
|   `-AlwaysInlineAttr 0x7f994e4fb648 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e4f8040 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:195:5, line:197:27> line:196:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &))' inline
| |-ParmVarDecl 0x7f994e4f7f40 <col:31, col:68> col:48 __pf 'class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &)'
| `-AlwaysInlineAttr 0x7f994e4f80f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e4f85d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:199:5, line:202:34> line:200:20 operator<< 'class std::__1::basic_ostream<char> &(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &))' inline
| |-ParmVarDecl 0x7f994e4f84d0 <col:31, line:201:72> col:33 __pf 'basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &)'
| `-AlwaysInlineAttr 0x7f994e4f8680 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e4f87d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:204:5, line:206:34> line:205:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))' inline
| |-ParmVarDecl 0x7f994e4f86c8 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x7f994e4f8880 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e4f8990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:208:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(_Bool)'
| `-ParmVarDecl 0x7f994e4f88c8 <col:31, col:36> col:36 __n '_Bool'
|-CXXMethodDecl 0x7f994e4f8b00 <line:209:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(short)'
| `-ParmVarDecl 0x7f994e4f8a40 <col:31, col:37> col:37 __n 'short'
|-CXXMethodDecl 0x7f994e4f8c70 <line:210:5, col:49> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned short)'
| `-ParmVarDecl 0x7f994e4f8bb0 <col:31, col:46> col:46 __n 'unsigned short'
|-CXXMethodDecl 0x7f994e4f8de0 <line:211:5, col:38> col:20 operator<< 'class std::__1::basic_ostream<char> &(int)'
| `-ParmVarDecl 0x7f994e4f8d20 <col:31, col:35> col:35 __n 'int'
|-CXXMethodDecl 0x7f994e4f8f50 <line:212:5, col:47> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned int)'
| `-ParmVarDecl 0x7f994e4f8e90 <col:31, col:44> col:44 __n 'unsigned int'
|-CXXMethodDecl 0x7f994e4f90c0 <line:213:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(long)'
| `-ParmVarDecl 0x7f994e4f9000 <col:31, col:36> col:36 __n 'long'
|-CXXMethodDecl 0x7f994e4f9230 <line:214:5, col:48> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long)'
| `-ParmVarDecl 0x7f994e4f9170 <col:31, col:45> col:45 __n 'unsigned long'
|-CXXMethodDecl 0x7f994e4f93a0 <line:215:5, col:44> col:20 operator<< 'class std::__1::basic_ostream<char> &(long long)'
| `-ParmVarDecl 0x7f994e4f92e0 <col:31, col:41> col:41 __n 'long long'
|-CXXMethodDecl 0x7f994e4f9510 <line:216:5, col:53> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long long)'
| `-ParmVarDecl 0x7f994e4f9450 <col:31, col:50> col:50 __n 'unsigned long long'
|-CXXMethodDecl 0x7f994e4f9680 <line:217:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(float)'
| `-ParmVarDecl 0x7f994e4f95c0 <col:31, col:37> col:37 __f 'float'
|-CXXMethodDecl 0x7f994e4f97f0 <line:218:5, col:41> col:20 operator<< 'class std::__1::basic_ostream<char> &(double)'
| `-ParmVarDecl 0x7f994e4f9730 <col:31, col:38> col:38 __f 'double'
|-CXXMethodDecl 0x7f994e4f9960 <line:219:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(long double)'
| `-ParmVarDecl 0x7f994e4f98a0 <col:31, col:43> col:43 __f 'long double'
|-CXXMethodDecl 0x7f994e4f9ad0 <line:220:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(const void *)'
| `-ParmVarDecl 0x7f994e4f9a10 <col:31, col:43> col:43 __p 'const void *'
|-CXXMethodDecl 0x7f994e4f9d80 <line:221:5, col:76> col:20 operator<< 'class std::__1::basic_ostream<char> &(basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)'
| `-ParmVarDecl 0x7f994e4f9c78 <col:31, col:72> col:72 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
|-CXXMethodDecl 0x7f994e4f9f40 <line:224:5, col:37> col:20 put 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type)'
| `-ParmVarDecl 0x7f994e4f9e40 <col:24, col:34> col:34 __c 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7f994e4fa1a0 <line:225:5, col:62> col:20 write 'class std::__1::basic_ostream<char> &(const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7f994e4fa028 <col:26, col:43> col:43 __s 'const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f994e4fa088 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f994e4fa2b0 <line:226:5, col:26> col:20 flush 'class std::__1::basic_ostream<char> &(void)'
|-CXXMethodDecl 0x7f994e4fa400 <line:229:5, line:230:20> col:14 tellp 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type (void)' inline
| `-AlwaysInlineAttr 0x7f994e4fa4a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-CXXMethodDecl 0x7f994e4fa600 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:231:5, line:232:40> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type)' inline
| |-ParmVarDecl 0x7f994e4fa500 <col:26, col:35> col:35 __pos 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-AlwaysInlineAttr 0x7f994e4fa6b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-CXXMethodDecl 0x7f994e4fa8a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:233:5, line:234:65> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir)' inline
| |-ParmVarDecl 0x7f994e4fa730 <col:26, col:35> col:35 __off 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7f994e4fa790 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-AlwaysInlineAttr 0x7f994e4fa958 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-AccessSpecDecl 0x7f994e4fa9a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:236:1, col:10> col:1 protected
`-CXXConstructorDecl 0x7f994e4fa9e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:238:22> col:5 basic_ostream 'void (void)'
  `-AlwaysInlineAttr 0x7f994e4faaa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream.base" = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1185:9)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1203:9)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >
         0 |   struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> (base) (empty)
         0 |   std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type * __sbuf_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry
         0 |   _Bool __ok_
         8 |   basic_ostream<char, struct std::__1::char_traits<char> > & __os_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f994e4f7d08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:192:5, col:32> col:32 referenced class sentry definition
|-CXXRecordDecl 0x7f994e4fab90 prev 0x7f994e4f7d08 <line:242:1, col:60> col:60 implicit class sentry
|-FieldDecl 0x7f994e4fac28 <line:244:5, col:10> col:10 referenced __ok_ '_Bool'
|-FieldDecl 0x7f994e4fadc8 <line:245:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
|-CXXConstructorDecl 0x7f994e4faf50 <line:247:5, col:25> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| `-ParmVarDecl 0x7f994e4fae48 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
|-CXXMethodDecl 0x7f994e4fb110 <line:248:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| `-ParmVarDecl 0x7f994e4fb048 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
|-AccessSpecDecl 0x7f994e4fb1c0 <line:250:1, col:7> col:1 public
|-CXXConstructorDecl 0x7f994e4fb3d0 <line:251:5, col:57> col:14 used sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| `-ParmVarDecl 0x7f994e4fb2e8 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
|-CXXDestructorDecl 0x7f994e4fb4c0 <line:252:5, col:13> col:5 used ~sentry 'void (void) noexcept'
`-CXXConversionDecl 0x7f994e4fb570 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:256:45> col:9 used operator bool '_Bool (void) const'
  |-CompoundStmt 0x7f994e58afe0 <col:31, col:45>
  | `-ReturnStmt 0x7f994e58afc8 <col:32, col:39>
  |   `-ImplicitCastExpr 0x7f994e58afb0 <col:39> '_Bool' <LValueToRValue>
  |     `-MemberExpr 0x7f994e58af78 <col:39> 'const _Bool' lvalue ->__ok_ 0x7f994e4fac28
  |       `-CXXThisExpr 0x7f994e58af60 <col:39> 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry *' this
  `-AlwaysInlineAttr 0x7f994e4fb648 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream<char, std::__1::char_traits<char> >::sentry" = type { i8, %"class.std::__1::basic_ostream"* }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream<char, std::__1::char_traits<char> >::sentry" = type { i8, %"class.std::__1::basic_ostream"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f994e95f258 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:520:1, line:529:1> line:522:29 struct iterator definition
|-TemplateArgument type 'struct std::__1::output_iterator_tag'
|-TemplateArgument type 'void'
|-TemplateArgument type 'void'
|-TemplateArgument type 'void'
|-TemplateArgument type 'void'
|-CXXRecordDecl 0x7f994e95f560 prev 0x7f994e95f258 <col:1, col:29> col:29 implicit struct iterator
|-TypedefDecl 0x7f994e95f638 <line:524:5, col:24> col:24 value_type 'void':'void'
| `-SubstTemplateTypeParmType 0x7f994e95f600 'void' sugar
|   |-TemplateTypeParmType 0x7f994e9488b0 '_Tp' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f994e948868 '_Tp'
|   `-BuiltinType 0x7f994d032b20 'void'
|-TypedefDecl 0x7f994e95f6c8 <line:525:5, col:24> col:24 difference_type 'void':'void'
| `-SubstTemplateTypeParmType 0x7f994e95f690 'void' sugar
|   |-TemplateTypeParmType 0x7f994e948930 '_Distance' dependent depth 0 index 2
|   | `-TemplateTypeParm 0x7f994e9488e8 '_Distance'
|   `-BuiltinType 0x7f994d032b20 'void'
|-TypedefDecl 0x7f994e95f758 <line:526:5, col:24> col:24 pointer 'void':'void'
| `-SubstTemplateTypeParmType 0x7f994e95f720 'void' sugar
|   |-TemplateTypeParmType 0x7f994e9489e0 '_Pointer' dependent depth 0 index 3
|   | `-TemplateTypeParm 0x7f994e948998 '_Pointer'
|   `-BuiltinType 0x7f994d032b20 'void'
|-TypedefDecl 0x7f994e95f7e8 <line:527:5, col:24> col:24 reference 'void':'void'
| `-SubstTemplateTypeParmType 0x7f994e95f7b0 'void' sugar
|   |-TemplateTypeParmType 0x7f994e948a90 '_Reference' dependent depth 0 index 4
|   | `-TemplateTypeParm 0x7f994e948a48 '_Reference'
|   `-BuiltinType 0x7f994d032b20 'void'
|-TypedefDecl 0x7f994e95f878 <line:528:5, col:24> col:24 iterator_category 'struct std::__1::output_iterator_tag':'struct std::__1::output_iterator_tag'
| `-SubstTemplateTypeParmType 0x7f994e95f840 'struct std::__1::output_iterator_tag' sugar
|   |-TemplateTypeParmType 0x7f994e948840 '_Category' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f994e948800 '_Category'
|   `-RecordType 0x7f994e939bf0 'struct std::__1::output_iterator_tag'
|     `-CXXRecord 0x7f994e939b58 'output_iterator_tag'
|-CXXDestructorDecl 0x7f994ed5dae8 <line:522:29> col:29 implicit ~iterator 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f994e588838 <col:29> col:29 implicit constexpr iterator 'void (const struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &)' inline default trivial noexcept-unevaluated 0x7f994e588838
| `-ParmVarDecl 0x7f994e588960 <col:29> col:29 'const struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &'
|-CXXConstructorDecl 0x7f994e5889f8 <col:29> col:29 implicit used constexpr iterator 'void (struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7f994e588b20 <col:29> col:29 'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &&'
| `-CompoundStmt 0x7f994e58a868 <col:29>
`-CXXConstructorDecl 0x7f994e58a780 <col:29> col:29 implicit used constexpr iterator 'void (void) noexcept' inline default trivial
  `-CompoundStmt 0x7f994e58b170 <col:29>

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::iterator" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::iterator" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::locale
         0 |   class std::__1::locale::__imp * __locale_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_streambuf<char>
         0 |   (basic_streambuf vtable pointer)
         8 |   class std::__1::locale __loc_
         8 |     class std::__1::locale::__imp * __locale_
        16 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        24 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        32 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        40 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        48 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        56 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f994d33f9c8 prev 0x7f994d33f218 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:62:1, line:123:1> line:62:24 referenced class locale definition
|-VisibilityAttr 0x7f994d33fac8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7f994d33fb10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:62:1, col:24> col:24 implicit referenced class locale
|-AccessSpecDecl 0x7f994d33fba8 <line:64:1, col:7> col:1 public
|-CXXRecordDecl 0x7f994d33fc00 <line:66:5, col:28> col:28 referenced class facet
| `-VisibilityAttr 0x7f994d33fcc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7f994d33fd38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:67:5, col:28> col:28 referenced class id
| `-VisibilityAttr 0x7f994d33fdf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-TypedefDecl 0x7f994d33fe50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:69:5, col:17> col:17 referenced category 'int'
| `-BuiltinType 0x7f994d032bc0 'int'
|-VarDecl 0x7f994d33fee0 <line:70:5, line:71:20> col:9 none 'const std::__1::locale::category':'const int' static cinit
| `-IntegerLiteral 0x7f994d33ff40 <col:20> 'int' 0
|-VarDecl 0x7f994d33ffc8 <line:70:5, /usr/include/xlocale.h:45:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:72:9 referenced collate 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7f994d340090 </usr/include/xlocale.h:45:27, col:34> 'int'
|   `-BinaryOperator 0x7f994d340068 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7f994d340028 <col:28> 'int' 1
|     `-IntegerLiteral 0x7f994d340048 <col:33> 'int' 0
|-VarDecl 0x7f994d340118 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:46:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:73:9 referenced ctype 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7f994d3401e0 </usr/include/xlocale.h:46:25, col:32> 'int'
|   `-BinaryOperator 0x7f994d3401b8 <col:26, col:31> 'int' '<<'
|     |-IntegerLiteral 0x7f994d340178 <col:26> 'int' 1
|     `-IntegerLiteral 0x7f994d340198 <col:31> 'int' 1
|-VarDecl 0x7f994d340268 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:48:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:74:9 referenced monetary 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7f994d340330 </usr/include/xlocale.h:48:27, col:34> 'int'
|   `-BinaryOperator 0x7f994d340308 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7f994d3402c8 <col:28> 'int' 1
|     `-IntegerLiteral 0x7f994d3402e8 <col:33> 'int' 3
|-VarDecl 0x7f994d3403b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:49:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:75:9 referenced numeric 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7f994d340480 </usr/include/xlocale.h:49:27, col:34> 'int'
|   `-BinaryOperator 0x7f994d340458 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7f994d340418 <col:28> 'int' 1
|     `-IntegerLiteral 0x7f994d340438 <col:33> 'int' 4
|-VarDecl 0x7f994d340508 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:50:31> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:76:9 referenced time 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7f994d3405d0 </usr/include/xlocale.h:50:24, col:31> 'int'
|   `-BinaryOperator 0x7f994d3405a8 <col:25, col:30> 'int' '<<'
|     |-IntegerLiteral 0x7f994d340568 <col:25> 'int' 1
|     `-IntegerLiteral 0x7f994d340588 <col:30> 'int' 5
|-VarDecl 0x7f994d340658 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:47:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:77:9 referenced messages 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7f994d340720 </usr/include/xlocale.h:47:27, col:34> 'int'
|   `-BinaryOperator 0x7f994d3406f8 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7f994d3406b8 <col:28> 'int' 1
|     `-IntegerLiteral 0x7f994d3406d8 <col:33> 'int' 2
|-VarDecl 0x7f994d3407a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, line:78:61> col:9 all 'const std::__1::locale::category':'const int' static cinit
| `-BinaryOperator 0x7f994d340a28 <col:15, col:61> 'int' '|'
|   |-BinaryOperator 0x7f994d3409c0 <col:15, col:54> 'int' '|'
|   | |-BinaryOperator 0x7f994d340958 <col:15, col:44> 'int' '|'
|   | | |-BinaryOperator 0x7f994d3408f0 <col:15, col:33> 'int' '|'
|   | | | |-BinaryOperator 0x7f994d340888 <col:15, col:25> 'int' '|'
|   | | | | |-ImplicitCastExpr 0x7f994d340858 <col:15> 'std::__1::locale::category':'int' <LValueToRValue>
|   | | | | | `-DeclRefExpr 0x7f994d340808 <col:15> 'const std::__1::locale::category':'const int' lvalue Var 0x7f994d33ffc8 'collate' 'const std::__1::locale::category':'const int'
|   | | | | `-ImplicitCastExpr 0x7f994d340870 <col:25> 'std::__1::locale::category':'int' <LValueToRValue>
|   | | | |   `-DeclRefExpr 0x7f994d340830 <col:25> 'const std::__1::locale::category':'const int' lvalue Var 0x7f994d340118 'ctype' 'const std::__1::locale::category':'const int'
|   | | | `-ImplicitCastExpr 0x7f994d3408d8 <col:33> 'std::__1::locale::category':'int' <LValueToRValue>
|   | | |   `-DeclRefExpr 0x7f994d3408b0 <col:33> 'const std::__1::locale::category':'const int' lvalue Var 0x7f994d340268 'monetary' 'const std::__1::locale::category':'const int'
|   | | `-ImplicitCastExpr 0x7f994d340940 <col:44> 'std::__1::locale::category':'int' <LValueToRValue>
|   | |   `-DeclRefExpr 0x7f994d340918 <col:44> 'const std::__1::locale::category':'const int' lvalue Var 0x7f994d3403b8 'numeric' 'const std::__1::locale::category':'const int'
|   | `-ImplicitCastExpr 0x7f994d3409a8 <col:54> 'std::__1::locale::category':'int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7f994d340980 <col:54> 'const std::__1::locale::category':'const int' lvalue Var 0x7f994d340508 'time' 'const std::__1::locale::category':'const int'
|   `-ImplicitCastExpr 0x7f994d340a10 <col:61> 'std::__1::locale::category':'int' <LValueToRValue>
|     `-DeclRefExpr 0x7f994d3409e8 <col:61> 'const std::__1::locale::category':'const int' lvalue Var 0x7f994d340658 'messages' 'const std::__1::locale::category':'const int'
|-CXXConstructorDecl 0x7f994d340b60 <line:81:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:81:5 locale 'void (void) noexcept'
|-CXXConstructorDecl 0x7f994d340d28 <line:82:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:82:5 referenced locale 'void (const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7f994d340c18 <col:12, col:24> col:25 'const class std::__1::locale &'
|-CXXConstructorDecl 0x7f994d340e78 <line:83:5, col:32> col:14 locale 'void (const char *)'
| `-ParmVarDecl 0x7f994d340df0 <col:21, col:31> col:32 'const char *'
|-CXXConstructorDecl 0x7f994d340fc0 <line:84:5, col:34> col:14 locale 'void (const std::__1::string &)'
| `-ParmVarDecl 0x7f994d340f38 <col:21, col:33> col:34 'const std::__1::string &'
|-CXXConstructorDecl 0x7f994d3412a0 <line:85:5, col:48> col:5 locale 'void (const class std::__1::locale &, const char *, std::__1::locale::category)'
| |-ParmVarDecl 0x7f994d341080 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f994d3410f8 <col:27, col:37> col:38 'const char *'
| `-ParmVarDecl 0x7f994d341168 <col:40> col:48 'std::__1::locale::category':'int'
|-CXXConstructorDecl 0x7f994d341580 <line:86:5, col:50> col:5 locale 'void (const class std::__1::locale &, const std::__1::string &, std::__1::locale::category)'
| |-ParmVarDecl 0x7f994d341370 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f994d3413e0 <col:27, col:39> col:40 'const std::__1::string &'
| `-ParmVarDecl 0x7f994d341450 <col:42> col:50 'std::__1::locale::category':'int'
|-FunctionTemplateDecl 0x7f994d341958 <line:87:5, line:88:64> col:35 locale
| |-TemplateTypeParmDecl 0x7f994d341640 <line:87:15, col:21> col:21 referenced class depth 0 index 0 _Facet
| `-CXXConstructorDecl 0x7f994d3418b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:88:64> col:35 locale 'void (const class std::__1::locale &, _Facet *)'
|   |-ParmVarDecl 0x7f994d341700 <col:42, col:54> col:55 'const class std::__1::locale &'
|   |-ParmVarDecl 0x7f994d341798 <col:57, col:63> col:64 '_Facet *'
|   |-AlwaysInlineAttr 0x7f994d3419b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|   `-VisibilityAttr 0x7f994d341a00 <col:51, col:74> Hidden
|-CXXConstructorDecl 0x7f994d341c30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:89:5, col:50> col:5 locale 'void (const class std::__1::locale &, const class std::__1::locale &, std::__1::locale::category)'
| |-ParmVarDecl 0x7f994d341a20 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f994d341a90 <col:27, col:39> col:40 'const class std::__1::locale &'
| `-ParmVarDecl 0x7f994d341b00 <col:42> col:50 'std::__1::locale::category':'int'
|-CXXDestructorDecl 0x7f994d341d40 <line:91:5, col:13> col:5 used ~locale 'void (void) noexcept'
|-CXXMethodDecl 0x7f994d341ef8 <line:93:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:93:19 operator= 'const class std::__1::locale &(const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7f994d341df0 <col:29, col:41> col:42 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7f994d3421e8 <line:95:5, line:97:37> col:14 combine
| |-TemplateTypeParmDecl 0x7f994d341f98 <line:95:15, col:21> col:21 class depth 0 index 0 _Facet
| `-CXXMethodDecl 0x7f994d342150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:97:37> col:14 combine 'class std::__1::locale (const class std::__1::locale &) const' inline
|   |-ParmVarDecl 0x7f994d342060 <col:22, col:34> col:35 'const class std::__1::locale &'
|   `-VisibilityAttr 0x7f994d342240 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:624:40, col:63> Hidden
|-CXXMethodDecl 0x7f994d3422a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:100:5, col:19> col:12 name 'std::__1::string (void) const'
|-CXXMethodDecl 0x7f994d342410 <line:101:5, col:36> col:10 used operator== '_Bool (const class std::__1::locale &) const'
| `-ParmVarDecl 0x7f994d342350 <col:21, col:33> col:34 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f994d342548 <line:102:5, col:70> col:10 operator!= '_Bool (const class std::__1::locale &) const'
| |-ParmVarDecl 0x7f994d3424c0 <col:21, col:35> col:35 used __y 'const class std::__1::locale &'
| `-CompoundStmt 0x7f994d348c60 <col:46, col:70>
|   `-ReturnStmt 0x7f994d348c48 <col:47, col:68>
|     `-UnaryOperator 0x7f994d348c28 <col:54, col:68> '_Bool' prefix '!'
|       `-ParenExpr 0x7f994d348c08 <col:55, col:68> '_Bool'
|         `-CXXOperatorCallExpr 0x7f994d348bc0 <col:56, col:65> '_Bool'
|           |-ImplicitCastExpr 0x7f994d348ba8 <col:62> '_Bool (*)(const class std::__1::locale &) const' <FunctionToPointerDecay>
|           | `-DeclRefExpr 0x7f994d348b50 <col:62> '_Bool (const class std::__1::locale &) const' lvalue CXXMethod 0x7f994d342410 'operator==' '_Bool (const class std::__1::locale &) const'
|           |-UnaryOperator 0x7f994d347880 <col:56, col:57> 'const class std::__1::locale' lvalue prefix '*'
|           | `-CXXThisExpr 0x7f994d347868 <col:57> 'const class std::__1::locale *' this
|           `-DeclRefExpr 0x7f994d3478a0 <col:65> 'const class std::__1::locale' lvalue ParmVar 0x7f994d3424c0 '__y' 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7f994d342cd8 <line:103:5, line:106:73> line:105:12 operator()
| |-TemplateTypeParmDecl 0x7f994d3425e8 <line:103:15, col:21> col:21 referenced class depth 0 index 0 _CharT
| |-TemplateTypeParmDecl 0x7f994d342658 <col:29, col:35> col:35 referenced class depth 0 index 1 _Traits
| |-TemplateTypeParmDecl 0x7f994d3426c8 <col:44, col:50> col:50 referenced class depth 0 index 2 _Allocator
| `-CXXMethodDecl 0x7f994d342c40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:106:73> line:105:12 operator() '_Bool (const basic_string<_CharT, _Traits, _Allocator> &, const basic_string<_CharT, _Traits, _Allocator> &) const' inline
|   |-ParmVarDecl 0x7f994d342930 <col:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   |-ParmVarDecl 0x7f994d342b30 <line:106:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   `-VisibilityAttr 0x7f994d342d38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:624:40, col:63> Hidden
|-CXXMethodDecl 0x7f994d342e50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:109:5, col:39> col:19 global 'class std::__1::locale (const class std::__1::locale &)' static
| `-ParmVarDecl 0x7f994d342d90 <col:26, col:38> col:39 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f994d342f40 <line:110:5, col:34> col:26 classic 'const class std::__1::locale &(void)' static
|-AccessSpecDecl 0x7f994d342fd8 <line:112:1, col:8> col:1 private
|-CXXRecordDecl 0x7f994d343000 <line:113:5, col:11> col:11 referenced class __imp
|-FieldDecl 0x7f994d3430f8 <line:114:5, col:12> col:12 __locale_ 'class std::__1::locale::__imp *'
|-CXXMethodDecl 0x7f994d343340 <line:116:5, col:52> col:10 referenced __install_ctor 'void (const class std::__1::locale &, class std::__1::locale::facet *, long)'
| |-ParmVarDecl 0x7f994d343150 <col:25, col:37> col:38 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f994d3431e8 <col:40, col:45> col:46 'class std::__1::locale::facet *'
| `-ParmVarDecl 0x7f994d343260 <col:48> col:52 'long'
|-CXXMethodDecl 0x7f994d343470 <line:117:5, col:29> col:20 __global 'class std::__1::locale &(void)' static
|-CXXMethodDecl 0x7f994d343610 <line:118:5, col:25> col:10 referenced has_facet '_Bool (class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7f994d343548 <col:20, col:22> col:23 'class std::__1::locale::id &'
|-CXXMethodDecl 0x7f994d3437b0 <line:119:5, col:33> col:18 used use_facet 'const class std::__1::locale::facet *(class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7f994d3436c0 <col:28, col:30> col:31 'class std::__1::locale::id &'
|-FriendDecl 0x7f994d343ad8 <line:121:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:121:41
| `-FunctionTemplateDecl 0x7f994d343a18 parent 0x7f994d33f180 prev 0x7f994d33f5b0 <col:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:121:41 has_facet
|   |-TemplateTypeParmDecl 0x7f994d343850 <col:15, col:21> col:21 class depth 0 index 0 _Facet
|   `-FunctionDecl 0x7f994d343970 parent 0x7f994d33f180 prev 0x7f994d33f518 <col:29, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:121:41 has_facet '_Bool (const class std::__1::locale &) noexcept'
|     |-ParmVarDecl 0x7f994d3438e0 <col:51, col:63> col:64 'const class std::__1::locale &'
|     |-AlwaysInlineAttr 0x7f994d343ab8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|     `-VisibilityAttr 0x7f994d343ac8 <col:51, col:74> Inherited Hidden
`-FriendDecl 0x7f994d3477f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:122:5, col:73> col:50
  `-FunctionTemplateDecl 0x7f994d347738 parent 0x7f994d33f180 prev 0x7f994d33f8e8 <col:5, col:73> col:50 use_facet
    |-TemplateTypeParmDecl 0x7f994d343b10 <col:15, col:21> col:21 referenced class depth 0 index 0 _Facet
    |-FunctionDecl 0x7f994d347690 parent 0x7f994d33f180 prev 0x7f994d33f850 <col:29, col:73> col:50 use_facet 'const _Facet &(const class std::__1::locale &)'
    | |-ParmVarDecl 0x7f994d343ba0 <col:60, col:72> col:73 'const class std::__1::locale &'
    | |-AlwaysInlineAttr 0x7f994d3477d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
    | `-VisibilityAttr 0x7f994d3477e8 <col:51, col:74> Inherited Hidden
    `-Function 0x7f994e58c2a0 'use_facet' 'const class std::__1::ctype<char> &(const class std::__1::locale &)'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  NonVirtualBaseLLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f994e0dacd8 parent 0x7f994e0d2088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:479:84> col:64 class basic_streambuf definition
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f994e38d0b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7f994e38d178 prev 0x7f994e0dacd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:122:1, col:28> col:28 implicit class basic_streambuf
|-AccessSpecDecl 0x7f994e38d210 <line:124:1, col:7> col:1 public
|-TypedefDecl 0x7f994e38d278 <line:126:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f994e38d240 'char' sugar
|   |-TemplateTypeParmType 0x7f994e376230 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f994e3761e8 '_CharT'
|   `-BuiltinType 0x7f994d032b60 'char'
|-TypedefDecl 0x7f994e38d308 <line:127:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f994e38d2d0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f994e3762a0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f994e376258 '_Traits'
|   `-RecordType 0x7f994e0da560 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f994da44488 'char_traits'
|-TypedefDecl 0x7f994e38d410 <line:128:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f994e38d3c0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f994da45fd0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f994da447e8 'int_type'
|     `-BuiltinType 0x7f994d032bc0 'int'
|-TypedefDecl 0x7f994e38d500 <line:129:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f994e38d4b0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f994e38d490 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f994da448b8 'pos_type'
|     `-TypedefType 0x7f994da3a040 'std::__1::streampos' sugar
|       |-Typedef 0x7f994e0e07b8 'streampos'
|       `-TemplateSpecializationType 0x7f994e0e0710 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f994e0e06f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f994e0e0600 'fpos'
|-TypedefDecl 0x7f994e38d5f0 <line:130:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f994e38d5a0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f994e38d580 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f994da44850 'off_type'
|     `-TypedefType 0x7f994da39fb0 'std::__1::streamoff' sugar
|       |-Typedef 0x7f994e0e0b58 'streamoff'
|       `-BuiltinType 0x7f994d032c00 'long long'
|-CXXDestructorDecl 0x7f994e38d678 <line:132:5, col:30> col:13 ~basic_streambuf 'void (void)' virtual noexcept-unevaluated 0x7f994e38d678
|-CXXMethodDecl 0x7f994e38d7b0 <line:135:5, line:141:5> line:136:12 pubimbue 'class std::__1::locale (const class std::__1::locale &)' inline
| |-ParmVarDecl 0x7f994e38d728 <col:21, col:35> col:35 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7f994e38d888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e38d8d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:143:5, line:144:44> col:12 getloc 'class std::__1::locale (void) const' inline
| `-AlwaysInlineAttr 0x7f994e38d978 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e38db90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:147:5, line:149:32> line:148:22 pubsetbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f994e38da18 <col:32, col:43> col:43 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f994e38da78 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f994e38dc48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e38ded0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:151:5, line:154:46> line:152:14 referenced pubseekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7f994e38dce0 <col:25, col:34> col:34 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7f994e38dd40 <col:41, col:59> col:59 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| |-ParmVarDecl 0x7f994e38dda0 <line:153:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7f994e38df90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e38e160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:156:5, line:159:38> line:157:14 referenced pubseekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7f994e38dfe8 <col:25, col:34> col:34 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| |-ParmVarDecl 0x7f994e38e048 <line:158:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7f994e38e218 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e38e260 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:161:5, line:162:36> col:9 referenced pubsync 'int (void)' inline
| `-AlwaysInlineAttr 0x7f994e38e308 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e38e350 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:166:5, line:171:5> line:167:16 in_avail 'std::__1::streamsize (void)' inline
| `-AlwaysInlineAttr 0x7f994e38e3f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e38e4b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:173:5, line:178:5> line:174:14 snextc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f994e38e558 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e38e5c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:180:5, line:185:5> line:181:14 sbumpc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f994e38e668 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e38e6d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:187:5, line:192:5> line:188:14 sgetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f994e38e778 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e38e940 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:194:5, line:196:32> line:195:16 referenced sgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f994e38e7d0 <col:22, col:33> col:33 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f994e38e830 <col:38, col:49> col:49 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f994e38e9f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e38eb10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:199:5, line:204:5> line:200:14 sputbackc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7f994e38ea50 <col:24, col:34> col:34 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7f994e38ebc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e38ec28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:206:5, line:211:5> line:207:14 sungetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f994e38ecd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e38edb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:214:5, line:220:5> line:215:14 sputc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7f994e38ed28 <col:20, col:30> col:30 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7f994e38ee60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e38f060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:222:5, line:224:32> line:223:16 used sputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f994e38eee8 <col:22, col:39> col:39 used __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f994e38ef48 <col:44, col:55> col:55 used __n 'std::__1::streamsize':'long'
| |-CompoundStmt 0x7f994e58ea40 <line:224:5, col:32>
| | `-ReturnStmt 0x7f994e58ea28 <col:7, col:29>
| |   `-CXXMemberCallExpr 0x7f994e58e9c0 <col:14, col:29> 'std::__1::streamsize':'long'
| |     |-MemberExpr 0x7f994e58e938 <col:14> '<bound member function type>' ->xsputn 0x7f994e391500
| |     | `-CXXThisExpr 0x7f994e58e920 <col:14> 'class std::__1::basic_streambuf<char> *' this
| |     |-ImplicitCastExpr 0x7f994e58e9f8 <col:21> 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f994e58e970 <col:21> 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *' lvalue ParmVar 0x7f994e38eee8 '__s' 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |     `-ImplicitCastExpr 0x7f994e58ea10 <col:26> 'std::__1::streamsize':'long' <LValueToRValue>
| |       `-DeclRefExpr 0x7f994e58e998 <col:26> 'std::__1::streamsize':'long' lvalue ParmVar 0x7f994e38ef48 '__n' 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f994e38f118 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-AccessSpecDecl 0x7f994e38f160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:226:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f994e38f1c8 <line:227:5, col:21> col:5 basic_streambuf 'void (void)'
|-CXXConstructorDecl 0x7f994e38f3a0 <line:228:5, col:49> col:5 basic_streambuf 'void (const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7f994e38f2b8 <col:21, col:44> col:44 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7f994e38f560 <line:229:5, col:60> col:22 operator= 'class std::__1::basic_streambuf<char> &(const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7f994e38f498 <col:32, col:55> col:55 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7f994e38f6e0 <line:230:5, col:37> col:10 swap 'void (class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7f994e38f620 <col:15, col:32> col:32 __rhs 'class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7f994e38f810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:233:68> col:38 eback 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f994e38f8b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e38f920 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:234:68> col:38 gptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f994e38f9c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e38fa30 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:235:68> col:38 egptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f994e38fad8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e38fba8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:237:5, line:238:43> col:10 gbump 'void (int)' inline
| |-ParmVarDecl 0x7f994e38fb20 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7f994e38fc58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e38fec0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:240:5, line:245:5> line:241:10 setg 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7f994e38fcb0 <col:15, col:26> col:26 __gbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f994e38fd20 <col:34, col:45> col:45 __gnext 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f994e38fd90 <col:54, col:65> col:65 __gend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7f994e38ff80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e38ffe8 <line:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:248:68> col:38 pbase 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f994e390090 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e3900f8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:249:68> col:38 pptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f994e3901a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e390208 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:250:68> col:38 epptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f994e3902b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f994e390380 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:252:5, line:253:43> col:10 pbump 'void (int)' inline
| |-ParmVarDecl 0x7f994e3902f8 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7f994e390430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e390610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:255:5, line:259:5> line:256:10 setp 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7f994e390488 <col:15, col:26> col:26 __pbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f994e3904f8 <col:34, col:45> col:45 __pend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7f994e3906c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f994e390798 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:263:5, col:43> col:18 imbue 'void (const class std::__1::locale &)' virtual
| `-ParmVarDecl 0x7f994e390710 <col:24, col:38> col:38 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f994e390948 <line:266:5, col:67> col:30 setbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7f994e390858 <col:37, col:48> col:48 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f994e3908b8 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f994e390b68 <line:267:5, line:268:87> line:267:22 seekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7f994e390a10 <col:30, col:39> col:39 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7f994e390a70 <col:46, col:64> col:64 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-ParmVarDecl 0x7f994e390ad0 <line:268:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f994e390d28 <line:269:5, line:270:87> line:269:22 seekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7f994e390c38 <col:30, col:39> col:39 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ParmVarDecl 0x7f994e390c98 <line:270:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f994e390de0 <line:271:5, col:22> col:17 sync 'int (void)' virtual
|-CXXMethodDecl 0x7f994e390e88 <line:274:5, col:34> col:24 showmanyc 'std::__1::streamsize (void)' virtual
|-CXXMethodDecl 0x7f994e391030 <line:275:5, col:61> col:24 xsgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7f994e390f40 <col:31, col:42> col:42 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f994e390fa0 <col:47, col:58> col:58 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f994e391108 <line:276:5, col:32> col:22 underflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7f994e3911d0 <line:277:5, col:28> col:22 uflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7f994e391350 <line:280:5, col:65> col:22 pbackfail 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7f994e391288 <col:32, col:64> col:41 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7f994e391500 <line:283:5, col:67> col:24 used xsputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7f994e391410 <col:31, col:48> col:48 __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f994e391470 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f994e391650 <line:284:5, col:64> col:22 overflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7f994e3915c8 <col:31, col:63> col:40 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-AccessSpecDecl 0x7f994e391700 <line:286:1, col:8> col:1 private
|-FieldDecl 0x7f994e391728 <line:287:5, col:12> col:12 __loc_ 'class std::__1::locale'
|-FieldDecl 0x7f994e391780 <line:288:5, col:16> col:16 __binp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f994e3917d8 <line:289:5, col:16> col:16 __ninp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f994e391830 <line:290:5, col:16> col:16 __einp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f994e391888 <line:291:5, col:16> col:16 __bout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f994e3918e0 <line:292:5, col:16> col:16 __nout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
`-FieldDecl 0x7f994e391938 <line:293:5, col:16> col:16 __eout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f994dbddf28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:998:1, line:1037:1> line:999:28 class ostreambuf_iterator definition
|-public 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-CXXRecordDecl 0x7f994e586e70 prev 0x7f994dbddf28 <col:1, col:28> col:28 implicit class ostreambuf_iterator
|-AccessSpecDecl 0x7f994e586f08 <line:1002:1, col:7> col:1 public
|-TypedefDecl 0x7f994e586f68 <line:1003:5, col:45> col:45 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f994e586f30 'char' sugar
|   |-TemplateTypeParmType 0x7f994e973180 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f994e973140 '_CharT'
|   `-BuiltinType 0x7f994d032b60 'char'
|-TypedefDecl 0x7f994e586ff8 <line:1004:5, col:45> col:45 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f994e586fc0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f994e9731f0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f994e9731a8 '_Traits'
|   `-RecordType 0x7f994e0da560 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f994da44488 'char_traits'
|-TypedefDecl 0x7f994e587118 <line:1005:5, col:45> col:45 streambuf_type 'basic_streambuf<char, struct std::__1::char_traits<char> >':'class std::__1::basic_streambuf<char>'
| `-TemplateSpecializationType 0x7f994e587070 'basic_streambuf<char, struct std::__1::char_traits<char> >' sugar basic_streambuf
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7f994e0dade0 'class std::__1::basic_streambuf<char>'
|     `-ClassTemplateSpecialization 0x7f994e0dacd8 'basic_streambuf'
|-TypedefDecl 0x7f994e587238 <line:1006:5, col:45> col:45 ostream_type 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>'
| `-TemplateSpecializationType 0x7f994e587190 'basic_ostream<char, struct std::__1::char_traits<char> >' sugar basic_ostream
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7f994e0db7c0 'class std::__1::basic_ostream<char>'
|     `-ClassTemplateSpecialization 0x7f994e0db6b8 'basic_ostream'
|-AccessSpecDecl 0x7f994e587290 <line:1007:1, col:8> col:1 private
|-FieldDecl 0x7f994e587318 <line:1008:5, col:21> col:21 referenced __sbuf_ 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
|-AccessSpecDecl 0x7f994e587360 <line:1009:1, col:7> col:1 public
|-CXXConstructorDecl 0x7f994e5874f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1011:33> line:1010:31 used ostreambuf_iterator 'void (std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type &) noexcept'
| |-ParmVarDecl 0x7f994e5873e8 <col:51, col:65> col:65 used __s 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type &'
| |-CXXCtorInitializer 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>'
| | `-CXXConstructExpr 0x7f994e58b188 <col:31> 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7f994e587318 '__sbuf_' 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
| | `-CXXMemberCallExpr 0x7f994e58b0d0 <line:1011:19, col:29> 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| |   `-MemberExpr 0x7f994e58b098 <col:19, col:23> '<bound member function type>' .rdbuf 0x7f994e39a4e0
| |     `-ImplicitCastExpr 0x7f994e58b0f8 <col:19> 'const class std::__1::basic_ios<char>' lvalue <UncheckedDerivedToBase (virtual basic_ios)>
| |       `-DeclRefExpr 0x7f994e58b000 <col:19> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type':'class std::__1::basic_ostream<char>' lvalue ParmVar 0x7f994e5873e8 '__s' 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type &'
| |-CompoundStmt 0x7f994e9761b8 <col:32, col:33>
| `-AlwaysInlineAttr 0x7f994e5875e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f994e587728 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1013:25> line:1012:31 ostreambuf_iterator 'void (std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *) noexcept'
| |-ParmVarDecl 0x7f994e587640 <col:51, col:67> col:67 __s 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
| `-AlwaysInlineAttr 0x7f994e5877e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e587970 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1019:9> line:1014:52 operator= 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(char)'
| |-ParmVarDecl 0x7f994e587868 <col:62, col:69> col:69 __c 'char':'char'
| `-AlwaysInlineAttr 0x7f994e587a20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e587ac0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1020:82> col:52 operator* 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(void)'
| `-AlwaysInlineAttr 0x7f994e587b68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e587bd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1021:82> col:52 operator++ 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(void)'
| `-AlwaysInlineAttr 0x7f994e587c78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e587d80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1022:82> col:52 operator++ 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(int)'
| |-ParmVarDecl 0x7f994e587cc0 <col:63> col:66 'int'
| `-AlwaysInlineAttr 0x7f994e587e30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e587e78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1023:82> col:36 used failed '_Bool (void) const noexcept'
| |-CompoundStmt 0x7f994e593f28 <col:61, col:82>
| | `-ReturnStmt 0x7f994e593f10 <col:62, col:80>
| |   `-BinaryOperator 0x7f994e593ee8 <col:69, col:80> '_Bool' '=='
| |     |-ImplicitCastExpr 0x7f994e593eb8 <col:69> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' <LValueToRValue>
| |     | `-MemberExpr 0x7f994e593e80 <col:69> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *const' lvalue ->__sbuf_ 0x7f994e587318
| |     |   `-CXXThisExpr 0x7f994e593e68 <col:69> 'const class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > *' this
| |     `-ImplicitCastExpr 0x7f994e593ed0 <col:80> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' <NullToPointer>
| |       `-IntegerLiteral 0x7f994e976888 <col:80> 'int' 0
| `-AlwaysInlineAttr 0x7f994e587f20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FriendDecl 0x7f994e588760 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1029:5, line:1035:47> line:1033:5
| `-FunctionTemplateDecl 0x7f994e588630 parent 0x7f994e939868 prev 0x7f994dbacd60 <line:1029:5, line:1035:47> line:1033:5 __pad_and_output
|   |-TemplateTypeParmDecl 0x7f994e587f68 <line:1029:15, col:21> col:21 class depth 0 index 0 _Ch
|   |-TemplateTypeParmDecl 0x7f994e587fd8 <col:26, col:32> col:32 class depth 0 index 1 _Tr
|   |-FunctionDecl 0x7f994e588558 parent 0x7f994e939868 prev 0x7f994dbaccc8 <line:1030:5, line:1035:47> line:1033:5 __pad_and_output 'ostreambuf_iterator<_Ch, _Tr> (ostreambuf_iterator<_Ch, _Tr>, const _Ch *, const _Ch *, const _Ch *, class std::__1::ios_base &, _Ch)'
|   | |-ParmVarDecl 0x7f994e5881b8 <col:22, col:52> col:52 __s 'ostreambuf_iterator<_Ch, _Tr>'
|   | |-ParmVarDecl 0x7f994e588258 <line:1034:22, col:33> col:33 __ob 'const _Ch *'
|   | |-ParmVarDecl 0x7f994e5882c8 <col:39, col:50> col:50 __op 'const _Ch *'
|   | |-ParmVarDecl 0x7f994e588338 <col:56, col:67> col:67 __oe 'const _Ch *'
|   | |-ParmVarDecl 0x7f994e588398 <line:1035:22, col:32> col:32 __iob 'class std::__1::ios_base &'
|   | |-ParmVarDecl 0x7f994e588408 <col:39, col:43> col:43 __fl '_Ch'
|   | `-VisibilityAttr 0x7f994e5886c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:624:40, col:63> Inherited Hidden
|   `-Function 0x7f994e58a438 '__pad_and_output' 'ostreambuf_iterator<char, struct std::__1::char_traits<char> > (ostreambuf_iterator<char, struct std::__1::char_traits<char> >, const char *, const char *, const char *, class std::__1::ios_base &, char)'
|-CXXConstructorDecl 0x7f994e588b88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:999:28> col:28 implicit constexpr ostreambuf_iterator 'void (const class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &)' inline default trivial noexcept-unevaluated 0x7f994e588b88
| `-ParmVarDecl 0x7f994e588cb0 <col:28> col:28 'const class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &'
|-CXXConstructorDecl 0x7f994e588d48 <col:28> col:28 implicit used constexpr ostreambuf_iterator 'void (class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7f994e588e70 <col:28> col:28 used 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&'
| |-CXXCtorInitializer 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>'
| | `-CXXConstructExpr 0x7f994e58a880 <col:28> 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>' 'void (struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &&) noexcept'
| |   `-ImplicitCastExpr 0x7f994e58a760 <col:28> 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>' xvalue <UncheckedDerivedToBase (iterator)>
| |     `-CXXStaticCastExpr 0x7f994e58a730 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' xvalue static_cast<class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&> <NoOp>
| |       `-DeclRefExpr 0x7f994e58a6f8 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' lvalue ParmVar 0x7f994e588e70 '' 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&'
| |-CXXCtorInitializer Field 0x7f994e587318 '__sbuf_' 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
| | `-ImplicitCastExpr 0x7f994e58aa78 <col:28> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' <LValueToRValue>
| |   `-MemberExpr 0x7f994e58aa28 <col:28> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' xvalue .__sbuf_ 0x7f994e587318
| |     `-CXXStaticCastExpr 0x7f994e58a9f8 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' xvalue static_cast<class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&> <NoOp>
| |       `-DeclRefExpr 0x7f994e58a9c0 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' lvalue ParmVar 0x7f994e588e70 '' 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&'
| `-CompoundStmt 0x7f994e58aac8 <col:28>
`-CXXDestructorDecl 0x7f994e588f10 <col:28> col:28 implicit referenced ~ostreambuf_iterator 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ostreambuf_iterator" = type { %"class.std::__1::basic_streambuf"* }
  NonVirtualBaseLLVMType:%"class.std::__1::ostreambuf_iterator" = type { %"class.std::__1::basic_streambuf"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f994d22c368 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:583:90> col:64 class __basic_string_common definition
|-TemplateArgument integral 1
|-VisibilityAttr 0x7f994d22c4f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7f994d22c5a8 prev 0x7f994d22c368 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:558:1, col:28> col:28 implicit class __basic_string_common
|-AccessSpecDecl 0x7f994d22c640 <line:560:1, col:10> col:1 protected
|-CXXMethodDecl 0x7f994d22c668 <line:561:22, col:50> col:27 used __throw_length_error 'void (void) const'
| `-CXX11NoReturnAttr 0x7f994d22c738 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:313:30> Inherited
|-CXXMethodDecl 0x7f994d22c780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:562:22, col:50> col:27 __throw_out_of_range 'void (void) const'
| `-CXX11NoReturnAttr 0x7f994d22c828 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:313:30> Inherited
|-CXXDestructorDecl 0x7f994d293740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:583:64> col:64 implicit ~__basic_string_common 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f994edceab8 <col:64> col:64 implicit used constexpr __basic_string_common 'void (void) noexcept' inline default trivial
| `-CompoundStmt 0x7f994edcef18 <col:64>
|-CXXConstructorDecl 0x7f994edcebc8 <col:64> col:64 implicit constexpr __basic_string_common 'void (const class std::__1::__basic_string_common<true> &)' inline default trivial noexcept-unevaluated 0x7f994edcebc8
| `-ParmVarDecl 0x7f994edcecf0 <col:64> col:64 'const class std::__1::__basic_string_common<true> &'
`-CXXConstructorDecl 0x7f994edced88 <col:64> col:64 implicit constexpr __basic_string_common 'void (class std::__1::__basic_string_common<true> &&)' inline default trivial noexcept-unevaluated 0x7f994edced88
  `-ParmVarDecl 0x7f994edceeb0 <col:64> col:64 'class std::__1::__basic_string_common<true> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f994e0dbca8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:101:1, col:52> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1759:28 class allocator definition
|-TemplateArgument type 'char'
|-CXXRecordDecl 0x7f994e2ff048 prev 0x7f994e0dbca8 <col:1, col:28> col:28 implicit class allocator
|-AccessSpecDecl 0x7f994e2ff0e0 <line:1761:1, col:7> col:1 public
|-TypedefDecl 0x7f994e2ff108 <line:1762:5, col:31> col:31 referenced size_type 'size_t':'unsigned long'
| `-TypedefType 0x7f994e07b220 'size_t' sugar
|   |-Typedef 0x7f994e01a960 'size_t'
|   `-TypedefType 0x7f994e01a930 '__darwin_size_t' sugar
|     |-Typedef 0x7f994d067c30 '__darwin_size_t'
|     `-BuiltinType 0x7f994d032c80 'unsigned long'
|-TypedefDecl 0x7f994e2ff160 <line:1763:5, col:31> col:31 referenced difference_type 'ptrdiff_t':'long'
| `-TypedefType 0x7f994e9448a0 'ptrdiff_t' sugar
|   |-Typedef 0x7f994e0e5028 'ptrdiff_t'
|   `-BuiltinType 0x7f994d032be0 'long'
|-TypedefDecl 0x7f994e2ff228 <line:1764:5, col:31> col:31 referenced pointer 'char *'
| `-PointerType 0x7f994e2ff1f0 'char *'
|   `-SubstTemplateTypeParmType 0x7f994e2ff1c0 'char' sugar
|     |-TemplateTypeParmType 0x7f994e238fd0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f994e238f88 '_Tp'
|     `-BuiltinType 0x7f994d032b60 'char'
|-TypedefDecl 0x7f994e2ff2b8 <line:1765:5, col:31> col:31 referenced const_pointer 'const char *'
| `-PointerType 0x7f994e2ff280 'const char *'
|   `-QualType 0x7f994e2ff1c1 'const char' const
|     `-SubstTemplateTypeParmType 0x7f994e2ff1c0 'char' sugar
|       |-TemplateTypeParmType 0x7f994e238fd0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f994e238f88 '_Tp'
|       `-BuiltinType 0x7f994d032b60 'char'
|-TypedefDecl 0x7f994e2ff348 <line:1766:5, col:31> col:31 reference 'char &'
| `-LValueReferenceType 0x7f994e2ff310 'char &'
|   `-SubstTemplateTypeParmType 0x7f994e2ff1c0 'char' sugar
|     |-TemplateTypeParmType 0x7f994e238fd0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f994e238f88 '_Tp'
|     `-BuiltinType 0x7f994d032b60 'char'
|-TypedefDecl 0x7f994e2ff3d8 <line:1767:5, col:31> col:31 const_reference 'const char &'
| `-LValueReferenceType 0x7f994e2ff3a0 'const char &'
|   `-QualType 0x7f994e2ff1c1 'const char' const
|     `-SubstTemplateTypeParmType 0x7f994e2ff1c0 'char' sugar
|       |-TemplateTypeParmType 0x7f994e238fd0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f994e238f88 '_Tp'
|       `-BuiltinType 0x7f994d032b60 'char'
|-TypedefDecl 0x7f994e2ff440 <line:1768:5, col:31> col:31 referenced value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f994e2ff1c0 'char' sugar
|   |-TemplateTypeParmType 0x7f994e238fd0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f994e238f88 '_Tp'
|   `-BuiltinType 0x7f994d032b60 'char'
|-TypedefDecl 0x7f994e2ff498 <line:1770:5, col:23> col:23 referenced propagate_on_container_move_assignment 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7f994e103000 'std::__1::true_type' sugar
|   |-Typedef 0x7f994e0f46d0 'true_type'
|   `-TemplateSpecializationType 0x7f994e0f45e0 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7f994e0f4448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:522:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7f994e0f4430 <line:525:31> '_Bool' true
|     `-RecordType 0x7f994e0f45c0 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7f994e0f44b8 'integral_constant'
|-TypedefDecl 0x7f994e2ff4f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1771:5, col:23> col:23 referenced is_always_equal 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7f994e103000 'std::__1::true_type' sugar
|   |-Typedef 0x7f994e0f46d0 'true_type'
|   `-TemplateSpecializationType 0x7f994e0f45e0 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7f994e0f4448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:522:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7f994e0f4430 <line:525:31> '_Bool' true
|     `-RecordType 0x7f994e0f45c0 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7f994e0f44b8 'integral_constant'
|-ClassTemplateDecl 0x7f994e2ff668 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1773:5, col:33> col:33 rebind
| |-TemplateTypeParmDecl 0x7f994e2ff548 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXRecordDecl 0x7f994e2ff5d0 <col:26, col:33> col:33 struct rebind
|-CXXConstructorDecl 0x7f994e2ff8b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1775:54> col:31 used allocator 'void (void) noexcept'
| |-CompoundStmt 0x7f994e23b6b0 <col:53, col:54>
| `-AlwaysInlineAttr 0x7f994e2ff998 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f994e2ffcf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:5, col:96> col:52 allocator
| |-TemplateTypeParmDecl 0x7f994e2ff9e0 <col:15, col:21> col:21 class depth 0 index 0 _Up
| |-CXXConstructorDecl 0x7f994e2ffc48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:96> col:52 allocator 'void (const allocator<_Up> &) noexcept'
| | |-ParmVarDecl 0x7f994e2ffb20 <col:62, col:82> col:83 'const allocator<_Up> &'
| | `-AlwaysInlineAttr 0x7f994e2ffd48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-CXXConstructorDecl 0x7f994d29a948 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:96> col:52 allocator 'void (const allocator<char> &) noexcept'
|   |-TemplateArgument type 'char'
|   |-ParmVarDecl 0x7f994d29a880 <col:62, col:82> col:83 'const allocator<char> &'
|   `-AlwaysInlineAttr 0x7f994d29aa50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e2fff78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1778:39> line:1777:39 address 'std::__1::allocator<char>::pointer (std::__1::allocator<char>::reference) const noexcept'
| |-ParmVarDecl 0x7f994e2ffe70 <col:47, col:57> col:57 __x 'std::__1::allocator<char>::reference':'char &'
| `-AlwaysInlineAttr 0x7f994e300028 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e3001c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1780:39> line:1779:45 address 'std::__1::allocator<char>::const_pointer (std::__1::allocator<char>::const_reference) const noexcept'
| |-ParmVarDecl 0x7f994e3000c0 <col:53, col:69> col:69 __x 'std::__1::allocator<char>::const_reference':'const char &'
| `-AlwaysInlineAttr 0x7f994e300278 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e300430 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1787:9> line:1781:39 used allocate 'std::__1::allocator<char>::pointer (std::__1::allocator::size_type, allocator<void>::const_pointer)'
| |-ParmVarDecl 0x7f994e3002c0 <col:48, col:58> col:58 used __n 'std::__1::allocator::size_type':'unsigned long'
| |-ParmVarDecl 0x7f994e300320 <col:63, col:96> col:94 'allocator<void>::const_pointer':'const void *' cinit
| | `-ImplicitCastExpr 0x7f994eddfff8 <col:96> 'allocator<void>::const_pointer':'const void *' <NullToPointer>
| |   `-IntegerLiteral 0x7f994e23b678 <col:96> 'int' 0
| |-CompoundStmt 0x7f994ede03b0 <line:1782:9, line:1787:9>
| | |-IfStmt 0x7f994ede0240 <line:1783:9, line:1785:71>
| | | |-<<<NULL>>>
| | | |-<<<NULL>>>
| | | |-BinaryOperator 0x7f994ede01b8 <line:1783:13, col:28> '_Bool' '>'
| | | | |-ImplicitCastExpr 0x7f994ede01a0 <col:13> 'std::__1::allocator::size_type':'unsigned long' <LValueToRValue>
| | | | | `-DeclRefExpr 0x7f994ede00e8 <col:13> 'std::__1::allocator::size_type':'unsigned long' lvalue ParmVar 0x7f994e3002c0 '__n' 'std::__1::allocator::size_type':'unsigned long'
| | | | `-CXXMemberCallExpr 0x7f994ede0160 <col:19, col:28> 'std::__1::allocator::size_type':'unsigned long'
| | | |   `-MemberExpr 0x7f994ede0128 <col:19> '<bound member function type>' ->max_size 0x7f994e300778
| | | |     `-ImplicitCastExpr 0x7f994ede0188 <col:19> 'const class std::__1::allocator<char> *' <NoOp>
| | | |       `-CXXThisExpr 0x7f994ede0110 <col:19> 'class std::__1::allocator<char> *' this
| | | |-CallExpr 0x7f994ede01f8 <line:1784:13, line:1785:71> 'void'
| | | | |-ImplicitCastExpr 0x7f994ede01e0 <line:1784:13> 'void (*)(const char *)' <FunctionToPointerDecay>
| | | | | `-DeclRefExpr 0x7f994e23bbd0 <col:13> 'void (const char *)' lvalue Function 0x7f994e1d1480 '__throw_length_error' 'void (const char *)'
| | | | `-ImplicitCastExpr 0x7f994ede0228 <col:34, line:1785:34> 'const char *' <ArrayToPointerDecay>
| | | |   `-StringLiteral 0x7f994e23bb58 <line:1784:34, line:1785:34> 'const char [68]' lvalue "allocator<T>::allocate(size_t n) 'n' exceeds maximum supported size"
| | | `-<<<NULL>>>
| | `-ReturnStmt 0x7f994ede0398 <line:1786:9, col:73>
| |   `-CXXStaticCastExpr 0x7f994ede0368 <col:16, col:73> 'std::__1::allocator<char>::pointer':'char *' static_cast<std::__1::allocator<char>::pointer> <BitCast>
| |     `-CallExpr 0x7f994ede0338 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1786:72> 'void *'
| |       |-ImplicitCastExpr 0x7f994ede0320 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1786:44> 'void *(*)(size_t)' <FunctionToPointerDecay>
| |       | `-DeclRefExpr 0x7f994e23bcf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1786:44> 'void *(size_t)' lvalue Function 0x7f994e8cd2b8 '__allocate' 'void *(size_t)'
| |       `-BinaryOperator 0x7f994ede02f8 <col:55, col:71> 'unsigned long' '*'
| |         |-ImplicitCastExpr 0x7f994ede02e0 <col:55> 'std::__1::allocator::size_type':'unsigned long' <LValueToRValue>
| |         | `-DeclRefExpr 0x7f994ede0288 <col:55> 'std::__1::allocator::size_type':'unsigned long' lvalue ParmVar 0x7f994e3002c0 '__n' 'std::__1::allocator::size_type':'unsigned long'
| |         `-UnaryExprOrTypeTraitExpr 0x7f994ede02c0 <col:61, col:71> 'unsigned long' sizeof 'char':'char'
| `-AlwaysInlineAttr 0x7f994e3004e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e300678 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:49> line:1788:36 used deallocate 'void (std::__1::allocator<char>::pointer, std::__1::allocator::size_type) noexcept'
| |-ParmVarDecl 0x7f994e300540 <col:47, col:55> col:55 used __p 'std::__1::allocator<char>::pointer':'char *'
| |-ParmVarDecl 0x7f994e3005a0 <col:60> col:69 'std::__1::allocator::size_type':'unsigned long'
| |-CompoundStmt 0x7f994ede1a60 <line:1789:9, col:49>
| | `-CallExpr 0x7f994ede1a30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:47> 'void'
| |   |-ImplicitCastExpr 0x7f994ede1a18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:17> 'void (*)(void *)' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7f994e23bee0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:17> 'void (void *)' lvalue Function 0x7f994e8cd740 '__libcpp_deallocate' 'void (void *)'
| |   `-CStyleCastExpr 0x7f994ede19f0 <col:37, col:44> 'void *' <NoOp>
| |     `-ImplicitCastExpr 0x7f994ede19d8 <col:44> 'void *' <BitCast>
| |       `-ImplicitCastExpr 0x7f994ede19c0 <col:44> 'std::__1::allocator<char>::pointer':'char *' <LValueToRValue>
| |         `-DeclRefExpr 0x7f994ede1998 <col:44> 'std::__1::allocator<char>::pointer':'char *' lvalue ParmVar 0x7f994e300540 '__p' 'std::__1::allocator<char>::pointer':'char *'
| `-AlwaysInlineAttr 0x7f994e300730 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e300778 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1791:45> line:1790:41 used max_size 'std::__1::allocator::size_type (void) const noexcept'
| |-CompoundStmt 0x7f994edd6ad8 <line:1791:9, col:45>
| | `-ReturnStmt 0x7f994edd6ac0 <col:10, col:43>
| |   `-BinaryOperator 0x7f994edd6a98 <col:17, col:43> 'unsigned long' '/'
| |     |-CXXFunctionalCastExpr 0x7f994edd6a40 <col:17, col:29> 'std::__1::allocator::size_type':'unsigned long' functional cast to std::__1::allocator::size_type <NoOp>
| |     | `-ImplicitCastExpr 0x7f994edd6a28 <col:27, col:28> 'std::__1::allocator::size_type':'unsigned long' <IntegralCast>
| |     |   `-UnaryOperator 0x7f994e23c018 <col:27, col:28> 'int' prefix '~'
| |     |     `-IntegerLiteral 0x7f994e23bff8 <col:28> 'int' 0
| |     `-UnaryExprOrTypeTraitExpr 0x7f994edd6a78 <col:33, col:43> 'unsigned long' sizeof 'char':'char'
| `-AlwaysInlineAttr 0x7f994e300820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f994e300c48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1793:5, line:1799:9> line:1796:9 construct
| |-TemplateTypeParmDecl 0x7f994e300868 <line:1793:15, col:21> col:21 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7f994e3008d8 <col:26, col:35> col:35 class depth 0 index 1 ... _Args
| `-CXXMethodDecl 0x7f994e300bb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1799:9> line:1796:9 construct 'void (_Up *, _Args &&...)'
|   |-ParmVarDecl 0x7f994e3009a8 <col:19, col:24> col:24 __p '_Up *'
|   |-ParmVarDecl 0x7f994e300a98 <col:29, col:40> col:40 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7f994e300ca8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994e300e90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1853:70> col:36 destroy 'void (std::__1::allocator<char>::pointer)'
| |-ParmVarDecl 0x7f994e300d88 <col:44, col:52> col:52 __p 'std::__1::allocator<char>::pointer':'char *'
| `-AlwaysInlineAttr 0x7f994e300f40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f994d292348 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1759:28> col:28 implicit constexpr allocator 'void (const class std::__1::allocator<char> &)' inline default trivial noexcept-unevaluated 0x7f994d292348
| `-ParmVarDecl 0x7f994d292430 <col:28> col:28 'const class std::__1::allocator<char> &'
|-CXXConstructorDecl 0x7f994d2924c8 <col:28> col:28 implicit used constexpr allocator 'void (class std::__1::allocator<char> &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7f994d2925f0 <col:28> col:28 'class std::__1::allocator<char> &&'
| `-CompoundStmt 0x7f994ede30f0 <col:28>
`-CXXDestructorDecl 0x7f994d2939d8 <col:28> col:28 implicit referenced ~allocator 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f994d256e60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:699:5, line:704:5> line:699:12 struct __long definition
|-CXXRecordDecl 0x7f994d2572d8 prev 0x7f994d256e60 <col:5, col:12> col:12 implicit struct __long
|-FieldDecl 0x7f994d2573a0 <line:701:9, col:19> col:19 referenced __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7f994d2573f8 <line:702:9, col:19> col:19 referenced __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7f994d257450 <line:703:9, col:19> col:19 referenced __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
|-CXXDestructorDecl 0x7f994d293b98 <line:699:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f994edcf5e8 <col:12> col:12 implicit constexpr __long 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &)' inline default trivial noexcept-unevaluated 0x7f994edcf5e8
| `-ParmVarDecl 0x7f994edcf710 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &'
|-CXXConstructorDecl 0x7f994edcf7a8 <col:12> col:12 implicit constexpr __long 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7f994edcf8d0 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &&'
`-CXXConstructorDecl 0x7f994edd11c8 <col:12> col:12 implicit __long 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f994d259958 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9, line:723:9> line:719:9 union definition
|-FieldDecl 0x7f994d259ad8 <line:721:13, col:27> col:27 referenced __size_ 'unsigned char'
|-FieldDecl 0x7f994d259b30 <line:722:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXDestructorDecl 0x7f994d293f18 <line:719:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f994edcf9d8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &)' inline default trivial noexcept-unevaluated 0x7f994edcf9d8
| `-ParmVarDecl 0x7f994edcfb00 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &'
|-CXXConstructorDecl 0x7f994edcfb98 <col:9> col:9 implicit constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7f994edcfcc0 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&'
`-CXXConstructorDecl 0x7f994edd1548 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon.0 = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f994d257838 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:717:5, line:725:5> line:717:12 struct __short definition
|-CXXRecordDecl 0x7f994d2598c0 prev 0x7f994d257838 <col:5, col:12> col:12 implicit struct __short
|-CXXRecordDecl 0x7f994d259958 <line:719:9, line:723:9> line:719:9 union definition
| |-FieldDecl 0x7f994d259ad8 <line:721:13, col:27> col:27 referenced __size_ 'unsigned char'
| |-FieldDecl 0x7f994d259b30 <line:722:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-CXXDestructorDecl 0x7f994d293f18 <line:719:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7f994edcf9d8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &)' inline default trivial noexcept-unevaluated 0x7f994edcf9d8
| | `-ParmVarDecl 0x7f994edcfb00 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &'
| |-CXXConstructorDecl 0x7f994edcfb98 <col:9> col:9 implicit constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&) noexcept' inline default trivial
| | `-ParmVarDecl 0x7f994edcfcc0 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&'
| `-CXXConstructorDecl 0x7f994edd1548 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial
|-FieldDecl 0x7f994d259b98 <col:9> col:9 implicit referenced 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
|-IndirectFieldDecl 0x7f994d259bf0 <line:721:27> col:27 implicit __size_ 'unsigned char'
| |-Field 0x7f994d259b98 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| `-Field 0x7f994d259ad8 '__size_' 'unsigned char'
|-IndirectFieldDecl 0x7f994d259c40 <line:722:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-Field 0x7f994d259b98 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| `-Field 0x7f994d259b30 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FieldDecl 0x7f994d259d08 <line:724:9, col:37> col:20 referenced __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
|-CXXDestructorDecl 0x7f994d293c78 <line:717:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f994edcfd28 <col:12> col:12 implicit constexpr __short 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &)' inline default trivial noexcept-unevaluated 0x7f994edcfd28
| `-ParmVarDecl 0x7f994edcfe50 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &'
|-CXXConstructorDecl 0x7f994edcfee8 <col:12> col:12 implicit constexpr __short 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7f994edd0010 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &&'
`-CXXConstructorDecl 0x7f994edd12a8 <col:12> col:12 implicit __short 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f994d25a110 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:733:5, line:736:5> line:733:12 struct __raw definition
|-CXXRecordDecl 0x7f994d25c810 prev 0x7f994d25a110 <col:5, col:12> col:12 implicit struct __raw
|-FieldDecl 0x7f994d25c968 <line:735:9, col:36> col:19 referenced __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
|-CXXDestructorDecl 0x7f994d293d58 <line:733:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f994edd00c8 <col:12> col:12 implicit constexpr __raw 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &)' inline default trivial noexcept-unevaluated 0x7f994edd00c8
| `-ParmVarDecl 0x7f994edd01f0 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &'
|-CXXConstructorDecl 0x7f994edd0288 <col:12> col:12 implicit constexpr __raw 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7f994edd03b0 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &&'
`-CXXConstructorDecl 0x7f994edd1388 <col:12> col:12 implicit __raw 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f994d25c568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9, line:745:9> line:740:9 union definition
|-FieldDecl 0x7f994d25c6f8 <line:742:13, col:21> col:21 referenced __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-FieldDecl 0x7f994d25c750 <line:743:13, col:21> col:21 referenced __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-FieldDecl 0x7f994d25c9d0 <line:744:13, col:21> col:21 referenced __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
|-CXXDestructorDecl 0x7f994d293e38 <line:740:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f994edcf0b8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &)' inline default trivial noexcept-unevaluated 0x7f994edcf0b8
| `-ParmVarDecl 0x7f994edcf1e0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &'
|-CXXConstructorDecl 0x7f994edcf278 <col:9> col:9 implicit used constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7f994edcf3a0 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&'
| `-CompoundStmt 0x7f994ede32d0 <col:9>
`-CXXConstructorDecl 0x7f994edd1468 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f994d25a1e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:738:5, line:746:5> line:738:12 struct __rep definition
|-CXXRecordDecl 0x7f994d25c4d0 prev 0x7f994d25a1e0 <col:5, col:12> col:12 implicit struct __rep
|-CXXRecordDecl 0x7f994d25c568 <line:740:9, line:745:9> line:740:9 union definition
| |-FieldDecl 0x7f994d25c6f8 <line:742:13, col:21> col:21 referenced __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-FieldDecl 0x7f994d25c750 <line:743:13, col:21> col:21 referenced __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-FieldDecl 0x7f994d25c9d0 <line:744:13, col:21> col:21 referenced __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-CXXDestructorDecl 0x7f994d293e38 <line:740:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7f994edcf0b8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &)' inline default trivial noexcept-unevaluated 0x7f994edcf0b8
| | `-ParmVarDecl 0x7f994edcf1e0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &'
| |-CXXConstructorDecl 0x7f994edcf278 <col:9> col:9 implicit used constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept' inline default trivial
| | |-ParmVarDecl 0x7f994edcf3a0 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&'
| | `-CompoundStmt 0x7f994ede32d0 <col:9>
| `-CXXConstructorDecl 0x7f994edd1468 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial
|-FieldDecl 0x7f994d25ca38 <col:9> col:9 implicit referenced 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
|-IndirectFieldDecl 0x7f994d25ca90 <line:742:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-Field 0x7f994d25ca38 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| `-Field 0x7f994d25c6f8 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-IndirectFieldDecl 0x7f994d25cae0 <line:743:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-Field 0x7f994d25ca38 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| `-Field 0x7f994d25c750 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-IndirectFieldDecl 0x7f994d25cb30 <line:744:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-Field 0x7f994d25ca38 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| `-Field 0x7f994d25c9d0 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
|-CXXDestructorDecl 0x7f994d293ab8 <line:738:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f994edcf408 <col:12> col:12 implicit constexpr __rep 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &)' inline default trivial noexcept-unevaluated 0x7f994edcf408
| `-ParmVarDecl 0x7f994edcf530 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
|-CXXConstructorDecl 0x7f994edd0448 <col:12> col:12 implicit used constexpr __rep 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7f994edd0570 <col:12> col:12 used 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&'
| |-CXXCtorInitializer Field 0x7f994d25ca38 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | `-CXXConstructExpr 0x7f994ede32e8 <col:12> 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)' 'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept'
| |   `-MemberExpr 0x7f994ede3298 <col:12> 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)' xvalue . 0x7f994d25ca38
| |     `-CXXStaticCastExpr 0x7f994ede3268 <col:12> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' xvalue static_cast<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&> <NoOp>
| |       `-DeclRefExpr 0x7f994ede3230 <col:12> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue ParmVar 0x7f994edd0570 '' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&'
| `-CompoundStmt 0x7f994ede3350 <col:12>
`-CXXConstructorDecl 0x7f994edd10e0 <col:12> col:12 implicit referenced __rep 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f994d25e2d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2209:1, line:2264:1> line:2210:7 class __libcpp_compressed_pair_imp definition
|-private 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-TemplateArgument integral 2
|-CXXRecordDecl 0x7f994d25e6f8 prev 0x7f994d25e2d8 <col:1, col:7> col:7 implicit class __libcpp_compressed_pair_imp
|-AccessSpecDecl 0x7f994d25e790 <line:2213:1, col:8> col:1 private
|-FieldDecl 0x7f994d25e7c8 <line:2214:5, col:9> col:9 referenced __first_ 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-AccessSpecDecl 0x7f994d25e810 <line:2215:1, col:7> col:1 public
|-TypedefDecl 0x7f994d25e848 <line:2216:5, col:17> col:17 referenced _T1_param 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-SubstTemplateTypeParmType 0x7f994d25e580 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|   |-TemplateTypeParmType 0x7f994e9c5ba0 '_T1' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f994e9c5b60 '_T1'
|   `-RecordType 0x7f994d25a280 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|     `-CXXRecord 0x7f994d25a1e0 '__rep'
|-TypedefDecl 0x7f994d25e8b0 <line:2217:5, col:17> col:17 referenced _T2_param 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7f994d25e5c0 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7f994e9c5c10 '_T2' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f994e9c5bc8 '_T2'
|   `-RecordType 0x7f994e0dbd90 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7f994e0dbca8 'allocator'
|-TypedefDecl 0x7f994d25eda0 <line:2219:5, col:51> col:51 referenced _T1_reference 'typename remove_reference<struct __rep>::type &'
| `-LValueReferenceType 0x7f994d25ed50 'typename remove_reference<struct __rep>::type &'
|   `-ElaboratedType 0x7f994d25ecf0 'typename remove_reference<struct __rep>::type' sugar
|     `-TypedefType 0x7f994d25ecd0 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|       |-Typedef 0x7f994d25ec58 'type'
|       `-SubstTemplateTypeParmType 0x7f994d25ec20 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|         |-TemplateTypeParmType 0x7f994e12e4b0 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7f994e12e470 '_Tp'
|         `-RecordType 0x7f994d25a280 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|           `-CXXRecord 0x7f994d25a1e0 '__rep'
|-TypedefDecl 0x7f994d25ee38 <line:2220:5, col:57> col:57 referenced _T2_reference 'class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7f994d25ee00 'class std::__1::allocator<char> &'
|   `-SubstTemplateTypeParmType 0x7f994d25e5c0 'class std::__1::allocator<char>' sugar
|     |-TemplateTypeParmType 0x7f994e9c5c10 '_T2' dependent depth 0 index 1
|     | `-TemplateTypeParm 0x7f994e9c5bc8 '_T2'
|     `-RecordType 0x7f994e0dbd90 'class std::__1::allocator<char>'
|       `-ClassTemplateSpecialization 0x7f994e0dbca8 'allocator'
|-TypedefDecl 0x7f994d25eff0 <line:2222:5, col:57> col:57 referenced _T1_const_reference 'const typename remove_reference<struct __rep>::type &'
| `-LValueReferenceType 0x7f994d25efa0 'const typename remove_reference<struct __rep>::type &'
|   `-QualType 0x7f994d25ef41 'const typename remove_reference<struct __rep>::type' const
|     `-ElaboratedType 0x7f994d25ef40 'typename remove_reference<struct __rep>::type' sugar
|       `-TypedefType 0x7f994d25ecd0 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|         |-Typedef 0x7f994d25ec58 'type'
|         `-SubstTemplateTypeParmType 0x7f994d25ec20 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|           |-TemplateTypeParmType 0x7f994e12e4b0 '_Tp' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x7f994e12e470 '_Tp'
|           `-RecordType 0x7f994d25a280 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|             `-CXXRecord 0x7f994d25a1e0 '__rep'
|-TypedefDecl 0x7f994d25f088 <line:2223:5, col:63> col:63 referenced _T2_const_reference 'const class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7f994d25f050 'const class std::__1::allocator<char> &'
|   `-QualType 0x7f994d25e5c1 'const class std::__1::allocator<char>' const
|     `-SubstTemplateTypeParmType 0x7f994d25e5c0 'class std::__1::allocator<char>' sugar
|       |-TemplateTypeParmType 0x7f994e9c5c10 '_T2' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x7f994e9c5bc8 '_T2'
|       `-RecordType 0x7f994e0dbd90 'class std::__1::allocator<char>'
|         `-ClassTemplateSpecialization 0x7f994e0dbca8 'allocator'
|-CXXConstructorDecl 0x7f994d25f120 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2225:76> col:31 used __libcpp_compressed_pair_imp 'void (void)'
| |-CXXCtorInitializer 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| | `-CXXConstructExpr 0x7f994edd1680 <col:31> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7f994d25e7c8 '__first_' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| | `-CXXConstructExpr 0x7f994edd1628 <col:64, col:73> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' 'void (void) noexcept' zeroing
| |-CompoundStmt 0x7f994e9c9b28 <col:75, col:76>
| `-AlwaysInlineAttr 0x7f994d25f208 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f994d25f3a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2227:54> line:2226:40 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param)'
| |-ParmVarDecl 0x7f994d25f280 <col:69, col:79> col:79 __t1 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-AlwaysInlineAttr 0x7f994d25f460 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f994d25f600 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2229:61> line:2228:40 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param)'
| |-ParmVarDecl 0x7f994d25f4e0 <col:69, col:79> col:79 __t2 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7f994d25f6c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f994d25f8d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2233:92> line:2230:31 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param, std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param)' noexcept-uninstantiated 0x7f994e9c7fa8
| |-ParmVarDecl 0x7f994d25f718 <col:60, col:70> col:70 __t1 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| |-ParmVarDecl 0x7f994d25f788 <col:76, col:86> col:86 __t2 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7f994d25f9f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f994d2603f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2237:5, line:2247:14> line:2239:9 __libcpp_compressed_pair_imp
| |-TemplateTypeParmDecl 0x7f994d25fa38 <line:2237:15, col:24> col:24 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7f994d25faa8 <col:32, col:41> col:41 class depth 0 index 1 ... _Args2
| |-NonTypeTemplateParmDecl 0x7f994d25fb18 <col:49, col:59> col:59 referenced 'size_t':'unsigned long' depth 0 index 2 ... _I1
| |-NonTypeTemplateParmDecl 0x7f994d25fb70 <col:64, col:74> col:74 referenced 'size_t':'unsigned long' depth 0 index 3 ... _I2
| `-CXXConstructorDecl 0x7f994d260350 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2247:14> line:2239:9 __libcpp_compressed_pair_imp 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>, __tuple_indices<_I1...>, __tuple_indices<_I2...>)'
|   |-ParmVarDecl 0x7f994d25fbf8 <col:38> col:59 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f994d25fd68 <line:2240:38, col:55> col:55 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7f994d25fed8 <line:2241:38, col:55> col:55 __second_args 'tuple<_Args2...>'
|   |-ParmVarDecl 0x7f994d260028 <line:2242:38, col:60> col:61 '__tuple_indices<_I1...>'
|   |-ParmVarDecl 0x7f994d2601c8 <line:2243:38, col:60> col:61 '__tuple_indices<_I2...>'
|   `-AlwaysInlineAttr 0x7f994d260470 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994d2605e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2251:92> col:51 used first 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_reference (void) noexcept'
| |-CompoundStmt 0x7f994edd74b0 <col:75, col:92>
| | `-ReturnStmt 0x7f994edd7498 <col:76, col:83>
| |   `-MemberExpr 0x7f994edd7460 <col:83> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue ->__first_ 0x7f994d25e7c8
| |     `-CXXThisExpr 0x7f994edd7448 <col:83> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7f994d260690 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994d260788 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2252:92> col:51 used first 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_const_reference (void) const noexcept'
| |-CompoundStmt 0x7f994ede1840 <col:75, col:92>
| | `-ReturnStmt 0x7f994ede1828 <col:76, col:83>
| |   `-MemberExpr 0x7f994ede17f0 <col:83> 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue ->__first_ 0x7f994d25e7c8
| |     `-CXXThisExpr 0x7f994ede17d8 <col:83> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7f994d260830 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994d260928 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2254:90> col:51 used second 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_reference (void) noexcept'
| |-CompoundStmt 0x7f994eddfef0 <col:76, col:90>
| | `-ReturnStmt 0x7f994eddfed8 <col:77, col:85>
| |   `-ImplicitCastExpr 0x7f994eddfeb8 <col:84, col:85> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' lvalue <DerivedToBase (allocator)>
| |     `-UnaryOperator 0x7f994eddfe98 <col:84, col:85> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue prefix '*'
| |       `-CXXThisExpr 0x7f994eddfe80 <col:85> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7f994d2609d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994d260ac8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2255:90> col:51 used second 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_const_reference (void) const noexcept'
| |-CompoundStmt 0x7f994edd6ef8 <col:76, col:90>
| | `-ReturnStmt 0x7f994edd6ee0 <col:77, col:85>
| |   `-ImplicitCastExpr 0x7f994edd6ec0 <col:84, col:85> 'const class std::__1::allocator<char>':'const class std::__1::allocator<char>' lvalue <DerivedToBase (allocator)>
| |     `-UnaryOperator 0x7f994edd6ea0 <col:84, col:85> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue prefix '*'
| |       `-CXXThisExpr 0x7f994edd6e88 <col:85> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7f994d260b70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994d260d10 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2263:5> line:2257:36 swap 'void (class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &)' noexcept-uninstantiated 0x7f994e9c93a8
| |-ParmVarDecl 0x7f994d260bf8 <col:41, col:71> col:71 __x 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &'
| `-AlwaysInlineAttr 0x7f994d260e08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7f994d2938f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2210:7> col:7 implicit ~__libcpp_compressed_pair_imp 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f994edd05d8 <col:7> col:7 implicit constexpr __libcpp_compressed_pair_imp 'void (const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &)' inline default trivial noexcept-unevaluated 0x7f994edd05d8
| `-ParmVarDecl 0x7f994edd0700 <col:7> col:7 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &'
`-CXXConstructorDecl 0x7f994edd07d0 <col:7> col:7 implicit used constexpr __libcpp_compressed_pair_imp 'void (class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&) noexcept' inline default trivial
  |-ParmVarDecl 0x7f994edd0900 <col:7> col:7 used 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&'
  |-CXXCtorInitializer 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
  | `-CXXConstructExpr 0x7f994ede3108 <col:7> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' 'void (class std::__1::allocator<char> &&) noexcept'
  |   `-ImplicitCastExpr 0x7f994ede3098 <col:7> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' xvalue <UncheckedDerivedToBase (allocator)>
  |     `-CXXStaticCastExpr 0x7f994ede3068 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' xvalue static_cast<class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&> <NoOp>
  |       `-DeclRefExpr 0x7f994ede3030 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue ParmVar 0x7f994edd0900 '' 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&'
  |-CXXCtorInitializer Field 0x7f994d25e7c8 '__first_' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
  | `-CXXConstructExpr 0x7f994ede3368 <col:7> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&) noexcept'
  |   `-MemberExpr 0x7f994ede31e0 <col:7> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' xvalue .__first_ 0x7f994d25e7c8
  |     `-CXXStaticCastExpr 0x7f994ede31b0 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' xvalue static_cast<class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&> <NoOp>
  |       `-DeclRefExpr 0x7f994ede3178 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue ParmVar 0x7f994edd0900 '' 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&'
  `-CompoundStmt 0x7f994ede33d8 <col:7>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__libcpp_compressed_pair_imp" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  NonVirtualBaseLLVMType:%"class.std::__1::__libcpp_compressed_pair_imp" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f994d25a2d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2317:1, line:2363:1> line:2318:7 class __compressed_pair definition
|-private '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-CXXRecordDecl 0x7f994d260ea0 prev 0x7f994d25a2d0 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7f994d263908 <line:2321:5, col:52> col:52 base '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
| `-TemplateSpecializationType 0x7f994d263860 '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >' sugar __libcpp_compressed_pair_imp
|   |-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|   |-TemplateArgument type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|   `-RecordType 0x7f994d25e3f0 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
|     `-ClassTemplateSpecialization 0x7f994d25e2d8 '__libcpp_compressed_pair_imp'
|-AccessSpecDecl 0x7f994d263960 <line:2322:1, col:7> col:1 public
|-TypedefDecl 0x7f994d263a40 <line:2323:5, col:38> col:38 _T1_param 'typename base::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-ElaboratedType 0x7f994d2639f0 'typename base::_T1_param' sugar
|   `-TypedefType 0x7f994d25f250 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param' sugar
|     |-Typedef 0x7f994d25e848 '_T1_param'
|     `-SubstTemplateTypeParmType 0x7f994d25e580 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|       |-TemplateTypeParmType 0x7f994e9c5ba0 '_T1' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f994e9c5b60 '_T1'
|       `-RecordType 0x7f994d25a280 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|         `-CXXRecord 0x7f994d25a1e0 '__rep'
|-TypedefDecl 0x7f994d263b10 <line:2324:5, col:38> col:38 _T2_param 'typename base::_T2_param':'class std::__1::allocator<char>'
| `-ElaboratedType 0x7f994d263ac0 'typename base::_T2_param' sugar
|   `-TypedefType 0x7f994d25f4b0 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param' sugar
|     |-Typedef 0x7f994d25e8b0 '_T2_param'
|     `-SubstTemplateTypeParmType 0x7f994d25e5c0 'class std::__1::allocator<char>' sugar
|       |-TemplateTypeParmType 0x7f994e9c5c10 '_T2' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x7f994e9c5bc8 '_T2'
|       `-RecordType 0x7f994e0dbd90 'class std::__1::allocator<char>'
|         `-ClassTemplateSpecialization 0x7f994e0dbca8 'allocator'
|-TypedefDecl 0x7f994d263be0 <line:2326:5, col:42> col:42 _T1_reference 'typename base::_T1_reference':'typename remove_reference<struct __rep>::type &'
| `-ElaboratedType 0x7f994d263b90 'typename base::_T1_reference' sugar
|   `-TypedefType 0x7f994d260540 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_reference' sugar
|     |-Typedef 0x7f994d25eda0 '_T1_reference'
|     `-LValueReferenceType 0x7f994d25ed50 'typename remove_reference<struct __rep>::type &'
|       `-ElaboratedType 0x7f994d25ecf0 'typename remove_reference<struct __rep>::type' sugar
|         `-TypedefType 0x7f994d25ecd0 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|           |-Typedef 0x7f994d25ec58 'type'
|           `-SubstTemplateTypeParmType 0x7f994d25ec20 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|             |-TemplateTypeParmType 0x7f994e12e4b0 '_Tp' dependent depth 0 index 0
|             | `-TemplateTypeParm 0x7f994e12e470 '_Tp'
|             `-RecordType 0x7f994d25a280 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|               `-CXXRecord 0x7f994d25a1e0 '__rep'
|-TypedefDecl 0x7f994d263cb0 <line:2327:5, col:42> col:42 _T2_reference 'typename base::_T2_reference':'class std::__1::allocator<char> &'
| `-ElaboratedType 0x7f994d263c60 'typename base::_T2_reference' sugar
|   `-TypedefType 0x7f994d260880 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_reference' sugar
|     |-Typedef 0x7f994d25ee38 '_T2_reference'
|     `-LValueReferenceType 0x7f994d25ee00 'class std::__1::allocator<char> &'
|       `-SubstTemplateTypeParmType 0x7f994d25e5c0 'class std::__1::allocator<char>' sugar
|         |-TemplateTypeParmType 0x7f994e9c5c10 '_T2' dependent depth 0 index 1
|         | `-TemplateTypeParm 0x7f994e9c5bc8 '_T2'
|         `-RecordType 0x7f994e0dbd90 'class std::__1::allocator<char>'
|           `-ClassTemplateSpecialization 0x7f994e0dbca8 'allocator'
|-TypedefDecl 0x7f994d263d80 <line:2329:5, col:48> col:48 _T1_const_reference 'typename base::_T1_const_reference':'const typename remove_reference<struct __rep>::type &'
| `-ElaboratedType 0x7f994d263d30 'typename base::_T1_const_reference' sugar
|   `-TypedefType 0x7f994d2606e0 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_const_reference' sugar
|     |-Typedef 0x7f994d25eff0 '_T1_const_reference'
|     `-LValueReferenceType 0x7f994d25efa0 'const typename remove_reference<struct __rep>::type &'
|       `-QualType 0x7f994d25ef41 'const typename remove_reference<struct __rep>::type' const
|         `-ElaboratedType 0x7f994d25ef40 'typename remove_reference<struct __rep>::type' sugar
|           `-TypedefType 0x7f994d25ecd0 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|             |-Typedef 0x7f994d25ec58 'type'
|             `-SubstTemplateTypeParmType 0x7f994d25ec20 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|               |-TemplateTypeParmType 0x7f994e12e4b0 '_Tp' dependent depth 0 index 0
|               | `-TemplateTypeParm 0x7f994e12e470 '_Tp'
|               `-RecordType 0x7f994d25a280 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|                 `-CXXRecord 0x7f994d25a1e0 '__rep'
|-TypedefDecl 0x7f994d263e50 <line:2330:5, col:48> col:48 _T2_const_reference 'typename base::_T2_const_reference':'const class std::__1::allocator<char> &'
| `-ElaboratedType 0x7f994d263e00 'typename base::_T2_const_reference' sugar
|   `-TypedefType 0x7f994d260a20 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_const_reference' sugar
|     |-Typedef 0x7f994d25f088 '_T2_const_reference'
|     `-LValueReferenceType 0x7f994d25f050 'const class std::__1::allocator<char> &'
|       `-QualType 0x7f994d25e5c1 'const class std::__1::allocator<char>' const
|         `-SubstTemplateTypeParmType 0x7f994d25e5c0 'class std::__1::allocator<char>' sugar
|           |-TemplateTypeParmType 0x7f994e9c5c10 '_T2' dependent depth 0 index 1
|           | `-TemplateTypeParm 0x7f994e9c5bc8 '_T2'
|           `-RecordType 0x7f994e0dbd90 'class std::__1::allocator<char>'
|             `-ClassTemplateSpecialization 0x7f994e0dbca8 'allocator'
|-CXXConstructorDecl 0x7f994d263ee8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2332:52> col:31 used __compressed_pair 'void (void)'
| |-CXXCtorInitializer '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
| | `-CXXConstructExpr 0x7f994edd0ff0 <col:31> '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' 'void (void)'
| |-CompoundStmt 0x7f994e9d7a30 <col:51, col:52>
| `-AlwaysInlineAttr 0x7f994d263fc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f994d264120 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2334:50> line:2333:40 __compressed_pair 'void (std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param)'
| |-ParmVarDecl 0x7f994d264040 <col:58, col:68> col:68 __t1 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-AlwaysInlineAttr 0x7f994d2641e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f994d264340 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2336:50> line:2335:40 __compressed_pair 'void (std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param)'
| |-ParmVarDecl 0x7f994d264260 <col:58, col:68> col:68 __t2 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7f994d264400 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f994d2645c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2338:83> line:2337:31 __compressed_pair 'void (std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param, std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param)'
| |-ParmVarDecl 0x7f994d264458 <col:49, col:59> col:59 __t1 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| |-ParmVarDecl 0x7f994d2644c8 <col:65, col:75> col:75 __t2 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7f994d264688 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f994d264ca8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2342:5, line:2349:14> line:2344:9 __compressed_pair
| |-TemplateTypeParmDecl 0x7f994d2646d0 <line:2342:15, col:24> col:24 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7f994d264738 <col:32, col:41> col:41 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7f994d264c00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2349:14> line:2344:9 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7f994d2647c8 <col:27, col:49> col:49 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f994d264938 <col:55, col:72> col:72 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7f994d264aa8 <line:2345:55, col:72> col:72 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7f994d264d10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994d264e58 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2353:97> col:51 used first 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_reference (void) noexcept'
| |-CompoundStmt 0x7f994edd7428 <col:75, col:97>
| | `-ReturnStmt 0x7f994edd7410 <col:76, col:95>
| |   `-CXXMemberCallExpr 0x7f994edd73c8 <col:83, col:95> 'typename remove_reference<struct __rep>::type':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue
| |     `-MemberExpr 0x7f994edd7378 <col:83, col:89> '<bound member function type>' ->first 0x7f994d2605e8
| |       `-ImplicitCastExpr 0x7f994edd73f0 <col:83> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |         `-CXXThisExpr 0x7f994edd7360 <col:83> 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7f994d264f00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994d264fc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2354:97> col:51 used first 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_const_reference (void) const noexcept'
| |-CompoundStmt 0x7f994ede17b8 <col:75, col:97>
| | `-ReturnStmt 0x7f994ede17a0 <col:76, col:95>
| |   `-CXXMemberCallExpr 0x7f994ede1740 <col:83, col:95> 'const typename remove_reference<struct __rep>::type':'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue
| |     `-MemberExpr 0x7f994ede16f0 <col:83, col:89> '<bound member function type>' ->first 0x7f994d260788
| |       `-ImplicitCastExpr 0x7f994ede1788 <col:83> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' <NoOp>
| |         `-ImplicitCastExpr 0x7f994ede1768 <col:83> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |           `-CXXThisExpr 0x7f994ede16d8 <col:83> 'const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7f994d265070 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994d265138 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2356:99> col:51 used second 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_reference (void) noexcept'
| |-CompoundStmt 0x7f994eddfe60 <col:76, col:99>
| | `-ReturnStmt 0x7f994eddfe48 <col:77, col:97>
| |   `-CXXMemberCallExpr 0x7f994eddfe00 <col:84, col:97> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' lvalue
| |     `-MemberExpr 0x7f994eddfdb0 <col:84, col:90> '<bound member function type>' ->second 0x7f994d260928
| |       `-ImplicitCastExpr 0x7f994eddfe28 <col:84> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |         `-CXXThisExpr 0x7f994eddfd98 <col:84> 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7f994d2651e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994d2652a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2357:99> col:51 used second 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_const_reference (void) const noexcept'
| |-CompoundStmt 0x7f994edd6e68 <col:76, col:99>
| | `-ReturnStmt 0x7f994edd6e50 <col:77, col:97>
| |   `-CXXMemberCallExpr 0x7f994edd6d98 <col:84, col:97> 'const class std::__1::allocator<char>':'const class std::__1::allocator<char>' lvalue
| |     `-MemberExpr 0x7f994edd6d48 <col:84, col:90> '<bound member function type>' ->second 0x7f994d260ac8
| |       `-ImplicitCastExpr 0x7f994edd6e38 <col:84> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' <NoOp>
| |         `-ImplicitCastExpr 0x7f994edd6e18 <col:84> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |           `-CXXThisExpr 0x7f994edd6d30 <col:84> 'const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7f994d265350 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f994d2654f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2362:26> line:2359:36 swap 'void (class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &)' noexcept-uninstantiated 0x7f994e9d7658
| |-ParmVarDecl 0x7f994d2653d8 <col:41, col:60> col:60 __x 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &'
| `-AlwaysInlineAttr 0x7f994d2655e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7f994d293818 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2318:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f994edd0968 <col:7> col:7 implicit constexpr __compressed_pair 'void (const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &)' inline default trivial noexcept-unevaluated 0x7f994edd0968
| `-ParmVarDecl 0x7f994edd0a90 <col:7> col:7 'const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &'
`-CXXConstructorDecl 0x7f994edd0b28 <col:7> col:7 implicit used constexpr __compressed_pair 'void (class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &&) noexcept' inline default trivial
  |-ParmVarDecl 0x7f994edd0c50 <col:7> col:7 used 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &&'
  |-CXXCtorInitializer '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
  | `-CXXConstructExpr 0x7f994ede33f0 <col:7> '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' 'void (class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&) noexcept'
  |   `-ImplicitCastExpr 0x7f994ede3010 <col:7> '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' xvalue <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
  |     `-CXXStaticCastExpr 0x7f994ede2fe0 <col:7> 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >' xvalue static_cast<class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &&> <NoOp>
  |       `-DeclRefExpr 0x7f994ede2fa8 <col:7> 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >' lvalue ParmVar 0x7f994edd0c50 '' 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &&'
  `-CompoundStmt 0x7f994ede34c0 <col:7>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair" = type { %"class.std::__1::__libcpp_compressed_pair_imp" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair" = type { %"class.std::__1::__libcpp_compressed_pair_imp" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f994e0e13a8 parent 0x7f994e0d2088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:4036:81> col:64 class basic_string definition
|-private '__basic_string_common<true>':'class std::__1::__basic_string_common<true>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-VisibilityAttr 0x7f994eb1fa38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7f994e2fe748 prev 0x7f994e0e13a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:633:1, col:28> col:28 implicit class basic_string
|-AccessSpecDecl 0x7f994e2fe7e0 <line:636:1, col:7> col:1 public
|-TypedefDecl 0x7f994e2fe818 <line:637:5, col:58> col:58 __self 'class std::__1::basic_string<char>'
| `-RecordType 0x7f994e0e14c0 'class std::__1::basic_string<char>'
|   `-ClassTemplateSpecialization 0x7f994e0e13a8 'basic_string'
|-TypedefDecl 0x7f994e2fe998 <line:638:5, col:58> col:58 __self_view 'basic_string_view<char, struct std::__1::char_traits<char> >':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-TemplateSpecializationType 0x7f994e2fe8f0 'basic_string_view<char, struct std::__1::char_traits<char> >' sugar basic_string_view
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7f994d1ecfb0 'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
|     `-ClassTemplateSpecialization 0x7f994d1ecea8 'basic_string_view'
|-TypedefDecl 0x7f994e2fea00 <line:639:5, col:58> col:58 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f994e2fe8b0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f994d22f480 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f994d22f438 '_Traits'
|   `-RecordType 0x7f994e0da560 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f994da44488 'char_traits'
|-TypedefDecl 0x7f994e2fea68 <line:640:5, col:58> col:58 referenced value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f994e2fe870 'char' sugar
|   |-TemplateTypeParmType 0x7f994d22f410 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f994d22f3d0 '_CharT'
|   `-BuiltinType 0x7f994d032b60 'char'
|-TypedefDecl 0x7f994e2feaf8 <line:641:5, col:58> col:58 allocator_type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7f994e2feac0 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7f994d22f4f0 '_Allocator' dependent depth 0 index 2
|   | `-TemplateTypeParm 0x7f994d22f4a8 '_Allocator'
|   `-RecordType 0x7f994e0dbd90 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7f994e0dbca8 'allocator'
|-TypedefDecl 0x7f994e2fed08 <line:642:5, col:58> col:58 __alloc_traits 'allocator_traits<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>':'struct std::__1::allocator_traits<class std::__1::allocator<char> >'
| `-TemplateSpecializationType 0x7f994e2fec90 'allocator_traits<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type':'class std::__1::allocator<char>'
|   `-RecordType 0x7f994e2fec70 'struct std::__1::allocator_traits<class std::__1::allocator<char> >'
|     `-ClassTemplateSpecialization 0x7f994e2feb80 'allocator_traits'
|-TypedefDecl 0x7f994d255ba0 <line:643:5, col:58> col:58 size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7f994d255b50 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7f994d24d670 'std::__1::allocator_traits<class std::__1::allocator<char> >::size_type' sugar
|     |-Typedef 0x7f994d246550 'size_type'
|     `-ElaboratedType 0x7f994d246500 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7f994d2464e0 'std::__1::__size_type<class std::__1::allocator<char>, long, true>::type' sugar
|         |-Typedef 0x7f994d246460 'type'
|         `-ElaboratedType 0x7f994d246410 'typename class allocator<char>::size_type' sugar
|           `-TypedefType 0x7f994d2458b0 'std::__1::allocator<char>::size_type' sugar
|             |-Typedef 0x7f994e2ff108 'size_type'
|             `-TypedefType 0x7f994e07b220 'size_t' sugar
|               |-Typedef 0x7f994e01a960 'size_t'
|               `-TypedefType 0x7f994e01a930 '__darwin_size_t' sugar
|                 |-Typedef 0x7f994d067c30 '__darwin_size_t'
|                 `-BuiltinType 0x7f994d032c80 'unsigned long'
|-TypedefDecl 0x7f994d255c70 <line:644:5, col:58> col:58 difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7f994d255c20 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7f994d244bd0 'std::__1::allocator_traits<class std::__1::allocator<char> >::difference_type' sugar
|     |-Typedef 0x7f994d244b60 'difference_type'
|     `-ElaboratedType 0x7f994d244b10 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7f994d244af0 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<char>, char *, true>::type' sugar
|         |-Typedef 0x7f994d244a70 'type'
|         `-ElaboratedType 0x7f994d244a20 'typename class allocator<char>::difference_type' sugar
|           `-TypedefType 0x7f994d243ec0 'std::__1::allocator<char>::difference_type' sugar
|             |-Typedef 0x7f994e2ff160 'difference_type'
|             `-TypedefType 0x7f994e9448a0 'ptrdiff_t' sugar
|               |-Typedef 0x7f994e0e5028 'ptrdiff_t'
|               `-BuiltinType 0x7f994d032be0 'long'
|-TypedefDecl 0x7f994d255d28 <line:645:5, col:58> col:58 reference 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
| `-LValueReferenceType 0x7f994d255cf0 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
|   `-TypedefType 0x7f994d255cd0 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' sugar
|     |-Typedef 0x7f994e2fea68 'value_type'
|     `-SubstTemplateTypeParmType 0x7f994e2fe870 'char' sugar
|       |-TemplateTypeParmType 0x7f994d22f410 '_CharT' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f994d22f3d0 '_CharT'
|       `-BuiltinType 0x7f994d032b60 'char'
|-TypedefDecl 0x7f994d255db8 <line:646:5, col:58> col:58 const_reference 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
| `-LValueReferenceType 0x7f994d255d80 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
|   `-QualType 0x7f994d255cd1 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' const
|     `-TypedefType 0x7f994d255cd0 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' sugar
|       |-Typedef 0x7f994e2fea68 'value_type'
|       `-SubstTemplateTypeParmType 0x7f994e2fe870 'char' sugar
|         |-TemplateTypeParmType 0x7f994d22f410 '_CharT' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7f994d22f3d0 '_CharT'
|         `-BuiltinType 0x7f994d032b60 'char'
|-TypedefDecl 0x7f994d255e80 <line:647:5, col:58> col:58 pointer 'typename __alloc_traits::pointer':'char *'
| `-ElaboratedType 0x7f994d255e30 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7f994e302b90 'std::__1::allocator_traits<class std::__1::allocator<char> >::pointer' sugar
|     |-Typedef 0x7f994e302b20 'pointer'
|     `-ElaboratedType 0x7f994e302ad0 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7f994e302ab0 'std::__1::__pointer_type<char, class std::__1::allocator<char> >::type' sugar
|         |-Typedef 0x7f994e302a30 'type'
|         `-ElaboratedType 0x7f994e3029e0 'typename __pointer_type_imp::__pointer_type<char, typename remove_reference<class allocator<char> >::type>::type' sugar
|           `-TypedefType 0x7f994e3029c0 'std::__1::__pointer_type_imp::__pointer_type<char, class std::__1::allocator<char>, true>::type' sugar
|             |-Typedef 0x7f994e302940 'type'
|             `-ElaboratedType 0x7f994e3028f0 'typename class allocator<char>::pointer' sugar
|               `-TypedefType 0x7f994e2ffe20 'std::__1::allocator<char>::pointer' sugar
|                 |-Typedef 0x7f994e2ff228 'pointer'
|                 `-PointerType 0x7f994e2ff1f0 'char *'
|                   `-SubstTemplateTypeParmType 0x7f994e2ff1c0 'char' sugar
|                     |-TemplateTypeParmType 0x7f994e238fd0 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7f994e238f88 '_Tp'
|                     `-BuiltinType 0x7f994d032b60 'char'
|-TypedefDecl 0x7f994d255f70 <line:648:5, col:58> col:58 const_pointer 'typename __alloc_traits::const_pointer':'const char *'
| `-ElaboratedType 0x7f994d255f20 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7f994d255f00 'std::__1::allocator_traits<class std::__1::allocator<char> >::const_pointer' sugar
|     |-Typedef 0x7f994e3044b0 'const_pointer'
|     `-ElaboratedType 0x7f994e304460 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7f994e304440 'std::__1::__const_pointer<char, char *, class std::__1::allocator<char>, true>::type' sugar
|         |-Typedef 0x7f994e3043c0 'type'
|         `-ElaboratedType 0x7f994e304370 'typename class allocator<char>::const_pointer' sugar
|           `-TypedefType 0x7f994e300070 'std::__1::allocator<char>::const_pointer' sugar
|             |-Typedef 0x7f994e2ff2b8 'const_pointer'
|             `-PointerType 0x7f994e2ff280 'const char *'
|               `-QualType 0x7f994e2ff1c1 'const char' const
|                 `-SubstTemplateTypeParmType 0x7f994e2ff1c0 'char' sugar
|                   |-TemplateTypeParmType 0x7f994e238fd0 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7f994e238f88 '_Tp'
|                   `-BuiltinType 0x7f994d032b60 'char'
|-StaticAssertDecl 0x7f994d2560d0 <line:650:5, col:92> col:5
| |-DeclRefExpr 0x7f994d256080 <col:19, col:39> 'const _Bool':'const _Bool' lvalue Var 0x7f994d98f0a8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f994d230488 <col:46> 'const char [45]' lvalue "Character type of basic_string must be a POD"
|-StaticAssertDecl 0x7f994d256310 <line:651:5, line:652:74> line:651:5
| |-ParenExpr 0x7f994d2562d8 <col:19, col:75> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7f994d2562a0 <col:20, col:70> 'const _Bool':'const _Bool' lvalue Var 0x7f994d98f0a8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f994d230750 <line:652:19> 'const char [54]' lvalue "traits_type::char_type must be the same type as CharT"
|-StaticAssertDecl 0x7f994d256520 <line:653:5, line:654:74> line:653:5
| |-ParenExpr 0x7f994d2564e8 <col:19, col:83> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7f994d2564b0 <col:20, col:78> 'const _Bool':'const _Bool' lvalue Var 0x7f994d98f0a8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f994d230a90 <line:654:19> 'const char [54]' lvalue "Allocator::value_type must be same type as value_type"
|-TypedefDecl 0x7f994d256718 <line:659:5, col:58> col:58 iterator '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer>':'class std::__1::__wrap_iter<char *>'
| `-TemplateSpecializationType 0x7f994d2566a0 '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
|   `-RecordType 0x7f994d256680 'class std::__1::__wrap_iter<char *>'
|     `-ClassTemplateSpecialization 0x7f994d256590 '__wrap_iter'
|-TypedefDecl 0x7f994d256928 <line:660:5, col:58> col:58 const_iterator '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer>':'class std::__1::__wrap_iter<const char *>'
| `-TemplateSpecializationType 0x7f994d2568b0 '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer':'const char *'
|   `-RecordType 0x7f994d256890 'class std::__1::__wrap_iter<const char *>'
|     `-ClassTemplateSpecialization 0x7f994d2567a0 '__wrap_iter'
|-TypedefDecl 0x7f994d256b80 <line:662:5, col:59> col:59 reverse_iterator 'std::__1::reverse_iterator<iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<char *> >'
| `-ElaboratedType 0x7f994d256b10 'std::__1::reverse_iterator<iterator>' sugar
|   `-TemplateSpecializationType 0x7f994d256ac0 'reverse_iterator<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator':'class std::__1::__wrap_iter<char *>'
|     `-RecordType 0x7f994d256aa0 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<char *> >'
|       `-ClassTemplateSpecialization 0x7f994d2569b0 'reverse_iterator'
|-TypedefDecl 0x7f994d256de0 <line:663:5, col:59> col:59 const_reverse_iterator 'std::__1::reverse_iterator<const_iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const char *> >'
| `-ElaboratedType 0x7f994d256d70 'std::__1::reverse_iterator<const_iterator>' sugar
|   `-TemplateSpecializationType 0x7f994d256d20 'reverse_iterator<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|     `-RecordType 0x7f994d256d00 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const char *> >'
|       `-ClassTemplateSpecialization 0x7f994d256c10 'reverse_iterator'
|-AccessSpecDecl 0x7f994d256e38 <line:665:1, col:8> col:1 private
|-CXXRecordDecl 0x7f994d256e60 <line:699:5, line:704:5> line:699:12 struct __long definition
| |-CXXRecordDecl 0x7f994d2572d8 prev 0x7f994d256e60 <col:5, col:12> col:12 implicit struct __long
| |-FieldDecl 0x7f994d2573a0 <line:701:9, col:19> col:19 referenced __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-FieldDecl 0x7f994d2573f8 <line:702:9, col:19> col:19 referenced __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-FieldDecl 0x7f994d257450 <line:703:9, col:19> col:19 referenced __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
| |-CXXDestructorDecl 0x7f994d293b98 <line:699:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7f994edcf5e8 <col:12> col:12 implicit constexpr __long 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &)' inline default trivial noexcept-unevaluated 0x7f994edcf5e8
| | `-ParmVarDecl 0x7f994edcf710 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &'
| |-CXXConstructorDecl 0x7f994edcf7a8 <col:12> col:12 implicit constexpr __long 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &&) noexcept' inline default trivial
| | `-ParmVarDecl 0x7f994edcf8d0 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &&'
| `-CXXConstructorDecl 0x7f994edd11c8 <col:12> col:12 implicit __long 'void (void) noexcept' inline default trivial
|-EnumDecl 0x7f994d256f30 <line:710:5> col:5
| `-EnumConstantDecl 0x7f994d257000 <col:11, col:26> col:11 referenced __short_mask 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:710:5)'
|   `-ImplicitCastExpr 0x7f994d257050 <col:26> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7f994d231650 <col:26> 'int' 1
|-EnumDecl 0x7f994d257068 <line:711:5> col:5
| `-EnumConstantDecl 0x7f994d257130 <col:11, col:26> col:11 referenced __long_mask 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:711:5)'
|   `-ImplicitCastExpr 0x7f994d257180 <col:26> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7f994d231780 <col:26> 'unsigned long' 1
|-EnumDecl 0x7f994d257198 <line:714:5> col:5
| `-EnumConstantDecl 0x7f994d2577d0 <col:11, line:715:65> line:714:11 referenced __min_cap 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:714:5)'
|   `-ImplicitCastExpr 0x7f994d257820 <col:23, line:715:65> 'unsigned int' <IntegralCast>
|     `-ConditionalOperator 0x7f994d2576d0 <line:714:23, line:715:65> 'unsigned long'
|       |-BinaryOperator 0x7f994d2575a8 <line:714:23, col:65> '_Bool' '>'
|       | |-BinaryOperator 0x7f994d257568 <col:23, col:61> 'unsigned long' '/'
|       | | |-ParenExpr 0x7f994d257518 <col:23, col:42> 'unsigned long'
|       | | | `-BinaryOperator 0x7f994d2574f0 <col:24, col:41> 'unsigned long' '-'
|       | | |   |-UnaryExprOrTypeTraitExpr 0x7f994d2574b8 <col:24, col:37> 'unsigned long' sizeof 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|       | | |   `-ImplicitCastExpr 0x7f994d2574d8 <col:41> 'unsigned long' <IntegralCast>
|       | | |     `-IntegerLiteral 0x7f994d2318e0 <col:41> 'int' 1
|       | | `-UnaryExprOrTypeTraitExpr 0x7f994d257548 <col:44, col:61> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|       | `-ImplicitCastExpr 0x7f994d257590 <col:65> 'unsigned long' <IntegralCast>
|       |   `-IntegerLiteral 0x7f994d2319b8 <col:65> 'int' 2
|       |-BinaryOperator 0x7f994d257690 <line:715:23, col:61> 'unsigned long' '/'
|       | |-ParenExpr 0x7f994d257640 <col:23, col:42> 'unsigned long'
|       | | `-BinaryOperator 0x7f994d257618 <col:24, col:41> 'unsigned long' '-'
|       | |   |-UnaryExprOrTypeTraitExpr 0x7f994d2575e0 <col:24, col:37> 'unsigned long' sizeof 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|       | |   `-ImplicitCastExpr 0x7f994d257600 <col:41> 'unsigned long' <IntegralCast>
|       | |     `-IntegerLiteral 0x7f994d231a48 <col:41> 'int' 1
|       | `-UnaryExprOrTypeTraitExpr 0x7f994d257670 <col:44, col:61> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|       `-ImplicitCastExpr 0x7f994d2576b8 <col:65> 'unsigned long' <IntegralCast>
|         `-IntegerLiteral 0x7f994d231b20 <col:65> 'int' 2
|-CXXRecordDecl 0x7f994d257838 <line:717:5, line:725:5> line:717:12 struct __short definition
| |-CXXRecordDecl 0x7f994d2598c0 prev 0x7f994d257838 <col:5, col:12> col:12 implicit struct __short
| |-CXXRecordDecl 0x7f994d259958 <line:719:9, line:723:9> line:719:9 union definition
| | |-FieldDecl 0x7f994d259ad8 <line:721:13, col:27> col:27 referenced __size_ 'unsigned char'
| | |-FieldDecl 0x7f994d259b30 <line:722:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| | |-CXXDestructorDecl 0x7f994d293f18 <line:719:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| | |-CXXConstructorDecl 0x7f994edcf9d8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &)' inline default trivial noexcept-unevaluated 0x7f994edcf9d8
| | | `-ParmVarDecl 0x7f994edcfb00 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &'
| | |-CXXConstructorDecl 0x7f994edcfb98 <col:9> col:9 implicit constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&) noexcept' inline default trivial
| | | `-ParmVarDecl 0x7f994edcfcc0 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&'
| | `-CXXConstructorDecl 0x7f994edd1548 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial
| |-FieldDecl 0x7f994d259b98 <col:9> col:9 implicit referenced 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| |-IndirectFieldDecl 0x7f994d259bf0 <line:721:27> col:27 implicit __size_ 'unsigned char'
| | |-Field 0x7f994d259b98 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| | `-Field 0x7f994d259ad8 '__size_' 'unsigned char'
| |-IndirectFieldDecl 0x7f994d259c40 <line:722:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| | |-Field 0x7f994d259b98 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| | `-Field 0x7f994d259b30 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-FieldDecl 0x7f994d259d08 <line:724:9, col:37> col:20 referenced __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
| |-CXXDestructorDecl 0x7f994d293c78 <line:717:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7f994edcfd28 <col:12> col:12 implicit constexpr __short 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &)' inline default trivial noexcept-unevaluated 0x7f994edcfd28
| | `-ParmVarDecl 0x7f994edcfe50 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &'
| |-CXXConstructorDecl 0x7f994edcfee8 <col:12> col:12 implicit constexpr __short 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &&) noexcept' inline default trivial
| | `-ParmVarDecl 0x7f994edd0010 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &&'
| `-CXXConstructorDecl 0x7f994edd12a8 <col:12> col:12 implicit __short 'void (void) noexcept' inline default trivial
|-CXXRecordDecl 0x7f994d257900 <line:729:5, col:44> col:11 union __ulx definition
| |-CXXRecordDecl 0x7f994d257b18 prev 0x7f994d257900 <col:5, col:11> col:11 implicit union __ulx
| |-FieldDecl 0x7f994d259800 <col:17, col:24> col:24 __lx 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| `-FieldDecl 0x7f994d259d70 <col:30, col:38> col:38 __lxx 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-EnumDecl 0x7f994d2579d0 <line:731:5> col:5
| `-EnumConstantDecl 0x7f994d25a0a8 <col:11, col:55> col:11 referenced __n_words 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:731:5)'
|   `-ImplicitCastExpr 0x7f994d25a0f8 <col:23, col:55> 'unsigned int' <IntegralCast>
|     `-BinaryOperator 0x7f994d259e28 <col:23, col:55> 'unsigned long' '/'
|       |-UnaryExprOrTypeTraitExpr 0x7f994d259dd8 <col:23, col:35> 'unsigned long' sizeof 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx'
|       `-UnaryExprOrTypeTraitExpr 0x7f994d259e08 <col:39, col:55> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXRecordDecl 0x7f994d25a110 <line:733:5, line:736:5> line:733:12 struct __raw definition
| |-CXXRecordDecl 0x7f994d25c810 prev 0x7f994d25a110 <col:5, col:12> col:12 implicit struct __raw
| |-FieldDecl 0x7f994d25c968 <line:735:9, col:36> col:19 referenced __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
| |-CXXDestructorDecl 0x7f994d293d58 <line:733:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7f994edd00c8 <col:12> col:12 implicit constexpr __raw 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &)' inline default trivial noexcept-unevaluated 0x7f994edd00c8
| | `-ParmVarDecl 0x7f994edd01f0 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &'
| |-CXXConstructorDecl 0x7f994edd0288 <col:12> col:12 implicit constexpr __raw 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &&) noexcept' inline default trivial
| | `-ParmVarDecl 0x7f994edd03b0 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &&'
| `-CXXConstructorDecl 0x7f994edd1388 <col:12> col:12 implicit __raw 'void (void) noexcept' inline default trivial
|-CXXRecordDecl 0x7f994d25a1e0 <line:738:5, line:746:5> line:738:12 struct __rep definition
| |-CXXRecordDecl 0x7f994d25c4d0 prev 0x7f994d25a1e0 <col:5, col:12> col:12 implicit struct __rep
| |-CXXRecordDecl 0x7f994d25c568 <line:740:9, line:745:9> line:740:9 union definition
| | |-FieldDecl 0x7f994d25c6f8 <line:742:13, col:21> col:21 referenced __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| | |-FieldDecl 0x7f994d25c750 <line:743:13, col:21> col:21 referenced __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| | |-FieldDecl 0x7f994d25c9d0 <line:744:13, col:21> col:21 referenced __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| | |-CXXDestructorDecl 0x7f994d293e38 <line:740:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| | |-CXXConstructorDecl 0x7f994edcf0b8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &)' inline default trivial noexcept-unevaluated 0x7f994edcf0b8
| | | `-ParmVarDecl 0x7f994edcf1e0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &'
| | |-CXXConstructorDecl 0x7f994edcf278 <col:9> col:9 implicit used constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept' inline default trivial
| | | |-ParmVarDecl 0x7f994edcf3a0 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&'
| | | `-CompoundStmt 0x7f994ede32d0 <col:9>
| | `-CXXConstructorDecl 0x7f994edd1468 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial
| |-FieldDecl 0x7f994d25ca38 <col:9> col:9 implicit referenced 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| |-IndirectFieldDecl 0x7f994d25ca90 <line:742:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| | |-Field 0x7f994d25ca38 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | `-Field 0x7f994d25c6f8 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-IndirectFieldDecl 0x7f994d25cae0 <line:743:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| | |-Field 0x7f994d25ca38 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | `-Field 0x7f994d25c750 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-IndirectFieldDecl 0x7f994d25cb30 <line:744:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| | |-Field 0x7f994d25ca38 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | `-Field 0x7f994d25c9d0 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-CXXDestructorDecl 0x7f994d293ab8 <line:738:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7f994edcf408 <col:12> col:12 implicit constexpr __rep 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &)' inline default trivial noexcept-unevaluated 0x7f994edcf408
| | `-ParmVarDecl 0x7f994edcf530 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
| |-CXXConstructorDecl 0x7f994edd0448 <col:12> col:12 implicit used constexpr __rep 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&) noexcept' inline default trivial
| | |-ParmVarDecl 0x7f994edd0570 <col:12> col:12 used 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&'
| | |-CXXCtorInitializer Field 0x7f994d25ca38 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | | `-CXXConstructExpr 0x7f994ede32e8 <col:12> 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)' 'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept'
| | |   `-MemberExpr 0x7f994ede3298 <col:12> 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)' xvalue . 0x7f994d25ca38
