
*** Dumping AST Record Layout
         0 | struct X
         0 |   double x
         8 |   double y
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct Y
         0 |   double v
         8 |   struct Y * n
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f990b047c58 <object_model_refined/2_constructors/01_default_constructor_construction.cpp:1:1, line:4:1> line:1:8 referenced struct X definition
|-CXXRecordDecl 0x7f990b047d78 <col:1, col:8> col:8 implicit struct X
|-FieldDecl 0x7f990b047e28 <line:2:5, col:12> col:12 x 'double'
|-FieldDecl 0x7f990b047e88 <line:3:5, col:12> col:12 y 'double'
|-CXXConstructorDecl 0x7f990b048398 <line:1:8> col:8 implicit used X 'void (void) noexcept' inline default trivial
| `-CompoundStmt 0x7f990b048860 <col:8>
|-CXXConstructorDecl 0x7f990b0484d8 <col:8> col:8 implicit constexpr X 'void (const struct X &)' inline default trivial noexcept-unevaluated 0x7f990b0484d8
| `-ParmVarDecl 0x7f990b048600 <col:8> col:8 'const struct X &'
`-CXXConstructorDecl 0x7f990b048698 <col:8> col:8 implicit constexpr X 'void (struct X &&)' inline default trivial noexcept-unevaluated 0x7f990b048698
  `-ParmVarDecl 0x7f990b0487c0 <col:8> col:8 'struct X &&'

Layout: <CGRecordLayout
  LLVMType:%struct.X = type { double, double }
  NonVirtualBaseLLVMType:%struct.X = type { double, double }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f990b047ef0 <object_model_refined/2_constructors/01_default_constructor_construction.cpp:6:1, line:9:1> line:6:8 referenced struct Y definition
|-CXXRecordDecl 0x7f990b048018 <col:1, col:8> col:8 implicit referenced struct Y
|-FieldDecl 0x7f990b0480c8 <line:7:5, col:12> col:12 v 'double'
|-FieldDecl 0x7f990b048148 <line:8:5, col:8> col:8 n 'struct Y *'
|-CXXConstructorDecl 0x7f990b048950 <line:6:8> col:8 implicit used Y 'void (void) noexcept' inline default trivial
| `-CompoundStmt 0x7f990b0731b8 <col:8>
|-CXXConstructorDecl 0x7f990b048a68 <col:8> col:8 implicit constexpr Y 'void (const struct Y &)' inline default trivial noexcept-unevaluated 0x7f990b048a68
| `-ParmVarDecl 0x7f990b048b90 <col:8> col:8 'const struct Y &'
`-CXXConstructorDecl 0x7f990b073028 <col:8> col:8 implicit constexpr Y 'void (struct Y &&)' inline default trivial noexcept-unevaluated 0x7f990b073028
  `-ParmVarDecl 0x7f990b073150 <col:8> col:8 'struct Y &&'

Layout: <CGRecordLayout
  LLVMType:%struct.Y = type { double, %struct.Y* }
  NonVirtualBaseLLVMType:%struct.Y = type { double, %struct.Y* }
  IsZeroInitializable:1
  BitFields:[
]>
