
*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1507:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1504:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1507:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__basic_string_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>
         0 |   class std::__1::allocator<char> (base) (empty)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
         0 |   class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
         0 |     class std::__1::allocator<char> (base) (empty)
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<char>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |     class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
         0 |       class std::__1::allocator<char> (base) (empty)
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct S
         0 |   std::size_t n
         8 |   class std::__1::basic_string<char> s
         8 |     class std::__1::__basic_string_common<true> (base) (empty)
         8 |     class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         8 |       class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
         8 |         class std::__1::allocator<char> (base) (empty)
         8 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         8 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         8 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         8 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
        16 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        24 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         8 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         8 |               union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         8 |                 unsigned char __size_
         8 |                 std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         9 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         8 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         8 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f8ada824c38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:583:90> col:64 class __basic_string_common definition
|-TemplateArgument integral 1
|-VisibilityAttr 0x7f8ada824dc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7f8ada824e78 prev 0x7f8ada824c38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:558:1, col:28> col:28 implicit class __basic_string_common
|-AccessSpecDecl 0x7f8ada824f10 <line:560:1, col:10> col:1 protected
|-CXXMethodDecl 0x7f8ada824f38 <line:561:22, col:50> col:27 __throw_length_error 'void (void) const'
| `-CXX11NoReturnAttr 0x7f8ada825008 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:313:30> Inherited
|-CXXMethodDecl 0x7f8ada825050 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:562:22, col:50> col:27 __throw_out_of_range 'void (void) const'
| `-CXX11NoReturnAttr 0x7f8ada8250f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:313:30> Inherited
`-CXXDestructorDecl 0x7f8ad92aa390 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:583:64> col:64 implicit ~__basic_string_common 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f8ad891f448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:101:1, col:52> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1759:28 class allocator definition
|-TemplateArgument type 'char'
|-CXXRecordDecl 0x7f8ad924cb48 prev 0x7f8ad891f448 <col:1, col:28> col:28 implicit class allocator
|-AccessSpecDecl 0x7f8ad924cbe0 <line:1761:1, col:7> col:1 public
|-TypedefDecl 0x7f8ad924cc08 <line:1762:5, col:31> col:31 referenced size_type 'size_t':'unsigned long'
| `-TypedefType 0x7f8ad8801cc0 'size_t' sugar
|   |-Typedef 0x7f8ad88011b0 'size_t'
|   `-BuiltinType 0x7f8ad8031c80 'unsigned long'
|-TypedefDecl 0x7f8ad924cc60 <line:1763:5, col:31> col:31 referenced difference_type 'ptrdiff_t':'long'
| `-TypedefType 0x7f8ad89a94e0 'ptrdiff_t' sugar
|   |-Typedef 0x7f8ad8801140 'ptrdiff_t'
|   `-BuiltinType 0x7f8ad8031be0 'long'
|-TypedefDecl 0x7f8ad924cd28 <line:1764:5, col:31> col:31 referenced pointer 'char *'
| `-PointerType 0x7f8ad924ccf0 'char *'
|   `-SubstTemplateTypeParmType 0x7f8ad924ccc0 'char' sugar
|     |-TemplateTypeParmType 0x7f8ad915e0c0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f8ad915e078 '_Tp'
|     `-BuiltinType 0x7f8ad8031b60 'char'
|-TypedefDecl 0x7f8ad924cdb8 <line:1765:5, col:31> col:31 referenced const_pointer 'const char *'
| `-PointerType 0x7f8ad924cd80 'const char *'
|   `-QualType 0x7f8ad924ccc1 'const char' const
|     `-SubstTemplateTypeParmType 0x7f8ad924ccc0 'char' sugar
|       |-TemplateTypeParmType 0x7f8ad915e0c0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f8ad915e078 '_Tp'
|       `-BuiltinType 0x7f8ad8031b60 'char'
|-TypedefDecl 0x7f8ad924ce48 <line:1766:5, col:31> col:31 reference 'char &'
| `-LValueReferenceType 0x7f8ad924ce10 'char &'
|   `-SubstTemplateTypeParmType 0x7f8ad924ccc0 'char' sugar
|     |-TemplateTypeParmType 0x7f8ad915e0c0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f8ad915e078 '_Tp'
|     `-BuiltinType 0x7f8ad8031b60 'char'
|-TypedefDecl 0x7f8ad924ced8 <line:1767:5, col:31> col:31 const_reference 'const char &'
| `-LValueReferenceType 0x7f8ad924cea0 'const char &'
|   `-QualType 0x7f8ad924ccc1 'const char' const
|     `-SubstTemplateTypeParmType 0x7f8ad924ccc0 'char' sugar
|       |-TemplateTypeParmType 0x7f8ad915e0c0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f8ad915e078 '_Tp'
|       `-BuiltinType 0x7f8ad8031b60 'char'
|-TypedefDecl 0x7f8ad924cf40 <line:1768:5, col:31> col:31 referenced value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f8ad924ccc0 'char' sugar
|   |-TemplateTypeParmType 0x7f8ad915e0c0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f8ad915e078 '_Tp'
|   `-BuiltinType 0x7f8ad8031b60 'char'
|-TypedefDecl 0x7f8ad924cf98 <line:1770:5, col:23> col:23 referenced propagate_on_container_move_assignment 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7f8ad7803e10 'std::__1::true_type' sugar
|   |-Typedef 0x7f8ad78026f0 'true_type'
|   `-TemplateSpecializationType 0x7f8ad7802600 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7f8ad7802468 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:522:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7f8ad7802450 <line:525:31> '_Bool' true
|     `-RecordType 0x7f8ad78025e0 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7f8ad78024d8 'integral_constant'
|-TypedefDecl 0x7f8ad924cff0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1771:5, col:23> col:23 referenced is_always_equal 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7f8ad7803e10 'std::__1::true_type' sugar
|   |-Typedef 0x7f8ad78026f0 'true_type'
|   `-TemplateSpecializationType 0x7f8ad7802600 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7f8ad7802468 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:522:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7f8ad7802450 <line:525:31> '_Bool' true
|     `-RecordType 0x7f8ad78025e0 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7f8ad78024d8 'integral_constant'
|-ClassTemplateDecl 0x7f8ad924d168 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1773:5, col:33> col:33 rebind
| |-TemplateTypeParmDecl 0x7f8ad924d048 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXRecordDecl 0x7f8ad924d0d0 <col:26, col:33> col:33 struct rebind
|-CXXConstructorDecl 0x7f8ad924d3b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1775:54> col:31 allocator 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7f8ad924d498 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f8ad924d7f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:5, col:96> col:52 allocator
| |-TemplateTypeParmDecl 0x7f8ad924d4e0 <col:15, col:21> col:21 class depth 0 index 0 _Up
| |-CXXConstructorDecl 0x7f8ad924d748 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:96> col:52 allocator 'void (const allocator<_Up> &) noexcept'
| | |-ParmVarDecl 0x7f8ad924d620 <col:62, col:82> col:83 'const allocator<_Up> &'
| | `-AlwaysInlineAttr 0x7f8ad924d848 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-CXXConstructorDecl 0x7f8ad92af1a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:96> col:52 allocator 'void (const allocator<char> &) noexcept'
|   |-TemplateArgument type 'char'
|   |-ParmVarDecl 0x7f8ad92af0e0 <col:62, col:82> col:83 'const allocator<char> &'
|   `-AlwaysInlineAttr 0x7f8ad92af2b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad924da78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1778:39> line:1777:39 address 'std::__1::allocator<char>::pointer (std::__1::allocator<char>::reference) const noexcept'
| |-ParmVarDecl 0x7f8ad924d970 <col:47, col:57> col:57 __x 'std::__1::allocator<char>::reference':'char &'
| `-AlwaysInlineAttr 0x7f8ad924db28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad924dcc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1780:39> line:1779:45 address 'std::__1::allocator<char>::const_pointer (std::__1::allocator<char>::const_reference) const noexcept'
| |-ParmVarDecl 0x7f8ad924dbc0 <col:53, col:69> col:69 __x 'std::__1::allocator<char>::const_reference':'const char &'
| `-AlwaysInlineAttr 0x7f8ad924dd78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad924df30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1787:9> line:1781:39 allocate 'std::__1::allocator<char>::pointer (std::__1::allocator::size_type, allocator<void>::const_pointer)'
| |-ParmVarDecl 0x7f8ad924ddc0 <col:48, col:58> col:58 __n 'std::__1::allocator::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad924de20 <col:63, col:96> col:94 'allocator<void>::const_pointer':'const void *'
| `-AlwaysInlineAttr 0x7f8ad924dfe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad924e178 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:49> line:1788:36 deallocate 'void (std::__1::allocator<char>::pointer, std::__1::allocator::size_type) noexcept'
| |-ParmVarDecl 0x7f8ad924e040 <col:47, col:55> col:55 __p 'std::__1::allocator<char>::pointer':'char *'
| |-ParmVarDecl 0x7f8ad924e0a0 <col:60> col:69 'std::__1::allocator::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad924e230 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad924e278 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1791:45> line:1790:41 max_size 'std::__1::allocator::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad924e320 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f8ad924e748 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1793:5, line:1799:9> line:1796:9 construct
| |-TemplateTypeParmDecl 0x7f8ad924e368 <line:1793:15, col:21> col:21 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7f8ad924e3d8 <col:26, col:35> col:35 class depth 0 index 1 ... _Args
| `-CXXMethodDecl 0x7f8ad924e6b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1799:9> line:1796:9 construct 'void (_Up *, _Args &&...)'
|   |-ParmVarDecl 0x7f8ad924e4a8 <col:19, col:24> col:24 __p '_Up *'
|   |-ParmVarDecl 0x7f8ad924e598 <col:29, col:40> col:40 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7f8ad924e7a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad924e990 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1853:70> col:36 destroy 'void (std::__1::allocator<char>::pointer)'
| |-ParmVarDecl 0x7f8ad924e888 <col:44, col:52> col:52 __p 'std::__1::allocator<char>::pointer':'char *'
| `-AlwaysInlineAttr 0x7f8ad924ea40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad92a8f98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1759:28> col:28 implicit constexpr allocator 'void (const class std::__1::allocator<char> &)' inline default trivial noexcept-unevaluated 0x7f8ad92a8f98
| `-ParmVarDecl 0x7f8ad92a9080 <col:28> col:28 'const class std::__1::allocator<char> &'
|-CXXConstructorDecl 0x7f8ad92a9118 <col:28> col:28 implicit referenced constexpr allocator 'void (class std::__1::allocator<char> &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7f8ad92a9240 <col:28> col:28 'class std::__1::allocator<char> &&'
`-CXXDestructorDecl 0x7f8ad92aa628 <col:28> col:28 implicit referenced ~allocator 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f8ad926e350 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:699:5, line:704:5> line:699:12 struct __long definition
|-CXXRecordDecl 0x7f8ad926e7c8 prev 0x7f8ad926e350 <col:5, col:12> col:12 implicit struct __long
|-FieldDecl 0x7f8ad926e890 <line:701:9, col:19> col:19 __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7f8ad926e8e8 <line:702:9, col:19> col:19 __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7f8ad926e940 <line:703:9, col:19> col:19 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
`-CXXDestructorDecl 0x7f8ad92aa7e8 <line:699:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f8ad9270e98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9, line:723:9> line:719:9 union definition
|-FieldDecl 0x7f8ad9271018 <line:721:13, col:27> col:27 __size_ 'unsigned char'
|-FieldDecl 0x7f8ad9271070 <line:722:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
`-CXXDestructorDecl 0x7f8ad92aab68 <line:719:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon.0 = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f8ad926ed28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:717:5, line:725:5> line:717:12 struct __short definition
|-CXXRecordDecl 0x7f8ad9270e00 prev 0x7f8ad926ed28 <col:5, col:12> col:12 implicit struct __short
|-CXXRecordDecl 0x7f8ad9270e98 <line:719:9, line:723:9> line:719:9 union definition
| |-FieldDecl 0x7f8ad9271018 <line:721:13, col:27> col:27 __size_ 'unsigned char'
| |-FieldDecl 0x7f8ad9271070 <line:722:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-CXXDestructorDecl 0x7f8ad92aab68 <line:719:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7f8ad92710d8 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
|-IndirectFieldDecl 0x7f8ad9271130 <line:721:27> col:27 implicit __size_ 'unsigned char'
| |-Field 0x7f8ad92710d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| `-Field 0x7f8ad9271018 '__size_' 'unsigned char'
|-IndirectFieldDecl 0x7f8ad9271180 <line:722:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-Field 0x7f8ad92710d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| `-Field 0x7f8ad9271070 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FieldDecl 0x7f8ad9271248 <line:724:9, col:37> col:20 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
`-CXXDestructorDecl 0x7f8ad92aa8c8 <line:717:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f8ad9271650 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:733:5, line:736:5> line:733:12 struct __raw definition
|-CXXRecordDecl 0x7f8ad9273d50 prev 0x7f8ad9271650 <col:5, col:12> col:12 implicit struct __raw
|-FieldDecl 0x7f8ad9273ea8 <line:735:9, col:36> col:19 __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
`-CXXDestructorDecl 0x7f8ad92aa9a8 <line:733:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f8ad9273aa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9, line:745:9> line:740:9 union definition
|-FieldDecl 0x7f8ad9273c38 <line:742:13, col:21> col:21 __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-FieldDecl 0x7f8ad9273c90 <line:743:13, col:21> col:21 __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-FieldDecl 0x7f8ad9273f10 <line:744:13, col:21> col:21 __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
`-CXXDestructorDecl 0x7f8ad92aaa88 <line:740:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f8ad9271720 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:738:5, line:746:5> line:738:12 struct __rep definition
|-CXXRecordDecl 0x7f8ad9273a10 prev 0x7f8ad9271720 <col:5, col:12> col:12 implicit struct __rep
|-CXXRecordDecl 0x7f8ad9273aa8 <line:740:9, line:745:9> line:740:9 union definition
| |-FieldDecl 0x7f8ad9273c38 <line:742:13, col:21> col:21 __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-FieldDecl 0x7f8ad9273c90 <line:743:13, col:21> col:21 __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-FieldDecl 0x7f8ad9273f10 <line:744:13, col:21> col:21 __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| `-CXXDestructorDecl 0x7f8ad92aaa88 <line:740:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7f8ad9273f78 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
|-IndirectFieldDecl 0x7f8ad9273fd0 <line:742:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-Field 0x7f8ad9273f78 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| `-Field 0x7f8ad9273c38 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-IndirectFieldDecl 0x7f8ad9274020 <line:743:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-Field 0x7f8ad9273f78 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| `-Field 0x7f8ad9273c90 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-IndirectFieldDecl 0x7f8ad9274070 <line:744:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-Field 0x7f8ad9273f78 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| `-Field 0x7f8ad9273f10 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
`-CXXDestructorDecl 0x7f8ad92aa708 <line:738:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f8ad9275818 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2209:1, line:2264:1> line:2210:7 class __libcpp_compressed_pair_imp definition
|-private 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-TemplateArgument integral 2
|-CXXRecordDecl 0x7f8ad9275c38 prev 0x7f8ad9275818 <col:1, col:7> col:7 implicit class __libcpp_compressed_pair_imp
|-AccessSpecDecl 0x7f8ad9275cd0 <line:2213:1, col:8> col:1 private
|-FieldDecl 0x7f8ad9275d08 <line:2214:5, col:9> col:9 __first_ 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-AccessSpecDecl 0x7f8ad9275d50 <line:2215:1, col:7> col:1 public
|-TypedefDecl 0x7f8ad9275d88 <line:2216:5, col:17> col:17 referenced _T1_param 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-SubstTemplateTypeParmType 0x7f8ad9275ac0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|   |-TemplateTypeParmType 0x7f8ad788f2f0 '_T1' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f8ad788f2b0 '_T1'
|   `-RecordType 0x7f8ad92717c0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|     `-CXXRecord 0x7f8ad9271720 '__rep'
|-TypedefDecl 0x7f8ad9275df0 <line:2217:5, col:17> col:17 referenced _T2_param 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7f8ad9275b00 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7f8ad788f360 '_T2' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f8ad788f318 '_T2'
|   `-RecordType 0x7f8ad891f530 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7f8ad891f448 'allocator'
|-TypedefDecl 0x7f8ad92762e0 <line:2219:5, col:51> col:51 referenced _T1_reference 'typename remove_reference<struct __rep>::type &'
| `-LValueReferenceType 0x7f8ad9276290 'typename remove_reference<struct __rep>::type &'
|   `-ElaboratedType 0x7f8ad9276230 'typename remove_reference<struct __rep>::type' sugar
|     `-TypedefType 0x7f8ad9276210 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|       |-Typedef 0x7f8ad9276198 'type'
|       `-SubstTemplateTypeParmType 0x7f8ad9276160 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|         |-TemplateTypeParmType 0x7f8ad8856000 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7f8ad8855fc0 '_Tp'
|         `-RecordType 0x7f8ad92717c0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|           `-CXXRecord 0x7f8ad9271720 '__rep'
|-TypedefDecl 0x7f8ad9276378 <line:2220:5, col:57> col:57 referenced _T2_reference 'class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7f8ad9276340 'class std::__1::allocator<char> &'
|   `-SubstTemplateTypeParmType 0x7f8ad9275b00 'class std::__1::allocator<char>' sugar
|     |-TemplateTypeParmType 0x7f8ad788f360 '_T2' dependent depth 0 index 1
|     | `-TemplateTypeParm 0x7f8ad788f318 '_T2'
|     `-RecordType 0x7f8ad891f530 'class std::__1::allocator<char>'
|       `-ClassTemplateSpecialization 0x7f8ad891f448 'allocator'
|-TypedefDecl 0x7f8ad9276530 <line:2222:5, col:57> col:57 referenced _T1_const_reference 'const typename remove_reference<struct __rep>::type &'
| `-LValueReferenceType 0x7f8ad92764e0 'const typename remove_reference<struct __rep>::type &'
|   `-QualType 0x7f8ad9276481 'const typename remove_reference<struct __rep>::type' const
|     `-ElaboratedType 0x7f8ad9276480 'typename remove_reference<struct __rep>::type' sugar
|       `-TypedefType 0x7f8ad9276210 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|         |-Typedef 0x7f8ad9276198 'type'
|         `-SubstTemplateTypeParmType 0x7f8ad9276160 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|           |-TemplateTypeParmType 0x7f8ad8856000 '_Tp' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x7f8ad8855fc0 '_Tp'
|           `-RecordType 0x7f8ad92717c0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|             `-CXXRecord 0x7f8ad9271720 '__rep'
|-TypedefDecl 0x7f8ad92765c8 <line:2223:5, col:63> col:63 referenced _T2_const_reference 'const class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7f8ad9276590 'const class std::__1::allocator<char> &'
|   `-QualType 0x7f8ad9275b01 'const class std::__1::allocator<char>' const
|     `-SubstTemplateTypeParmType 0x7f8ad9275b00 'class std::__1::allocator<char>' sugar
|       |-TemplateTypeParmType 0x7f8ad788f360 '_T2' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x7f8ad788f318 '_T2'
|       `-RecordType 0x7f8ad891f530 'class std::__1::allocator<char>'
|         `-ClassTemplateSpecialization 0x7f8ad891f448 'allocator'
|-CXXConstructorDecl 0x7f8ad9276660 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2225:76> col:31 __libcpp_compressed_pair_imp 'void (void)'
| `-AlwaysInlineAttr 0x7f8ad9276748 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad92768e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2227:54> line:2226:40 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param)'
| |-ParmVarDecl 0x7f8ad92767c0 <col:69, col:79> col:79 __t1 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-AlwaysInlineAttr 0x7f8ad92769a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad9276b40 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2229:61> line:2228:40 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param)'
| |-ParmVarDecl 0x7f8ad9276a20 <col:69, col:79> col:79 __t2 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7f8ad9276c00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad9276e10 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2233:92> line:2230:31 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param, std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param)' noexcept-uninstantiated 0x7f8ad81d8b38
| |-ParmVarDecl 0x7f8ad9276c58 <col:60, col:70> col:70 __t1 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| |-ParmVarDecl 0x7f8ad9276cc8 <col:76, col:86> col:86 __t2 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7f8ad9276f30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f8ad9277938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2237:5, line:2247:14> line:2239:9 __libcpp_compressed_pair_imp
| |-TemplateTypeParmDecl 0x7f8ad9276f78 <line:2237:15, col:24> col:24 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7f8ad9276fe8 <col:32, col:41> col:41 class depth 0 index 1 ... _Args2
| |-NonTypeTemplateParmDecl 0x7f8ad9277058 <col:49, col:59> col:59 referenced 'size_t':'unsigned long' depth 0 index 2 ... _I1
| |-NonTypeTemplateParmDecl 0x7f8ad92770b0 <col:64, col:74> col:74 referenced 'size_t':'unsigned long' depth 0 index 3 ... _I2
| `-CXXConstructorDecl 0x7f8ad9277890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2247:14> line:2239:9 __libcpp_compressed_pair_imp 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>, __tuple_indices<_I1...>, __tuple_indices<_I2...>)'
|   |-ParmVarDecl 0x7f8ad9277138 <col:38> col:59 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f8ad92772a8 <line:2240:38, col:55> col:55 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7f8ad9277418 <line:2241:38, col:55> col:55 __second_args 'tuple<_Args2...>'
|   |-ParmVarDecl 0x7f8ad9277568 <line:2242:38, col:60> col:61 '__tuple_indices<_I1...>'
|   |-ParmVarDecl 0x7f8ad9277708 <line:2243:38, col:60> col:61 '__tuple_indices<_I2...>'
|   `-AlwaysInlineAttr 0x7f8ad92779b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9277b28 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2251:92> col:51 first 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_reference (void) noexcept'
| `-AlwaysInlineAttr 0x7f8ad9277bd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9277cc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2252:92> col:51 first 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad9277d70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9277e68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2254:90> col:51 second 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_reference (void) noexcept'
| `-AlwaysInlineAttr 0x7f8ad9277f10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9278008 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2255:90> col:51 second 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad92780b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9278250 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2263:5> line:2257:36 swap 'void (class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &)' noexcept-uninstantiated 0x7f8ad81d9f38
| |-ParmVarDecl 0x7f8ad9278138 <col:41, col:71> col:71 __x 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &'
| `-AlwaysInlineAttr 0x7f8ad9278348 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
`-CXXDestructorDecl 0x7f8ad92aa548 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2210:7> col:7 implicit ~__libcpp_compressed_pair_imp 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__libcpp_compressed_pair_imp" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  NonVirtualBaseLLVMType:%"class.std::__1::__libcpp_compressed_pair_imp" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f8ad9271810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2317:1, line:2363:1> line:2318:7 class __compressed_pair definition
|-private '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-CXXRecordDecl 0x7f8ad92783e0 prev 0x7f8ad9271810 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7f8ad927ae48 <line:2321:5, col:52> col:52 base '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
| `-TemplateSpecializationType 0x7f8ad9278da0 '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >' sugar __libcpp_compressed_pair_imp
|   |-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|   |-TemplateArgument type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|   `-RecordType 0x7f8ad9275930 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
|     `-ClassTemplateSpecialization 0x7f8ad9275818 '__libcpp_compressed_pair_imp'
|-AccessSpecDecl 0x7f8ad927aea0 <line:2322:1, col:7> col:1 public
|-TypedefDecl 0x7f8ad927af80 <line:2323:5, col:38> col:38 _T1_param 'typename base::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-ElaboratedType 0x7f8ad927af30 'typename base::_T1_param' sugar
|   `-TypedefType 0x7f8ad9276790 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param' sugar
|     |-Typedef 0x7f8ad9275d88 '_T1_param'
|     `-SubstTemplateTypeParmType 0x7f8ad9275ac0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|       |-TemplateTypeParmType 0x7f8ad788f2f0 '_T1' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f8ad788f2b0 '_T1'
|       `-RecordType 0x7f8ad92717c0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|         `-CXXRecord 0x7f8ad9271720 '__rep'
|-TypedefDecl 0x7f8ad927b050 <line:2324:5, col:38> col:38 _T2_param 'typename base::_T2_param':'class std::__1::allocator<char>'
| `-ElaboratedType 0x7f8ad927b000 'typename base::_T2_param' sugar
|   `-TypedefType 0x7f8ad92769f0 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param' sugar
|     |-Typedef 0x7f8ad9275df0 '_T2_param'
|     `-SubstTemplateTypeParmType 0x7f8ad9275b00 'class std::__1::allocator<char>' sugar
|       |-TemplateTypeParmType 0x7f8ad788f360 '_T2' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x7f8ad788f318 '_T2'
|       `-RecordType 0x7f8ad891f530 'class std::__1::allocator<char>'
|         `-ClassTemplateSpecialization 0x7f8ad891f448 'allocator'
|-TypedefDecl 0x7f8ad927b120 <line:2326:5, col:42> col:42 _T1_reference 'typename base::_T1_reference':'typename remove_reference<struct __rep>::type &'
| `-ElaboratedType 0x7f8ad927b0d0 'typename base::_T1_reference' sugar
|   `-TypedefType 0x7f8ad9277a80 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_reference' sugar
|     |-Typedef 0x7f8ad92762e0 '_T1_reference'
|     `-LValueReferenceType 0x7f8ad9276290 'typename remove_reference<struct __rep>::type &'
|       `-ElaboratedType 0x7f8ad9276230 'typename remove_reference<struct __rep>::type' sugar
|         `-TypedefType 0x7f8ad9276210 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|           |-Typedef 0x7f8ad9276198 'type'
|           `-SubstTemplateTypeParmType 0x7f8ad9276160 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|             |-TemplateTypeParmType 0x7f8ad8856000 '_Tp' dependent depth 0 index 0
|             | `-TemplateTypeParm 0x7f8ad8855fc0 '_Tp'
|             `-RecordType 0x7f8ad92717c0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|               `-CXXRecord 0x7f8ad9271720 '__rep'
|-TypedefDecl 0x7f8ad927b1f0 <line:2327:5, col:42> col:42 _T2_reference 'typename base::_T2_reference':'class std::__1::allocator<char> &'
| `-ElaboratedType 0x7f8ad927b1a0 'typename base::_T2_reference' sugar
|   `-TypedefType 0x7f8ad9277dc0 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_reference' sugar
|     |-Typedef 0x7f8ad9276378 '_T2_reference'
|     `-LValueReferenceType 0x7f8ad9276340 'class std::__1::allocator<char> &'
|       `-SubstTemplateTypeParmType 0x7f8ad9275b00 'class std::__1::allocator<char>' sugar
|         |-TemplateTypeParmType 0x7f8ad788f360 '_T2' dependent depth 0 index 1
|         | `-TemplateTypeParm 0x7f8ad788f318 '_T2'
|         `-RecordType 0x7f8ad891f530 'class std::__1::allocator<char>'
|           `-ClassTemplateSpecialization 0x7f8ad891f448 'allocator'
|-TypedefDecl 0x7f8ad927b2c0 <line:2329:5, col:48> col:48 _T1_const_reference 'typename base::_T1_const_reference':'const typename remove_reference<struct __rep>::type &'
| `-ElaboratedType 0x7f8ad927b270 'typename base::_T1_const_reference' sugar
|   `-TypedefType 0x7f8ad9277c20 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_const_reference' sugar
|     |-Typedef 0x7f8ad9276530 '_T1_const_reference'
|     `-LValueReferenceType 0x7f8ad92764e0 'const typename remove_reference<struct __rep>::type &'
|       `-QualType 0x7f8ad9276481 'const typename remove_reference<struct __rep>::type' const
|         `-ElaboratedType 0x7f8ad9276480 'typename remove_reference<struct __rep>::type' sugar
|           `-TypedefType 0x7f8ad9276210 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|             |-Typedef 0x7f8ad9276198 'type'
|             `-SubstTemplateTypeParmType 0x7f8ad9276160 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|               |-TemplateTypeParmType 0x7f8ad8856000 '_Tp' dependent depth 0 index 0
|               | `-TemplateTypeParm 0x7f8ad8855fc0 '_Tp'
|               `-RecordType 0x7f8ad92717c0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|                 `-CXXRecord 0x7f8ad9271720 '__rep'
|-TypedefDecl 0x7f8ad927b390 <line:2330:5, col:48> col:48 _T2_const_reference 'typename base::_T2_const_reference':'const class std::__1::allocator<char> &'
| `-ElaboratedType 0x7f8ad927b340 'typename base::_T2_const_reference' sugar
|   `-TypedefType 0x7f8ad9277f60 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_const_reference' sugar
|     |-Typedef 0x7f8ad92765c8 '_T2_const_reference'
|     `-LValueReferenceType 0x7f8ad9276590 'const class std::__1::allocator<char> &'
|       `-QualType 0x7f8ad9275b01 'const class std::__1::allocator<char>' const
|         `-SubstTemplateTypeParmType 0x7f8ad9275b00 'class std::__1::allocator<char>' sugar
|           |-TemplateTypeParmType 0x7f8ad788f360 '_T2' dependent depth 0 index 1
|           | `-TemplateTypeParm 0x7f8ad788f318 '_T2'
|           `-RecordType 0x7f8ad891f530 'class std::__1::allocator<char>'
|             `-ClassTemplateSpecialization 0x7f8ad891f448 'allocator'
|-CXXConstructorDecl 0x7f8ad927b428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2332:52> col:31 __compressed_pair 'void (void)'
| `-AlwaysInlineAttr 0x7f8ad927b508 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad927b660 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2334:50> line:2333:40 __compressed_pair 'void (std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param)'
| |-ParmVarDecl 0x7f8ad927b580 <col:58, col:68> col:68 __t1 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-AlwaysInlineAttr 0x7f8ad927b720 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad927b880 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2336:50> line:2335:40 __compressed_pair 'void (std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param)'
| |-ParmVarDecl 0x7f8ad927b7a0 <col:58, col:68> col:68 __t2 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7f8ad927b940 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad927bb00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2338:83> line:2337:31 __compressed_pair 'void (std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param, std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param)'
| |-ParmVarDecl 0x7f8ad927b998 <col:49, col:59> col:59 __t1 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| |-ParmVarDecl 0x7f8ad927ba08 <col:65, col:75> col:75 __t2 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7f8ad927bbc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f8ad927c1e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2342:5, line:2349:14> line:2344:9 __compressed_pair
| |-TemplateTypeParmDecl 0x7f8ad927bc10 <line:2342:15, col:24> col:24 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7f8ad927bc78 <col:32, col:41> col:41 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7f8ad927c140 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2349:14> line:2344:9 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7f8ad927bd08 <col:27, col:49> col:49 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f8ad927be78 <col:55, col:72> col:72 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7f8ad927bfe8 <line:2345:55, col:72> col:72 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7f8ad927c250 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad927c398 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2353:97> col:51 first 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_reference (void) noexcept'
| `-AlwaysInlineAttr 0x7f8ad927c440 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad927c508 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2354:97> col:51 first 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad927c5b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad927c678 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2356:99> col:51 second 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_reference (void) noexcept'
| `-AlwaysInlineAttr 0x7f8ad927c720 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad927c7e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2357:99> col:51 second 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad927c890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad927ca30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2362:26> line:2359:36 swap 'void (class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &)' noexcept-uninstantiated 0x7f8ad81e31f8
| |-ParmVarDecl 0x7f8ad927c918 <col:41, col:60> col:60 __x 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &'
| `-AlwaysInlineAttr 0x7f8ad927cb28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
`-CXXDestructorDecl 0x7f8ad92aa468 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2318:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair" = type { %"class.std::__1::__libcpp_compressed_pair_imp" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair" = type { %"class.std::__1::__libcpp_compressed_pair_imp" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f8ad898a4e8 parent 0x7f8ad8916408 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:4036:81> col:64 class basic_string definition
|-private '__basic_string_common<true>':'class std::__1::__basic_string_common<true>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-VisibilityAttr 0x7f8ad9386978 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7f8ad924c248 prev 0x7f8ad898a4e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:633:1, col:28> col:28 implicit class basic_string
|-AccessSpecDecl 0x7f8ad924c2e0 <line:636:1, col:7> col:1 public
|-TypedefDecl 0x7f8ad924c318 <line:637:5, col:58> col:58 __self 'class std::__1::basic_string<char>'
| `-RecordType 0x7f8ad898a600 'class std::__1::basic_string<char>'
|   `-ClassTemplateSpecialization 0x7f8ad898a4e8 'basic_string'
|-TypedefDecl 0x7f8ad924c498 <line:638:5, col:58> col:58 __self_view 'basic_string_view<char, struct std::__1::char_traits<char> >':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-TemplateSpecializationType 0x7f8ad924c3f0 'basic_string_view<char, struct std::__1::char_traits<char> >' sugar basic_string_view
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7f8ad8289ce0 'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
|     `-ClassTemplateSpecialization 0x7f8ad8289bd8 'basic_string_view'
|-TypedefDecl 0x7f8ad924c500 <line:639:5, col:58> col:58 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f8ad924c3b0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f8ad797dfc0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f8ad797df78 '_Traits'
|   `-RecordType 0x7f8ad891e0f0 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f8ad79353f8 'char_traits'
|-TypedefDecl 0x7f8ad924c568 <line:640:5, col:58> col:58 value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f8ad924c370 'char' sugar
|   |-TemplateTypeParmType 0x7f8ad797df50 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f8ad797df10 '_CharT'
|   `-BuiltinType 0x7f8ad8031b60 'char'
|-TypedefDecl 0x7f8ad924c5f8 <line:641:5, col:58> col:58 allocator_type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7f8ad924c5c0 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7f8ad797e030 '_Allocator' dependent depth 0 index 2
|   | `-TemplateTypeParm 0x7f8ad797dfe8 '_Allocator'
|   `-RecordType 0x7f8ad891f530 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7f8ad891f448 'allocator'
|-TypedefDecl 0x7f8ad924c808 <line:642:5, col:58> col:58 __alloc_traits 'allocator_traits<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>':'struct std::__1::allocator_traits<class std::__1::allocator<char> >'
| `-TemplateSpecializationType 0x7f8ad924c790 'allocator_traits<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type':'class std::__1::allocator<char>'
|   `-RecordType 0x7f8ad924c770 'struct std::__1::allocator_traits<class std::__1::allocator<char> >'
|     `-ClassTemplateSpecialization 0x7f8ad924c680 'allocator_traits'
|-TypedefDecl 0x7f8ad926d090 <line:643:5, col:58> col:58 size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7f8ad926d040 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7f8ad9264350 'std::__1::allocator_traits<class std::__1::allocator<char> >::size_type' sugar
|     |-Typedef 0x7f8ad925ba60 'size_type'
|     `-ElaboratedType 0x7f8ad925ba10 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7f8ad925b9f0 'std::__1::__size_type<class std::__1::allocator<char>, long, true>::type' sugar
|         |-Typedef 0x7f8ad925b970 'type'
|         `-ElaboratedType 0x7f8ad925b920 'typename class allocator<char>::size_type' sugar
|           `-TypedefType 0x7f8ad925adc0 'std::__1::allocator<char>::size_type' sugar
|             |-Typedef 0x7f8ad924cc08 'size_type'
|             `-TypedefType 0x7f8ad8801cc0 'size_t' sugar
|               |-Typedef 0x7f8ad88011b0 'size_t'
|               `-BuiltinType 0x7f8ad8031c80 'unsigned long'
|-TypedefDecl 0x7f8ad926d160 <line:644:5, col:58> col:58 difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7f8ad926d110 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7f8ad925a0e0 'std::__1::allocator_traits<class std::__1::allocator<char> >::difference_type' sugar
|     |-Typedef 0x7f8ad925a070 'difference_type'
|     `-ElaboratedType 0x7f8ad925a020 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7f8ad925a000 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<char>, char *, true>::type' sugar
|         |-Typedef 0x7f8ad9259f80 'type'
|         `-ElaboratedType 0x7f8ad9259f30 'typename class allocator<char>::difference_type' sugar
|           `-TypedefType 0x7f8ad92593d0 'std::__1::allocator<char>::difference_type' sugar
|             |-Typedef 0x7f8ad924cc60 'difference_type'
|             `-TypedefType 0x7f8ad89a94e0 'ptrdiff_t' sugar
|               |-Typedef 0x7f8ad8801140 'ptrdiff_t'
|               `-BuiltinType 0x7f8ad8031be0 'long'
|-TypedefDecl 0x7f8ad926d218 <line:645:5, col:58> col:58 reference 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
| `-LValueReferenceType 0x7f8ad926d1e0 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
|   `-TypedefType 0x7f8ad926d1c0 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' sugar
|     |-Typedef 0x7f8ad924c568 'value_type'
|     `-SubstTemplateTypeParmType 0x7f8ad924c370 'char' sugar
|       |-TemplateTypeParmType 0x7f8ad797df50 '_CharT' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f8ad797df10 '_CharT'
|       `-BuiltinType 0x7f8ad8031b60 'char'
|-TypedefDecl 0x7f8ad926d2a8 <line:646:5, col:58> col:58 const_reference 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
| `-LValueReferenceType 0x7f8ad926d270 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
|   `-QualType 0x7f8ad926d1c1 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' const
|     `-TypedefType 0x7f8ad926d1c0 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' sugar
|       |-Typedef 0x7f8ad924c568 'value_type'
|       `-SubstTemplateTypeParmType 0x7f8ad924c370 'char' sugar
|         |-TemplateTypeParmType 0x7f8ad797df50 '_CharT' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7f8ad797df10 '_CharT'
|         `-BuiltinType 0x7f8ad8031b60 'char'
|-TypedefDecl 0x7f8ad926d370 <line:647:5, col:58> col:58 pointer 'typename __alloc_traits::pointer':'char *'
| `-ElaboratedType 0x7f8ad926d320 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7f8ad9250690 'std::__1::allocator_traits<class std::__1::allocator<char> >::pointer' sugar
|     |-Typedef 0x7f8ad9250620 'pointer'
|     `-ElaboratedType 0x7f8ad92505d0 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7f8ad92505b0 'std::__1::__pointer_type<char, class std::__1::allocator<char> >::type' sugar
|         |-Typedef 0x7f8ad9250530 'type'
|         `-ElaboratedType 0x7f8ad92504e0 'typename __pointer_type_imp::__pointer_type<char, typename remove_reference<class allocator<char> >::type>::type' sugar
|           `-TypedefType 0x7f8ad92504c0 'std::__1::__pointer_type_imp::__pointer_type<char, class std::__1::allocator<char>, true>::type' sugar
|             |-Typedef 0x7f8ad9250440 'type'
|             `-ElaboratedType 0x7f8ad92503f0 'typename class allocator<char>::pointer' sugar
|               `-TypedefType 0x7f8ad924d920 'std::__1::allocator<char>::pointer' sugar
|                 |-Typedef 0x7f8ad924cd28 'pointer'
|                 `-PointerType 0x7f8ad924ccf0 'char *'
|                   `-SubstTemplateTypeParmType 0x7f8ad924ccc0 'char' sugar
|                     |-TemplateTypeParmType 0x7f8ad915e0c0 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7f8ad915e078 '_Tp'
|                     `-BuiltinType 0x7f8ad8031b60 'char'
|-TypedefDecl 0x7f8ad926d460 <line:648:5, col:58> col:58 const_pointer 'typename __alloc_traits::const_pointer':'const char *'
| `-ElaboratedType 0x7f8ad926d410 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7f8ad926d3f0 'std::__1::allocator_traits<class std::__1::allocator<char> >::const_pointer' sugar
|     |-Typedef 0x7f8ad9251fb0 'const_pointer'
|     `-ElaboratedType 0x7f8ad9251f60 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7f8ad9251f40 'std::__1::__const_pointer<char, char *, class std::__1::allocator<char>, true>::type' sugar
|         |-Typedef 0x7f8ad9251ec0 'type'
|         `-ElaboratedType 0x7f8ad9251e70 'typename class allocator<char>::const_pointer' sugar
|           `-TypedefType 0x7f8ad924db70 'std::__1::allocator<char>::const_pointer' sugar
|             |-Typedef 0x7f8ad924cdb8 'const_pointer'
|             `-PointerType 0x7f8ad924cd80 'const char *'
|               `-QualType 0x7f8ad924ccc1 'const char' const
|                 `-SubstTemplateTypeParmType 0x7f8ad924ccc0 'char' sugar
|                   |-TemplateTypeParmType 0x7f8ad915e0c0 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7f8ad915e078 '_Tp'
|                   `-BuiltinType 0x7f8ad8031b60 'char'
|-StaticAssertDecl 0x7f8ad926d5c0 <line:650:5, col:92> col:5
| |-DeclRefExpr 0x7f8ad926d570 <col:19, col:39> 'const _Bool':'const _Bool' lvalue Var 0x7f8ad8244bc8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f8ad797efc8 <col:46> 'const char [45]' lvalue "Character type of basic_string must be a POD"
|-StaticAssertDecl 0x7f8ad926d800 <line:651:5, line:652:74> line:651:5
| |-ParenExpr 0x7f8ad926d7c8 <col:19, col:75> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7f8ad926d790 <col:20, col:70> 'const _Bool':'const _Bool' lvalue Var 0x7f8ad8244bc8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f8ad797f290 <line:652:19> 'const char [54]' lvalue "traits_type::char_type must be the same type as CharT"
|-StaticAssertDecl 0x7f8ad926da10 <line:653:5, line:654:74> line:653:5
| |-ParenExpr 0x7f8ad926d9d8 <col:19, col:83> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7f8ad926d9a0 <col:20, col:78> 'const _Bool':'const _Bool' lvalue Var 0x7f8ad8244bc8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f8ad797f5d0 <line:654:19> 'const char [54]' lvalue "Allocator::value_type must be same type as value_type"
|-TypedefDecl 0x7f8ad926dc08 <line:659:5, col:58> col:58 iterator '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer>':'class std::__1::__wrap_iter<char *>'
| `-TemplateSpecializationType 0x7f8ad926db90 '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
|   `-RecordType 0x7f8ad926db70 'class std::__1::__wrap_iter<char *>'
|     `-ClassTemplateSpecialization 0x7f8ad926da80 '__wrap_iter'
|-TypedefDecl 0x7f8ad926de18 <line:660:5, col:58> col:58 const_iterator '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer>':'class std::__1::__wrap_iter<const char *>'
| `-TemplateSpecializationType 0x7f8ad926dda0 '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer':'const char *'
|   `-RecordType 0x7f8ad926dd80 'class std::__1::__wrap_iter<const char *>'
|     `-ClassTemplateSpecialization 0x7f8ad926dc90 '__wrap_iter'
|-TypedefDecl 0x7f8ad926e070 <line:662:5, col:59> col:59 reverse_iterator 'std::__1::reverse_iterator<iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<char *> >'
| `-ElaboratedType 0x7f8ad926e000 'std::__1::reverse_iterator<iterator>' sugar
|   `-TemplateSpecializationType 0x7f8ad926dfb0 'reverse_iterator<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator':'class std::__1::__wrap_iter<char *>'
|     `-RecordType 0x7f8ad926df90 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<char *> >'
|       `-ClassTemplateSpecialization 0x7f8ad926dea0 'reverse_iterator'
|-TypedefDecl 0x7f8ad926e2d0 <line:663:5, col:59> col:59 const_reverse_iterator 'std::__1::reverse_iterator<const_iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const char *> >'
| `-ElaboratedType 0x7f8ad926e260 'std::__1::reverse_iterator<const_iterator>' sugar
|   `-TemplateSpecializationType 0x7f8ad926e210 'reverse_iterator<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|     `-RecordType 0x7f8ad926e1f0 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const char *> >'
|       `-ClassTemplateSpecialization 0x7f8ad926e100 'reverse_iterator'
|-AccessSpecDecl 0x7f8ad926e328 <line:665:1, col:8> col:1 private
|-CXXRecordDecl 0x7f8ad926e350 <line:699:5, line:704:5> line:699:12 struct __long definition
| |-CXXRecordDecl 0x7f8ad926e7c8 prev 0x7f8ad926e350 <col:5, col:12> col:12 implicit struct __long
| |-FieldDecl 0x7f8ad926e890 <line:701:9, col:19> col:19 __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-FieldDecl 0x7f8ad926e8e8 <line:702:9, col:19> col:19 __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-FieldDecl 0x7f8ad926e940 <line:703:9, col:19> col:19 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
| `-CXXDestructorDecl 0x7f8ad92aa7e8 <line:699:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial
|-EnumDecl 0x7f8ad926e420 <line:710:5> col:5
| `-EnumConstantDecl 0x7f8ad926e4f0 <col:11, col:26> col:11 __short_mask 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:710:5)'
|   `-ImplicitCastExpr 0x7f8ad926e540 <col:26> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7f8ad7980190 <col:26> 'int' 1
|-EnumDecl 0x7f8ad926e558 <line:711:5> col:5
| `-EnumConstantDecl 0x7f8ad926e620 <col:11, col:26> col:11 __long_mask 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:711:5)'
|   `-ImplicitCastExpr 0x7f8ad926e670 <col:26> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7f8ad79802c0 <col:26> 'unsigned long' 1
|-EnumDecl 0x7f8ad926e688 <line:714:5> col:5
| `-EnumConstantDecl 0x7f8ad926ecc0 <col:11, line:715:65> line:714:11 referenced __min_cap 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:714:5)'
|   `-ImplicitCastExpr 0x7f8ad926ed10 <col:23, line:715:65> 'unsigned int' <IntegralCast>
|     `-ConditionalOperator 0x7f8ad926ebc0 <line:714:23, line:715:65> 'unsigned long'
|       |-BinaryOperator 0x7f8ad926ea98 <line:714:23, col:65> '_Bool' '>'
|       | |-BinaryOperator 0x7f8ad926ea58 <col:23, col:61> 'unsigned long' '/'
|       | | |-ParenExpr 0x7f8ad926ea08 <col:23, col:42> 'unsigned long'
|       | | | `-BinaryOperator 0x7f8ad926e9e0 <col:24, col:41> 'unsigned long' '-'
|       | | |   |-UnaryExprOrTypeTraitExpr 0x7f8ad926e9a8 <col:24, col:37> 'unsigned long' sizeof 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|       | | |   `-ImplicitCastExpr 0x7f8ad926e9c8 <col:41> 'unsigned long' <IntegralCast>
|       | | |     `-IntegerLiteral 0x7f8ad7980420 <col:41> 'int' 1
|       | | `-UnaryExprOrTypeTraitExpr 0x7f8ad926ea38 <col:44, col:61> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|       | `-ImplicitCastExpr 0x7f8ad926ea80 <col:65> 'unsigned long' <IntegralCast>
|       |   `-IntegerLiteral 0x7f8ad79804f8 <col:65> 'int' 2
|       |-BinaryOperator 0x7f8ad926eb80 <line:715:23, col:61> 'unsigned long' '/'
|       | |-ParenExpr 0x7f8ad926eb30 <col:23, col:42> 'unsigned long'
|       | | `-BinaryOperator 0x7f8ad926eb08 <col:24, col:41> 'unsigned long' '-'
|       | |   |-UnaryExprOrTypeTraitExpr 0x7f8ad926ead0 <col:24, col:37> 'unsigned long' sizeof 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|       | |   `-ImplicitCastExpr 0x7f8ad926eaf0 <col:41> 'unsigned long' <IntegralCast>
|       | |     `-IntegerLiteral 0x7f8ad7980588 <col:41> 'int' 1
|       | `-UnaryExprOrTypeTraitExpr 0x7f8ad926eb60 <col:44, col:61> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|       `-ImplicitCastExpr 0x7f8ad926eba8 <col:65> 'unsigned long' <IntegralCast>
|         `-IntegerLiteral 0x7f8ad7980660 <col:65> 'int' 2
|-CXXRecordDecl 0x7f8ad926ed28 <line:717:5, line:725:5> line:717:12 struct __short definition
| |-CXXRecordDecl 0x7f8ad9270e00 prev 0x7f8ad926ed28 <col:5, col:12> col:12 implicit struct __short
| |-CXXRecordDecl 0x7f8ad9270e98 <line:719:9, line:723:9> line:719:9 union definition
| | |-FieldDecl 0x7f8ad9271018 <line:721:13, col:27> col:27 __size_ 'unsigned char'
| | |-FieldDecl 0x7f8ad9271070 <line:722:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| | `-CXXDestructorDecl 0x7f8ad92aab68 <line:719:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-FieldDecl 0x7f8ad92710d8 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| |-IndirectFieldDecl 0x7f8ad9271130 <line:721:27> col:27 implicit __size_ 'unsigned char'
| | |-Field 0x7f8ad92710d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| | `-Field 0x7f8ad9271018 '__size_' 'unsigned char'
| |-IndirectFieldDecl 0x7f8ad9271180 <line:722:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| | |-Field 0x7f8ad92710d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| | `-Field 0x7f8ad9271070 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-FieldDecl 0x7f8ad9271248 <line:724:9, col:37> col:20 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
| `-CXXDestructorDecl 0x7f8ad92aa8c8 <line:717:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial
|-CXXRecordDecl 0x7f8ad926edf0 <line:729:5, col:44> col:11 union __ulx definition
| |-CXXRecordDecl 0x7f8ad926f008 prev 0x7f8ad926edf0 <col:5, col:11> col:11 implicit union __ulx
| |-FieldDecl 0x7f8ad926f0b0 <col:17, col:24> col:24 __lx 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| `-FieldDecl 0x7f8ad92712b0 <col:30, col:38> col:38 __lxx 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-EnumDecl 0x7f8ad926eec0 <line:731:5> col:5
| `-EnumConstantDecl 0x7f8ad92715e8 <col:11, col:55> col:11 referenced __n_words 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:731:5)'
|   `-ImplicitCastExpr 0x7f8ad9271638 <col:23, col:55> 'unsigned int' <IntegralCast>
|     `-BinaryOperator 0x7f8ad9271368 <col:23, col:55> 'unsigned long' '/'
|       |-UnaryExprOrTypeTraitExpr 0x7f8ad9271318 <col:23, col:35> 'unsigned long' sizeof 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx'
|       `-UnaryExprOrTypeTraitExpr 0x7f8ad9271348 <col:39, col:55> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXRecordDecl 0x7f8ad9271650 <line:733:5, line:736:5> line:733:12 struct __raw definition
| |-CXXRecordDecl 0x7f8ad9273d50 prev 0x7f8ad9271650 <col:5, col:12> col:12 implicit struct __raw
| |-FieldDecl 0x7f8ad9273ea8 <line:735:9, col:36> col:19 __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
| `-CXXDestructorDecl 0x7f8ad92aa9a8 <line:733:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial
|-CXXRecordDecl 0x7f8ad9271720 <line:738:5, line:746:5> line:738:12 struct __rep definition
| |-CXXRecordDecl 0x7f8ad9273a10 prev 0x7f8ad9271720 <col:5, col:12> col:12 implicit struct __rep
| |-CXXRecordDecl 0x7f8ad9273aa8 <line:740:9, line:745:9> line:740:9 union definition
| | |-FieldDecl 0x7f8ad9273c38 <line:742:13, col:21> col:21 __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| | |-FieldDecl 0x7f8ad9273c90 <line:743:13, col:21> col:21 __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| | |-FieldDecl 0x7f8ad9273f10 <line:744:13, col:21> col:21 __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| | `-CXXDestructorDecl 0x7f8ad92aaa88 <line:740:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-FieldDecl 0x7f8ad9273f78 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| |-IndirectFieldDecl 0x7f8ad9273fd0 <line:742:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| | |-Field 0x7f8ad9273f78 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | `-Field 0x7f8ad9273c38 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-IndirectFieldDecl 0x7f8ad9274020 <line:743:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| | |-Field 0x7f8ad9273f78 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | `-Field 0x7f8ad9273c90 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-IndirectFieldDecl 0x7f8ad9274070 <line:744:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| | |-Field 0x7f8ad9273f78 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | `-Field 0x7f8ad9273f10 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| `-CXXDestructorDecl 0x7f8ad92aa708 <line:738:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7f8ad927cb90 <line:748:5, col:46> col:46 __r_ '__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>':'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >'
|-AccessSpecDecl 0x7f8ad927cbd8 <line:750:1, col:7> col:1 public
|-VarDecl 0x7f8ad927cc10 <line:751:5, col:36> col:28 npos 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'const unsigned long' static cinit
| `-ImplicitCastExpr 0x7f8ad927cc80 <col:35, col:36> 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'const unsigned long' <IntegralCast>
|   `-UnaryOperator 0x7f8ad7981c70 <col:35, col:36> 'int' prefix '-'
|     `-IntegerLiteral 0x7f8ad7981c50 <col:36> 'int' 1
|-CXXConstructorDecl 0x7f8ad927cd58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, line:739:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:753:31 basic_string 'void (void)' noexcept-uninstantiated 0x7f8ad7981d30
| `-AlwaysInlineAttr 0x7f8ad927ce78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad927d030 <col:35, line:739:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:756:40 basic_string 'void (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)' noexcept-uninstantiated 0x7f8ad7981fa8
| |-ParmVarDecl 0x7f8ad927cef8 <col:53, col:75> col:75 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
| `-AlwaysInlineAttr 0x7f8ad927d138 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad927d238 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:763:5, col:43> col:5 used basic_string 'void (const class std::__1::basic_string<char> &)'
| `-ParmVarDecl 0x7f8ad927d190 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
|-CXXConstructorDecl 0x7f8ad927d4b0 <line:764:5, col:70> col:5 basic_string 'void (const class std::__1::basic_string<char> &, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)'
| |-ParmVarDecl 0x7f8ad927d308 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
| `-ParmVarDecl 0x7f8ad927d378 <col:45, col:67> col:67 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
|-CXXConstructorDecl 0x7f8ad927d6f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, line:739:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:768:5 used basic_string 'void (class std::__1::basic_string<char> &&) noexcept(is_nothrow_move_constructible<allocator_type>::value)'
| |-ParmVarDecl 0x7f8ad927d5b8 <col:18, col:33> col:33 __str 'class std::__1::basic_string<char> &&'
| `-AlwaysInlineAttr 0x7f8ad927d7f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad927d9f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:776:65> col:5 basic_string 'void (class std::__1::basic_string<char> &&, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)'
| |-ParmVarDecl 0x7f8ad927d850 <col:18, col:33> col:33 __str 'class std::__1::basic_string<char> &&'
| |-ParmVarDecl 0x7f8ad927d8c0 <col:40, col:62> col:62 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
| `-AlwaysInlineAttr 0x7f8ad927dab8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad927dc20 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:778:61> col:31 used basic_string 'void (const char *)'
| |-ParmVarDecl 0x7f8ad927db38 <col:44, col:58> col:58 __s 'const char *'
| `-AlwaysInlineAttr 0x7f8ad927dce0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad927df10 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:780:58> col:5 basic_string 'void (const char *, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7f8ad927dd38 <col:18, col:32> col:32 __s 'const char *'
| |-ParmVarDecl 0x7f8ad927ddd8 <col:37, col:55> col:55 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7f8ad927dfd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad927e190 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:782:50> col:5 used basic_string 'void (const char *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f8ad927e030 <col:18, col:32> col:32 __s 'const char *'
| |-ParmVarDecl 0x7f8ad927e0a0 <col:37, col:47> col:47 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad927e258 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad927e4e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:784:73> col:5 basic_string 'void (const char *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7f8ad927e2b0 <col:18, col:32> col:32 __s 'const char *'
| |-ParmVarDecl 0x7f8ad927e320 <col:37, col:47> col:47 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad927e390 <col:52, col:70> col:70 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7f8ad927e5b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad927e7b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:786:43> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, char)'
| |-ParmVarDecl 0x7f8ad927e608 <col:18, col:28> col:28 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad927e678 <col:33, col:40> col:40 __c 'char':'char'
| `-AlwaysInlineAttr 0x7f8ad927e878 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad927eb00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:788:66> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, char, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7f8ad927e8d0 <col:18, col:28> col:28 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad927e940 <col:33, col:40> col:40 __c 'char':'char'
| |-ParmVarDecl 0x7f8ad927e9b0 <col:45, col:63> col:63 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7f8ad927ebd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad927eee0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:789:5, line:790:54> line:789:5 basic_string 'void (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7f8ad927ec28 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad927ec98 <col:45, col:55> col:55 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad927ed08 <col:62, col:72> col:72 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad927ed78 <line:790:18, col:53> col:36 __a 'const class std::__1::allocator<char> &'
|-CXXConstructorDecl 0x7f8ad927f200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:793:54> line:792:5 basic_string 'void (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7f8ad927efc8 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad927f038 <col:45, col:55> col:55 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad927f0a8 <line:793:18, col:53> col:36 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7f8ad927f2d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f8ad927fbf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:794:5, line:798:121> line:796:9 basic_string
| |-TemplateTypeParmDecl 0x7f8ad927f318 <line:794:14, col:20> col:20 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7f8ad927fb50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:798:121> line:796:9 basic_string 'void (const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &, typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, void>::type *)' inline
|   |-ParmVarDecl 0x7f8ad927f3d8 <col:22, col:33> col:33 __t 'const _Tp &'
|   |-ParmVarDecl 0x7f8ad927f448 <col:38, col:48> col:48 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7f8ad927f4b8 <col:55, col:65> col:65 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7f8ad927f528 <line:797:22, col:65> col:44 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
|   `-ParmVarDecl 0x7f8ad927f9d0 <line:798:22, col:120> col:118 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, void>::type *'
|-CXXConstructorDecl 0x7f8ad927fe50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:800:34> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7f8ad927fd30 <col:18, col:30> col:30 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7f8ad927ff10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad9280110 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:802:57> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7f8ad927ff68 <col:18, col:30> col:30 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7f8ad927ffd8 <col:36, col:54> col:54 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7f8ad92801d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f8ad92804b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:803:5, line:805:67> col:9 basic_string
| |-TemplateTypeParmDecl 0x7f8ad9280220 <line:803:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7f8ad9280410 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:805:67> col:9 basic_string 'void (_InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x7f8ad92802b0 <col:22, col:37> col:37 __first '_InputIterator'
|   |-ParmVarDecl 0x7f8ad9280320 <col:46, col:61> col:61 __last '_InputIterator'
|   `-AlwaysInlineAttr 0x7f8ad9280518 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f8ad9280958 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:806:5, line:808:94> col:9 basic_string
| |-TemplateTypeParmDecl 0x7f8ad92805e8 <line:806:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7f8ad92808b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:808:94> col:9 basic_string 'void (_InputIterator, _InputIterator, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)'
|   |-ParmVarDecl 0x7f8ad9280680 <col:22, col:37> col:37 __first '_InputIterator'
|   |-ParmVarDecl 0x7f8ad92806f0 <col:46, col:61> col:61 __last '_InputIterator'
|   |-ParmVarDecl 0x7f8ad9280760 <col:69, col:91> col:91 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
|   `-AlwaysInlineAttr 0x7f8ad92809c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad9280d50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:811:47> col:5 basic_string 'void (initializer_list<char>)'
| |-ParmVarDecl 0x7f8ad9280c28 <col:18, col:43> col:43 __il 'initializer_list<char>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7f8ad9280e10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8ad9281090 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:813:70> col:5 basic_string 'void (initializer_list<char>, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7f8ad9280ee8 <col:18, col:43> col:43 __il 'initializer_list<char>':'class std::initializer_list<char>'
| |-ParmVarDecl 0x7f8ad9280f58 <col:49, col:67> col:67 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7f8ad9281158 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7f8ad92811d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:816:5, col:26> col:12 used ~basic_string 'void (void) noexcept' inline
|-CXXConversionDecl 0x7f8ad9281338 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:819:82> col:5 operator basic_string_view 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad92813e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9281530 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:821:5, col:54> col:19 operator= 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| `-ParmVarDecl 0x7f8ad9281468 <col:29, col:49> col:49 __str 'const class std::__1::basic_string<char> &'
|-FunctionTemplateDecl 0x7f8ad9281808 <line:824:5, line:827:69> col:19 operator=
| |-TemplateTypeParmDecl 0x7f8ad92815e0 <line:824:15, col:23> col:15 class depth 0 index 0
| | `-TemplateArgument type 'void'
| `-CXXMethodDecl 0x7f8ad9281770 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:827:69> col:19 operator= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
|   |-ParmVarDecl 0x7f8ad9281670 <col:29, col:41> col:41 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
|   `-AlwaysInlineAttr 0x7f8ad9281860 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9281a50 <col:35, line:739:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:830:19 operator= 'class std::__1::basic_string<char> &(class std::__1::basic_string<char> &&)' noexcept-uninstantiated 0x7f8ad7986958
| |-ParmVarDecl 0x7f8ad9281940 <col:29, col:44> col:44 __str 'class std::__1::basic_string<char> &&'
| `-AlwaysInlineAttr 0x7f8ad9281b48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9281cd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:833:98> col:45 operator= 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7f8ad9281bc8 <col:55, col:73> col:73 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-AlwaysInlineAttr 0x7f8ad9281d80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9281ee0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:834:5, col:43> col:19 operator= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| `-ParmVarDecl 0x7f8ad9281dd8 <col:29, col:40> col:40 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7f8ad9282120 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:837:106> col:19 operator= 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7f8ad9282018 <col:29, col:58> col:58 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7f8ad92821d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92822a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:856:43> line:855:14 begin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f8ad9282350 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9282428 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:859:49> line:858:20 begin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad92824d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9282540 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:862:52> line:861:14 end 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f8ad92825e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9282658 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:865:58> line:864:20 end 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad9282700 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92827f8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:869:41> line:868:22 rbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f8ad92828a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9282998 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:872:47> line:871:28 rbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad9282a40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9282ab0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:875:43> line:874:22 rend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f8ad9282b58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9282bc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:878:49> line:877:28 rend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad9282c70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9282ce0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:882:25> line:881:20 cbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad9282d88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928b400 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:885:23> line:884:20 cend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad928b4a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928b518 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:888:26> line:887:28 crbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad928b5c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928b630 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:891:24> line:890:28 crend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad928b6d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928b778 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:894:70> line:893:41 used size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad928b820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928b890 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:895:81> col:41 length 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad928b938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928b9a8 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:896:41 max_size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad928ba50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928bac0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:899:71> line:897:41 capacity 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad928bb68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928bd00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:901:5, col:46> col:10 resize 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7f8ad928bbc0 <col:17, col:27> col:27 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad928bc30 <col:32, col:43> col:43 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7f8ad928be90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:902:85> col:36 resize 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f8ad928bdc8 <col:43, col:53> col:53 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad928bf40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928c020 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:904:5, col:39> col:10 reserve 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| `-ParmVarDecl 0x7f8ad928bf98 <col:18, col:38> col:28 res_arg 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad928c0d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:906:47> col:10 shrink_to_fit 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7f8ad928c178 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928c1c0 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:908:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7f8ad928c268 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928c2b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:909:80> col:36 empty '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad928c358 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928c498 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:911:47 operator[] 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad928c3d0 <col:58, col:68> col:68 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad928c548 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928c6c8 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:912:47 operator[] 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7f8ad928c5c0 <col:58, col:68> col:68 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad928c778 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928c890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:914:5, col:39> col:21 at 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| `-ParmVarDecl 0x7f8ad928c7d0 <col:24, col:34> col:34 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad928ca10 <line:915:5, col:37> col:21 at 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| `-ParmVarDecl 0x7f8ad928c950 <col:24, col:34> col:34 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad928cb58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:917:105> col:45 operator+= 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7f8ad928cad0 <col:56, col:76> col:76 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f8ad928cc08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928cce8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:918:104> col:45 operator+= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7f8ad928cc60 <col:56, col:68> col:68 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7f8ad928cd98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928ce78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:919:103> col:45 operator+= 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7f8ad928cdf0 <col:56, col:74> col:74 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-AlwaysInlineAttr 0x7f8ad928cf28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928d008 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:920:113> col:45 operator+= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7f8ad928cf80 <col:56, col:67> col:67 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-AlwaysInlineAttr 0x7f8ad928d0b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928d250 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:922:112> col:45 operator+= 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7f8ad928d188 <col:56, col:85> col:85 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7f8ad928d300 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928d3e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:926:51> col:19 append 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7f8ad928d358 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f8ad928d490 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928d570 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:928:87> col:19 append 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7f8ad928d4e8 <col:26, col:38> col:38 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7f8ad928d620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928d890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:929:5, col:88> col:19 append 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f8ad928d678 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad928d6e8 <col:53, col:63> col:63 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad928d758 <col:70, col:84> col:80 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7f8ad928dff8 <line:930:5, line:937:77> col:19 append
| |-TemplateTypeParmDecl 0x7f8ad928d950 <line:930:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7f8ad928df60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:937:77> col:19 append 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7f8ad928dd38 <col:26, col:37> col:37 __t 'const _Tp &'
|   |-ParmVarDecl 0x7f8ad928dda8 <col:42, col:52> col:52 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7f8ad928de18 <col:59, col:73> col:69 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad928e280 <line:938:5, col:62> col:19 append 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f8ad928e0f8 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7f8ad928e168 <col:49, col:59> col:59 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad928e3d0 <line:939:5, col:47> col:19 append 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| `-ParmVarDecl 0x7f8ad928e348 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7f8ad928e610 <line:940:5, col:55> col:19 append 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7f8ad928e490 <col:26, col:36> col:36 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad928e500 <col:41, col:52> col:52 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FunctionTemplateDecl 0x7f8ad928e978 <line:941:5, line:943:77> col:19 __append_forward_unsafe
| |-TemplateTypeParmDecl 0x7f8ad928e6c8 <line:941:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7f8ad928e8e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:943:77> col:19 __append_forward_unsafe 'class std::__1::basic_string<char> &(_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7f8ad928e760 <col:43> col:59 '_ForwardIterator'
|   `-ParmVarDecl 0x7f8ad928e7d0 <col:61> col:77 '_ForwardIterator'
|-FunctionTemplateDecl 0x7f8ad928f138 <line:944:5, line:957:5> line:953:5 append
| |-TemplateTypeParmDecl 0x7f8ad928ea60 <line:944:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7f8ad928f0a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:957:5> line:953:5 append 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value || !__libcpp_string_gets_noexcept_iterator<_InputIterator>::value, class basic_string<char> &>::type (_InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7f8ad928ef10 <col:12, col:27> col:27 __first '_InputIterator'
|   |-ParmVarDecl 0x7f8ad928ef80 <col:36, col:51> col:51 __last '_InputIterator'
|   `-AlwaysInlineAttr 0x7f8ad928f198 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f8ad928f8f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:958:5, line:969:5> line:967:5 append
| |-TemplateTypeParmDecl 0x7f8ad928f268 <line:958:14, col:20> col:20 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7f8ad928f860 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:969:5> line:967:5 append 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && __libcpp_string_gets_noexcept_iterator<_ForwardIterator>::value, class basic_string<char> &>::type (_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7f8ad928f6d0 <col:12, col:29> col:29 __first '_ForwardIterator'
|   |-ParmVarDecl 0x7f8ad928f740 <col:38, col:55> col:55 __last '_ForwardIterator'
|   `-AlwaysInlineAttr 0x7f8ad928f958 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928fb80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:973:103> col:19 append 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7f8ad928fab8 <col:26, col:55> col:55 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7f8ad928fc30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928fd90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:976:5, col:34> col:10 push_back 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| `-ParmVarDecl 0x7f8ad928fc88 <col:20, col:31> col:31 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7f8ad928fe40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:978:19> col:10 pop_back 'void (void)'
| `-AlwaysInlineAttr 0x7f8ad928fee8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad928ffb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:979:53> col:47 front 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (void)'
| `-AlwaysInlineAttr 0x7f8ad9290058 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92900f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:980:55> col:47 front 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7f8ad9290198 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9290200 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:981:52> col:47 back 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (void)'
| `-AlwaysInlineAttr 0x7f8ad92902a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9290310 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:982:54> col:47 back 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7f8ad92903b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9290498 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:985:87> col:19 assign 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7f8ad9290410 <col:26, col:38> col:38 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7f8ad9290548 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9290628 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:987:77> col:19 assign 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7f8ad92905a0 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f8ad92906d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9290800 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:992:49> line:990:19 assign 'class std::__1::basic_string<char> &(class std::__1::basic_string<char> &&)' noexcept-uninstantiated 0x7f8ad798da80
| |-ParmVarDecl 0x7f8ad9290730 <col:26, col:41> col:41 str 'class std::__1::basic_string<char> &&'
| `-AlwaysInlineAttr 0x7f8ad92908f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9290ac8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:994:5, col:88> col:19 assign 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f8ad9290950 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad92909c0 <col:53, col:63> col:63 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad9290a30 <col:70, col:84> col:80 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7f8ad9291138 <line:995:5, line:1002:74> col:19 assign
| |-TemplateTypeParmDecl 0x7f8ad9290b88 <line:995:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7f8ad92910a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1002:74> col:19 assign 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7f8ad9290ec8 <col:26, col:38> col:38 __t 'const _Tp &'
|   |-ParmVarDecl 0x7f8ad9290f38 <col:43, col:53> col:53 pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7f8ad9290fa8 <col:58, col:70> col:68 n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad9291338 <line:1003:5, col:62> col:19 assign 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f8ad9291238 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7f8ad92912a8 <col:49, col:59> col:59 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad9291488 <line:1004:5, col:47> col:19 assign 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| `-ParmVarDecl 0x7f8ad9291400 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7f8ad9291648 <line:1005:5, col:55> col:19 assign 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7f8ad9291548 <col:26, col:36> col:36 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad92915b8 <col:41, col:52> col:52 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FunctionTemplateDecl 0x7f8ad9291cb8 <line:1006:5, line:1014:61> col:9 assign
| |-TemplateTypeParmDecl 0x7f8ad9291700 <line:1006:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7f8ad9291c20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1014:61> col:9 assign 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value || !__libcpp_string_gets_noexcept_iterator<_InputIterator>::value, class basic_string<char> &>::type (_InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7f8ad9291ad0 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x7f8ad9291b40 <col:40, col:55> col:55 __last '_InputIterator'
|-FunctionTemplateDecl 0x7f8ad9292338 <line:1015:5, line:1023:65> col:9 assign
| |-TemplateTypeParmDecl 0x7f8ad9291da0 <line:1015:14, col:20> col:20 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7f8ad92922a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1023:65> col:9 assign 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && __libcpp_string_gets_noexcept_iterator<_ForwardIterator>::value, class basic_string<char> &>::type (_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7f8ad9292150 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7f8ad92921c0 <col:42, col:59> col:59 __last '_ForwardIterator'
|-CXXMethodDecl 0x7f8ad9292570 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1026:103> col:19 assign 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7f8ad92924a8 <col:26, col:55> col:55 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7f8ad9292620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9292800 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1030:69> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7f8ad9292678 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad92926e8 <col:44, col:64> col:64 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f8ad92928b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9292a90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1032:113> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7f8ad9292910 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad9292980 <col:44, col:56> col:56 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7f8ad9292b48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f8ad9293208 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1033:5, line:1040:96> col:19 insert
| |-TemplateTypeParmDecl 0x7f8ad9292b90 <line:1033:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7f8ad9293170 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1040:96> col:19 insert 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7f8ad9292ea0 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7f8ad9292f38 <col:44, col:55> col:55 __t 'const _Tp &'
|   |-ParmVarDecl 0x7f8ad9292fa8 <col:60, col:70> col:70 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7f8ad9293018 <col:78, col:92> col:88 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad92935b0 <line:1041:5, col:107> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f8ad9293310 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad9293380 <col:44, col:64> col:64 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad9293400 <col:71, col:81> col:81 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad9293470 <col:89, col:103> col:99 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad92938a0 <line:1042:5, col:79> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f8ad9293688 <col:26, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad92936f8 <col:43, col:61> col:61 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7f8ad9293768 <col:66, col:76> col:76 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad9293af0 <line:1043:5, col:64> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7f8ad9293970 <col:26, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad92939e0 <col:43, col:61> col:61 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7f8ad9293dd0 <line:1044:5, col:72> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7f8ad9293bb8 <col:26, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad9293c28 <col:43, col:53> col:53 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad9293c98 <col:58, col:69> col:69 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7f8ad9294020 <line:1045:5, col:62> col:19 insert 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7f8ad9293ea0 <col:26, col:41> col:41 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| `-ParmVarDecl 0x7f8ad9293f10 <col:48, col:59> col:59 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7f8ad9294300 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1047:77> col:19 insert 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7f8ad92940e8 <col:26, col:41> col:41 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f8ad9294158 <col:48, col:58> col:58 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad92941c8 <col:63, col:74> col:74 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-AlwaysInlineAttr 0x7f8ad92943c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f8ad9294b48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1048:5, line:1056:83> col:9 insert
| |-TemplateTypeParmDecl 0x7f8ad9294408 <line:1048:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7f8ad9294ab0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1056:83> col:9 insert 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value || !__libcpp_string_gets_noexcept_iterator<_InputIterator>::value, iterator>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, _InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7f8ad9294890 <col:16, col:31> col:31 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7f8ad9294900 <col:38, col:53> col:53 __first '_InputIterator'
|   `-ParmVarDecl 0x7f8ad9294970 <col:62, col:77> col:77 __last '_InputIterator'
|-FunctionTemplateDecl 0x7f8ad9295358 <line:1057:5, line:1065:87> col:9 insert
| |-TemplateTypeParmDecl 0x7f8ad9294c38 <line:1057:14, col:20> col:20 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7f8ad92952c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1065:87> col:9 insert 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && __libcpp_string_gets_noexcept_iterator<_ForwardIterator>::value, iterator>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, _ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7f8ad92950a0 <col:16, col:31> col:31 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7f8ad9295110 <col:38, col:55> col:55 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7f8ad9295180 <col:64, col:81> col:81 __last '_ForwardIterator'
|-CXXMethodDecl 0x7f8ad9295660 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1069:69> line:1068:14 insert 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7f8ad9295458 <col:21, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f8ad9295548 <col:43, col:72> col:72 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7f8ad9295718 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92958f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1072:5, col:66> col:19 erase 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f8ad9295770 <col:25, col:43> col:35 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad92957e0 <col:46, col:62> col:56 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad9295ac0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1074:45> col:19 erase 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator)'
| |-ParmVarDecl 0x7f8ad92959b8 <col:25, col:40> col:40 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| `-AlwaysInlineAttr 0x7f8ad9295b70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9295d50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1076:70> col:19 erase 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator)'
| |-ParmVarDecl 0x7f8ad9295bc8 <col:25, col:40> col:40 __first 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f8ad9295c38 <col:49, col:64> col:64 __last 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| `-AlwaysInlineAttr 0x7f8ad9295e08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9296070 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1079:86> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7f8ad9295e60 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad9295ed0 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad9295f40 <col:61, col:81> col:81 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f8ad9296130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92963a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1081:137> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7f8ad9296188 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad92961f8 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad9296268 <col:61, col:73> col:73 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7f8ad9296460 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92967e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1082:5, col:125> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f8ad92964b8 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad9296528 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad9296598 <col:61, col:81> col:81 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad9296608 <col:88, col:98> col:98 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad9296678 <col:106, col:121> col:116 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7f8ad9296fb8 <line:1083:5, line:1090:114> col:19 replace
| |-TemplateTypeParmDecl 0x7f8ad92968b0 <line:1083:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7f8ad9296f20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1090:114> col:19 replace 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7f8ad9296bc0 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7f8ad9296c30 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7f8ad9296cc8 <col:61, col:72> col:72 __t 'const _Tp &'
|   |-ParmVarDecl 0x7f8ad9296d38 <col:77, col:87> col:87 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7f8ad9296da8 <col:95, col:110> col:105 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad9297360 <line:1091:5, col:97> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f8ad92970c8 <col:27, col:37> col:37 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad9297138 <col:44, col:54> col:54 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad92971a8 <col:60, col:78> col:78 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f8ad9297218 <col:83, col:93> col:93 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-NoSanitizeAttr 0x7f8ad9297428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:425:69> unsigned-integer-overflow
|-CXXMethodDecl 0x7f8ad92976d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1092:5, col:81> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7f8ad92974b8 <col:27, col:37> col:37 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad9297528 <col:44, col:54> col:54 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad9297598 <col:60, col:78> col:78 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7f8ad9297a30 <line:1093:5, col:90> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7f8ad92977a0 <col:27, col:37> col:37 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad9297810 <col:44, col:54> col:54 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad9297880 <col:60, col:70> col:70 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad92978f0 <col:76, col:87> col:87 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-NoSanitizeAttr 0x7f8ad9297af8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:425:69> unsigned-integer-overflow
|-CXXMethodDecl 0x7f8ad9297da0 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1095:94> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7f8ad9297b88 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f8ad9297bf8 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f8ad9297c68 <col:69, col:89> col:89 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f8ad9297e60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92980d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1097:140> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7f8ad9297eb8 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f8ad9297f28 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f8ad9297f98 <col:69, col:81> col:81 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7f8ad9298190 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9298480 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1099:105> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f8ad92981e8 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f8ad9298258 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f8ad92982c8 <col:69, col:87> col:87 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f8ad9298338 <col:92, col:102> col:102 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad9298548 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92987b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1101:90> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7f8ad92985a0 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f8ad9298610 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f8ad9298680 <col:69, col:87> col:87 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-AlwaysInlineAttr 0x7f8ad9298870 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9298b60 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1103:98> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7f8ad92988c8 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f8ad9298938 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f8ad92989a8 <col:69, col:79> col:79 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad9298a18 <col:84, col:95> col:95 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-AlwaysInlineAttr 0x7f8ad9298c28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f8ad92992e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1104:5, line:1111:99> col:9 replace
| |-TemplateTypeParmDecl 0x7f8ad9298c70 <line:1104:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7f8ad9299250 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1111:99> col:9 replace 'typename enable_if<__is_input_iterator<_InputIterator>::value, class basic_string<char> &>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, _InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7f8ad9298fb0 <col:17, col:32> col:32 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7f8ad9299020 <col:38, col:53> col:53 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7f8ad9299090 <col:59, col:74> col:74 __j1 '_InputIterator'
|   `-ParmVarDecl 0x7f8ad9299100 <col:80, col:95> col:95 __j2 '_InputIterator'
|-CXXMethodDecl 0x7f8ad9299680 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1115:63> line:1114:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7f8ad92993f0 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f8ad9299460 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f8ad9299548 <col:69, col:98> col:98 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7f8ad9299740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9299990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1118:5, col:73> col:15 copy 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7f8ad92997c8 <col:20, col:32> col:32 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f8ad9299838 <col:37, col:47> col:47 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad92998a8 <col:52, col:70> col:62 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad9299be0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1120:68> col:18 substr 'class std::__1::basic_string<char> (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7f8ad9299a60 <col:25, col:43> col:35 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad9299ad0 <col:46, col:62> col:56 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad9299c98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9299df8 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1123:10 swap 'void (class std::__1::basic_string<char> &) noexcept'
| |-ParmVarDecl 0x7f8ad9299cf0 <col:15, col:29> col:29 __str 'class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f8ad9299ea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad9299f48 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1132:62> col:23 c_str 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad9299ff0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929a060 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1134:96> col:23 data 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad929a108 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929a1d8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1141:70> col:20 get_allocator 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad929a280 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929a468 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1144:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929a2d8 <col:20, col:40> col:40 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad929a348 <col:47, col:65> col:57 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929a520 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929a6c8 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1146:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929a578 <col:20, col:32> col:32 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7f8ad929a5e8 <col:38, col:56> col:48 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929a780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929a9a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1147:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1147:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929a7d8 <col:20, col:38> col:38 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f8ad929a848 <col:43, col:53> col:53 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad929a8b8 <col:60, col:70> col:70 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad929abc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1149:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929aa78 <col:20, col:38> col:38 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f8ad929aae8 <col:43, col:61> col:53 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929ac80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929ae28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1150:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1150:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929acd8 <col:20, col:31> col:31 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-ParmVarDecl 0x7f8ad929ad48 <col:36, col:54> col:46 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad929aff8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1153:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929aef0 <col:21, col:41> col:41 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad929af60 <col:48, col:66> col:58 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929b0b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929b210 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1155:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929b108 <col:21, col:33> col:33 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7f8ad929b178 <col:39, col:57> col:49 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929b2c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929b4a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1156:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1156:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929b320 <col:21, col:39> col:39 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f8ad929b390 <col:44, col:54> col:54 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad929b400 <col:61, col:71> col:71 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad929b678 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1158:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929b570 <col:21, col:39> col:39 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f8ad929b5e0 <col:44, col:62> col:54 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929b730 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929b890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1159:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1159:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929b788 <col:21, col:32> col:32 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-ParmVarDecl 0x7f8ad929b7f8 <col:37, col:55> col:47 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad929ba60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1162:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929b958 <col:29, col:49> col:49 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad929b9c8 <col:56, col:74> col:66 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929bb18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929bc78 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1164:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929bb70 <col:29, col:41> col:41 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7f8ad929bbe0 <col:47, col:65> col:57 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929bd30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929bf08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1165:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1165:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929bd88 <col:29, col:47> col:47 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f8ad929bdf8 <col:52, col:62> col:62 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad929be68 <col:69, col:79> col:79 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad929c0e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1167:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929bfd8 <col:29, col:47> col:47 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f8ad929c048 <col:52, col:70> col:62 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929c198 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929c2f8 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1169:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929c1f0 <col:29, col:40> col:40 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7f8ad929c260 <col:45, col:63> col:55 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929c3b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929c510 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1172:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929c408 <col:28, col:48> col:48 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad929c478 <col:55, col:73> col:65 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929c5c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929c728 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1174:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929c620 <col:28, col:40> col:40 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7f8ad929c690 <col:46, col:64> col:56 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929c7e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929c9b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1175:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1175:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929c838 <col:28, col:46> col:46 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f8ad929c8a8 <col:51, col:61> col:61 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad929c918 <col:68, col:78> col:78 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad929cb90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1177:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929ca88 <col:28, col:46> col:46 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f8ad929caf8 <col:51, col:69> col:61 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929cc48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929cda8 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1179:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929cca0 <col:28, col:39> col:39 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7f8ad929cd10 <col:44, col:62> col:54 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929ce60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929cfc0 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1182:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929ceb8 <col:33, col:53> col:53 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad929cf28 <col:60, col:78> col:70 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929d078 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929d1d8 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1184:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929d0d0 <col:33, col:45> col:45 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7f8ad929d140 <col:51, col:69> col:61 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929d290 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929d468 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1185:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1185:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929d2e8 <col:33, col:51> col:51 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f8ad929d358 <col:56, col:66> col:66 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad929d3c8 <col:73, col:83> col:83 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad929d640 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1187:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929d538 <col:33, col:51> col:51 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f8ad929d5a8 <col:56, col:74> col:66 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929d6f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929d858 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1189:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929d750 <col:33, col:44> col:44 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7f8ad929d7c0 <col:49, col:67> col:59 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929d910 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929da70 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1192:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929d968 <col:32, col:52> col:52 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad929d9d8 <col:59, col:77> col:69 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929db28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929dc88 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1194:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929db80 <col:32, col:44> col:44 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7f8ad929dbf0 <col:50, col:68> col:60 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929dd40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929df18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1195:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1195:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929dd98 <col:32, col:50> col:50 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f8ad929de08 <col:55, col:65> col:65 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad929de78 <col:72, col:82> col:82 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad929e0f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1197:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929dfe8 <col:32, col:50> col:50 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f8ad929e058 <col:55, col:73> col:65 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929e1a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929e308 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1199:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f8ad929e200 <col:32, col:43> col:43 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7f8ad929e270 <col:48, col:66> col:58 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad929e3c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929e530 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1202:9 compare 'int (const class std::__1::basic_string<char> &) const noexcept'
| |-ParmVarDecl 0x7f8ad929e418 <col:17, col:37> col:37 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f8ad929e5e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929e710 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1204:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view) const noexcept'
| |-ParmVarDecl 0x7f8ad929e638 <col:17, col:29> col:29 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7f8ad929e7c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929e9e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1206:69> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view) const'
| |-ParmVarDecl 0x7f8ad929e818 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad929e888 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad929e8f8 <col:51, col:63> col:63 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7f8ad929eaa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929ed18 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1208:78> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &) const'
| |-ParmVarDecl 0x7f8ad929eb00 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad929eb70 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad929ebe0 <col:51, col:71> col:71 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f8ad929edd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad929f158 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1209:5, col:117> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7f8ad929ee30 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad929eea0 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad929ef10 <col:51, col:71> col:71 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad929ef80 <col:78, col:88> col:88 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad929eff0 <col:96, col:111> col:106 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7f8ad929f9d8 <line:1210:5, line:1217:106> col:9 compare
| |-TemplateTypeParmDecl 0x7f8ad929f228 <line:1210:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7f8ad929f940 <line:1211:5, line:1217:106> col:9 compare 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, int>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const' inline
|   |-ParmVarDecl 0x7f8ad929f5e0 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7f8ad929f650 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7f8ad929f6e8 <col:51, col:62> col:62 __t 'const _Tp &'
|   |-ParmVarDecl 0x7f8ad929f758 <col:67, col:77> col:77 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7f8ad929f7c8 <col:85, col:100> col:95 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-AlwaysInlineAttr 0x7f8ad929fa50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7f8ad929fc00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1218:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1218:9 compare 'int (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *) const noexcept'
| `-ParmVarDecl 0x7f8ad929fb30 <col:17, col:35> col:35 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7f8ad929fe88 <line:1219:5, col:74> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *) const'
| |-ParmVarDecl 0x7f8ad929fcc0 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad929fd30 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad929fda0 <col:51, col:69> col:69 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7f8ad92a01a8 <line:1220:5, col:90> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7f8ad929ff58 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad929ffc8 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad92a0038 <col:51, col:69> col:69 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7f8ad92a00a8 <col:74, col:84> col:84 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad92a0270 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1222:51> col:36 __invariants '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f8ad92a0318 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a0360 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1226:63> line:1225:10 __is_long '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad92a0408 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-AccessSpecDecl 0x7f8ad92a0450 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1237:1, col:8> col:1 private
|-CXXMethodDecl 0x7f8ad92a0508 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1240:31> line:1239:21 __alloc 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &(void) noexcept'
| `-AlwaysInlineAttr 0x7f8ad92a05b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a0658 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1243:31> line:1242:27 __alloc 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &(void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad92a0700 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a0828 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1270:63> line:1266:10 __set_short_size 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7f8ad92a0758 <col:27, col:37> col:37 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad92a08d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a0948 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1278:47> line:1274:15 __get_short_size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad92a09f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a0ad8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1285:41> line:1284:10 __set_long_size 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7f8ad92a0a48 <col:26, col:36> col:36 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad92a0b88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a0bf8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1288:42> line:1287:15 __get_long_size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad92a0ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a0d88 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1291:76> line:1290:10 __set_size 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7f8ad92a0cf8 <col:21, col:31> col:31 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad92a0e38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a0f20 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1295:55> line:1294:10 __set_long_cap 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7f8ad92a0e90 <col:25, col:35> col:35 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad92a0fd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a1040 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1298:67> line:1297:15 __get_long_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad92a10e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a1208 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1302:41> line:1301:10 __set_long_pointer 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer) noexcept'
| |-ParmVarDecl 0x7f8ad92a1140 <col:29, col:37> col:37 __p 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
| `-AlwaysInlineAttr 0x7f8ad92a12b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a1388 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1305:42> line:1304:13 __get_long_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer (void) noexcept'
| `-AlwaysInlineAttr 0x7f8ad92a1430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a14d8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1308:42> line:1307:19 __get_long_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad92a1580 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a15f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1311:82> line:1310:13 __get_short_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer (void) noexcept'
| `-AlwaysInlineAttr 0x7f8ad92a1698 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a1708 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1314:88> line:1313:19 __get_short_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad92a17b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a1820 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1317:76> line:1316:13 __get_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer (void) noexcept'
| `-AlwaysInlineAttr 0x7f8ad92a18c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a1938 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1320:76> line:1319:19 __get_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer (void) const noexcept'
| `-AlwaysInlineAttr 0x7f8ad92a19e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a1a28 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1328:9> line:1323:10 __zero 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7f8ad92a1ad0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f8ad92a1d10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1330:5, line:1333:48> line:1332:19 __align_it
| |-NonTypeTemplateParmDecl 0x7f8ad92a1b28 <line:1330:15, col:25> col:25 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long' depth 0 index 0 __a
| `-CXXMethodDecl 0x7f8ad92a1c78 <col:30, line:1333:48> line:1332:19 __align_it 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept' static
|   |-ParmVarDecl 0x7f8ad92a1ba8 <col:30, col:40> col:40 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-AlwaysInlineAttr 0x7f8ad92a1d68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-EnumDecl 0x7f8ad92a1e38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1334:5> col:5
| `-EnumConstantDecl 0x7f8ad92a1f00 <col:11, col:25> col:11 __alignment 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1334:5)'
|   `-ImplicitCastExpr 0x7f8ad92a1f50 <col:25> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7f8ad82b0210 <col:25> 'int' 16
|-CXXMethodDecl 0x7f8ad92a2008 <line:1335:5, line:1339:79> line:1336:15 __recommend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept' static
| |-ParmVarDecl 0x7f8ad92a1f78 <col:27, col:37> col:37 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad92a20b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a2320 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1341:5, line:1342:75> col:10 __init 'void (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
| |-ParmVarDecl 0x7f8ad92a2110 <col:17, col:35> col:35 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f8ad92a2180 <col:40, col:50> col:50 __sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad92a21f0 <col:56, col:66> col:66 __reserve 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad92a2530 <line:1343:5, line:1344:54> col:10 __init 'void (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
| |-ParmVarDecl 0x7f8ad92a23f0 <col:17, col:35> col:35 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7f8ad92a2460 <col:40, col:50> col:50 __sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad92a26f8 <line:1345:5, line:1346:46> col:10 __init 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)' inline
| |-ParmVarDecl 0x7f8ad92a25f8 <col:17, col:27> col:27 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad92a2668 <col:32, col:43> col:43 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FunctionTemplateDecl 0x7f8ad92a2d08 <line:1348:5, line:1355:57> col:5 __init
| |-TemplateTypeParmDecl 0x7f8ad92a27b0 <line:1348:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7f8ad92a2c70 <line:1349:5, line:1355:57> col:5 __init 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value, void>::type (_InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7f8ad92a2ae0 <col:12, col:27> col:27 __first '_InputIterator'
|   `-ParmVarDecl 0x7f8ad92a2b50 <col:36, col:51> col:51 __last '_InputIterator'
|-FunctionTemplateDecl 0x7f8ad92a3348 <line:1357:5, line:1364:61> col:5 __init
| |-TemplateTypeParmDecl 0x7f8ad92a2df0 <line:1357:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7f8ad92a32b0 <line:1358:5, line:1364:61> col:5 __init 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value, void>::type (_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7f8ad92a3120 <col:12, col:29> col:29 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7f8ad92a3190 <col:38, col:55> col:55 __last '_ForwardIterator'
|-CXXMethodDecl 0x7f8ad92a3840 <line:1366:5, line:1367:85> line:1366:10 __grow_by 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f8ad92a3498 <col:20, col:30> col:30 __old_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad92a3508 <col:41, col:51> col:51 __delta_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad92a3578 <col:64, col:74> col:74 __old_sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad92a35e8 <line:1367:20, col:30> col:30 __n_copy 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad92a3658 <col:41, col:51> col:51 __n_del 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad92a36c8 <col:64, col:84> col:74 __n_add 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f8ad92a3d60 <line:1368:5, line:1370:82> line:1368:10 __grow_by_and_replace 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7f8ad92a3928 <col:32, col:42> col:42 __old_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad92a3998 <col:53, col:63> col:63 __delta_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad92a3a08 <col:76, col:86> col:86 __old_sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad92a3a78 <line:1369:32, col:42> col:42 __n_copy 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad92a3ae8 <col:53, col:63> col:63 __n_del 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8ad92a3b58 <line:1370:32, col:42> col:42 __n_add 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f8ad92a3bc8 <col:51, col:69> col:69 __p_new_stuff 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7f8ad92a3ed8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1373:40> col:10 __erase_to_end 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f8ad92a3e50 <col:25, col:35> col:35 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad92a3f88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a4068 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1378:89> line:1376:10 __copy_assign_alloc 'void (const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7f8ad92a3fe0 <col:30, col:50> col:50 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f8ad92a4118 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a42e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1405:9> line:1381:10 __copy_assign_alloc 'void (const class std::__1::basic_string<char> &, std::__1::true_type)'
| |-ParmVarDecl 0x7f8ad92a4170 <col:30, col:50> col:50 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad92a41d0 <col:57> col:66 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7f8ad92a4398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a4568 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1409:10> line:1408:10 __copy_assign_alloc 'void (const class std::__1::basic_string<char> &, std::__1::false_type) noexcept'
| |-ParmVarDecl 0x7f8ad92a43f0 <col:30, col:48> col:49 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad92a4450 <col:51> col:61 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7f8ad92a4620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a4800 <col:35, line:739:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1413:10 __move_assign 'void (class std::__1::basic_string<char> &, std::__1::false_type)' noexcept-uninstantiated 0x7f8ad82b2b58
| |-ParmVarDecl 0x7f8ad92a4678 <col:24, col:38> col:38 __str 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad92a46d8 <col:45> col:55 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7f8ad92a4910 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a4af0 <col:35, line:739:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1416:10 __move_assign 'void (class std::__1::basic_string<char> &, std::__1::true_type)' noexcept-uninstantiated 0x7f8ad82b2e28
| |-ParmVarDecl 0x7f8ad92a4968 <col:24, col:38> col:38 __str 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad92a49c8 <col:45> col:54 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7f8ad92a4c00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a4d30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1431:89> line:1426:5 __move_assign_alloc 'void (class std::__1::basic_string<char> &)' noexcept-uninstantiated 0x7f8ad82b3038
| |-ParmVarDecl 0x7f8ad92a4c58 <col:25, col:39> col:39 __str 'class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f8ad92a4e28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a4fc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1438:9> line:1434:10 __move_assign_alloc 'void (class std::__1::basic_string<char> &, std::__1::true_type)' noexcept-uninstantiated 0x7f8ad82b3278
| |-ParmVarDecl 0x7f8ad92a4e80 <col:30, col:44> col:44 __c 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad92a4ee0 <col:49> col:58 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7f8ad92a50d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a5268 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1443:10> line:1441:10 __move_assign_alloc 'void (class std::__1::basic_string<char> &, std::__1::false_type) noexcept'
| |-ParmVarDecl 0x7f8ad92a5128 <col:30, col:42> col:43 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f8ad92a5188 <col:45> col:55 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7f8ad92a5320 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a5368 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1445:63> col:36 __invalidate_all_iterators 'void (void)'
| `-AlwaysInlineAttr 0x7f8ad92a5410 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8ad92a54f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1446:73> col:36 __invalidate_iterators_past 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f8ad92a5468 <col:64> col:73 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f8ad92a55a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FriendDecl 0x7f8ad92a6170 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1448:5, col:77> col:25
| `-FunctionDecl 0x7f8ad92a5740 parent 0x7f8ad8a79368 prev 0x7f8ad92a5f20 <col:5, col:77> col:25 operator+ 'class std::__1::basic_string<char> (const class std::__1::basic_string<char> &, const class std::__1::basic_string<char> &)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7f8ad92a55f8 <col:37, col:55> col:56 'const class std::__1::basic_string<char> &'
|   `-ParmVarDecl 0x7f8ad92a5668 <col:58, col:76> col:77 'const class std::__1::basic_string<char> &'
|-FriendDecl 0x7f8ad92a6c68 <line:1449:5, col:75> col:25
| `-FunctionDecl 0x7f8ad92a6340 parent 0x7f8ad8a79368 prev 0x7f8ad92a6a50 <col:5, col:75> col:25 operator+ 'class std::__1::basic_string<char> (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, const class std::__1::basic_string<char> &)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7f8ad92a61b8 <col:37, col:53> col:54 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|   `-ParmVarDecl 0x7f8ad92a6228 <col:56, col:74> col:75 'const class std::__1::basic_string<char> &'
|-FriendDecl 0x7f8ad92a7720 <line:1450:5, col:68> col:25
| `-FunctionDecl 0x7f8ad92a6e30 parent 0x7f8ad8a79368 prev 0x7f8ad92a7540 <col:5, col:68> col:25 operator+ 'class std::__1::basic_string<char> (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, const class std::__1::basic_string<char> &)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7f8ad92a6cb0 <col:37> col:47 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|   `-ParmVarDecl 0x7f8ad92a6d20 <col:49, col:67> col:68 'const class std::__1::basic_string<char> &'
|-FriendDecl 0x7f8ad92a8228 <line:1451:5, col:75> col:25
| `-FunctionDecl 0x7f8ad92a78f0 parent 0x7f8ad8a79368 prev 0x7f8ad92a8070 <col:5, col:75> col:25 operator+ 'class std::__1::basic_string<char> (const class std::__1::basic_string<char> &, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7f8ad92a7768 <col:37, col:55> col:56 'const class std::__1::basic_string<char> &'
|   `-ParmVarDecl 0x7f8ad92a77d8 <col:58, col:74> col:75 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
`-FriendDecl 0x7f8ad92a8cf0 <line:1452:5, col:68> col:25
  `-FunctionDecl 0x7f8ad92a83f0 parent 0x7f8ad8a79368 prev 0x7f8ad92a8b70 <col:5, col:68> col:25 operator+ 'class std::__1::basic_string<char> (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
    |-TemplateArgument type 'char'
    |-TemplateArgument type 'struct std::__1::char_traits<char>'
    |-TemplateArgument type 'class std::__1::allocator<char>'
    |-ParmVarDecl 0x7f8ad92a8270 <col:37, col:55> col:56 'const class std::__1::basic_string<char> &'
    `-ParmVarDecl 0x7f8ad92a82e0 <col:58> col:68 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_string" = type { %"class.std::__1::__compressed_pair" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_string" = type { %"class.std::__1::__compressed_pair" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f8ad938b3d0 <object_model_refined/2_constructors/06_default_memberwise_initialization.cpp:3:1, line:10:1> line:3:8 referenced struct S definition
|-CXXRecordDecl 0x7f8ad938b4f8 <col:1, col:8> col:8 implicit referenced struct S
|-FieldDecl 0x7f8ad938b610 <line:4:5, col:17> col:17 referenced n 'std::size_t':'unsigned long'
|-FieldDecl 0x7f8ad938b6e0 <line:5:5, col:17> col:17 referenced s 'std::string':'class std::__1::basic_string<char>'
|-CXXConstructorDecl 0x7f8ad938b8c0 <line:7:5, col:65> col:14 used S 'void (const std::string &)'
| |-ParmVarDecl 0x7f8ad938b7b0 <col:16, col:35> col:35 used str 'const std::string &'
| |-CXXCtorInitializer Field 0x7f8ad938b610 'n' 'std::size_t':'unsigned long'
| | `-InitListExpr 0x7f8ad938bb90 <col:43, col:54> 'std::size_t':'unsigned long'
| |   `-CXXMemberCallExpr 0x7f8ad938baf8 <col:44, col:53> 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |     `-MemberExpr 0x7f8ad938bac0 <col:44, col:48> '<bound member function type>' .size 0x7f8ad928b778
| |       `-DeclRefExpr 0x7f8ad938ba98 <col:44> 'const std::string':'const class std::__1::basic_string<char>' lvalue ParmVar 0x7f8ad938b7b0 'str' 'const std::string &'
| |-CXXCtorInitializer Field 0x7f8ad938b6e0 's' 'std::string':'class std::__1::basic_string<char>'
| | `-CXXConstructExpr 0x7f8ad938bcc0 <col:57, col:62> 'std::string':'class std::__1::basic_string<char>' 'void (const class std::__1::basic_string<char> &)'
| |   `-DeclRefExpr 0x7f8ad938bc00 <col:59> 'const std::string':'const class std::__1::basic_string<char>' lvalue ParmVar 0x7f8ad938b7b0 'str' 'const std::string &'
| `-CompoundStmt 0x7f8ad938bd30 <col:64, col:65>
|-CXXDestructorDecl 0x7f8ad938b9c0 <line:9:5, col:18> col:5 used ~S 'void (void) noexcept' default
| `-CompoundStmt 0x7f8ad938c188 <col:18>
`-CXXConstructorDecl 0x7f8ad938bf18 <line:3:8> col:8 implicit used S 'void (const struct S &) noexcept(false)' inline default
  |-ParmVarDecl 0x7f8ad938c040 <col:8> col:8 used 'const struct S &'
  |-CXXCtorInitializer Field 0x7f8ad938b610 'n' 'std::size_t':'unsigned long'
  | `-ImplicitCastExpr 0x7f8ad938c3b0 <col:8> 'std::size_t':'unsigned long' <LValueToRValue>
  |   `-MemberExpr 0x7f8ad938c378 <col:8> 'const std::size_t':'const unsigned long' lvalue .n 0x7f8ad938b610
  |     `-DeclRefExpr 0x7f8ad938c350 <col:8> 'const struct S' lvalue ParmVar 0x7f8ad938c040 '' 'const struct S &'
  |-CXXCtorInitializer Field 0x7f8ad938b6e0 's' 'std::string':'class std::__1::basic_string<char>'
  | `-CXXConstructExpr 0x7f8ad938c4a0 <col:8> 'std::string':'class std::__1::basic_string<char>' 'void (const class std::__1::basic_string<char> &)'
  |   `-MemberExpr 0x7f8ad938c418 <col:8> 'const std::string':'const class std::__1::basic_string<char>' lvalue .s 0x7f8ad938b6e0
  |     `-DeclRefExpr 0x7f8ad938c3f0 <col:8> 'const struct S' lvalue ParmVar 0x7f8ad938c040 '' 'const struct S &'
  `-CompoundStmt 0x7f8ad938c510 <col:8>

Layout: <CGRecordLayout
  LLVMType:%struct.S = type { i64, %"class.std::__1::basic_string" }
  NonVirtualBaseLLVMType:%struct.S = type { i64, %"class.std::__1::basic_string" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1185:9)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1203:9)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]
