
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1507:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1504:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1507:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::once_flag
         0 |   unsigned long __state_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale::id
         0 |   struct std::__1::once_flag __flag_
         0 |     unsigned long __state_
         8 |   int32_t __id_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__basic_string_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>
         0 |   class std::__1::allocator<char> (base) (empty)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
         0 |   class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
         0 |     class std::__1::allocator<char> (base) (empty)
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<char>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |     class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
         0 |       class std::__1::allocator<char> (base) (empty)
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<wchar_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2>
         0 |   class std::__1::allocator<wchar_t> (base) (empty)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> >
         0 |   class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2> (base)
         0 |     class std::__1::allocator<wchar_t> (base) (empty)
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |           union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<wchar_t>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> > __r_
         0 |     class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2> (base)
         0 |       class std::__1::allocator<wchar_t> (base) (empty)
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |             union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::money_base::pattern
         0 |   char [4] field
           | [sizeof=4, dsize=4, align=1,
           |  nvsize=4, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__bitset<0, 0> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct B
         0 |   int n
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_mutex_t
         0 |   long __sig
         8 |   char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::mutex
         0 |   struct _opaque_pthread_mutex_t __m_
         0 |     long __sig
         8 |     char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::lock_guard<class std::__1::mutex>
         0 |   std::__1::lock_guard<class std::__1::mutex>::mutex_type & __m_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::ios_base
         0 |   (ios_base vtable pointer)
         8 |   std::__1::ios_base::fmtflags __fmtflags_
        16 |   std::__1::streamsize __precision_
        24 |   std::__1::streamsize __width_
        32 |   std::__1::ios_base::iostate __rdstate_
        36 |   std::__1::ios_base::iostate __exceptions_
        40 |   void * __rdbuf_
        48 |   void * __loc_
        56 |   std::__1::ios_base::event_callback * __fn_
        64 |   int * __index_
        72 |   size_t __event_size_
        80 |   size_t __event_cap_
        88 |   long * __iarray_
        96 |   size_t __iarray_size_
       104 |   size_t __iarray_cap_
       112 |   void ** __parray_
       120 |   size_t __parray_size_
       128 |   size_t __parray_cap_
           | [sizeof=136, dsize=136, align=8,
           |  nvsize=136, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ios<char>
         0 |   class std::__1::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     std::__1::ios_base::fmtflags __fmtflags_
        16 |     std::__1::streamsize __precision_
        24 |     std::__1::streamsize __width_
        32 |     std::__1::ios_base::iostate __rdstate_
        36 |     std::__1::ios_base::iostate __exceptions_
        40 |     void * __rdbuf_
        48 |     void * __loc_
        56 |     std::__1::ios_base::event_callback * __fn_
        64 |     int * __index_
        72 |     size_t __event_size_
        80 |     size_t __event_cap_
        88 |     long * __iarray_
        96 |     size_t __iarray_size_
       104 |     size_t __iarray_cap_
       112 |     void ** __parray_
       120 |     size_t __parray_size_
       128 |     size_t __parray_cap_
       136 |   basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       144 |   std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=152, dsize=148, align=8,
           |  nvsize=148, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_istream<char>
         0 |   (basic_istream vtable pointer)
         8 |   std::__1::streamsize __gc_
        16 |   class std::__1::basic_ios<char> (virtual base)
        16 |     class std::__1::ios_base (primary base)
        16 |       (ios_base vtable pointer)
        24 |       std::__1::ios_base::fmtflags __fmtflags_
        32 |       std::__1::streamsize __precision_
        40 |       std::__1::streamsize __width_
        48 |       std::__1::ios_base::iostate __rdstate_
        52 |       std::__1::ios_base::iostate __exceptions_
        56 |       void * __rdbuf_
        64 |       void * __loc_
        72 |       std::__1::ios_base::event_callback * __fn_
        80 |       int * __index_
        88 |       size_t __event_size_
        96 |       size_t __event_cap_
       104 |       long * __iarray_
       112 |       size_t __iarray_size_
       120 |       size_t __iarray_cap_
       128 |       void ** __parray_
       136 |       size_t __parray_size_
       144 |       size_t __parray_cap_
       152 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       160 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=168, dsize=164, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ostream<char>
         0 |   (basic_ostream vtable pointer)
         8 |   class std::__1::basic_ios<char> (virtual base)
         8 |     class std::__1::ios_base (primary base)
         8 |       (ios_base vtable pointer)
        16 |       std::__1::ios_base::fmtflags __fmtflags_
        24 |       std::__1::streamsize __precision_
        32 |       std::__1::streamsize __width_
        40 |       std::__1::ios_base::iostate __rdstate_
        44 |       std::__1::ios_base::iostate __exceptions_
        48 |       void * __rdbuf_
        56 |       void * __loc_
        64 |       std::__1::ios_base::event_callback * __fn_
        72 |       int * __index_
        80 |       size_t __event_size_
        88 |       size_t __event_cap_
        96 |       long * __iarray_
       104 |       size_t __iarray_size_
       112 |       size_t __iarray_cap_
       120 |       void ** __parray_
       128 |       size_t __parray_size_
       136 |       size_t __parray_cap_
       144 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       152 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=160, dsize=156, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_iostream<char>
         0 |   class std::__1::basic_istream<char> (primary base)
         0 |     (basic_istream vtable pointer)
         8 |     std::__1::streamsize __gc_
        16 |   class std::__1::basic_ostream<char> (base)
        16 |     (basic_ostream vtable pointer)
        24 |   class std::__1::basic_ios<char> (virtual base)
        24 |     class std::__1::ios_base (primary base)
        24 |       (ios_base vtable pointer)
        32 |       std::__1::ios_base::fmtflags __fmtflags_
        40 |       std::__1::streamsize __precision_
        48 |       std::__1::streamsize __width_
        56 |       std::__1::ios_base::iostate __rdstate_
        60 |       std::__1::ios_base::iostate __exceptions_
        64 |       void * __rdbuf_
        72 |       void * __loc_
        80 |       std::__1::ios_base::event_callback * __fn_
        88 |       int * __index_
        96 |       size_t __event_size_
       104 |       size_t __event_cap_
       112 |       long * __iarray_
       120 |       size_t __iarray_size_
       128 |       size_t __iarray_cap_
       136 |       void ** __parray_
       144 |       size_t __parray_size_
       152 |       size_t __parray_cap_
       160 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       168 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=176, dsize=172, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale
         0 |   class std::__1::locale::__imp * __locale_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_streambuf<char>
         0 |   (basic_streambuf vtable pointer)
         8 |   class std::__1::locale __loc_
         8 |     class std::__1::locale::__imp * __locale_
        16 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        24 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        32 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        40 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        48 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        56 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | __mbstate_t
         0 |   char [128] __mbstate8
         0 |   long long _mbstateL
           | [sizeof=128, dsize=128, align=8,
           |  nvsize=128, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >
         0 |   class std::__1::basic_streambuf<char> (primary base)
         0 |     (basic_streambuf vtable pointer)
         8 |     class std::__1::locale __loc_
         8 |       class std::__1::locale::__imp * __locale_
        16 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        24 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        32 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        40 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        48 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        56 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
        64 |   char * __extbuf_
        72 |   const char * __extbufnext_
        80 |   const char * __extbufend_
        88 |   char [8] __extbuf_min_
        96 |   size_t __ebs_
       104 |   std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       112 |   size_t __ibs_
       120 |   FILE * __file_
       128 |   const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       136 |   __mbstate_t __st_
       136 |     char [128] __mbstate8
       136 |     long long _mbstateL
       264 |   __mbstate_t __st_last_
       264 |     char [128] __mbstate8
       264 |     long long _mbstateL
       392 |   class ios_base::openmode __om_
       396 |   class ios_base::openmode __cm_
       400 |   _Bool __owns_eb_
       401 |   _Bool __owns_ib_
       402 |   _Bool __always_noconv_
           | [sizeof=408, dsize=403, align=8,
           |  nvsize=403, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >
         0 |   class std::__1::basic_iostream<char> (primary base)
         0 |     class std::__1::basic_istream<char> (primary base)
         0 |       (basic_istream vtable pointer)
         8 |       std::__1::streamsize __gc_
        16 |     class std::__1::basic_ostream<char> (base)
        16 |       (basic_ostream vtable pointer)
        24 |   class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > __sb_
        24 |     class std::__1::basic_streambuf<char> (primary base)
        24 |       (basic_streambuf vtable pointer)
        32 |       class std::__1::locale __loc_
        32 |         class std::__1::locale::__imp * __locale_
        40 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        48 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        56 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        64 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        72 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        80 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
        88 |     char * __extbuf_
        96 |     const char * __extbufnext_
       104 |     const char * __extbufend_
       112 |     char [8] __extbuf_min_
       120 |     size_t __ebs_
       128 |     std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       136 |     size_t __ibs_
       144 |     FILE * __file_
       152 |     const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       160 |     __mbstate_t __st_
       160 |       char [128] __mbstate8
       160 |       long long _mbstateL
       288 |     __mbstate_t __st_last_
       288 |       char [128] __mbstate8
       288 |       long long _mbstateL
       416 |     class ios_base::openmode __om_
       420 |     class ios_base::openmode __cm_
       424 |     _Bool __owns_eb_
       425 |     _Bool __owns_ib_
       426 |     _Bool __always_noconv_
       432 |   class std::__1::basic_ios<char> (virtual base)
       432 |     class std::__1::ios_base (primary base)
       432 |       (ios_base vtable pointer)
       440 |       std::__1::ios_base::fmtflags __fmtflags_
       448 |       std::__1::streamsize __precision_
       456 |       std::__1::streamsize __width_
       464 |       std::__1::ios_base::iostate __rdstate_
       468 |       std::__1::ios_base::iostate __exceptions_
       472 |       void * __rdbuf_
       480 |       void * __loc_
       488 |       std::__1::ios_base::event_callback * __fn_
       496 |       int * __index_
       504 |       size_t __event_size_
       512 |       size_t __event_cap_
       520 |       long * __iarray_
       528 |       size_t __iarray_size_
       536 |       size_t __iarray_cap_
       544 |       void ** __parray_
       552 |       size_t __parray_size_
       560 |       size_t __parray_cap_
       568 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       576 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=584, dsize=580, align=8,
           |  nvsize=432, nvalign=8]

*** Dumping AST Record Layout
         0 | struct C
         0 |   struct B (base)
         0 |     int n
         4 |   unsigned char x
         5 |   unsigned char y
         8 |   class std::__1::mutex m
         8 |     struct _opaque_pthread_mutex_t __m_
         8 |       long __sig
        16 |       char [56] __opaque
        72 |   class std::__1::lock_guard<class std::__1::mutex> lg
        72 |     std::__1::lock_guard<class std::__1::mutex>::mutex_type & __m_
        80 |   class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > f1
        80 |     class std::__1::basic_iostream<char> (primary base)
        80 |       class std::__1::basic_istream<char> (primary base)
        80 |         (basic_istream vtable pointer)
        88 |         std::__1::streamsize __gc_
        96 |       class std::__1::basic_ostream<char> (base)
        96 |         (basic_ostream vtable pointer)
       104 |     class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > __sb_
       104 |       class std::__1::basic_streambuf<char> (primary base)
       104 |         (basic_streambuf vtable pointer)
       112 |         class std::__1::locale __loc_
       112 |           class std::__1::locale::__imp * __locale_
       120 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
       128 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
       136 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
       144 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
       152 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
       160 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
       168 |       char * __extbuf_
       176 |       const char * __extbufnext_
       184 |       const char * __extbufend_
       192 |       char [8] __extbuf_min_
       200 |       size_t __ebs_
       208 |       std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       216 |       size_t __ibs_
       224 |       FILE * __file_
       232 |       const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       240 |       __mbstate_t __st_
       240 |         char [128] __mbstate8
       240 |         long long _mbstateL
       368 |       __mbstate_t __st_last_
       368 |         char [128] __mbstate8
       368 |         long long _mbstateL
       496 |       class ios_base::openmode __om_
       500 |       class ios_base::openmode __cm_
       504 |       _Bool __owns_eb_
       505 |       _Bool __owns_ib_
       506 |       _Bool __always_noconv_
       512 |     class std::__1::basic_ios<char> (virtual base)
       512 |       class std::__1::ios_base (primary base)
       512 |         (ios_base vtable pointer)
       520 |         std::__1::ios_base::fmtflags __fmtflags_
       528 |         std::__1::streamsize __precision_
       536 |         std::__1::streamsize __width_
       544 |         std::__1::ios_base::iostate __rdstate_
       548 |         std::__1::ios_base::iostate __exceptions_
       552 |         void * __rdbuf_
       560 |         void * __loc_
       568 |         std::__1::ios_base::event_callback * __fn_
       576 |         int * __index_
       584 |         size_t __event_size_
       592 |         size_t __event_cap_
       600 |         long * __iarray_
       608 |         size_t __iarray_size_
       616 |         size_t __iarray_cap_
       624 |         void ** __parray_
       632 |         size_t __parray_size_
       640 |         size_t __parray_cap_
       648 |       basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       656 |       std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
       664 |   class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > f2
       664 |     class std::__1::basic_iostream<char> (primary base)
       664 |       class std::__1::basic_istream<char> (primary base)
       664 |         (basic_istream vtable pointer)
       672 |         std::__1::streamsize __gc_
       680 |       class std::__1::basic_ostream<char> (base)
       680 |         (basic_ostream vtable pointer)
       688 |     class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > __sb_
       688 |       class std::__1::basic_streambuf<char> (primary base)
       688 |         (basic_streambuf vtable pointer)
       696 |         class std::__1::locale __loc_
       696 |           class std::__1::locale::__imp * __locale_
       704 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
       712 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
       720 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
       728 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
       736 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
       744 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
       752 |       char * __extbuf_
       760 |       const char * __extbufnext_
       768 |       const char * __extbufend_
       776 |       char [8] __extbuf_min_
       784 |       size_t __ebs_
       792 |       std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       800 |       size_t __ibs_
       808 |       FILE * __file_
       816 |       const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       824 |       __mbstate_t __st_
       824 |         char [128] __mbstate8
       824 |         long long _mbstateL
       952 |       __mbstate_t __st_last_
       952 |         char [128] __mbstate8
       952 |         long long _mbstateL
      1080 |       class ios_base::openmode __om_
      1084 |       class ios_base::openmode __cm_
      1088 |       _Bool __owns_eb_
      1089 |       _Bool __owns_ib_
      1090 |       _Bool __always_noconv_
      1096 |     class std::__1::basic_ios<char> (virtual base)
      1096 |       class std::__1::ios_base (primary base)
      1096 |         (ios_base vtable pointer)
      1104 |         std::__1::ios_base::fmtflags __fmtflags_
      1112 |         std::__1::streamsize __precision_
      1120 |         std::__1::streamsize __width_
      1128 |         std::__1::ios_base::iostate __rdstate_
      1132 |         std::__1::ios_base::iostate __exceptions_
      1136 |         void * __rdbuf_
      1144 |         void * __loc_
      1152 |         std::__1::ios_base::event_callback * __fn_
      1160 |         int * __index_
      1168 |         size_t __event_size_
      1176 |         size_t __event_cap_
      1184 |         long * __iarray_
      1192 |         size_t __iarray_size_
      1200 |         size_t __iarray_cap_
      1208 |         void ** __parray_
      1216 |         size_t __parray_size_
      1224 |         size_t __parray_cap_
      1232 |       basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
      1240 |       std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=1248, dsize=1248, align=8,
           |  nvsize=1248, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffee7524f48 </Users/tskull/Documents/Programming/Cpp/object_model_refined/2_constructors/11_member_initialization_list.cpp:5:1, line:9:1> line:5:8 referenced struct B definition
|-CXXRecordDecl 0x7ffee7525068 <col:1, col:8> col:8 implicit referenced struct B
|-FieldDecl 0x7ffee7525118 <line:6:5, col:9> col:9 n 'int'
|-CXXConstructorDecl 0x7ffee7525250 <line:8:5, col:22> col:5 used B 'void (int)'
| |-ParmVarDecl 0x7ffee7525178 <col:7, col:11> col:11 used n 'int'
| |-CXXCtorInitializer Field 0x7ffee7525118 'n' 'int'
| | `-ImplicitCastExpr 0x7ffee7525378 <col:18> 'int' <LValueToRValue>
| |   `-DeclRefExpr 0x7ffee7525320 <col:18> 'int' lvalue ParmVar 0x7ffee7525178 'n' 'int'
| `-CompoundStmt 0x7ffee75253c0 <col:21, col:22>
|-CXXConstructorDecl 0x7ffee752b858 <line:5:8> col:8 implicit constexpr B 'void (const struct B &)' inline default trivial noexcept-unevaluated 0x7ffee752b858
| `-ParmVarDecl 0x7ffee752b980 <col:8> col:8 'const struct B &'
|-CXXConstructorDecl 0x7ffee752ba18 <col:8> col:8 implicit constexpr B 'void (struct B &&)' inline default trivial noexcept-unevaluated 0x7ffee752ba18
| `-ParmVarDecl 0x7ffee752bb40 <col:8> col:8 'struct B &&'
|-CXXDestructorDecl 0x7ffee752bd38 <col:8> col:8 implicit ~B 'void (void) noexcept' inline default trivial
|-CXXMethodDecl 0x7ffee752c1b8 <col:8, <invalid sloc>> col:8 implicit operator= 'struct B &(const struct B &)' inline default trivial noexcept-unevaluated 0x7ffee752c1b8
| `-ParmVarDecl 0x7ffee752c2d0 <col:8> col:8 'const struct B &'
`-CXXMethodDecl 0x7ffee752c338 <col:8, <invalid sloc>> col:8 implicit operator= 'struct B &(struct B &&)' inline default trivial noexcept-unevaluated 0x7ffee752c338
  `-ParmVarDecl 0x7ffee752c450 <col:8> col:8 'struct B &&'

Layout: <CGRecordLayout
  LLVMType:%struct.B = type { i32 }
  NonVirtualBaseLLVMType:%struct.B = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffee780bcc0 </usr/include/sys/_pthread/_pthread_types.h:78:1, line:81:1> line:78:8 struct _opaque_pthread_mutex_t definition
|-CXXRecordDecl 0x7ffee780bde8 <col:1, col:8> col:8 implicit struct _opaque_pthread_mutex_t
|-FieldDecl 0x7ffee780be98 <line:79:2, col:7> col:7 __sig 'long'
|-FieldDecl 0x7ffee780bf20 <line:80:2, col:38> col:7 __opaque 'char [56]'
`-CXXDestructorDecl 0x7ffee8c1d9b8 <line:78:8> col:8 implicit ~_opaque_pthread_mutex_t 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%struct._opaque_pthread_mutex_t = type { i64, [56 x i8] }
  NonVirtualBaseLLVMType:%struct._opaque_pthread_mutex_t = type { i64, [56 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffee8c1cc18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:35:1, line:63:1> line:35:78 referenced class mutex definition
|-VisibilityAttr 0x7ffee8c1cd38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7ffee8c1cd80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:35:1, col:78> col:78 implicit referenced class mutex
|-FieldDecl 0x7ffee8c1ce28 <line:38:5, /usr/include/pthread.h:182:64> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:38:22 referenced __m_ 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
| `-InitListExpr 0x7ffee8c1db70 </usr/include/pthread.h:182:35, col:64> 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
|   |-ImplicitCastExpr 0x7ffee8c1dbc0 </usr/include/pthread_impl.h:41:34> 'long' <IntegralCast>
|   | `-IntegerLiteral 0x7ffee8c1da98 <col:34> 'int' 850045863
|   `-InitListExpr 0x7ffee8c1dbd8 </usr/include/pthread.h:182:61, col:63> 'char [56]'
|     |-array filler
|     | `-ImplicitValueInitExpr 0x7ffee8c1dc38 <<invalid sloc>> 'char'
|     `-ImplicitCastExpr 0x7ffee8c1dc18 <col:62> 'char' <IntegralCast>
|       `-IntegerLiteral 0x7ffee8c1dab8 <col:62> 'int' 0
|-AccessSpecDecl 0x7ffee8c1ce70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:43:1, col:7> col:1 public
|-CXXConstructorDecl 0x7ffee8c1cf40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:46:41> col:15 used constexpr mutex 'void (void) noexcept' default
| |-CXXCtorInitializer Field 0x7ffee8c1ce28 '__m_' 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
| | `-CXXDefaultInitExpr 0x7ffee752cf90 <col:15> 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
| |-CompoundStmt 0x7ffee752cfe0 <col:41>
| |-AlwaysInlineAttr 0x7ffee8c1cfe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee8c1d030 <col:51, col:74> Hidden
|-CXXDestructorDecl 0x7ffee8c1d090 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:50:5, col:12> col:5 used ~mutex 'void (void) noexcept'
|-AccessSpecDecl 0x7ffee8c1d130 <line:52:1, col:8> col:1 private
|-CXXConstructorDecl 0x7ffee8c1d260 <line:53:5, col:23> col:5 mutex 'void (const class std::__1::mutex &)'
| `-ParmVarDecl 0x7ffee8c1d198 <col:11, col:22> col:23 'const class std::__1::mutex &'
|-CXXMethodDecl 0x7ffee8c1d410 <line:54:5, col:34> col:12 operator= 'class std::__1::mutex &(const class std::__1::mutex &)'
| `-ParmVarDecl 0x7ffee8c1d320 <col:22, col:33> col:34 'const class std::__1::mutex &'
|-AccessSpecDecl 0x7ffee8c1d4b0 <line:56:1, col:7> col:1 public
|-CXXMethodDecl 0x7ffee8c1d4f8 <line:57:5, col:15> col:10 lock 'void (void)'
|-CXXMethodDecl 0x7ffee8c1d5b8 <line:58:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:58:10 try_lock '_Bool (void) noexcept'
|-CXXMethodDecl 0x7ffee8c1d678 <line:59:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:59:10 unlock 'void (void) noexcept'
|-TypedefDecl 0x7ffee8c1d720 <line:61:5, col:31> col:31 referenced native_handle_type 'std::__1::__libcpp_mutex_t *'
| `-PointerType 0x7ffee7a49760 'std::__1::__libcpp_mutex_t *'
|   `-TypedefType 0x7ffee7a49740 'std::__1::__libcpp_mutex_t' sugar
|     |-Typedef 0x7ffee7a48a58 '__libcpp_mutex_t'
|     `-TypedefType 0x7ffee8c154d0 'pthread_mutex_t' sugar
|       |-Typedef 0x7ffee8c0d780 'pthread_mutex_t'
|       `-TypedefType 0x7ffee8c0d750 '__darwin_pthread_mutex_t' sugar
|         |-Typedef 0x7ffee780e980 '__darwin_pthread_mutex_t'
|         `-ElaboratedType 0x7ffee780e930 'struct _opaque_pthread_mutex_t' sugar
|           `-RecordType 0x7ffee780bd60 'struct _opaque_pthread_mutex_t'
|             `-CXXRecord 0x7ffee780bcc0 '_opaque_pthread_mutex_t'
`-CXXMethodDecl 0x7ffee8c1d850 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:62:80> col:50 native_handle 'std::__1::mutex::native_handle_type (void)'
  |-CompoundStmt 0x7ffee8c1dcd0 <col:66, col:80>
  | `-ReturnStmt 0x7ffee8c1dcb8 <col:67, col:75>
  |   `-UnaryOperator 0x7ffee8c1dc98 <col:74, col:75> 'std::__1::__libcpp_mutex_t *' prefix '&'
  |     `-MemberExpr 0x7ffee8c1dc60 <col:75> 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t' lvalue ->__m_ 0x7ffee8c1ce28
  |       `-CXXThisExpr 0x7ffee8c1dc48 <col:75> 'class std::__1::mutex *' this
  |-AlwaysInlineAttr 0x7ffee8c1d8e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
  `-VisibilityAttr 0x7ffee8c1d930 <col:51, col:74> Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::mutex" = type { %struct._opaque_pthread_mutex_t }
  NonVirtualBaseLLVMType:%"class.std::__1::mutex" = type { %struct._opaque_pthread_mutex_t }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffee75257c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:83:1, line:106:1> line:85:1 class lock_guard definition
|-TemplateArgument type 'class std::__1::mutex'
|-CXXRecordDecl 0x7ffee7525a40 prev 0x7ffee75257c8 <line:84:1, line:85:1> col:1 implicit class lock_guard
|-AccessSpecDecl 0x7ffee7525ad8 <line:87:1, col:7> col:1 public
|-TypedefDecl 0x7ffee7525b38 <line:88:5, col:20> col:20 mutex_type 'class std::__1::mutex':'class std::__1::mutex'
| `-SubstTemplateTypeParmType 0x7ffee7525b00 'class std::__1::mutex' sugar
|   |-TemplateTypeParmType 0x7ffee8c1fbc0 '_Mutex' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7ffee8c1fb80 '_Mutex'
|   `-RecordType 0x7ffee8c1ccb0 'class std::__1::mutex'
|     `-CXXRecord 0x7ffee8c1cc18 'mutex'
|-AccessSpecDecl 0x7ffee7525b90 <line:90:1, col:8> col:1 private
|-FieldDecl 0x7ffee7525c18 <line:91:5, col:17> col:17 __m_ 'std::__1::lock_guard<class std::__1::mutex>::mutex_type &'
|-AccessSpecDecl 0x7ffee7525c60 <line:92:1, col:7> col:1 public
|-CXXConstructorDecl 0x7ffee7525da0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:96:34> line:95:14 used lock_guard 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |-ParmVarDecl 0x7ffee7525c98 <col:25, col:37> col:37 __m 'std::__1::lock_guard<class std::__1::mutex>::mutex_type &'
| `-AlwaysInlineAttr 0x7ffee7525e88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7ffee7526030 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:99:22> line:98:5 lock_guard 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &, struct std::__1::adopt_lock_t)'
| |-ParmVarDecl 0x7ffee7525ee0 <col:16, col:28> col:28 __m 'std::__1::lock_guard<class std::__1::mutex>::mutex_type &'
| |-ParmVarDecl 0x7ffee7525f40 <col:33> col:45 'struct std::__1::adopt_lock_t'
| `-AlwaysInlineAttr 0x7ffee75260f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7ffee7526170 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:101:89> col:5 used ~lock_guard 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7ffee7526220 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-AccessSpecDecl 0x7ffee7526268 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:103:1, col:8> col:1 private
|-CXXConstructorDecl 0x7ffee75263b0 <line:104:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:804:37> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:104:5 lock_guard 'void (const class std::__1::lock_guard<class std::__1::mutex> &)' delete trivial
| `-ParmVarDecl 0x7ffee75262c8 <col:16, col:32> col:33 'const class std::__1::lock_guard<class std::__1::mutex> &'
`-CXXMethodDecl 0x7ffee7526570 <line:105:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:804:37> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:105:17 operator= 'class std::__1::lock_guard<class std::__1::mutex> &(const class std::__1::lock_guard<class std::__1::mutex> &)' delete trivial
  `-ParmVarDecl 0x7ffee75264a8 <col:27, col:43> col:44 'const class std::__1::lock_guard<class std::__1::mutex> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::lock_guard" = type { %"class.std::__1::mutex"* }
  NonVirtualBaseLLVMType:%"class.std::__1::lock_guard" = type { %"class.std::__1::mutex"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffee7371760 prev 0x7ffee80acb20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, line:386:1> line:231:24 referenced class ios_base definition
|-VisibilityAttr 0x7ffee7371860 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7ffee73718a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, col:24> col:24 implicit referenced class ios_base
|-AccessSpecDecl 0x7ffee7371940 <line:233:1, col:7> col:1 public
|-CXXRecordDecl 0x7ffee7371998 <line:234:5, col:33> col:33 class failure
| `-VisibilityAttr 0x7ffee7371a50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:681:47, col:71> Default
|-TypedefDecl 0x7ffee7371ab0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:236:5, col:26> col:26 referenced fmtflags 'unsigned int'
| `-BuiltinType 0x7ffee7032c60 'unsigned int'
|-VarDecl 0x7ffee7371b40 <line:237:5, col:41> col:27 referenced boolalpha 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee7371bc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee7371ba0 <col:41> 'int' 1
|-VarDecl 0x7ffee7371c40 <line:238:5, col:41> col:27 referenced dec 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee7371cc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee7371ca0 <col:41> 'int' 2
|-VarDecl 0x7ffee7371d40 <line:239:5, col:41> col:27 referenced fixed 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee7371dc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee7371da0 <col:41> 'int' 4
|-VarDecl 0x7ffee7371e40 <line:240:5, col:41> col:27 referenced hex 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee7371ec0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee7371ea0 <col:41> 'int' 8
|-VarDecl 0x7ffee7371f40 <line:241:5, col:41> col:27 referenced internal 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee7371fc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee7371fa0 <col:41> 'int' 16
|-VarDecl 0x7ffee7372040 <line:242:5, col:41> col:27 referenced left 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee73720c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee73720a0 <col:41> 'int' 32
|-VarDecl 0x7ffee7372140 <line:243:5, col:41> col:27 referenced oct 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee73721c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee73721a0 <col:41> 'int' 64
|-VarDecl 0x7ffee7372240 <line:244:5, col:41> col:27 referenced right 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee73722c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee73722a0 <col:41> 'int' 128
|-VarDecl 0x7ffee7372340 <line:245:5, col:41> col:27 referenced scientific 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee73723c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee73723a0 <col:41> 'int' 256
|-VarDecl 0x7ffee7372440 <line:246:5, col:41> col:27 referenced showbase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee73724c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee73724a0 <col:41> 'int' 512
|-VarDecl 0x7ffee7372540 <line:247:5, col:41> col:27 referenced showpoint 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee73725c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee73725a0 <col:41> 'int' 1024
|-VarDecl 0x7ffee7372640 <line:248:5, col:41> col:27 referenced showpos 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee73726c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee73726a0 <col:41> 'int' 2048
|-VarDecl 0x7ffee7372740 <line:249:5, col:41> col:27 referenced skipws 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee73727c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee73727a0 <col:41> 'int' 4096
|-VarDecl 0x7ffee7372840 <line:250:5, col:41> col:27 referenced unitbuf 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee73728c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee73728a0 <col:41> 'int' 8192
|-VarDecl 0x7ffee7372940 <line:251:5, col:41> col:27 referenced uppercase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee73729c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee73729a0 <col:41> 'int' 16384
|-VarDecl 0x7ffee7372a40 <line:252:5, col:56> col:27 referenced adjustfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7ffee7372b88 <col:41, col:56> 'unsigned int' '|'
|   |-BinaryOperator 0x7ffee7372b20 <col:41, col:48> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7ffee7372af0 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7ffee7372aa0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7ffee7372040 'left' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7ffee7372b08 <col:48> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7ffee7372ac8 <col:48> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7ffee7372240 'right' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7ffee7372b70 <col:56> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7ffee7372b48 <col:56> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7ffee7371f40 'internal' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7ffee7372c18 <line:253:5, col:53> col:27 referenced basefield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7ffee7372d60 <col:41, col:53> 'unsigned int' '|'
|   |-BinaryOperator 0x7ffee7372cf8 <col:41, col:47> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7ffee7372cc8 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7ffee7372c78 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7ffee7371c40 'dec' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7ffee7372ce0 <col:47> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7ffee7372ca0 <col:47> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7ffee7372140 'oct' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7ffee7372d48 <col:53> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7ffee7372d20 <col:53> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7ffee7371e40 'hex' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7ffee7372df0 <line:254:5, col:54> col:27 referenced floatfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7ffee7372ed0 <col:41, col:54> 'unsigned int' '|'
|   |-ImplicitCastExpr 0x7ffee7372ea0 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | `-DeclRefExpr 0x7ffee7372e50 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7ffee7372340 'scientific' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7ffee7372eb8 <col:54> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7ffee7372e78 <col:54> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7ffee7371d40 'fixed' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-TypedefDecl 0x7ffee7372f68 <line:256:5, col:26> col:26 referenced iostate 'unsigned int'
| `-BuiltinType 0x7ffee7032c60 'unsigned int'
|-VarDecl 0x7ffee7372ff0 <line:257:5, col:36> col:26 referenced badbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee7373070 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee7373050 <col:36> 'int' 1
|-VarDecl 0x7ffee73730f0 <line:258:5, col:36> col:26 referenced eofbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee7373170 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee7373150 <col:36> 'int' 2
|-VarDecl 0x7ffee73731f0 <line:259:5, col:36> col:26 referenced failbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee7373270 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee7373250 <col:36> 'int' 4
|-VarDecl 0x7ffee73732f0 <line:260:5, col:36> col:26 referenced goodbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee7373370 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee7373350 <col:36> 'int' 0
|-TypedefDecl 0x7ffee73733f8 <line:262:5, col:26> col:26 referenced openmode 'unsigned int'
| `-BuiltinType 0x7ffee7032c60 'unsigned int'
|-VarDecl 0x7ffee7373480 <line:263:5, col:36> col:27 referenced app 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee7373500 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee73734e0 <col:36> 'int' 1
|-VarDecl 0x7ffee7373580 <line:264:5, col:36> col:27 referenced ate 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee7373600 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee73735e0 <col:36> 'int' 2
|-VarDecl 0x7ffee7373680 <line:265:5, col:36> col:27 referenced binary 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee7373700 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee73736e0 <col:36> 'int' 4
|-VarDecl 0x7ffee7373780 <line:266:5, col:36> col:27 referenced in 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee7373800 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee73737e0 <col:36> 'int' 8
|-VarDecl 0x7ffee7373880 <line:267:5, col:36> col:27 referenced out 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee7373900 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee73738e0 <col:36> 'int' 16
|-VarDecl 0x7ffee7373980 <line:268:5, col:36> col:27 referenced trunc 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffee7373a00 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffee73739e0 <col:36> 'int' 32
|-EnumDecl 0x7ffee7373a70 <line:270:5, col:32> col:10 referenced seekdir
| |-EnumConstantDecl 0x7ffee7373b30 <col:19> col:19 referenced beg 'enum std::__1::ios_base::seekdir'
| |-EnumConstantDecl 0x7ffee7373b80 <col:24> col:24 referenced cur 'enum std::__1::ios_base::seekdir'
| `-EnumConstantDecl 0x7ffee7373bd0 <col:29> col:29 referenced end 'enum std::__1::ios_base::seekdir'
|-TypedefDecl 0x7ffee7373c30 <line:273:5, col:26> col:26 io_state 'std::__1::ios_base::iostate':'unsigned int'
| `-TypedefType 0x7ffee7372fc0 'std::__1::ios_base::iostate' sugar
|   |-Typedef 0x7ffee7372f68 'iostate'
|   `-BuiltinType 0x7ffee7032c60 'unsigned int'
|-TypedefDecl 0x7ffee7373c98 <line:274:5, col:26> col:26 open_mode 'std::__1::ios_base::openmode':'unsigned int'
| `-TypedefType 0x7ffee7373450 'std::__1::ios_base::openmode' sugar
|   |-Typedef 0x7ffee73733f8 'openmode'
|   `-BuiltinType 0x7ffee7032c60 'unsigned int'
|-TypedefDecl 0x7ffee7373d00 <line:275:5, col:26> col:26 seek_dir 'enum std::__1::ios_base::seekdir'
| `-EnumType 0x7ffee7373b10 'enum std::__1::ios_base::seekdir'
|   `-Enum 0x7ffee7373a70 'seekdir'
|-TypedefDecl 0x7ffee7373e10 <line:277:5, col:30> col:30 streamoff 'std::__1::streamoff':'long long'
| `-ElaboratedType 0x7ffee7373da0 'std::__1::streamoff' sugar
|   `-TypedefType 0x7ffee72b2bb0 'std::__1::streamoff' sugar
|     |-Typedef 0x7ffee80bb558 'streamoff'
|     `-BuiltinType 0x7ffee7032c00 'long long'
|-TypedefDecl 0x7ffee7373ef0 <line:278:5, col:30> col:30 streampos 'std::__1::streampos':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7ffee7373e80 'std::__1::streampos' sugar
|   `-TypedefType 0x7ffee72b2c40 'std::__1::streampos' sugar
|     |-Typedef 0x7ffee80bb1b8 'streampos'
|     `-TemplateSpecializationType 0x7ffee80bb110 'fpos<mbstate_t>' sugar fpos
|       |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|       `-RecordType 0x7ffee80bb0f0 'class std::__1::fpos<__mbstate_t>'
|         `-ClassTemplateSpecialization 0x7ffee80bb000 'fpos'
|-CXXRecordDecl 0x7ffee7373f78 <line:281:5, col:28> col:28 class Init
| `-VisibilityAttr 0x7ffee7374030 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXMethodDecl 0x7ffee7374160 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:284:48> col:40 flags 'std::__1::ios_base::fmtflags (void) const'
| |-AlwaysInlineAttr 0x7ffee73741f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee7374240 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee7374380 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:285:62> col:40 flags 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7ffee7374290 <col:46, col:55> col:55 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7ffee7374420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee7374468 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee7374540 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:286:61> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7ffee73744b8 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7ffee73745e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee7374628 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee7374800 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:287:78> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags, std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7ffee7374678 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-ParmVarDecl 0x7ffee73746e8 <col:63, col:72> col:72 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7ffee73748a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee73748f0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee7374a00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:288:58> col:36 used unsetf 'void (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7ffee7374940 <col:43, col:52> col:52 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7ffee7374aa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee7374ae8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee7374ba0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:290:54> col:42 precision 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7ffee7374c38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee7374c80 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee7374d90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:291:69> col:42 precision 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7ffee7374cd0 <col:52, col:63> col:63 __prec 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7ffee7374e30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee7374e78 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee7374ed8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:292:50> col:42 width 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7ffee7374f70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee7374fb8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee7375090 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:293:65> col:42 width 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7ffee7375008 <col:48, col:59> col:59 __wide 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7ffee7375130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee7375178 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee7375220 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:296:5, col:37> col:12 referenced imbue 'class std::__1::locale (const class std::__1::locale &)'
| `-ParmVarDecl 0x7ffee7375198 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7ffee7375310 <line:297:5, col:21> col:12 referenced getloc 'class std::__1::locale (void) const'
|-CXXMethodDecl 0x7ffee73753d0 <line:300:5, col:23> col:16 xalloc 'int (void)' static
|-CXXMethodDecl 0x7ffee7375510 <line:301:5, col:28> col:11 iword 'long &(int)'
| `-ParmVarDecl 0x7ffee7375480 <col:17, col:21> col:21 __index 'int'
|-CXXMethodDecl 0x7ffee7375698 <line:302:5, col:29> col:12 pword 'void *&(int)'
| `-ParmVarDecl 0x7ffee73755c8 <col:18, col:22> col:22 __index 'int'
|-CXXDestructorDecl 0x7ffee7375788 <line:305:5, col:23> col:13 ~ios_base 'void (void) noexcept' virtual
|-EnumDecl 0x7ffee7375828 <line:308:5, col:58> col:10 referenced event
| |-EnumConstantDecl 0x7ffee73758e0 <col:18> col:18 referenced erase_event 'enum std::__1::ios_base::event'
| |-EnumConstantDecl 0x7ffee7375930 <col:31> col:31 imbue_event 'enum std::__1::ios_base::event'
| `-EnumConstantDecl 0x7ffee7375980 <col:44> col:44 referenced copyfmt_event 'enum std::__1::ios_base::event'
|-TypedefDecl 0x7ffee7375c50 <line:309:5, col:65> col:20 referenced event_callback 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-PointerType 0x7ffee7375be0 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
|   `-ParenType 0x7ffee7375b80 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' sugar
|     `-FunctionProtoType 0x7ffee7375b30 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' cdecl
|       |-BuiltinType 0x7ffee7032b20 'void'
|       |-EnumType 0x7ffee73758c0 'enum std::__1::ios_base::event'
|       | `-Enum 0x7ffee7375828 'event'
|       |-LValueReferenceType 0x7ffee7138c80 'class std::__1::ios_base &'
|       | `-RecordType 0x7ffee80acbc0 'class std::__1::ios_base'
|       |   `-CXXRecord 0x7ffee7371760 'ios_base'
|       `-BuiltinType 0x7ffee7032bc0 'int'
|-CXXMethodDecl 0x7ffee7375e70 <line:310:5, col:60> col:10 register_callback 'void (std::__1::ios_base::event_callback, int)'
| |-ParmVarDecl 0x7ffee7375ce0 <col:28, col:43> col:43 __fn 'std::__1::ios_base::event_callback':'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-ParmVarDecl 0x7ffee7375d58 <col:49, col:53> col:53 __index 'int'
|-AccessSpecDecl 0x7ffee7375f18 <line:312:1, col:8> col:1 private
|-CXXConstructorDecl 0x7ffee7376060 <line:313:5, col:29> col:5 ios_base 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7ffee7375f78 <col:14, col:28> col:29 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7ffee73761e0 <line:314:5, col:40> col:15 operator= 'class std::__1::ios_base &(const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7ffee7376120 <col:25, col:39> col:40 'const class std::__1::ios_base &'
|-AccessSpecDecl 0x7ffee7376280 <line:316:1, col:7> col:1 public
|-CXXMethodDecl 0x7ffee7376380 <line:317:5, col:51> col:17 sync_with_stdio '_Bool (_Bool)' static
| `-ParmVarDecl 0x7ffee73762b8 <col:33, col:47> col:38 __sync '_Bool' cinit
|   `-CXXBoolLiteralExpr 0x7ffee7378778 <col:47> '_Bool' true
|-CXXMethodDecl 0x7ffee73764a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:319:49> col:39 rdstate 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7ffee7376538 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee7376580 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee7376660 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:320:5, col:41> col:10 used clear 'void (std::__1::ios_base::iostate)'
| `-ParmVarDecl 0x7ffee73765a0 <col:16, col:34> col:24 __state 'std::__1::ios_base::iostate':'unsigned int' cinit
|   `-ImplicitCastExpr 0x7ffee73787b8 <col:34> 'std::__1::ios_base::iostate':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7ffee7378790 <col:34> 'const std::__1::ios_base::iostate':'const unsigned int' lvalue Var 0x7ffee73732f0 'goodbit' 'const std::__1::ios_base::iostate':'const unsigned int'
|-CXXMethodDecl 0x7ffee73767c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:321:60> col:36 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7ffee7376740 <col:45, col:53> col:53 __state 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7ffee7376868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee73768b0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee7376910 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:323:43> col:36 good '_Bool (void) const'
| |-AlwaysInlineAttr 0x7ffee73769a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee73769f0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee7376a50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:324:42> col:36 eof '_Bool (void) const'
| |-AlwaysInlineAttr 0x7ffee7376ae8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee7376b30 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee7376b90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:325:43> col:36 fail '_Bool (void) const'
| |-AlwaysInlineAttr 0x7ffee7376c28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee7376c70 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee7376cd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:326:42> col:36 bad '_Bool (void) const'
| |-AlwaysInlineAttr 0x7ffee7376d68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee7376db0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee7376e10 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:328:52> col:39 exceptions 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7ffee7376ea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee7376ef0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee7376fc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:329:64> col:36 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7ffee7376f40 <col:47, col:55> col:55 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7ffee7377068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee73770b0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee73770e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:331:5, col:44> col:10 __set_badbit_and_consider_rethrow 'void (void)'
|-CXXMethodDecl 0x7ffee7377198 <line:332:5, col:45> col:10 __set_failbit_and_consider_rethrow 'void (void)'
|-AccessSpecDecl 0x7ffee7377230 <line:334:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7ffee73772a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:337:16> line:336:5 ios_base 'void (void)'
| |-CompoundStmt 0x7ffee73787d0 <col:16, line:337:16>
| |-AlwaysInlineAttr 0x7ffee7377350 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee7377398 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee7377448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:339:5, col:25> col:10 referenced init 'void (void *)'
| `-ParmVarDecl 0x7ffee73773c0 <col:15, col:21> col:21 __sb 'void *'
|-CXXMethodDecl 0x7ffee7377578 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:340:64> col:33 rdbuf 'void *(void) const'
| |-CompoundStmt 0x7ffee7378868 <col:47, col:64>
| | `-ReturnStmt 0x7ffee7378850 <col:48, col:55>
| |   `-ImplicitCastExpr 0x7ffee7378838 <col:55> 'void *' <LValueToRValue>
| |     `-MemberExpr 0x7ffee7378800 <col:55> 'void *const' lvalue ->__rdbuf_ 0x7ffee7378188
| |       `-CXXThisExpr 0x7ffee73787e8 <col:55> 'const class std::__1::ios_base *' this
| |-AlwaysInlineAttr 0x7ffee7377610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7ffee7377658 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7ffee7377738 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:347:5> line:343:10 rdbuf 'void (void *)'
| |-ParmVarDecl 0x7ffee73776b0 <col:16, col:22> col:22 used __sb 'void *'
| |-CompoundStmt 0x7ffee73789e8 <line:344:5, line:347:5>
| | |-BinaryOperator 0x7ffee7378918 <line:345:9, col:20> 'void *' lvalue '='
| | | |-MemberExpr 0x7ffee73788a0 <col:9> 'void *' lvalue ->__rdbuf_ 0x7ffee7378188
| | | | `-CXXThisExpr 0x7ffee7378888 <col:9> 'class std::__1::ios_base *' this
| | | `-ImplicitCastExpr 0x7ffee7378900 <col:20> 'void *' <LValueToRValue>
| | |   `-DeclRefExpr 0x7ffee73788d8 <col:20> 'void *' lvalue ParmVar 0x7ffee73776b0 '__sb' 'void *'
| | `-CXXMemberCallExpr 0x7ffee7378990 <line:346:9, col:15> 'void'
| |   |-MemberExpr 0x7ffee7378958 <col:9> '<bound member function type>' ->clear 0x7ffee7376660
| |   | `-CXXThisExpr 0x7ffee7378940 <col:9> 'class std::__1::ios_base *' this
| |   `-CXXDefaultArgExpr 0x7ffee73789c8 <<invalid sloc>> 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7ffee73777d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7ffee7377820 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7ffee7377900 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:349:5, col:32> col:10 referenced __call_callbacks 'void (enum std::__1::ios_base::event)'
| `-ParmVarDecl 0x7ffee7377840 <col:27> col:32 'enum std::__1::ios_base::event'
|-CXXMethodDecl 0x7ffee7377a38 <line:350:5, col:33> col:10 referenced copyfmt 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7ffee73779b0 <col:18, col:32> col:33 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7ffee7377bb0 <line:351:5, col:24> col:10 referenced move 'void (class std::__1::ios_base &)'
| `-ParmVarDecl 0x7ffee7377ae8 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7ffee7377d28 <line:352:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:352:10 referenced swap 'void (class std::__1::ios_base &) noexcept'
| `-ParmVarDecl 0x7ffee7377c60 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7ffee7377e98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:358:5> line:355:10 referenced set_rdbuf 'void (void *)'
| |-ParmVarDecl 0x7ffee7377e10 <col:20, col:26> col:26 used __sb 'void *'
| |-CompoundStmt 0x7ffee7378ac8 <line:356:5, line:358:5>
| | `-BinaryOperator 0x7ffee7378aa0 <line:357:9, col:20> 'void *' lvalue '='
| |   |-MemberExpr 0x7ffee7378a28 <col:9> 'void *' lvalue ->__rdbuf_ 0x7ffee7378188
| |   | `-CXXThisExpr 0x7ffee7378a10 <col:9> 'class std::__1::ios_base *' this
| |   `-ImplicitCastExpr 0x7ffee7378a88 <col:20> 'void *' <LValueToRValue>
| |     `-DeclRefExpr 0x7ffee7378a60 <col:20> 'void *' lvalue ParmVar 0x7ffee7377e10 '__sb' 'void *'
| |-AlwaysInlineAttr 0x7ffee7377f38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7ffee7377f80 <col:48, col:71> Hidden
|-AccessSpecDecl 0x7ffee7377f90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:360:1, col:8> col:1 private
|-FieldDecl 0x7ffee7377fc8 <line:362:5, col:21> col:21 referenced __fmtflags_ 'std::__1::ios_base::fmtflags':'unsigned int'
|-FieldDecl 0x7ffee7378020 <line:363:5, col:21> col:21 referenced __precision_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7ffee7378078 <line:364:5, col:21> col:21 referenced __width_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7ffee73780d0 <line:365:5, col:21> col:21 referenced __rdstate_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7ffee7378128 <line:366:5, col:21> col:21 referenced __exceptions_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7ffee7378188 <line:367:5, col:21> col:21 referenced __rdbuf_ 'void *'
|-FieldDecl 0x7ffee73781e8 <line:368:5, col:21> col:21 __loc_ 'void *'
|-FieldDecl 0x7ffee7378298 <line:369:5, col:21> col:21 __fn_ 'std::__1::ios_base::event_callback *'
|-FieldDecl 0x7ffee73782f8 <line:370:5, col:21> col:21 __index_ 'int *'
|-FieldDecl 0x7ffee7378350 <line:371:5, col:21> col:21 __event_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7ffee73783a8 <line:372:5, col:21> col:21 __event_cap_ 'size_t':'unsigned long'
|-VarDecl 0x7ffee73784b8 <line:376:5, col:24> col:24 __xindex_ 'atomic<int>':'struct std::__1::atomic<int>' static
|-FieldDecl 0x7ffee7378530 <line:380:5, col:21> col:21 __iarray_ 'long *'
|-FieldDecl 0x7ffee7378588 <line:381:5, col:21> col:21 __iarray_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7ffee73785e0 <line:382:5, col:21> col:21 __iarray_cap_ 'size_t':'unsigned long'
|-FieldDecl 0x7ffee7378640 <line:383:5, col:21> col:21 __parray_ 'void **'
|-FieldDecl 0x7ffee7378698 <line:384:5, col:21> col:21 __parray_size_ 'size_t':'unsigned long'
`-FieldDecl 0x7ffee73786f0 <line:385:5, col:21> col:21 __parray_cap_ 'size_t':'unsigned long'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffee80b4ff8 parent 0x7ffee80aca88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:482:78> col:64 class basic_ios definition
|-public 'class std::__1::ios_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7ffee83df2e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7ffee83df3d8 prev 0x7ffee80b4ff8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:583:1, col:28> col:28 implicit class basic_ios
|-AccessSpecDecl 0x7ffee83df470 <line:586:1, col:7> col:1 public
|-TypedefDecl 0x7ffee83df4d8 <line:588:5, col:20> col:20 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7ffee83df4a0 'char' sugar
|   |-TemplateTypeParmType 0x7ffee7381d00 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7ffee7381cc0 '_CharT'
|   `-BuiltinType 0x7ffee7032b60 'char'
|-TypedefDecl 0x7ffee83df568 <line:589:5, col:21> col:21 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7ffee83df530 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7ffee7381d70 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7ffee7381d28 '_Traits'
|   `-RecordType 0x7ffee80b4f60 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7ffee72bd088 'char_traits'
|-TypedefDecl 0x7ffee83df670 <line:591:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7ffee83df620 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7ffee72bebd0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7ffee72bd3e8 'int_type'
|     `-BuiltinType 0x7ffee7032bc0 'int'
|-TypedefDecl 0x7ffee83df740 <line:592:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7ffee83df6f0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7ffee83d4090 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7ffee72bd4b8 'pos_type'
|     `-TypedefType 0x7ffee72b2c40 'std::__1::streampos' sugar
|       |-Typedef 0x7ffee80bb1b8 'streampos'
|       `-TemplateSpecializationType 0x7ffee80bb110 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7ffee80bb0f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7ffee80bb000 'fpos'
|-TypedefDecl 0x7ffee83df810 <line:593:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7ffee83df7c0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7ffee83d4180 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7ffee72bd450 'off_type'
|     `-TypedefType 0x7ffee72b2bb0 'std::__1::streamoff' sugar
|       |-Typedef 0x7ffee80bb558 'streamoff'
|       `-BuiltinType 0x7ffee7032c00 'long long'
|-CXXConversionDecl 0x7ffee83df868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:605:60> col:22 operator bool '_Bool (void) const'
| `-AlwaysInlineAttr 0x7ffee83df938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee83df988 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:608:69> col:32 operator! '_Bool (void) const'
| `-AlwaysInlineAttr 0x7ffee83dfa30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee83dfa78 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:609:81> col:35 rdstate 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7ffee83dfb20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee83dfbf0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:610:91> col:32 clear 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7ffee83dfb68 <col:38, col:56> col:46 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7ffee83dfca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee83dfd70 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:611:87> col:32 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7ffee83dfce8 <col:41, col:49> col:49 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7ffee83dfe20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee83dfe68 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:612:70> col:32 good '_Bool (void) const'
| `-AlwaysInlineAttr 0x7ffee83dff10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee83dff58 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:613:69> col:32 eof '_Bool (void) const'
| `-AlwaysInlineAttr 0x7ffee83e0000 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee83e0048 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:614:70> col:32 fail '_Bool (void) const'
| `-AlwaysInlineAttr 0x7ffee83e00f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee83e0138 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:615:69> col:32 bad '_Bool (void) const'
| `-AlwaysInlineAttr 0x7ffee83e01e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee83e0228 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:617:85> col:35 exceptions 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7ffee83e02d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee83e03a0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:618:95> col:32 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7ffee83e0318 <col:43, col:51> col:51 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7ffee83e0450 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXConstructorDecl 0x7ffee83e0700 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:622:68> col:14 basic_ios 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7ffee83e05b8 <col:24, col:64> col:64 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7ffee83e07c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7ffee83e0838 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:623:5, col:24> col:13 used ~basic_ios 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7ffee83e0a90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:627:50> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7ffee83e0b38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee83e0e70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:629:95> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7ffee83e0d28 <col:48, col:87> col:87 __tiestr 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7ffee83e0f20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee83e10e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:632:54> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7ffee83e1188 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee83e14c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:634:97> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7ffee83e1378 <col:52, col:93> col:93 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7ffee83e1570 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee83e16f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:636:5, col:46> col:16 copyfmt 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)'
| `-ParmVarDecl 0x7ffee83e1628 <col:24, col:41> col:41 __rhs 'const class std::__1::basic_ios<char> &'
|-CXXMethodDecl 0x7ffee83e17f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:639:22> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (void) const'
| `-AlwaysInlineAttr 0x7ffee83e1898 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee83e19f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:641:34> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7ffee83e18f0 <col:20, col:30> col:30 __ch 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7ffee83e1aa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee83e1b70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:644:37> col:12 imbue 'class std::__1::locale (const class std::__1::locale &)'
| |-ParmVarDecl 0x7ffee83e1ae8 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7ffee83e1c20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee83e1db0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:647:47> col:10 narrow 'char (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, char) const'
| |-ParmVarDecl 0x7ffee83e1c78 <col:17, col:27> col:27 __c 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| |-ParmVarDecl 0x7ffee83e1cd8 <col:32, col:37> col:37 __dfault 'char'
| `-AlwaysInlineAttr 0x7ffee83e1e68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee83e1f70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:649:31> col:15 widen 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (char) const'
| |-ParmVarDecl 0x7ffee83e1eb0 <col:21, col:26> col:26 __c 'char'
| `-AlwaysInlineAttr 0x7ffee83e2020 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-AccessSpecDecl 0x7ffee83e2068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:651:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7ffee83e20b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:654:17> line:653:5 basic_ios 'void (void)'
| `-AlwaysInlineAttr 0x7ffee83e2168 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee83e2370 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:656:60> col:10 init 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7ffee83e22a8 <col:15, col:56> col:56 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7ffee83e2420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee83e2540 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:659:31> col:10 move 'void (class std::__1::basic_ios<char> &)'
| |-ParmVarDecl 0x7ffee83e2478 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7ffee83e25f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee83e2740 <line:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:662:47> col:10 move 'void (class std::__1::basic_ios<char> &&)'
| |-ParmVarDecl 0x7ffee83e2678 <col:15, col:27> col:27 __rhs 'class std::__1::basic_ios<char> &&'
| `-AlwaysInlineAttr 0x7ffee83e27f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee83e2918 <line:709:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:665:10 swap 'void (class std::__1::basic_ios<char> &) noexcept'
| |-ParmVarDecl 0x7ffee83e2848 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7ffee83e29c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee83e2bd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:667:65> col:10 set_rdbuf 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7ffee83e2b08 <col:20, col:61> col:61 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7ffee83e2c80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-AccessSpecDecl 0x7ffee83e2cc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:668:1, col:8> col:1 private
|-FieldDecl 0x7ffee83e2de8 <line:669:5, col:44> col:44 __tie_ 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
|-FieldDecl 0x7ffee83e2e60 <line:670:6, col:23> col:23 __fill_ 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' mutable
|-CXXConstructorDecl 0x7ffee83e2ee8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:482:64> col:64 implicit basic_ios 'void (const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7ffee83e2ee8
| `-ParmVarDecl 0x7ffee83e3010 <col:64> col:64 'const class std::__1::basic_ios<char> &'
`-CXXMethodDecl 0x7ffee83e3078 <col:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7ffee83e3078
  `-ParmVarDecl 0x7ffee83e3150 <col:64> col:64 'const class std::__1::basic_ios<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ios" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffee80b5dc8 parent 0x7ffee80aca88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1681:82> col:64 class basic_istream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7ffee8559428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7ffee8559660 prev 0x7ffee80b5dc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:174:1, col:28> col:28 implicit class basic_istream
|-FieldDecl 0x7ffee85596f8 <line:177:5, col:16> col:16 __gc_ 'std::__1::streamsize':'long'
|-AccessSpecDecl 0x7ffee8559740 <line:178:1, col:7> col:1 public
|-TypedefDecl 0x7ffee8559778 <line:180:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7ffee85594f0 'char' sugar
|   |-TemplateTypeParmType 0x7ffee74a0120 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7ffee74a00d8 '_CharT'
|   `-BuiltinType 0x7ffee7032b60 'char'
|-TypedefDecl 0x7ffee85597e0 <line:181:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7ffee8559530 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7ffee74a0190 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7ffee74a0148 '_Traits'
|   `-RecordType 0x7ffee80b4f60 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7ffee72bd088 'char_traits'
|-TypedefDecl 0x7ffee85598f0 <line:182:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7ffee85598a0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7ffee72bebd0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7ffee72bd3e8 'int_type'
|     `-BuiltinType 0x7ffee7032bc0 'int'
|-TypedefDecl 0x7ffee85599c0 <line:183:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7ffee8559970 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7ffee83d4090 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7ffee72bd4b8 'pos_type'
|     `-TypedefType 0x7ffee72b2c40 'std::__1::streampos' sugar
|       |-Typedef 0x7ffee80bb1b8 'streampos'
|       `-TemplateSpecializationType 0x7ffee80bb110 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7ffee80bb0f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7ffee80bb000 'fpos'
|-TypedefDecl 0x7ffee8559a90 <line:184:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7ffee8559a40 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7ffee83d4180 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7ffee72bd450 'off_type'
|     `-TypedefType 0x7ffee72b2bb0 'std::__1::streamoff' sugar
|       |-Typedef 0x7ffee80bb558 'streamoff'
|       `-BuiltinType 0x7ffee7032c00 'long long'
|-CXXConstructorDecl 0x7ffee8559d10 <line:187:5, line:189:25> line:188:14 basic_istream 'void (basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7ffee8559c08 <col:28, col:69> col:69 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7ffee8559df8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXDestructorDecl 0x7ffee8559e70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:190:5, col:28> col:13 ~basic_istream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7ffee8559f20 <line:191:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7ffee855a070 <line:193:5, line:194:40> col:5 basic_istream 'void (class std::__1::basic_istream<char> &&)' inline
| |-ParmVarDecl 0x7ffee8559f88 <col:19, col:35> col:35 __rhs 'class std::__1::basic_istream<char> &&'
| `-AlwaysInlineAttr 0x7ffee855a130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7ffee855a280 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:198:5, line:199:51> col:20 operator= 'class std::__1::basic_istream<char> &(class std::__1::basic_istream<char> &&)' inline
| |-ParmVarDecl 0x7ffee855a1b8 <col:30, col:46> col:46 __rhs 'class std::__1::basic_istream<char> &&'
| `-AlwaysInlineAttr 0x7ffee855a330 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7ffee855a450 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:202:5, line:206:5> line:203:10 swap 'void (class std::__1::basic_istream<char> &)' inline
| |-ParmVarDecl 0x7ffee855a388 <col:15, col:30> col:30 __rhs 'class std::__1::basic_istream<char> &'
| `-AlwaysInlineAttr 0x7ffee855a500 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXConstructorDecl 0x7ffee855a670 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:209:5, col:65> col:5 basic_istream 'void (const class std::__1::basic_istream<char> &)' delete
| `-ParmVarDecl 0x7ffee855a588 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_istream<char> &'
|-CXXMethodDecl 0x7ffee855a800 <line:210:5, col:65> col:20 operator= 'class std::__1::basic_istream<char> &(const class std::__1::basic_istream<char> &)' delete
| `-ParmVarDecl 0x7ffee855a740 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_istream<char> &'
|-AccessSpecDecl 0x7ffee855a8b0 <line:212:1, col:7> col:1 public
|-CXXRecordDecl 0x7ffee855a8d8 <line:215:5, col:32> col:32 class sentry definition
| |-CXXRecordDecl 0x7ffee855edd0 prev 0x7ffee855a8d8 <line:292:1, col:60> col:60 implicit class sentry
| |-FieldDecl 0x7ffee855ee68 <line:294:5, col:10> col:10 __ok_ '_Bool'
| |-CXXConstructorDecl 0x7ffee855eff0 <line:296:5, col:25> col:5 sentry 'void (const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7ffee855eee8 <col:12, col:24> col:25 'const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x7ffee855f1b0 <line:297:5, col:36> col:13 operator= 'class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7ffee855f0e8 <col:23, col:35> col:36 'const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x7ffee855f260 <line:299:1, col:7> col:1 public
| |-CXXConstructorDecl 0x7ffee855f580 <line:300:5, col:82> col:14 sentry 'void (basic_istream<char, struct std::__1::char_traits<char> > &, _Bool)'
| | |-ParmVarDecl 0x7ffee855f3e8 <col:21, col:53> col:53 __is 'basic_istream<char, struct std::__1::char_traits<char> > &'
| | `-ParmVarDecl 0x7ffee855f448 <col:59, col:77> col:64 __noskipws '_Bool'
| `-CXXConversionDecl 0x7ffee855f648 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:305:45> col:9 operator bool '_Bool (void) const'
|   `-AlwaysInlineAttr 0x7ffee855f718 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee855ac10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:218:5, line:220:27> line:219:20 operator>> 'class std::__1::basic_istream<char> &(class std::__1::basic_istream<char> &(*)(class std::__1::basic_istream<char> &))' inline
| |-ParmVarDecl 0x7ffee855ab10 <col:31, col:68> col:48 __pf 'class std::__1::basic_istream<char> &(*)(class std::__1::basic_istream<char> &)'
| `-AlwaysInlineAttr 0x7ffee855acc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee855b130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:222:5, line:225:34> line:223:20 operator>> 'class std::__1::basic_istream<char> &(basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &))' inline
| |-ParmVarDecl 0x7ffee855b030 <col:31, line:224:73> col:33 __pf 'basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &)'
| `-AlwaysInlineAttr 0x7ffee855b1e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee855b330 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:227:5, line:229:34> line:228:20 operator>> 'class std::__1::basic_istream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))' inline
| |-ParmVarDecl 0x7ffee855b228 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x7ffee855b3e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee855b630 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:231:5, col:76> col:20 operator>> 'class std::__1::basic_istream<char> &(basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *)'
| `-ParmVarDecl 0x7ffee855b528 <col:31, col:72> col:72 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *'
|-CXXMethodDecl 0x7ffee855b7a0 <line:232:5, col:40> col:20 operator>> 'class std::__1::basic_istream<char> &(_Bool &)'
| `-ParmVarDecl 0x7ffee855b6e0 <col:31, col:37> col:37 __n '_Bool &'
|-CXXMethodDecl 0x7ffee855b910 <line:233:5, col:41> col:20 operator>> 'class std::__1::basic_istream<char> &(short &)'
| `-ParmVarDecl 0x7ffee855b850 <col:31, col:38> col:38 __n 'short &'
|-CXXMethodDecl 0x7ffee855ba80 <line:234:5, col:50> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned short &)'
| `-ParmVarDecl 0x7ffee855b9c0 <col:31, col:47> col:47 __n 'unsigned short &'
|-CXXMethodDecl 0x7ffee855bbf0 <line:235:5, col:39> col:20 operator>> 'class std::__1::basic_istream<char> &(int &)'
| `-ParmVarDecl 0x7ffee855bb30 <col:31, col:36> col:36 __n 'int &'
|-CXXMethodDecl 0x7ffee855bd60 <line:236:5, col:48> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned int &)'
| `-ParmVarDecl 0x7ffee855bca0 <col:31, col:45> col:45 __n 'unsigned int &'
|-CXXMethodDecl 0x7ffee855bed0 <line:237:5, col:40> col:20 operator>> 'class std::__1::basic_istream<char> &(long &)'
| `-ParmVarDecl 0x7ffee855be10 <col:31, col:37> col:37 __n 'long &'
|-CXXMethodDecl 0x7ffee855c040 <line:238:5, col:49> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned long &)'
| `-ParmVarDecl 0x7ffee855bf80 <col:31, col:46> col:46 __n 'unsigned long &'
|-CXXMethodDecl 0x7ffee855c1b0 <line:239:5, col:45> col:20 operator>> 'class std::__1::basic_istream<char> &(long long &)'
| `-ParmVarDecl 0x7ffee855c0f0 <col:31, col:42> col:42 __n 'long long &'
|-CXXMethodDecl 0x7ffee855c320 <line:240:5, col:54> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned long long &)'
| `-ParmVarDecl 0x7ffee855c260 <col:31, col:51> col:51 __n 'unsigned long long &'
|-CXXMethodDecl 0x7ffee855c490 <line:241:5, col:41> col:20 operator>> 'class std::__1::basic_istream<char> &(float &)'
| `-ParmVarDecl 0x7ffee855c3d0 <col:31, col:38> col:38 __f 'float &'
|-CXXMethodDecl 0x7ffee855c600 <line:242:5, col:42> col:20 operator>> 'class std::__1::basic_istream<char> &(double &)'
| `-ParmVarDecl 0x7ffee855c540 <col:31, col:39> col:39 __f 'double &'
|-CXXMethodDecl 0x7ffee855c770 <line:243:5, col:47> col:20 operator>> 'class std::__1::basic_istream<char> &(long double &)'
| `-ParmVarDecl 0x7ffee855c6b0 <col:31, col:44> col:44 __f 'long double &'
|-CXXMethodDecl 0x7ffee855c8e0 <line:244:5, col:41> col:20 operator>> 'class std::__1::basic_istream<char> &(void *&)'
| `-ParmVarDecl 0x7ffee855c820 <col:31, col:38> col:38 __p 'void *&'
|-CXXMethodDecl 0x7ffee855c990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:248:45> col:16 gcount 'std::__1::streamsize (void) const'
| `-AlwaysInlineAttr 0x7ffee855ca38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee855caf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:249:5, col:18> col:14 get 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type (void)'
|-CXXMethodDecl 0x7ffee855cce0 <line:251:5, line:257:5> line:252:20 get 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type &)' inline
| |-ParmVarDecl 0x7ffee855cbd8 <col:24, col:35> col:35 __c 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type &'
| `-AlwaysInlineAttr 0x7ffee855cd90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee855cf90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:259:5, line:261:48> line:260:20 get 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7ffee855ce18 <col:24, col:35> col:35 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7ffee855ce78 <col:40, col:51> col:51 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7ffee855d048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee855d2a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:263:5, col:71> col:20 get 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7ffee855d0a0 <col:24, col:35> col:35 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7ffee855d100 <col:40, col:51> col:51 __n 'std::__1::streamsize':'long'
| `-ParmVarDecl 0x7ffee855d170 <col:56, col:66> col:66 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7ffee855d560 <line:265:5, line:267:44> line:266:20 get 'class std::__1::basic_istream<char> &(basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &)' inline
| |-ParmVarDecl 0x7ffee855d458 <col:24, col:65> col:65 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &'
| `-AlwaysInlineAttr 0x7ffee855d610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee855d8e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:269:5, col:86> col:20 get 'class std::__1::basic_istream<char> &(basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7ffee855d758 <col:24, col:65> col:65 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &'
| `-ParmVarDecl 0x7ffee855d7c8 <col:71, col:81> col:81 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7ffee855da98 <line:271:5, line:273:52> line:272:20 getline 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7ffee855d9a8 <col:28, col:39> col:39 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7ffee855da08 <col:44, col:55> col:55 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7ffee855db50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee855dd10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:275:5, col:75> col:20 getline 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7ffee855dba8 <col:28, col:39> col:39 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7ffee855dc08 <col:44, col:55> col:55 __n 'std::__1::streamsize':'long'
| `-ParmVarDecl 0x7ffee855dc78 <col:60, col:70> col:70 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7ffee855df50 <line:277:5, col:82> col:20 ignore 'class std::__1::basic_istream<char> &(std::__1::streamsize, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type)'
| |-ParmVarDecl 0x7ffee855ddd0 <col:27, col:44> col:38 __n 'std::__1::streamsize':'long'
| `-ParmVarDecl 0x7ffee855de40 <col:47, col:81> col:56 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7ffee855e028 <line:278:5, col:19> col:14 peek 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type (void)'
|-CXXMethodDecl 0x7ffee855e1d0 <line:279:5, col:56> col:20 read 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7ffee855e0e0 <col:26, col:37> col:37 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7ffee855e140 <col:42, col:53> col:53 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7ffee855e3d0 <line:280:5, col:55> col:16 readsome 'std::__1::streamsize (std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7ffee855e298 <col:25, col:36> col:36 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7ffee855e2f8 <col:41, col:52> col:52 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7ffee855e5a0 <line:282:5, col:41> col:20 putback 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| `-ParmVarDecl 0x7ffee855e498 <col:28, col:38> col:38 __c 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7ffee855e6a0 <line:283:5, col:26> col:20 unget 'class std::__1::basic_istream<char> &(void)'
|-CXXMethodDecl 0x7ffee855e748 <line:284:5, col:14> col:9 sync 'int (void)'
|-CXXMethodDecl 0x7ffee855e860 <line:286:5, col:20> col:14 tellg 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::pos_type (void)'
|-CXXMethodDecl 0x7ffee855ea20 <line:287:5, col:40> col:20 seekg 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::pos_type)'
| `-ParmVarDecl 0x7ffee855e918 <col:26, col:35> col:35 __pos 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
`-CXXMethodDecl 0x7ffee855ec70 <line:288:5, col:65> col:20 seekg 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir)'
  |-ParmVarDecl 0x7ffee855eb00 <col:26, col:35> col:35 __off 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::off_type':'long long'
  `-ParmVarDecl 0x7ffee855eb60 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_istream" = type { i32 (...)**, i64, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_istream.base" = type { i32 (...)**, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffee80b60b8 parent 0x7ffee80aca88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:1085:82> col:64 class basic_ostream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7ffee74962d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7ffee7496510 prev 0x7ffee80b60b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:151:1, col:28> col:28 implicit class basic_ostream
|-AccessSpecDecl 0x7ffee74965a8 <line:154:1, col:7> col:1 public
|-TypedefDecl 0x7ffee74965e0 <line:156:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7ffee74963a0 'char' sugar
|   |-TemplateTypeParmType 0x7ffee8cd8530 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7ffee8cd84e8 '_CharT'
|   `-BuiltinType 0x7ffee7032b60 'char'
|-TypedefDecl 0x7ffee7496648 <line:157:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7ffee74963e0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7ffee8cd85a0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7ffee8cd8558 '_Traits'
|   `-RecordType 0x7ffee80b4f60 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7ffee72bd088 'char_traits'
|-TypedefDecl 0x7ffee7496750 <line:158:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7ffee7496700 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7ffee72bebd0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7ffee72bd3e8 'int_type'
|     `-BuiltinType 0x7ffee7032bc0 'int'
|-TypedefDecl 0x7ffee7496820 <line:159:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7ffee74967d0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7ffee83d4090 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7ffee72bd4b8 'pos_type'
|     `-TypedefType 0x7ffee72b2c40 'std::__1::streampos' sugar
|       |-Typedef 0x7ffee80bb1b8 'streampos'
|       `-TemplateSpecializationType 0x7ffee80bb110 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7ffee80bb0f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7ffee80bb000 'fpos'
|-TypedefDecl 0x7ffee74968f0 <line:160:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7ffee74968a0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7ffee83d4180 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7ffee72bd450 'off_type'
|     `-TypedefType 0x7ffee72b2bb0 'std::__1::streamoff' sugar
|       |-Typedef 0x7ffee80bb558 'streamoff'
|       `-BuiltinType 0x7ffee7032c00 'long long'
|-CXXConstructorDecl 0x7ffee7496b70 <line:163:5, line:165:25> line:164:14 basic_ostream 'void (basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7ffee7496a68 <col:28, col:69> col:69 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7ffee7496c30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXDestructorDecl 0x7ffee7496ca8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:166:5, col:28> col:13 ~basic_ostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7ffee7496d58 <line:167:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7ffee7496ea0 <line:169:5, line:170:40> col:5 basic_ostream 'void (class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7ffee7496db8 <col:19, col:35> col:35 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7ffee7496f60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7ffee74970b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:175:5, line:176:51> col:20 operator= 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7ffee7496fe8 <col:30, col:46> col:46 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7ffee7497160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7ffee7497280 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:178:5, line:180:55> line:179:10 swap 'void (class std::__1::basic_ostream<char> &)' inline
| |-ParmVarDecl 0x7ffee74971b8 <col:15, col:30> col:30 __rhs 'class std::__1::basic_ostream<char> &'
| `-AlwaysInlineAttr 0x7ffee7497330 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXConstructorDecl 0x7ffee74974a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:183:5, col:65> col:5 basic_ostream 'void (const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7ffee74973b8 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-CXXMethodDecl 0x7ffee7497630 <line:184:5, col:65> col:20 operator= 'class std::__1::basic_ostream<char> &(const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7ffee7497570 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-AccessSpecDecl 0x7ffee74976e0 <line:189:1, col:7> col:1 public
|-CXXRecordDecl 0x7ffee7497708 <line:192:5, col:32> col:32 class sentry definition
| |-CXXRecordDecl 0x7ffee749a590 prev 0x7ffee7497708 <line:242:1, col:60> col:60 implicit class sentry
| |-FieldDecl 0x7ffee749a628 <line:244:5, col:10> col:10 __ok_ '_Bool'
| |-FieldDecl 0x7ffee749a7c8 <line:245:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXConstructorDecl 0x7ffee749a950 <line:247:5, col:25> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7ffee749a848 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x7ffee749ab10 <line:248:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7ffee749aa48 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x7ffee749abc0 <line:250:1, col:7> col:1 public
| |-CXXConstructorDecl 0x7ffee749add0 <line:251:5, col:57> col:14 sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| | `-ParmVarDecl 0x7ffee749ace8 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXDestructorDecl 0x7ffee749aec0 <line:252:5, col:13> col:5 ~sentry 'void (void)' noexcept-unevaluated 0x7ffee749aec0
| `-CXXConversionDecl 0x7ffee749af70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:256:45> col:9 operator bool '_Bool (void) const'
|   `-AlwaysInlineAttr 0x7ffee749b048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee7497a40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:195:5, line:197:27> line:196:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &))' inline
| |-ParmVarDecl 0x7ffee7497940 <col:31, col:68> col:48 __pf 'class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &)'
| `-AlwaysInlineAttr 0x7ffee7497af0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee7497fd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:199:5, line:202:34> line:200:20 operator<< 'class std::__1::basic_ostream<char> &(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &))' inline
| |-ParmVarDecl 0x7ffee7497ed0 <col:31, line:201:72> col:33 __pf 'basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &)'
| `-AlwaysInlineAttr 0x7ffee7498080 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee74981d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:204:5, line:206:34> line:205:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))' inline
| |-ParmVarDecl 0x7ffee74980c8 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x7ffee7498280 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee7498390 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:208:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(_Bool)'
| `-ParmVarDecl 0x7ffee74982c8 <col:31, col:36> col:36 __n '_Bool'
|-CXXMethodDecl 0x7ffee7498500 <line:209:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(short)'
| `-ParmVarDecl 0x7ffee7498440 <col:31, col:37> col:37 __n 'short'
|-CXXMethodDecl 0x7ffee7498670 <line:210:5, col:49> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned short)'
| `-ParmVarDecl 0x7ffee74985b0 <col:31, col:46> col:46 __n 'unsigned short'
|-CXXMethodDecl 0x7ffee74987e0 <line:211:5, col:38> col:20 operator<< 'class std::__1::basic_ostream<char> &(int)'
| `-ParmVarDecl 0x7ffee7498720 <col:31, col:35> col:35 __n 'int'
|-CXXMethodDecl 0x7ffee7498950 <line:212:5, col:47> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned int)'
| `-ParmVarDecl 0x7ffee7498890 <col:31, col:44> col:44 __n 'unsigned int'
|-CXXMethodDecl 0x7ffee7498ac0 <line:213:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(long)'
| `-ParmVarDecl 0x7ffee7498a00 <col:31, col:36> col:36 __n 'long'
|-CXXMethodDecl 0x7ffee7498c30 <line:214:5, col:48> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long)'
| `-ParmVarDecl 0x7ffee7498b70 <col:31, col:45> col:45 __n 'unsigned long'
|-CXXMethodDecl 0x7ffee7498da0 <line:215:5, col:44> col:20 operator<< 'class std::__1::basic_ostream<char> &(long long)'
| `-ParmVarDecl 0x7ffee7498ce0 <col:31, col:41> col:41 __n 'long long'
|-CXXMethodDecl 0x7ffee7498f10 <line:216:5, col:53> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long long)'
| `-ParmVarDecl 0x7ffee7498e50 <col:31, col:50> col:50 __n 'unsigned long long'
|-CXXMethodDecl 0x7ffee7499080 <line:217:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(float)'
| `-ParmVarDecl 0x7ffee7498fc0 <col:31, col:37> col:37 __f 'float'
|-CXXMethodDecl 0x7ffee74991f0 <line:218:5, col:41> col:20 operator<< 'class std::__1::basic_ostream<char> &(double)'
| `-ParmVarDecl 0x7ffee7499130 <col:31, col:38> col:38 __f 'double'
|-CXXMethodDecl 0x7ffee7499360 <line:219:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(long double)'
| `-ParmVarDecl 0x7ffee74992a0 <col:31, col:43> col:43 __f 'long double'
|-CXXMethodDecl 0x7ffee74994d0 <line:220:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(const void *)'
| `-ParmVarDecl 0x7ffee7499410 <col:31, col:43> col:43 __p 'const void *'
|-CXXMethodDecl 0x7ffee7499780 <line:221:5, col:76> col:20 operator<< 'class std::__1::basic_ostream<char> &(basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)'
| `-ParmVarDecl 0x7ffee7499678 <col:31, col:72> col:72 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
|-CXXMethodDecl 0x7ffee7499940 <line:224:5, col:37> col:20 put 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type)'
| `-ParmVarDecl 0x7ffee7499840 <col:24, col:34> col:34 __c 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7ffee7499ba0 <line:225:5, col:62> col:20 write 'class std::__1::basic_ostream<char> &(const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7ffee7499a28 <col:26, col:43> col:43 __s 'const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7ffee7499a88 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7ffee7499cb0 <line:226:5, col:26> col:20 flush 'class std::__1::basic_ostream<char> &(void)'
|-CXXMethodDecl 0x7ffee7499e00 <line:229:5, line:230:20> col:14 tellp 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type (void)' inline
| `-AlwaysInlineAttr 0x7ffee7499ea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-CXXMethodDecl 0x7ffee749a000 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:231:5, line:232:40> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type)' inline
| |-ParmVarDecl 0x7ffee7499f00 <col:26, col:35> col:35 __pos 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-AlwaysInlineAttr 0x7ffee749a0b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-CXXMethodDecl 0x7ffee749a2a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:233:5, line:234:65> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir)' inline
| |-ParmVarDecl 0x7ffee749a130 <col:26, col:35> col:35 __off 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7ffee749a190 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-AlwaysInlineAttr 0x7ffee749a358 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-AccessSpecDecl 0x7ffee749a3a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:236:1, col:10> col:1 protected
`-CXXConstructorDecl 0x7ffee749a3e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:238:22> col:5 basic_ostream 'void (void)'
  `-AlwaysInlineAttr 0x7ffee749a4a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream.base" = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffee80b63a8 parent 0x7ffee80aca88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1683:83> col:64 class basic_iostream definition
|-public 'basic_istream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_istream<char>'
|-public 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7ffee8565da8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7ffee85660d8 prev 0x7ffee80b63a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1441:1, col:28> col:28 implicit class basic_iostream
|-AccessSpecDecl 0x7ffee8566170 <line:1445:1, col:7> col:1 public
|-TypedefDecl 0x7ffee85661a8 <line:1447:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7ffee8565e70 'char' sugar
|   |-TemplateTypeParmType 0x7ffee854d7d0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7ffee854d790 '_CharT'
|   `-BuiltinType 0x7ffee7032b60 'char'
|-TypedefDecl 0x7ffee8566210 <line:1448:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7ffee8565eb0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7ffee854d840 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7ffee854d7f8 '_Traits'
|   `-RecordType 0x7ffee80b4f60 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7ffee72bd088 'char_traits'
|-TypedefDecl 0x7ffee8566320 <line:1449:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7ffee85662d0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7ffee72bebd0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7ffee72bd3e8 'int_type'
|     `-BuiltinType 0x7ffee7032bc0 'int'
|-TypedefDecl 0x7ffee85663f0 <line:1450:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7ffee85663a0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7ffee83d4090 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7ffee72bd4b8 'pos_type'
|     `-TypedefType 0x7ffee72b2c40 'std::__1::streampos' sugar
|       |-Typedef 0x7ffee80bb1b8 'streampos'
|       `-TemplateSpecializationType 0x7ffee80bb110 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7ffee80bb0f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7ffee80bb000 'fpos'
|-TypedefDecl 0x7ffee85664c0 <line:1451:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7ffee8566470 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7ffee83d4180 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7ffee72bd450 'off_type'
|     `-TypedefType 0x7ffee72b2bb0 'std::__1::streamoff' sugar
|       |-Typedef 0x7ffee80bb558 'streamoff'
|       `-BuiltinType 0x7ffee7032c00 'long long'
|-CXXConstructorDecl 0x7ffee8566740 <line:1454:5, line:1457:6> line:1455:14 basic_iostream 'void (basic_streambuf<std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7ffee8566638 <col:29, col:70> col:70 __sb 'basic_streambuf<std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7ffee8566828 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXDestructorDecl 0x7ffee85668a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1459:5, col:29> col:13 used ~basic_iostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7ffee8566950 <line:1460:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7ffee8566aa0 <line:1462:5, line:1463:42> col:5 basic_iostream 'void (class std::__1::basic_iostream<char> &&)' inline
| |-ParmVarDecl 0x7ffee85669b8 <col:20, col:37> col:37 __rhs 'class std::__1::basic_iostream<char> &&'
| `-AlwaysInlineAttr 0x7ffee8566b60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7ffee8566cb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1468:5, line:1469:53> col:21 operator= 'class std::__1::basic_iostream<char> &(class std::__1::basic_iostream<char> &&)' inline
| |-ParmVarDecl 0x7ffee8566be8 <col:31, col:48> col:48 __rhs 'class std::__1::basic_iostream<char> &&'
| `-AlwaysInlineAttr 0x7ffee8566d60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7ffee74b34c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1471:5, line:1473:59> line:1472:10 swap 'void (class std::__1::basic_iostream<char> &)' inline
| |-ParmVarDecl 0x7ffee74b3400 <col:15, col:31> col:31 __rhs 'class std::__1::basic_iostream<char> &'
| `-AlwaysInlineAttr 0x7ffee74b3570 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-AccessSpecDecl 0x7ffee74b35b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1474:1, col:7> col:1 public
|-CXXConstructorDecl 0x7ffee74b3648 <line:1683:64> col:64 implicit basic_iostream 'void (const class std::__1::basic_iostream<char> &)' inline default_delete noexcept-unevaluated 0x7ffee74b3648
| `-ParmVarDecl 0x7ffee74b3770 <col:64> col:64 'const class std::__1::basic_iostream<char> &'
`-CXXMethodDecl 0x7ffee74b37d8 <col:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::basic_iostream<char> &(const class std::__1::basic_iostream<char> &)' inline default_delete noexcept-unevaluated 0x7ffee74b37d8
  `-ParmVarDecl 0x7ffee74b38f0 <col:64> col:64 'const class std::__1::basic_iostream<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_iostream" = type { %"class.std::__1::basic_istream.base", %"class.std::__1::basic_ostream.base", %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_iostream.base" = type { %"class.std::__1::basic_istream.base", %"class.std::__1::basic_ostream.base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffee83783c8 prev 0x7ffee8377c18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:62:1, line:123:1> line:62:24 referenced class locale definition
|-VisibilityAttr 0x7ffee83784c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7ffee8378510 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:62:1, col:24> col:24 implicit referenced class locale
|-AccessSpecDecl 0x7ffee83785a8 <line:64:1, col:7> col:1 public
|-CXXRecordDecl 0x7ffee8378600 <line:66:5, col:28> col:28 referenced class facet
| `-VisibilityAttr 0x7ffee83786c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7ffee8378738 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:67:5, col:28> col:28 referenced class id
| `-VisibilityAttr 0x7ffee83787f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-TypedefDecl 0x7ffee8378850 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:69:5, col:17> col:17 referenced category 'int'
| `-BuiltinType 0x7ffee7032bc0 'int'
|-VarDecl 0x7ffee83788e0 <line:70:5, line:71:20> col:9 none 'const std::__1::locale::category':'const int' static cinit
| `-IntegerLiteral 0x7ffee8378940 <col:20> 'int' 0
|-VarDecl 0x7ffee83789c8 <line:70:5, /usr/include/xlocale.h:45:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:72:9 referenced collate 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7ffee8378a90 </usr/include/xlocale.h:45:27, col:34> 'int'
|   `-BinaryOperator 0x7ffee8378a68 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7ffee8378a28 <col:28> 'int' 1
|     `-IntegerLiteral 0x7ffee8378a48 <col:33> 'int' 0
|-VarDecl 0x7ffee8378b18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:46:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:73:9 referenced ctype 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7ffee8378be0 </usr/include/xlocale.h:46:25, col:32> 'int'
|   `-BinaryOperator 0x7ffee8378bb8 <col:26, col:31> 'int' '<<'
|     |-IntegerLiteral 0x7ffee8378b78 <col:26> 'int' 1
|     `-IntegerLiteral 0x7ffee8378b98 <col:31> 'int' 1
|-VarDecl 0x7ffee8378c68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:48:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:74:9 referenced monetary 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7ffee8378d30 </usr/include/xlocale.h:48:27, col:34> 'int'
|   `-BinaryOperator 0x7ffee8378d08 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7ffee8378cc8 <col:28> 'int' 1
|     `-IntegerLiteral 0x7ffee8378ce8 <col:33> 'int' 3
|-VarDecl 0x7ffee8378db8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:49:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:75:9 referenced numeric 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7ffee8378e80 </usr/include/xlocale.h:49:27, col:34> 'int'
|   `-BinaryOperator 0x7ffee8378e58 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7ffee8378e18 <col:28> 'int' 1
|     `-IntegerLiteral 0x7ffee8378e38 <col:33> 'int' 4
|-VarDecl 0x7ffee8378f08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:50:31> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:76:9 referenced time 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7ffee8378fd0 </usr/include/xlocale.h:50:24, col:31> 'int'
|   `-BinaryOperator 0x7ffee8378fa8 <col:25, col:30> 'int' '<<'
|     |-IntegerLiteral 0x7ffee8378f68 <col:25> 'int' 1
|     `-IntegerLiteral 0x7ffee8378f88 <col:30> 'int' 5
|-VarDecl 0x7ffee8379058 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:47:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:77:9 referenced messages 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7ffee8379120 </usr/include/xlocale.h:47:27, col:34> 'int'
|   `-BinaryOperator 0x7ffee83790f8 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7ffee83790b8 <col:28> 'int' 1
|     `-IntegerLiteral 0x7ffee83790d8 <col:33> 'int' 2
|-VarDecl 0x7ffee83791a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, line:78:61> col:9 all 'const std::__1::locale::category':'const int' static cinit
| `-BinaryOperator 0x7ffee8379428 <col:15, col:61> 'int' '|'
|   |-BinaryOperator 0x7ffee83793c0 <col:15, col:54> 'int' '|'
|   | |-BinaryOperator 0x7ffee8379358 <col:15, col:44> 'int' '|'
|   | | |-BinaryOperator 0x7ffee83792f0 <col:15, col:33> 'int' '|'
|   | | | |-BinaryOperator 0x7ffee8379288 <col:15, col:25> 'int' '|'
|   | | | | |-ImplicitCastExpr 0x7ffee8379258 <col:15> 'std::__1::locale::category':'int' <LValueToRValue>
|   | | | | | `-DeclRefExpr 0x7ffee8379208 <col:15> 'const std::__1::locale::category':'const int' lvalue Var 0x7ffee83789c8 'collate' 'const std::__1::locale::category':'const int'
|   | | | | `-ImplicitCastExpr 0x7ffee8379270 <col:25> 'std::__1::locale::category':'int' <LValueToRValue>
|   | | | |   `-DeclRefExpr 0x7ffee8379230 <col:25> 'const std::__1::locale::category':'const int' lvalue Var 0x7ffee8378b18 'ctype' 'const std::__1::locale::category':'const int'
|   | | | `-ImplicitCastExpr 0x7ffee83792d8 <col:33> 'std::__1::locale::category':'int' <LValueToRValue>
|   | | |   `-DeclRefExpr 0x7ffee83792b0 <col:33> 'const std::__1::locale::category':'const int' lvalue Var 0x7ffee8378c68 'monetary' 'const std::__1::locale::category':'const int'
|   | | `-ImplicitCastExpr 0x7ffee8379340 <col:44> 'std::__1::locale::category':'int' <LValueToRValue>
|   | |   `-DeclRefExpr 0x7ffee8379318 <col:44> 'const std::__1::locale::category':'const int' lvalue Var 0x7ffee8378db8 'numeric' 'const std::__1::locale::category':'const int'
|   | `-ImplicitCastExpr 0x7ffee83793a8 <col:54> 'std::__1::locale::category':'int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7ffee8379380 <col:54> 'const std::__1::locale::category':'const int' lvalue Var 0x7ffee8378f08 'time' 'const std::__1::locale::category':'const int'
|   `-ImplicitCastExpr 0x7ffee8379410 <col:61> 'std::__1::locale::category':'int' <LValueToRValue>
|     `-DeclRefExpr 0x7ffee83793e8 <col:61> 'const std::__1::locale::category':'const int' lvalue Var 0x7ffee8379058 'messages' 'const std::__1::locale::category':'const int'
|-CXXConstructorDecl 0x7ffee8379560 <line:81:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:81:5 locale 'void (void) noexcept'
|-CXXConstructorDecl 0x7ffee8379728 <line:82:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:82:5 referenced locale 'void (const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7ffee8379618 <col:12, col:24> col:25 'const class std::__1::locale &'
|-CXXConstructorDecl 0x7ffee8379878 <line:83:5, col:32> col:14 locale 'void (const char *)'
| `-ParmVarDecl 0x7ffee83797f0 <col:21, col:31> col:32 'const char *'
|-CXXConstructorDecl 0x7ffee83799c0 <line:84:5, col:34> col:14 locale 'void (const std::__1::string &)'
| `-ParmVarDecl 0x7ffee8379938 <col:21, col:33> col:34 'const std::__1::string &'
|-CXXConstructorDecl 0x7ffee8379ca0 <line:85:5, col:48> col:5 locale 'void (const class std::__1::locale &, const char *, std::__1::locale::category)'
| |-ParmVarDecl 0x7ffee8379a80 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7ffee8379af8 <col:27, col:37> col:38 'const char *'
| `-ParmVarDecl 0x7ffee8379b68 <col:40> col:48 'std::__1::locale::category':'int'
|-CXXConstructorDecl 0x7ffee8379f80 <line:86:5, col:50> col:5 locale 'void (const class std::__1::locale &, const std::__1::string &, std::__1::locale::category)'
| |-ParmVarDecl 0x7ffee8379d70 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7ffee8379de0 <col:27, col:39> col:40 'const std::__1::string &'
| `-ParmVarDecl 0x7ffee8379e50 <col:42> col:50 'std::__1::locale::category':'int'
|-FunctionTemplateDecl 0x7ffee837a358 <line:87:5, line:88:64> col:35 locale
| |-TemplateTypeParmDecl 0x7ffee837a040 <line:87:15, col:21> col:21 referenced class depth 0 index 0 _Facet
| `-CXXConstructorDecl 0x7ffee837a2b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:88:64> col:35 locale 'void (const class std::__1::locale &, _Facet *)'
|   |-ParmVarDecl 0x7ffee837a100 <col:42, col:54> col:55 'const class std::__1::locale &'
|   |-ParmVarDecl 0x7ffee837a198 <col:57, col:63> col:64 '_Facet *'
|   |-AlwaysInlineAttr 0x7ffee837a3b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|   `-VisibilityAttr 0x7ffee837a400 <col:51, col:74> Hidden
|-CXXConstructorDecl 0x7ffee837a630 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:89:5, col:50> col:5 locale 'void (const class std::__1::locale &, const class std::__1::locale &, std::__1::locale::category)'
| |-ParmVarDecl 0x7ffee837a420 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7ffee837a490 <col:27, col:39> col:40 'const class std::__1::locale &'
| `-ParmVarDecl 0x7ffee837a500 <col:42> col:50 'std::__1::locale::category':'int'
|-CXXDestructorDecl 0x7ffee837a740 <line:91:5, col:13> col:5 referenced ~locale 'void (void) noexcept'
|-CXXMethodDecl 0x7ffee837a8f8 <line:93:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:93:19 operator= 'const class std::__1::locale &(const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7ffee837a7f0 <col:29, col:41> col:42 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7ffee837abe8 <line:95:5, line:97:37> col:14 combine
| |-TemplateTypeParmDecl 0x7ffee837a998 <line:95:15, col:21> col:21 class depth 0 index 0 _Facet
| `-CXXMethodDecl 0x7ffee837ab50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:97:37> col:14 combine 'class std::__1::locale (const class std::__1::locale &) const' inline
|   |-ParmVarDecl 0x7ffee837aa60 <col:22, col:34> col:35 'const class std::__1::locale &'
|   `-VisibilityAttr 0x7ffee837ac40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:624:40, col:63> Hidden
|-CXXMethodDecl 0x7ffee837aca8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:100:5, col:19> col:12 name 'std::__1::string (void) const'
|-CXXMethodDecl 0x7ffee837ae10 <line:101:5, col:36> col:10 used operator== '_Bool (const class std::__1::locale &) const'
| `-ParmVarDecl 0x7ffee837ad50 <col:21, col:33> col:34 'const class std::__1::locale &'
|-CXXMethodDecl 0x7ffee837af48 <line:102:5, col:70> col:10 operator!= '_Bool (const class std::__1::locale &) const'
| |-ParmVarDecl 0x7ffee837aec0 <col:21, col:35> col:35 used __y 'const class std::__1::locale &'
| `-CompoundStmt 0x7ffee8381660 <col:46, col:70>
|   `-ReturnStmt 0x7ffee8381648 <col:47, col:68>
|     `-UnaryOperator 0x7ffee8381628 <col:54, col:68> '_Bool' prefix '!'
|       `-ParenExpr 0x7ffee8381608 <col:55, col:68> '_Bool'
|         `-CXXOperatorCallExpr 0x7ffee83815c0 <col:56, col:65> '_Bool'
|           |-ImplicitCastExpr 0x7ffee83815a8 <col:62> '_Bool (*)(const class std::__1::locale &) const' <FunctionToPointerDecay>
|           | `-DeclRefExpr 0x7ffee8381550 <col:62> '_Bool (const class std::__1::locale &) const' lvalue CXXMethod 0x7ffee837ae10 'operator==' '_Bool (const class std::__1::locale &) const'
|           |-UnaryOperator 0x7ffee8380280 <col:56, col:57> 'const class std::__1::locale' lvalue prefix '*'
|           | `-CXXThisExpr 0x7ffee8380268 <col:57> 'const class std::__1::locale *' this
|           `-DeclRefExpr 0x7ffee83802a0 <col:65> 'const class std::__1::locale' lvalue ParmVar 0x7ffee837aec0 '__y' 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7ffee837b6d8 <line:103:5, line:106:73> line:105:12 operator()
| |-TemplateTypeParmDecl 0x7ffee837afe8 <line:103:15, col:21> col:21 referenced class depth 0 index 0 _CharT
| |-TemplateTypeParmDecl 0x7ffee837b058 <col:29, col:35> col:35 referenced class depth 0 index 1 _Traits
| |-TemplateTypeParmDecl 0x7ffee837b0c8 <col:44, col:50> col:50 referenced class depth 0 index 2 _Allocator
| `-CXXMethodDecl 0x7ffee837b640 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:106:73> line:105:12 operator() '_Bool (const basic_string<_CharT, _Traits, _Allocator> &, const basic_string<_CharT, _Traits, _Allocator> &) const' inline
|   |-ParmVarDecl 0x7ffee837b330 <col:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   |-ParmVarDecl 0x7ffee837b530 <line:106:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   `-VisibilityAttr 0x7ffee837b738 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:624:40, col:63> Hidden
|-CXXMethodDecl 0x7ffee837b850 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:109:5, col:39> col:19 global 'class std::__1::locale (const class std::__1::locale &)' static
| `-ParmVarDecl 0x7ffee837b790 <col:26, col:38> col:39 'const class std::__1::locale &'
|-CXXMethodDecl 0x7ffee837b940 <line:110:5, col:34> col:26 classic 'const class std::__1::locale &(void)' static
|-AccessSpecDecl 0x7ffee837b9d8 <line:112:1, col:8> col:1 private
|-CXXRecordDecl 0x7ffee837ba00 <line:113:5, col:11> col:11 referenced class __imp
|-FieldDecl 0x7ffee837baf8 <line:114:5, col:12> col:12 __locale_ 'class std::__1::locale::__imp *'
|-CXXMethodDecl 0x7ffee837bd40 <line:116:5, col:52> col:10 referenced __install_ctor 'void (const class std::__1::locale &, class std::__1::locale::facet *, long)'
| |-ParmVarDecl 0x7ffee837bb50 <col:25, col:37> col:38 'const class std::__1::locale &'
| |-ParmVarDecl 0x7ffee837bbe8 <col:40, col:45> col:46 'class std::__1::locale::facet *'
| `-ParmVarDecl 0x7ffee837bc60 <col:48> col:52 'long'
|-CXXMethodDecl 0x7ffee837be70 <line:117:5, col:29> col:20 __global 'class std::__1::locale &(void)' static
|-CXXMethodDecl 0x7ffee837c010 <line:118:5, col:25> col:10 referenced has_facet '_Bool (class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7ffee837bf48 <col:20, col:22> col:23 'class std::__1::locale::id &'
|-CXXMethodDecl 0x7ffee837c1b0 <line:119:5, col:33> col:18 referenced use_facet 'const class std::__1::locale::facet *(class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7ffee837c0c0 <col:28, col:30> col:31 'class std::__1::locale::id &'
|-FriendDecl 0x7ffee837c4d8 <line:121:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:121:41
| `-FunctionTemplateDecl 0x7ffee837c418 parent 0x7ffee8377b80 prev 0x7ffee8377fb0 <col:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:121:41 has_facet
|   |-TemplateTypeParmDecl 0x7ffee837c250 <col:15, col:21> col:21 class depth 0 index 0 _Facet
|   `-FunctionDecl 0x7ffee837c370 parent 0x7ffee8377b80 prev 0x7ffee8377f18 <col:29, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:121:41 has_facet '_Bool (const class std::__1::locale &) noexcept'
|     |-ParmVarDecl 0x7ffee837c2e0 <col:51, col:63> col:64 'const class std::__1::locale &'
|     |-AlwaysInlineAttr 0x7ffee837c4b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|     `-VisibilityAttr 0x7ffee837c4c8 <col:51, col:74> Inherited Hidden
`-FriendDecl 0x7ffee83801f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:122:5, col:73> col:50
  `-FunctionTemplateDecl 0x7ffee8380138 parent 0x7ffee8377b80 prev 0x7ffee83782e8 <col:5, col:73> col:50 use_facet
    |-TemplateTypeParmDecl 0x7ffee837c510 <col:15, col:21> col:21 referenced class depth 0 index 0 _Facet
    `-FunctionDecl 0x7ffee8380090 parent 0x7ffee8377b80 prev 0x7ffee8378250 <col:29, col:73> col:50 use_facet 'const _Facet &(const class std::__1::locale &)'
      |-ParmVarDecl 0x7ffee837c5a0 <col:60, col:72> col:73 'const class std::__1::locale &'
      |-AlwaysInlineAttr 0x7ffee83801d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
      `-VisibilityAttr 0x7ffee83801e8 <col:51, col:74> Inherited Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  NonVirtualBaseLLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffee80b56d8 parent 0x7ffee80aca88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:479:84> col:64 class basic_streambuf definition
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7ffee83d3cb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7ffee83d3d78 prev 0x7ffee80b56d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:122:1, col:28> col:28 implicit class basic_streambuf
|-AccessSpecDecl 0x7ffee83d3e10 <line:124:1, col:7> col:1 public
|-TypedefDecl 0x7ffee83d3e78 <line:126:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7ffee83d3e40 'char' sugar
|   |-TemplateTypeParmType 0x7ffee83b7430 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7ffee83b73e8 '_CharT'
|   `-BuiltinType 0x7ffee7032b60 'char'
|-TypedefDecl 0x7ffee83d3f08 <line:127:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7ffee83d3ed0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7ffee83b74a0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7ffee83b7458 '_Traits'
|   `-RecordType 0x7ffee80b4f60 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7ffee72bd088 'char_traits'
|-TypedefDecl 0x7ffee83d4010 <line:128:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7ffee83d3fc0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7ffee72bebd0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7ffee72bd3e8 'int_type'
|     `-BuiltinType 0x7ffee7032bc0 'int'
|-TypedefDecl 0x7ffee83d4100 <line:129:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7ffee83d40b0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7ffee83d4090 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7ffee72bd4b8 'pos_type'
|     `-TypedefType 0x7ffee72b2c40 'std::__1::streampos' sugar
|       |-Typedef 0x7ffee80bb1b8 'streampos'
|       `-TemplateSpecializationType 0x7ffee80bb110 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7ffee80bb0f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7ffee80bb000 'fpos'
|-TypedefDecl 0x7ffee83d41f0 <line:130:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7ffee83d41a0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7ffee83d4180 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7ffee72bd450 'off_type'
|     `-TypedefType 0x7ffee72b2bb0 'std::__1::streamoff' sugar
|       |-Typedef 0x7ffee80bb558 'streamoff'
|       `-BuiltinType 0x7ffee7032c00 'long long'
|-CXXDestructorDecl 0x7ffee83d4278 <line:132:5, col:30> col:13 ~basic_streambuf 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7ffee83d43b0 <line:135:5, line:141:5> line:136:12 pubimbue 'class std::__1::locale (const class std::__1::locale &)' inline
| |-ParmVarDecl 0x7ffee83d4328 <col:21, col:35> col:35 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7ffee83d4488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee83d44d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:143:5, line:144:44> col:12 getloc 'class std::__1::locale (void) const' inline
| `-AlwaysInlineAttr 0x7ffee83d4578 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee83d4790 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:147:5, line:149:32> line:148:22 pubsetbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7ffee83d4618 <col:32, col:43> col:43 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7ffee83d4678 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7ffee83d4848 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee83d4ad0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:151:5, line:154:46> line:152:14 referenced pubseekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7ffee83d48e0 <col:25, col:34> col:34 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7ffee83d4940 <col:41, col:59> col:59 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| |-ParmVarDecl 0x7ffee83d49a0 <line:153:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7ffee83d4b90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee83d4d60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:156:5, line:159:38> line:157:14 referenced pubseekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7ffee83d4be8 <col:25, col:34> col:34 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| |-ParmVarDecl 0x7ffee83d4c48 <line:158:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7ffee83d4e18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee83d4e60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:161:5, line:162:36> col:9 referenced pubsync 'int (void)' inline
| `-AlwaysInlineAttr 0x7ffee83d4f08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee83d4f50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:166:5, line:171:5> line:167:16 in_avail 'std::__1::streamsize (void)' inline
| `-AlwaysInlineAttr 0x7ffee83d4ff8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee83d50b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:173:5, line:178:5> line:174:14 snextc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7ffee83d5158 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee83d51c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:180:5, line:185:5> line:181:14 sbumpc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7ffee83d5268 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee83d52d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:187:5, line:192:5> line:188:14 sgetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7ffee83d5378 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee83d5540 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:194:5, line:196:32> line:195:16 referenced sgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7ffee83d53d0 <col:22, col:33> col:33 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7ffee83d5430 <col:38, col:49> col:49 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7ffee83d55f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee83d5710 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:199:5, line:204:5> line:200:14 sputbackc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7ffee83d5650 <col:24, col:34> col:34 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7ffee83d57c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee83d5828 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:206:5, line:211:5> line:207:14 sungetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7ffee83d58d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee83d59b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:214:5, line:220:5> line:215:14 sputc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7ffee83d5928 <col:20, col:30> col:30 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7ffee83d5a60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee83d5c60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:222:5, line:224:32> line:223:16 referenced sputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7ffee83d5ae8 <col:22, col:39> col:39 __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7ffee83d5b48 <col:44, col:55> col:55 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7ffee83d5d18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-AccessSpecDecl 0x7ffee83d5d60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:226:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7ffee83d5dc8 <line:227:5, col:21> col:5 basic_streambuf 'void (void)'
|-CXXConstructorDecl 0x7ffee83d5fa0 <line:228:5, col:49> col:5 basic_streambuf 'void (const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7ffee83d5eb8 <col:21, col:44> col:44 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7ffee83d6160 <line:229:5, col:60> col:22 operator= 'class std::__1::basic_streambuf<char> &(const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7ffee83d6098 <col:32, col:55> col:55 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7ffee83d62e0 <line:230:5, col:37> col:10 swap 'void (class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7ffee83d6220 <col:15, col:32> col:32 __rhs 'class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7ffee83d6410 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:233:68> col:38 eback 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7ffee83d64b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee83d6520 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:234:68> col:38 gptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7ffee83d65c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee83d6630 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:235:68> col:38 egptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7ffee83d66d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee83d67a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:237:5, line:238:43> col:10 gbump 'void (int)' inline
| |-ParmVarDecl 0x7ffee83d6720 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7ffee83d6858 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee83d6ac0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:240:5, line:245:5> line:241:10 setg 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7ffee83d68b0 <col:15, col:26> col:26 __gbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7ffee83d6920 <col:34, col:45> col:45 __gnext 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7ffee83d6990 <col:54, col:65> col:65 __gend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7ffee83d6b80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee83d6be8 <line:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:248:68> col:38 pbase 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7ffee83d6c90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee83d6cf8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:249:68> col:38 pptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7ffee83d6da0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee83d6e08 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:250:68> col:38 epptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7ffee83d6eb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffee83d6f80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:252:5, line:253:43> col:10 pbump 'void (int)' inline
| |-ParmVarDecl 0x7ffee83d6ef8 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7ffee83d7030 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee83d7210 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:255:5, line:259:5> line:256:10 setp 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7ffee83d7088 <col:15, col:26> col:26 __pbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7ffee83d70f8 <col:34, col:45> col:45 __pend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7ffee83d72c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffee83d7398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:263:5, col:43> col:18 imbue 'void (const class std::__1::locale &)' virtual
| `-ParmVarDecl 0x7ffee83d7310 <col:24, col:38> col:38 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7ffee83d7548 <line:266:5, col:67> col:30 setbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7ffee83d7458 <col:37, col:48> col:48 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7ffee83d74b8 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7ffee83d7768 <line:267:5, line:268:87> line:267:22 seekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7ffee83d7610 <col:30, col:39> col:39 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7ffee83d7670 <col:46, col:64> col:64 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-ParmVarDecl 0x7ffee83d76d0 <line:268:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7ffee83d7928 <line:269:5, line:270:87> line:269:22 seekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7ffee83d7838 <col:30, col:39> col:39 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ParmVarDecl 0x7ffee83d7898 <line:270:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7ffee83d79e0 <line:271:5, col:22> col:17 sync 'int (void)' virtual
|-CXXMethodDecl 0x7ffee83d7a88 <line:274:5, col:34> col:24 showmanyc 'std::__1::streamsize (void)' virtual
|-CXXMethodDecl 0x7ffee83d7c30 <line:275:5, col:61> col:24 xsgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7ffee83d7b40 <col:31, col:42> col:42 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7ffee83d7ba0 <col:47, col:58> col:58 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7ffee83d7d08 <line:276:5, col:32> col:22 underflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7ffee83d7dd0 <line:277:5, col:28> col:22 uflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7ffee83d7f50 <line:280:5, col:65> col:22 pbackfail 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7ffee83d7e88 <col:32, col:64> col:41 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7ffee83d8100 <line:283:5, col:67> col:24 xsputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7ffee83d8010 <col:31, col:48> col:48 __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7ffee83d8070 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7ffee83d8250 <line:284:5, col:64> col:22 overflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7ffee83d81c8 <col:31, col:63> col:40 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-AccessSpecDecl 0x7ffee83d8300 <line:286:1, col:8> col:1 private
|-FieldDecl 0x7ffee83d8328 <line:287:5, col:12> col:12 __loc_ 'class std::__1::locale'
|-FieldDecl 0x7ffee83d8380 <line:288:5, col:16> col:16 __binp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7ffee83d83d8 <line:289:5, col:16> col:16 __ninp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7ffee83d8430 <line:290:5, col:16> col:16 __einp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7ffee83d8488 <line:291:5, col:16> col:16 __bout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7ffee83d84e0 <line:292:5, col:16> col:16 __nout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
`-FieldDecl 0x7ffee83d8538 <line:293:5, col:16> col:16 __eout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct __sbuf
         0 |   unsigned char * _base
         8 |   int _size
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __sFILE
         0 |   unsigned char * _p
         8 |   int _r
        12 |   int _w
        16 |   short _flags
        18 |   short _file
        24 |   struct __sbuf _bf
        24 |     unsigned char * _base
        32 |     int _size
        40 |   int _lbfsize
        48 |   void * _cookie
        56 |   int (* _Nullable)(void *) _close
        64 |   int (* _Nullable)(void *, char *, int) _read
        72 |   fpos_t (* _Nullable)(void *, fpos_t, int) _seek
        80 |   int (* _Nullable)(void *, const char *, int) _write
        88 |   struct __sbuf _ub
        88 |     unsigned char * _base
        96 |     int _size
       104 |   struct __sFILEX * _extra
       112 |   int _ur
       116 |   unsigned char [3] _ubuf
       119 |   unsigned char [1] _nbuf
       120 |   struct __sbuf _lb
       120 |     unsigned char * _base
       128 |     int _size
       136 |   int _blksize
       144 |   fpos_t _offset
           | [sizeof=152, dsize=152, align=8,
           |  nvsize=152, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffee804db58 </usr/include/stdio.h:88:1, line:91:1> line:88:8 struct __sbuf definition
|-CXXRecordDecl 0x7ffee804dc78 <col:1, col:8> col:8 implicit struct __sbuf
|-FieldDecl 0x7ffee804dd50 <line:89:2, col:17> col:17 _base 'unsigned char *'
`-FieldDecl 0x7ffee804ddb0 <line:90:2, col:7> col:7 _size 'int'

Layout: <CGRecordLayout
  LLVMType:%struct.__sbuf = type { i8*, i32 }
  NonVirtualBaseLLVMType:%struct.__sbuf = type { i8*, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffee804ded0 </usr/include/stdio.h:122:9, line:153:1> line:122:16 struct __sFILE definition
|-CXXRecordDecl 0x7ffee804dff8 <col:9, col:16> col:16 implicit struct __sFILE
|-FieldDecl 0x7ffee804e0a8 <line:123:2, col:17> col:17 referenced _p 'unsigned char *'
|-FieldDecl 0x7ffee804e108 <line:124:2, col:6> col:6 _r 'int'
|-FieldDecl 0x7ffee804e168 <line:125:2, col:6> col:6 referenced _w 'int'
|-FieldDecl 0x7ffee804e1c8 <line:126:2, col:8> col:8 _flags 'short'
|-FieldDecl 0x7ffee804e228 <line:127:2, col:8> col:8 _file 'short'
|-FieldDecl 0x7ffee804e2c0 <line:128:2, col:16> col:16 _bf 'struct __sbuf':'struct __sbuf'
|-FieldDecl 0x7ffee804e320 <line:129:2, col:6> col:6 referenced _lbfsize 'int'
|-FieldDecl 0x7ffee804e380 <line:132:2, col:8> col:8 _cookie 'void *'
|-FieldDecl 0x7ffee804f200 <line:133:2, col:19> col:19 _close 'int (* _Nullable)(void *)':'int (*)(void *)'
|-FieldDecl 0x7ffee804f528 <line:134:2, col:19> col:19 _read 'int (* _Nullable)(void *, char *, int)':'int (*)(void *, char *, int)'
|-FieldDecl 0x7ffee804f8b0 <line:135:2, col:22> col:22 _seek 'fpos_t (* _Nullable)(void *, fpos_t, int)':'fpos_t (*)(void *, fpos_t, int)'
|-FieldDecl 0x7ffee804fbd8 <line:136:2, col:19> col:19 _write 'int (* _Nullable)(void *, const char *, int)':'int (*)(void *, const char *, int)'
|-FieldDecl 0x7ffee804fc40 <line:139:2, col:16> col:16 _ub 'struct __sbuf':'struct __sbuf'
|-FieldDecl 0x7ffee804fd40 <line:140:2, col:19> col:19 _extra 'struct __sFILEX *'
|-FieldDecl 0x7ffee804fda0 <line:141:2, col:6> col:6 _ur 'int'
|-FieldDecl 0x7ffee804fe70 <line:144:2, col:23> col:16 _ubuf 'unsigned char [3]'
|-FieldDecl 0x7ffee804ff40 <line:145:2, col:23> col:16 _nbuf 'unsigned char [1]'
|-FieldDecl 0x7ffee804ffa8 <line:148:2, col:16> col:16 _lb 'struct __sbuf':'struct __sbuf'
|-FieldDecl 0x7ffee8050008 <line:151:2, col:6> col:6 _blksize 'int'
`-FieldDecl 0x7ffee8050060 <line:152:2, col:9> col:9 _offset 'fpos_t':'long long'

Layout: <CGRecordLayout
  LLVMType:%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
  NonVirtualBaseLLVMType:%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::__shared_count
         0 |   (__shared_count vtable pointer)
         8 |   long __shared_owners_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffee826f090 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3410:1, line:3448:1> line:3410:24 referenced class __shared_count definition
|-VisibilityAttr 0x7ffee826f1b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7ffee826f200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3410:1, col:24> col:24 implicit referenced class __shared_count
|-CXXConstructorDecl 0x7ffee826f3f0 <line:3412:5, col:41> col:5 __shared_count 'void (const class std::__1::__shared_count &)'
| `-ParmVarDecl 0x7ffee826f2d8 <col:20, col:40> col:41 'const class std::__1::__shared_count &'
|-CXXMethodDecl 0x7ffee826f5a0 <line:3413:5, col:52> col:21 operator= 'class std::__1::__shared_count &(const class std::__1::__shared_count &)'
| `-ParmVarDecl 0x7ffee826f4b0 <col:31, col:51> col:52 'const class std::__1::__shared_count &'
|-AccessSpecDecl 0x7ffee826f640 <line:3415:1, col:10> col:1 protected
|-FieldDecl 0x7ffee826f680 <line:3416:5, col:10> col:10 referenced __shared_owners_ 'long'
|-CXXDestructorDecl 0x7ffee826f718 <line:3417:5, col:29> col:13 used ~__shared_count 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7ffee826f7b8 <line:3418:1, col:8> col:1 private
|-CXXMethodDecl 0x7ffee826f808 <line:3419:5, col:49> col:18 referenced __on_zero_shared 'void (void) noexcept' virtual pure
|-AccessSpecDecl 0x7ffee826f8a0 <line:3421:1, col:7> col:1 public
|-CXXConstructorDecl 0x7ffee826f9d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3424:37> line:3423:14 used __shared_count 'void (long) noexcept'
| |-ParmVarDecl 0x7ffee826f910 <col:29, col:43> col:34 used __refs 'long' cinit
| | `-ImplicitCastExpr 0x7ffee826ffa8 <col:43> 'long' <IntegralCast>
| |   `-IntegerLiteral 0x7ffee826ff88 <col:43> 'int' 0
| |-CXXCtorInitializer Field 0x7ffee826f680 '__shared_owners_' 'long'
| | `-ImplicitCastExpr 0x7ffee8270018 <line:3424:28> 'long' <LValueToRValue>
| |   `-DeclRefExpr 0x7ffee826ffc0 <col:28> 'long' lvalue ParmVar 0x7ffee826f910 '__refs' 'long'
| |-CompoundStmt 0x7ffee8270060 <col:36, col:37>
| |-AlwaysInlineAttr 0x7ffee826fa88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee826fad0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee826fb38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3434:5> line:3432:10 used __add_shared 'void (void) noexcept'
| |-CompoundStmt 0x7ffee82705b0 <col:35, line:3434:5>
| | `-CallExpr 0x7ffee8270580 <line:3433:7, col:58> 'long':'long'
| |   |-ImplicitCastExpr 0x7ffee8270568 <col:7> 'long (*)(long &) noexcept' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7ffee82704d8 <col:7> 'long (long &) noexcept' lvalue Function 0x7ffee8270398 '__libcpp_atomic_refcount_increment' 'long (long &) noexcept' (FunctionTemplate 0x7ffee826d7d0 '__libcpp_atomic_refcount_increment')
| |   `-MemberExpr 0x7ffee82700e8 <col:42> 'long' lvalue ->__shared_owners_ 0x7ffee826f680
| |     `-CXXThisExpr 0x7ffee82700d0 <col:42> 'class std::__1::__shared_count *' this
| |-AlwaysInlineAttr 0x7ffee826fbd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee826fc18 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffee826fc80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3442:5> line:3436:10 used __release_shared '_Bool (void) noexcept'
| |-CompoundStmt 0x7ffee8270c18 <col:39, line:3442:5>
| | |-IfStmt 0x7ffee8270bb0 <line:3437:7, line:3440:7>
| | | |-<<<NULL>>>
| | | |-<<<NULL>>>
| | | |-BinaryOperator 0x7ffee8270ab8 <line:3437:11, col:68> '_Bool' '=='
| | | | |-CallExpr 0x7ffee8270a30 <col:11, col:62> 'long':'long'
| | | | | |-ImplicitCastExpr 0x7ffee8270a18 <col:11> 'long (*)(long &) noexcept' <FunctionToPointerDecay>
| | | | | | `-DeclRefExpr 0x7ffee82709b8 <col:11> 'long (long &) noexcept' lvalue Function 0x7ffee8270878 '__libcpp_atomic_refcount_decrement' 'long (long &) noexcept' (FunctionTemplate 0x7ffee826dce0 '__libcpp_atomic_refcount_decrement')
| | | | | `-MemberExpr 0x7ffee8270640 <col:46> 'long' lvalue ->__shared_owners_ 0x7ffee826f680
| | | | |   `-CXXThisExpr 0x7ffee8270628 <col:46> 'class std::__1::__shared_count *' this
| | | | `-ImplicitCastExpr 0x7ffee8270aa0 <col:67, col:68> 'long' <IntegralCast>
| | | |   `-UnaryOperator 0x7ffee8270a80 <col:67, col:68> 'int' prefix '-'
| | | |     `-IntegerLiteral 0x7ffee8270a60 <col:68> 'int' 1
| | | |-CompoundStmt 0x7ffee8270b88 <col:71, line:3440:7>
| | | | |-CXXMemberCallExpr 0x7ffee8270b30 <line:3438:9, col:26> 'void'
| | | | | `-MemberExpr 0x7ffee8270af8 <col:9> '<bound member function type>' ->__on_zero_shared 0x7ffee826f808
| | | | |   `-CXXThisExpr 0x7ffee8270ae0 <col:9> 'class std::__1::__shared_count *' this
| | | | `-ReturnStmt 0x7ffee8270b70 <line:3439:9, col:16>
| | | |   `-CXXBoolLiteralExpr 0x7ffee8270b58 <col:16> '_Bool' true
| | | `-<<<NULL>>>
| | `-ReturnStmt 0x7ffee8270c00 <line:3441:7, col:14>
| |   `-CXXBoolLiteralExpr 0x7ffee8270be8 <col:14> '_Bool' false
| |-AlwaysInlineAttr 0x7ffee826fd18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee826fd60 <col:51, col:74> Hidden
`-CXXMethodDecl 0x7ffee826fe60 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3447:5> line:3445:10 used use_count 'long (void) const noexcept'
  |-CompoundStmt 0x7ffee82711c8 <col:38, line:3447:5>
  | `-ReturnStmt 0x7ffee82711b0 <line:3446:9, col:59>
  |   `-BinaryOperator 0x7ffee8271188 <col:16, col:59> 'long' '+'
  |     |-CallExpr 0x7ffee8271120 <col:16, col:55> 'long':'long'
  |     | |-ImplicitCastExpr 0x7ffee8271108 <col:16> 'long (*)(const long *)' <FunctionToPointerDecay>
  |     | | `-DeclRefExpr 0x7ffee8271080 <col:16> 'long (const long *)' lvalue Function 0x7ffee8270f40 '__libcpp_relaxed_load' 'long (const long *)' (FunctionTemplate 0x7ffee71c4158 '__libcpp_relaxed_load')
  |     | `-UnaryOperator 0x7ffee8270ce8 <col:38, col:39> 'const long *' prefix '&'
  |     |   `-MemberExpr 0x7ffee8270cb0 <col:39> 'const long' lvalue ->__shared_owners_ 0x7ffee826f680
  |     |     `-CXXThisExpr 0x7ffee8270c98 <col:39> 'const class std::__1::__shared_count *' this
  |     `-ImplicitCastExpr 0x7ffee8271170 <col:59> 'long' <IntegralCast>
  |       `-IntegerLiteral 0x7ffee8271150 <col:59> 'int' 1
  |-AlwaysInlineAttr 0x7ffee826fef8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
  `-VisibilityAttr 0x7ffee826ff40 <col:51, col:74> Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::locale::facet
         0 |   class std::__1::__shared_count (primary base)
         0 |     (__shared_count vtable pointer)
         8 |     long __shared_owners_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffee83816d0 parent 0x7ffee83783c8 prev 0x7ffee8378600 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:125:1, line:139:1> line:125:32 referenced class facet definition
|-public 'class std::__1::__shared_count'
|-VisibilityAttr 0x7ffee8381810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7ffee8381898 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:125:1, col:32> col:32 implicit referenced class facet
|-AccessSpecDecl 0x7ffee8381930 <line:128:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7ffee8381a80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:131:56> line:130:14 used facet 'void (size_t)'
| |-ParmVarDecl 0x7ffee8381998 <col:20, col:36> col:27 used __refs 'size_t':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7ffee8381f98 <col:36> 'size_t':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7ffee8381f78 <col:36> 'int' 0
| |-CXXCtorInitializer 'class std::__1::__shared_count'
| | `-CXXConstructExpr 0x7ffee83820f0 <line:131:11, col:53> 'class std::__1::__shared_count' 'void (long) noexcept'
| |   `-BinaryOperator 0x7ffee8382088 <col:26, col:52> 'long' '-'
| |     |-CXXStaticCastExpr 0x7ffee8382020 <col:26, col:50> 'long' static_cast<long> <NoOp>
| |     | `-ImplicitCastExpr 0x7ffee8382008 <col:44> 'long' <IntegralCast>
| |     |   `-ImplicitCastExpr 0x7ffee8381ff0 <col:44> 'size_t':'unsigned long' <LValueToRValue>
| |     |     `-DeclRefExpr 0x7ffee8381fb0 <col:44> 'size_t':'unsigned long' lvalue ParmVar 0x7ffee8381998 '__refs' 'size_t':'unsigned long'
| |     `-ImplicitCastExpr 0x7ffee8382070 <col:52> 'long' <IntegralCast>
| |       `-IntegerLiteral 0x7ffee8382050 <col:52> 'int' 1
| |-CompoundStmt 0x7ffee8382158 <col:55, col:56>
| |-AlwaysInlineAttr 0x7ffee8381b30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffee8381b78 <col:51, col:74> Hidden
|-CXXDestructorDecl 0x7ffee8381bd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:133:5, col:20> col:13 used ~facet 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7ffee8381c78 <line:137:1, col:8> col:1 private
|-CXXMethodDecl 0x7ffee8381cc8 <line:138:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:138:18 __on_zero_shared 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7ffee8381df8 <line:125:32, <invalid sloc>> col:32 implicit operator= 'class std::__1::locale::facet &(const class std::__1::locale::facet &)' inline default_delete noexcept-unevaluated 0x7ffee8381df8
| `-ParmVarDecl 0x7ffee8381f10 <col:32> col:32 'const class std::__1::locale::facet &'
`-CXXConstructorDecl 0x7ffee8386458 <col:32> col:32 implicit facet 'void (const class std::__1::locale::facet &)' inline default_delete noexcept-unevaluated 0x7ffee8386458
  `-ParmVarDecl 0x7ffee8386580 <col:32> col:32 'const class std::__1::locale::facet &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
  NonVirtualBaseLLVMType:%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::codecvt_base (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffee83a8570 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:810:1, line:815:1> line:810:24 referenced class codecvt_base definition
|-VisibilityAttr 0x7ffee83a8698 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7ffee83a86e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:810:1, col:24> col:24 implicit referenced class codecvt_base
|-AccessSpecDecl 0x7ffee83a8778 <line:812:1, col:7> col:1 public
|-CXXConstructorDecl 0x7ffee83a8838 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:813:43> col:27 used codecvt_base 'void (void)'
| |-CompoundStmt 0x7ffee83a8b50 <col:42, col:43>
| |-AlwaysInlineAttr 0x7ffee83a88e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7ffee83a8928 <col:48, col:71> Hidden
|-EnumDecl 0x7ffee83a8938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:814:5, col:44> col:10 referenced result
| |-EnumConstantDecl 0x7ffee83a89f0 <col:18> col:18 referenced ok 'enum std::__1::codecvt_base::result'
| |-EnumConstantDecl 0x7ffee83a8a40 <col:22> col:22 referenced partial 'enum std::__1::codecvt_base::result'
| |-EnumConstantDecl 0x7ffee83a8a90 <col:31> col:31 referenced error 'enum std::__1::codecvt_base::result'
| `-EnumConstantDecl 0x7ffee83a8ae0 <col:38> col:38 referenced noconv 'enum std::__1::codecvt_base::result'
|-CXXDestructorDecl 0x7ffee83ac918 <line:810:24> col:24 implicit ~codecvt_base 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7ffee83acb28 <col:24> col:24 implicit constexpr codecvt_base 'void (const class std::__1::codecvt_base &)' inline default trivial noexcept-unevaluated 0x7ffee83acb28
| `-ParmVarDecl 0x7ffee83acc50 <col:24> col:24 'const class std::__1::codecvt_base &'
`-CXXConstructorDecl 0x7ffee83acce8 <col:24> col:24 implicit constexpr codecvt_base 'void (class std::__1::codecvt_base &&)' inline default trivial noexcept-unevaluated 0x7ffee83acce8
  `-ParmVarDecl 0x7ffee83ace10 <col:24> col:24 'class std::__1::codecvt_base &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::codecvt_base" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::codecvt_base.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::codecvt<char, char, mbstate_t>
         0 |   class std::__1::locale::facet (primary base)
         0 |     class std::__1::__shared_count (primary base)
         0 |       (__shared_count vtable pointer)
         8 |       long __shared_owners_
         0 |   class std::__1::codecvt_base (base) (empty)
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffee83a90d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:823:1, line:905:1> line:824:24 class codecvt definition
|-public 'class locale::facet':'class std::__1::locale::facet'
|-public 'class std::__1::codecvt_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'char'
|-TemplateArgument type '__mbstate_t'
|-VisibilityAttr 0x7ffee83a9238 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7ffee83a9498 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:824:1, col:24> col:24 implicit referenced class codecvt
|-AccessSpecDecl 0x7ffee83a9530 <line:828:1, col:7> col:1 public
|-TypedefDecl 0x7ffee83a9568 <line:829:5, col:23> col:23 referenced intern_type 'char'
| `-BuiltinType 0x7ffee7032b60 'char'
|-TypedefDecl 0x7ffee83a95d0 <line:830:5, col:23> col:23 referenced extern_type 'char'
| `-BuiltinType 0x7ffee7032b60 'char'
|-TypedefDecl 0x7ffee83a9638 <line:831:5, col:23> col:23 referenced state_type 'mbstate_t':'__mbstate_t'
| `-TypedefType 0x7ffee809c780 'mbstate_t' sugar
|   |-Typedef 0x7ffee7810bf0 'mbstate_t'
|   `-TypedefType 0x7ffee7810bc0 '__darwin_mbstate_t' sugar
|     |-Typedef 0x7ffee7068150 '__darwin_mbstate_t'
|     `-TypedefType 0x7ffee7068120 '__mbstate_t' sugar
|       |-Typedef 0x7ffee70680b0 '__mbstate_t'
|       `-ElaboratedType 0x7ffee7068060 'union __mbstate_t' sugar
|         `-RecordType 0x7ffee7067e90 '__mbstate_t'
|           `-CXXRecord 0x7ffee7067df8 ''
|-CXXConstructorDecl 0x7ffee83a97a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:835:34> line:834:14 codecvt 'void (size_t)'
| |-ParmVarDecl 0x7ffee83a96d0 <col:22, col:38> col:29 used __refs 'size_t':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7ffee83ac8c8 <col:38> 'size_t':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7ffee83ac8a8 <col:38> 'int' 0
| |-CXXCtorInitializer 'class locale::facet':'class std::__1::locale::facet'
| | `-CXXConstructExpr 0x7ffee83acaa0 <line:835:11, col:31> 'class locale::facet':'class std::__1::locale::facet' 'void (size_t)'
| |   `-ImplicitCastExpr 0x7ffee83aca88 <col:25> 'size_t':'unsigned long' <LValueToRValue>
| |     `-DeclRefExpr 0x7ffee83aca00 <col:25> 'size_t':'unsigned long' lvalue ParmVar 0x7ffee83a96d0 '__refs' 'size_t':'unsigned long'
| |-CXXCtorInitializer 'class std::__1::codecvt_base'
| | `-CXXConstructExpr 0x7ffee83ace78 <line:834:14> 'class std::__1::codecvt_base' 'void (void)'
| |-CompoundStmt 0x7ffee83acef0 <line:835:33, col:34>
| |-AlwaysInlineAttr 0x7ffee83a9850 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7ffee83a9898 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7ffee83a9f30 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:843:5> line:838:12 out 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const'
| |-ParmVarDecl 0x7ffee83a9968 <col:16, col:28> col:28 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7ffee83a9a28 <line:839:16, col:35> col:35 used __frm 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7ffee83a9a98 <col:42, col:61> col:61 used __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7ffee83a9b70 <col:72, col:92> col:92 used __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-ParmVarDecl 0x7ffee83a9c28 <line:840:16, col:29> col:29 used __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7ffee83a9c98 <col:35, col:48> col:48 used __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7ffee83a9d70 <col:58, col:72> col:72 used __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-CompoundStmt 0x7ffee83ad148 <line:841:5, line:843:5>
| | `-ReturnStmt 0x7ffee83ad130 <line:842:9, col:82>
| |   `-CXXMemberCallExpr 0x7ffee83ad070 <col:16, col:82> 'enum std::__1::codecvt_base::result'
| |     |-MemberExpr 0x7ffee83acf20 <col:16> '<bound member function type>' ->do_out 0x7ffee83ab9a0
| |     | `-CXXThisExpr 0x7ffee83acf08 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7ffee83acf58 <col:23> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7ffee83a9968 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7ffee83ad0d0 <col:29> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7ffee83acf80 <col:29> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7ffee83a9a28 '__frm' 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     |-ImplicitCastExpr 0x7ffee83ad0e8 <col:36> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7ffee83acfa8 <col:36> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7ffee83a9a98 '__frm_end' 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     |-DeclRefExpr 0x7ffee83acfd0 <col:47> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7ffee83a9b70 '__frm_nxt' 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |     |-ImplicitCastExpr 0x7ffee83ad100 <col:58> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7ffee83acff8 <col:58> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7ffee83a9c28 '__to' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7ffee83ad118 <col:64> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7ffee83ad020 <col:64> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7ffee83a9c98 '__to_end' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     `-DeclRefExpr 0x7ffee83ad048 <col:74> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7ffee83a9d70 '__to_nxt' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-AlwaysInlineAttr 0x7ffee83aa000 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7ffee83aa048 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7ffee83aa330 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:850:5> line:846:12 unshift 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const'
| |-ParmVarDecl 0x7ffee83aa098 <col:20, col:32> col:32 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7ffee83aa108 <line:847:20, col:33> col:33 used __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7ffee83aa178 <col:39, col:52> col:52 used __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7ffee83aa1f0 <col:62, col:76> col:76 used __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-CompoundStmt 0x7ffee83ad2e8 <line:848:5, line:850:5>
| | `-ReturnStmt 0x7ffee83ad2d0 <line:849:9, col:57>
| |   `-CXXMemberCallExpr 0x7ffee83ad258 <col:16, col:57> 'enum std::__1::codecvt_base::result'
| |     |-MemberExpr 0x7ffee83ad180 <col:16> '<bound member function type>' ->do_unshift 0x7ffee83ac0c0
| |     | `-CXXThisExpr 0x7ffee83ad168 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7ffee83ad1b8 <col:27> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7ffee83aa098 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7ffee83ad2a0 <col:33> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7ffee83ad1e0 <col:33> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7ffee83aa108 '__to' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7ffee83ad2b8 <col:39> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7ffee83ad208 <col:39> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7ffee83aa178 '__to_end' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     `-DeclRefExpr 0x7ffee83ad230 <col:49> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7ffee83aa1f0 '__to_nxt' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-AlwaysInlineAttr 0x7ffee83aa3e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7ffee83aa430 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7ffee83aa900 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:858:5> line:853:12 in 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *&) const'
| |-ParmVarDecl 0x7ffee83aa480 <col:15, col:27> col:27 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7ffee83aa518 <line:854:15, col:34> col:34 used __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7ffee83aa588 <col:41, col:60> col:60 used __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7ffee83aa630 <col:71, col:91> col:91 used __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-ParmVarDecl 0x7ffee83aa6c8 <line:855:15, col:28> col:28 used __to 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7ffee83aa738 <col:34, col:47> col:47 used __to_end 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7ffee83aa7e0 <col:57, col:71> col:71 used __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-CompoundStmt 0x7ffee83ad548 <line:856:5, line:858:5>
| | `-ReturnStmt 0x7ffee83ad530 <line:857:9, col:81>
| |   `-CXXMemberCallExpr 0x7ffee83ad470 <col:16, col:81> 'enum std::__1::codecvt_base::result'
| |     |-MemberExpr 0x7ffee83ad320 <col:16> '<bound member function type>' ->do_in 0x7ffee83abde8
| |     | `-CXXThisExpr 0x7ffee83ad308 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7ffee83ad358 <col:22> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7ffee83aa480 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7ffee83ad4d0 <col:28> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7ffee83ad380 <col:28> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7ffee83aa518 '__frm' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7ffee83ad4e8 <col:35> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7ffee83ad3a8 <col:35> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7ffee83aa588 '__frm_end' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-DeclRefExpr 0x7ffee83ad3d0 <col:46> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7ffee83aa630 '__frm_nxt' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |     |-ImplicitCastExpr 0x7ffee83ad500 <col:57> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7ffee83ad3f8 <col:57> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7ffee83aa6c8 '__to' 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     |-ImplicitCastExpr 0x7ffee83ad518 <col:63> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7ffee83ad420 <col:63> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7ffee83aa738 '__to_end' 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     `-DeclRefExpr 0x7ffee83ad448 <col:73> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7ffee83aa7e0 '__to_nxt' 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-AlwaysInlineAttr 0x7ffee83aa9d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7ffee83aaa18 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7ffee83aaa88 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:864:5> line:861:9 encoding 'int (void) const noexcept'
| |-CompoundStmt 0x7ffee83ad5f8 <line:862:5, line:864:5>
| | `-ReturnStmt 0x7ffee83ad5e0 <line:863:9, col:28>
| |   `-CXXMemberCallExpr 0x7ffee83ad5b8 <col:16, col:28> 'int'
| |     `-MemberExpr 0x7ffee83ad580 <col:16> '<bound member function type>' ->do_encoding 0x7ffee83ac1a8
| |       `-CXXThisExpr 0x7ffee83ad568 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |-AlwaysInlineAttr 0x7ffee83aab20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7ffee83aab68 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7ffee83aabd0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:870:5> line:867:10 always_noconv '_Bool (void) const noexcept'
| |-CompoundStmt 0x7ffee83ad6a8 <line:868:5, line:870:5>
| | `-ReturnStmt 0x7ffee83ad690 <line:869:9, col:33>
| |   `-CXXMemberCallExpr 0x7ffee83ad668 <col:16, col:33> '_Bool'
| |     `-MemberExpr 0x7ffee83ad630 <col:16> '<bound member function type>' ->do_always_noconv 0x7ffee83ac268
| |       `-CXXThisExpr 0x7ffee83ad618 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |-AlwaysInlineAttr 0x7ffee83aac68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7ffee83aacb0 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7ffee83aaf98 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:876:5> line:873:9 length 'int (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, size_t) const'
| |-ParmVarDecl 0x7ffee83aad00 <col:16, col:28> col:28 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7ffee83aad70 <col:34, col:53> col:53 used __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7ffee83aade0 <col:60, col:79> col:79 used __end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7ffee83aae50 <col:86, col:93> col:93 used __mx 'size_t':'unsigned long'
| |-CompoundStmt 0x7ffee83ad860 <line:874:5, line:876:5>
| | `-ReturnStmt 0x7ffee83ad848 <line:875:9, col:50>
| |   `-CXXMemberCallExpr 0x7ffee83ad7b8 <col:16, col:50> 'int'
| |     |-MemberExpr 0x7ffee83ad6e0 <col:16> '<bound member function type>' ->do_length 0x7ffee83ac508
| |     | `-CXXThisExpr 0x7ffee83ad6c8 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7ffee83ad718 <col:26> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7ffee83aad00 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7ffee83ad800 <col:32> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7ffee83ad740 <col:32> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7ffee83aad70 '__frm' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7ffee83ad818 <col:39> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7ffee83ad768 <col:39> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7ffee83aade0 '__end' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     `-ImplicitCastExpr 0x7ffee83ad830 <col:46> 'size_t':'unsigned long' <LValueToRValue>
| |       `-DeclRefExpr 0x7ffee83ad790 <col:46> 'size_t':'unsigned long' lvalue ParmVar 0x7ffee83aae50 '__mx' 'size_t':'unsigned long'
| |-AlwaysInlineAttr 0x7ffee83ab050 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7ffee83ab098 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7ffee83ab108 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:882:5> line:879:9 max_length 'int (void) const noexcept'
| |-CompoundStmt 0x7ffee83ad910 <line:880:5, line:882:5>
| | `-ReturnStmt 0x7ffee83ad8f8 <line:881:9, col:30>
| |   `-CXXMemberCallExpr 0x7ffee83ad8d0 <col:16, col:30> 'int'
| |     `-MemberExpr 0x7ffee83ad898 <col:16> '<bound member function type>' ->do_max_length 0x7ffee83ac5f0
| |       `-CXXThisExpr 0x7ffee83ad880 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |-AlwaysInlineAttr 0x7ffee83ab1a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7ffee83ab1e8 <col:48, col:71> Hidden
|-VarDecl 0x7ffee83ab258 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:884:5, col:23> col:23 id 'class locale::id':'class std::__1::locale::id' static
|-AccessSpecDecl 0x7ffee83ab2b8 <line:886:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7ffee83ab428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:889:34> line:888:14 codecvt 'void (const char *, size_t)'
| |-ParmVarDecl 0x7ffee83ab328 <col:22, col:32> col:33 'const char *'
| |-ParmVarDecl 0x7ffee83ab398 <col:35, col:51> col:42 used __refs 'size_t':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7ffee83ac900 <col:51> 'size_t':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7ffee83ac8e0 <col:51> 'int' 0
| |-CXXCtorInitializer 'class locale::facet':'class std::__1::locale::facet'
| | `-CXXConstructExpr 0x7ffee83ad9d8 <line:889:11, col:31> 'class locale::facet':'class std::__1::locale::facet' 'void (size_t)'
| |   `-ImplicitCastExpr 0x7ffee83ad9c0 <col:25> 'size_t':'unsigned long' <LValueToRValue>
| |     `-DeclRefExpr 0x7ffee83ad938 <col:25> 'size_t':'unsigned long' lvalue ParmVar 0x7ffee83ab398 '__refs' 'size_t':'unsigned long'
| |-CXXCtorInitializer 'class std::__1::codecvt_base'
| | `-CXXConstructExpr 0x7ffee83ada38 <line:888:14> 'class std::__1::codecvt_base' 'void (void)'
| |-CompoundStmt 0x7ffee83adab0 <line:889:33, col:34>
| |-AlwaysInlineAttr 0x7ffee83ab4e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7ffee83ab528 <col:48, col:71> Hidden
|-CXXDestructorDecl 0x7ffee83ab588 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:891:5, col:14> col:5 ~codecvt 'void (void) noexcept'
|-CXXMethodDecl 0x7ffee83ab9a0 <line:893:5, line:895:93> line:893:20 used do_out 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const' virtual
| |-ParmVarDecl 0x7ffee83ab638 <col:27, col:39> col:39 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7ffee83ab6a8 <line:894:27, col:46> col:46 __frm 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7ffee83ab718 <col:53, col:72> col:72 __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7ffee83ab790 <col:83, col:103> col:103 __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-ParmVarDecl 0x7ffee83ab800 <line:895:27, col:40> col:40 __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7ffee83ab870 <col:46, col:59> col:59 __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| `-ParmVarDecl 0x7ffee83ab8e8 <col:69, col:83> col:83 __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
|-CXXMethodDecl 0x7ffee83abde8 <line:896:5, line:898:92> line:896:20 used do_in 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *&) const' virtual
| |-ParmVarDecl 0x7ffee83aba80 <col:26, col:38> col:38 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7ffee83abaf0 <line:897:26, col:45> col:45 __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7ffee83abb60 <col:52, col:71> col:71 __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7ffee83abbd8 <col:82, col:102> col:102 __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-ParmVarDecl 0x7ffee83abc48 <line:898:26, col:39> col:39 __to 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7ffee83abcb8 <col:45, col:58> col:58 __to_end 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| `-ParmVarDecl 0x7ffee83abd30 <col:68, col:82> col:82 __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
|-CXXMethodDecl 0x7ffee83ac0c0 <line:899:5, line:900:97> line:899:20 used do_unshift 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const' virtual
| |-ParmVarDecl 0x7ffee83abec8 <col:31, col:43> col:43 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7ffee83abf38 <line:900:31, col:44> col:44 __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7ffee83abfa8 <col:50, col:63> col:63 __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| `-ParmVarDecl 0x7ffee83ac020 <col:73, col:87> col:87 __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
|-CXXMethodDecl 0x7ffee83ac1a8 <line:901:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:901:17 used do_encoding 'int (void) const noexcept' virtual
|-CXXMethodDecl 0x7ffee83ac268 <line:902:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:902:18 used do_always_noconv '_Bool (void) const noexcept' virtual
|-CXXMethodDecl 0x7ffee83ac508 <line:903:5, col:110> col:17 used do_length 'int (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, size_t) const' virtual
| |-ParmVarDecl 0x7ffee83ac310 <col:27, col:39> col:39 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7ffee83ac380 <col:45, col:64> col:64 __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7ffee83ac3f0 <col:71, col:90> col:90 __end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| `-ParmVarDecl 0x7ffee83ac460 <col:97, col:104> col:104 __mx 'size_t':'unsigned long'
|-CXXMethodDecl 0x7ffee83ac5f0 <line:904:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:904:17 used do_max_length 'int (void) const noexcept' virtual
`-CXXMethodDecl 0x7ffee83ac728 <line:824:24, <invalid sloc>> col:24 implicit operator= 'class std::__1::codecvt<char, char, mbstate_t> &(const class std::__1::codecvt<char, char, mbstate_t> &)' inline default_delete noexcept-unevaluated 0x7ffee83ac728
  `-ParmVarDecl 0x7ffee83ac840 <col:24> col:24 'const class std::__1::codecvt<char, char, mbstate_t> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::codecvt" = type { %"class.std::__1::locale::facet" }
  NonVirtualBaseLLVMType:%"class.std::__1::codecvt" = type { %"class.std::__1::locale::facet" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffee7067df8 </usr/include/i386/_types.h:76:9, line:79:1> line:76:9 union definition
|-FieldDecl 0x7ffee7067f98 <line:77:2, col:22> col:8 __mbstate8 'char [128]'
|-FieldDecl 0x7ffee7067ff8 <line:78:2, col:12> col:12 _mbstateL 'long long'
|-CXXConstructorDecl 0x7ffee7b44330 <line:76:9> col:9 implicit used  'void (void) noexcept' inline default trivial
| `-CompoundStmt 0x7ffee7b44798 <col:9>
|-CXXConstructorDecl 0x7ffee7b44448 <col:9> col:9 implicit constexpr  'void (const __mbstate_t &)' inline default trivial noexcept-unevaluated 0x7ffee7b44448
| `-ParmVarDecl 0x7ffee7b44570 <col:9> col:9 'const __mbstate_t &'
|-CXXConstructorDecl 0x7ffee7b44608 <col:9> col:9 implicit constexpr  'void (__mbstate_t &&)' inline default trivial noexcept-unevaluated 0x7ffee7b44608
| `-ParmVarDecl 0x7ffee7b44730 <col:9> col:9 '__mbstate_t &&'
`-CXXDestructorDecl 0x7ffee752adc8 <col:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.__mbstate_t = type { i64, [120 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffee80b7628 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:128:1, line:129:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:183:28 class basic_filebuf definition
|-public 'basic_streambuf<char, struct std::__1::char_traits<char> >':'class std::__1::basic_streambuf<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-CXXRecordDecl 0x7ffee7528398 prev 0x7ffee80b7628 <col:1, col:28> col:28 implicit class basic_filebuf
|-AccessSpecDecl 0x7ffee7528430 <line:186:1, col:7> col:1 public
|-TypedefDecl 0x7ffee7528468 <line:187:5, col:46> col:46 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7ffee7528240 'char' sugar
|   |-TemplateTypeParmType 0x7ffee74b3a70 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7ffee74b3a28 '_CharT'
|   `-BuiltinType 0x7ffee7032b60 'char'
|-TypedefDecl 0x7ffee75284d0 <line:188:5, col:46> col:46 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7ffee7528280 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7ffee74b3ae0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7ffee74b3a98 '_Traits'
|   `-RecordType 0x7ffee80b4f60 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7ffee72bd088 'char_traits'
|-TypedefDecl 0x7ffee75285e0 <line:189:5, col:46> col:46 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7ffee7528590 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7ffee72bebd0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7ffee72bd3e8 'int_type'
|     `-BuiltinType 0x7ffee7032bc0 'int'
|-TypedefDecl 0x7ffee75286b0 <line:190:5, col:46> col:46 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7ffee7528660 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7ffee83d4090 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7ffee72bd4b8 'pos_type'
|     `-TypedefType 0x7ffee72b2c40 'std::__1::streampos' sugar
|       |-Typedef 0x7ffee80bb1b8 'streampos'
|       `-TemplateSpecializationType 0x7ffee80bb110 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7ffee80bb0f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7ffee80bb000 'fpos'
|-TypedefDecl 0x7ffee7528780 <line:191:5, col:46> col:46 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7ffee7528730 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7ffee83d4180 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7ffee72bd450 'off_type'
|     `-TypedefType 0x7ffee72b2bb0 'std::__1::streamoff' sugar
|       |-Typedef 0x7ffee80bb558 'streamoff'
|       `-BuiltinType 0x7ffee7032c00 'long long'
|-TypedefDecl 0x7ffee7528870 <line:192:5, col:46> col:46 state_type 'typename traits_type::state_type':'__mbstate_t'
| `-ElaboratedType 0x7ffee7528820 'typename traits_type::state_type' sugar
|   `-TypedefType 0x7ffee7528800 'std::__1::char_traits<char>::state_type' sugar
|     |-Typedef 0x7ffee72bd520 'state_type'
|     `-TypedefType 0x7ffee809c780 'mbstate_t' sugar
|       |-Typedef 0x7ffee7810bf0 'mbstate_t'
|       `-TypedefType 0x7ffee7810bc0 '__darwin_mbstate_t' sugar
|         |-Typedef 0x7ffee7068150 '__darwin_mbstate_t'
|         `-TypedefType 0x7ffee7068120 '__mbstate_t' sugar
|           |-Typedef 0x7ffee70680b0 '__mbstate_t'
|           `-ElaboratedType 0x7ffee7068060 'union __mbstate_t' sugar
|             `-RecordType 0x7ffee7067e90 '__mbstate_t'
|               `-CXXRecord 0x7ffee7067df8 ''
|-CXXConstructorDecl 0x7ffee7528908 <line:195:5, col:19> col:5 basic_filebuf 'void (void)'
|-CXXConstructorDecl 0x7ffee7528ae0 <line:197:5, col:40> col:5 basic_filebuf 'void (class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&)'
| `-ParmVarDecl 0x7ffee75289f8 <col:19, col:35> col:35 __rhs 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&'
|-CXXDestructorDecl 0x7ffee7528bd0 <line:199:5, col:28> col:13 used ~basic_filebuf 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7ffee7528d80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:204:51> col:20 operator= 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &(class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&)'
| |-ParmVarDecl 0x7ffee7528cb8 <col:30, col:46> col:46 __rhs 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&'
| `-AlwaysInlineAttr 0x7ffee7528e30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7ffee7528f50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:206:5, col:35> col:10 swap 'void (class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &)'
| `-ParmVarDecl 0x7ffee7528e88 <col:15, col:30> col:30 __rhs 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &'
|-CXXMethodDecl 0x7ffee7529000 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:210:20> col:10 is_open '_Bool (void) const'
| `-AlwaysInlineAttr 0x7ffee75290a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7ffee7529260 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:212:5, col:67> col:20 open 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > *(const char *, class ios_base::openmode)'
| |-ParmVarDecl 0x7ffee75290f0 <col:25, col:37> col:37 __s 'const char *'
| `-ParmVarDecl 0x7ffee7529150 <col:42, col:61> col:61 __mode 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7ffee7529490 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:214:69> col:20 open 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > *(const std::__1::string &, class ios_base::openmode)'
| |-ParmVarDecl 0x7ffee7529318 <col:25, col:39> col:39 __s 'const std::__1::string &'
| |-ParmVarDecl 0x7ffee7529378 <col:44, col:63> col:63 __mode 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7ffee7529548 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7ffee75295e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:216:5, col:26> col:20 close 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > *(void)'
|-AccessSpecDecl 0x7ffee7529688 <line:218:1, col:10> col:1 protected
|-CXXMethodDecl 0x7ffee7529720 <line:220:5, col:32> col:22 underflow 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7ffee75298a0 <line:221:5, col:65> col:22 pbackfail 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7ffee75297d8 <col:32, col:64> col:41 __c 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7ffee75299e8 <line:222:5, col:65> col:22 overflow 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7ffee7529960 <col:32, col:64> col:41 __c 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7ffee7529d20 <line:223:5, col:91> col:54 setbuf 'basic_streambuf<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::traits_type> *(std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7ffee7529ba8 <col:61, col:72> col:72 __s 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7ffee7529c08 <col:77, col:88> col:88 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7ffee7529fd0 <line:224:5, line:225:85> line:224:22 seekoff 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7ffee7529e30 <col:30, col:39> col:39 __off 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7ffee7529e90 <col:46, col:64> col:64 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-ParmVarDecl 0x7ffee7529ef0 <line:225:30, col:82> col:49 __wch 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7ffee752a1d0 <line:226:5, line:227:85> line:226:22 seekpos 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7ffee752a0a0 <col:30, col:39> col:39 __sp 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ParmVarDecl 0x7ffee752a100 <line:227:30, col:82> col:49 __wch 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7ffee752a288 <line:228:5, col:22> col:17 sync 'int (void)' virtual
|-CXXMethodDecl 0x7ffee752a3b8 <line:229:5, col:43> col:18 imbue 'void (const class std::__1::locale &)' virtual
| `-ParmVarDecl 0x7ffee752a330 <col:24, col:38> col:38 __loc 'const class std::__1::locale &'
|-AccessSpecDecl 0x7ffee752a468 <line:231:1, col:8> col:1 private
|-FieldDecl 0x7ffee752a490 <line:232:5, col:17> col:17 __extbuf_ 'char *'
|-FieldDecl 0x7ffee752a4d8 <line:233:5, col:17> col:17 __extbufnext_ 'const char *'
|-FieldDecl 0x7ffee752a520 <line:234:5, col:17> col:17 __extbufend_ 'const char *'
|-FieldDecl 0x7ffee752a568 <line:235:5, col:25> col:10 __extbuf_min_ 'char [8]'
|-FieldDecl 0x7ffee752a5b0 <line:236:5, col:12> col:12 __ebs_ 'size_t':'unsigned long'
|-FieldDecl 0x7ffee752a608 <line:237:5, col:16> col:16 __intbuf_ 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7ffee752a650 <line:238:5, col:12> col:12 __ibs_ 'size_t':'unsigned long'
|-FieldDecl 0x7ffee752a698 <line:239:5, col:11> col:11 __file_ 'FILE *'
|-FieldDecl 0x7ffee752a830 <line:240:5, col:49> col:49 __cv_ 'const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> *'
|-FieldDecl 0x7ffee752a888 <line:241:5, col:16> col:16 __st_ 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type':'__mbstate_t'
|-FieldDecl 0x7ffee752a8e0 <line:242:5, col:16> col:16 __st_last_ 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type':'__mbstate_t'
|-FieldDecl 0x7ffee752a928 <line:243:5, col:24> col:24 __om_ 'class ios_base::openmode':'unsigned int'
|-FieldDecl 0x7ffee752a970 <line:244:5, col:24> col:24 __cm_ 'class ios_base::openmode':'unsigned int'
|-FieldDecl 0x7ffee752a9b8 <line:245:5, col:10> col:10 __owns_eb_ '_Bool'
|-FieldDecl 0x7ffee752aa00 <line:246:5, col:10> col:10 __owns_ib_ '_Bool'
|-FieldDecl 0x7ffee752aa48 <line:247:5, col:10> col:10 __always_noconv_ '_Bool'
|-CXXMethodDecl 0x7ffee752aa90 <line:249:5, col:22> col:10 __read_mode '_Bool (void)'
|-CXXMethodDecl 0x7ffee752ab38 <line:250:5, col:23> col:10 __write_mode 'void (void)'
`-CXXMethodDecl 0x7ffee752ac48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:129:32, <invalid sloc>> col:32 implicit operator= 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &(const class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &)' inline default_delete noexcept-unevaluated 0x7ffee752ac48
  `-ParmVarDecl 0x7ffee752ad60 <col:32> col:32 'const class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_filebuf" = type <{ %"class.std::__1::basic_streambuf", i8*, i8*, i8*, [8 x i8], i64, i8*, i64, %struct.__sFILE*, %"class.std::__1::codecvt"*, %union.__mbstate_t, %union.__mbstate_t, i32, i32, i8, i8, i8, [5 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_filebuf.base" = type <{ %"class.std::__1::basic_streambuf", i8*, i8*, i8*, [8 x i8], i64, i8*, i64, %struct.__sFILE*, %"class.std::__1::codecvt"*, %union.__mbstate_t, %union.__mbstate_t, i32, i32, i8, i8, i8 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffee80b7f18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:134:1, line:135:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1324:28 class basic_fstream definition
|-public 'basic_iostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_iostream<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-CXXRecordDecl 0x7ffee7526920 prev 0x7ffee80b7f18 <col:1, col:28> col:28 implicit class basic_fstream
|-AccessSpecDecl 0x7ffee75269b8 <line:1327:1, col:7> col:1 public
|-TypedefDecl 0x7ffee75269f0 <line:1328:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7ffee75267b0 'char' sugar
|   |-TemplateTypeParmType 0x7ffee7510850 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7ffee7510808 '_CharT'
|   `-BuiltinType 0x7ffee7032b60 'char'
|-TypedefDecl 0x7ffee7526a58 <line:1329:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7ffee75267f0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7ffee75108c0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7ffee7510878 '_Traits'
|   `-RecordType 0x7ffee80b4f60 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7ffee72bd088 'char_traits'
|-TypedefDecl 0x7ffee7526b60 <line:1330:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7ffee7526b10 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7ffee72bebd0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7ffee72bd3e8 'int_type'
|     `-BuiltinType 0x7ffee7032bc0 'int'
|-TypedefDecl 0x7ffee7526c30 <line:1331:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7ffee7526be0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7ffee83d4090 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7ffee72bd4b8 'pos_type'
|     `-TypedefType 0x7ffee72b2c40 'std::__1::streampos' sugar
|       |-Typedef 0x7ffee80bb1b8 'streampos'
|       `-TemplateSpecializationType 0x7ffee80bb110 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7ffee80bb0f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7ffee80bb000 'fpos'
|-TypedefDecl 0x7ffee7526d00 <line:1332:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7ffee7526cb0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7ffee83d4180 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7ffee72bd450 'off_type'
|     `-TypedefType 0x7ffee72b2bb0 'std::__1::streamoff' sugar
|       |-Typedef 0x7ffee80bb558 'streamoff'
|       `-BuiltinType 0x7ffee7032c00 'long long'
|-CXXConstructorDecl 0x7ffee7526d98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1335:19> col:5 used basic_fstream 'void (void)'
| `-AlwaysInlineAttr 0x7ffee7526e78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXConstructorDecl 0x7ffee7526fd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1338:101> col:14 used basic_fstream 'void (const char *, class ios_base::openmode)'
| |-ParmVarDecl 0x7ffee7526ec0 <col:28, col:40> col:40 __s 'const char *'
| |-ParmVarDecl 0x7ffee7526f20 <col:45, col:98> col:64 __mode 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7ffee7527098 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXConstructorDecl 0x7ffee75271f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1340:103> col:14 basic_fstream 'void (const std::__1::string &, class ios_base::openmode)'
| |-ParmVarDecl 0x7ffee75270e0 <col:28, col:42> col:42 __s 'const std::__1::string &'
| |-ParmVarDecl 0x7ffee7527140 <col:47, col:100> col:66 __mode 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7ffee75272b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXConstructorDecl 0x7ffee7527420 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1344:40> col:5 basic_fstream 'void (class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&)'
| |-ParmVarDecl 0x7ffee7527338 <col:19, col:35> col:35 __rhs 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&'
| `-AlwaysInlineAttr 0x7ffee75274e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7ffee7527630 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1349:51> col:20 operator= 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &(class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&)'
| |-ParmVarDecl 0x7ffee7527568 <col:30, col:46> col:46 __rhs 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&'
| `-AlwaysInlineAttr 0x7ffee75276e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7ffee7527800 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1352:35> col:10 swap 'void (class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &)'
| |-ParmVarDecl 0x7ffee7527738 <col:15, col:30> col:30 __rhs 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &'
| `-AlwaysInlineAttr 0x7ffee75278b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7ffee7527ac0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1355:52> col:44 rdbuf 'basic_filebuf<std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7ffee7527b68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7ffee7527bb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1357:20> col:10 is_open '_Bool (void) const'
| `-AlwaysInlineAttr 0x7ffee7527c58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7ffee7527d90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1359:5, col:88> col:10 open 'void (const char *, class ios_base::openmode)'
| |-ParmVarDecl 0x7ffee7527ca0 <col:15, col:27> col:27 __s 'const char *'
| `-ParmVarDecl 0x7ffee7527d00 <col:32, col:85> col:51 __mode 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7ffee7527f38 <line:1360:5, col:90> col:10 open 'void (const std::__1::string &, class ios_base::openmode)'
| |-ParmVarDecl 0x7ffee7527e48 <col:15, col:29> col:29 __s 'const std::__1::string &'
| `-ParmVarDecl 0x7ffee7527ea8 <col:34, col:87> col:53 __mode 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7ffee7527ff0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1363:16> col:10 close 'void (void)'
| `-AlwaysInlineAttr 0x7ffee7528098 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-AccessSpecDecl 0x7ffee75280e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1365:1, col:8> col:1 private
|-FieldDecl 0x7ffee752aea8 <line:1366:5, col:43> col:43 __sb_ 'basic_filebuf<std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::traits_type>':'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >'
|-CXXConstructorDecl 0x7ffee752af18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:135:32> col:32 implicit basic_fstream 'void (const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &)' inline default_delete noexcept-unevaluated 0x7ffee752af18
| `-ParmVarDecl 0x7ffee752b040 <col:32> col:32 'const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &'
|-CXXMethodDecl 0x7ffee752b0a8 <col:32, <invalid sloc>> col:32 implicit operator= 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &(const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &)' inline default_delete noexcept-unevaluated 0x7ffee752b0a8
| `-ParmVarDecl 0x7ffee752b1c0 <col:32> col:32 'const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &'
`-CXXDestructorDecl 0x7ffee752b248 <col:32> col:32 implicit used ~basic_fstream 'void (void) noexcept' inline default
  `-CompoundStmt 0x7ffee752d088 <col:32>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_fstream" = type { %"class.std::__1::basic_iostream.base", %"class.std::__1::basic_filebuf", %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_fstream.base" = type { %"class.std::__1::basic_iostream.base", %"class.std::__1::basic_filebuf" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffee75253d8 </Users/tskull/Documents/Programming/Cpp/object_model_refined/2_constructors/11_member_initialization_list.cpp:11:1, line:40:1> line:11:8 referenced struct C definition
|-public 'struct B'
|-CXXRecordDecl 0x7ffee7525538 <col:1, col:8> col:8 implicit referenced struct C
|-FieldDecl 0x7ffee75255e8 <line:12:5, col:19> col:19 x 'unsigned char'
|-FieldDecl 0x7ffee7525648 <line:13:5, col:19> col:19 referenced y 'unsigned char'
|-FieldDecl 0x7ffee7525710 <line:14:5, col:16> col:16 referenced m 'std::mutex':'class std::__1::mutex'
|-FieldDecl 0x7ffee7526658 <line:15:5, col:33> col:33 lg 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
|-FieldDecl 0x7ffee752b328 <line:16:5, col:18> col:18 f1 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
|-FieldDecl 0x7ffee752b3c0 <line:17:5, col:18> col:18 f2 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
|-CXXConstructorDecl 0x7ffee752b4f0 <line:19:5, line:25:21> line:19:5 used C 'void (int)'
| |-ParmVarDecl 0x7ffee752b420 <col:7, col:11> col:11 used x 'int'
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7ffee752c7b0 <col:16, col:21> 'struct B' 'void (int)'
| |   `-IntegerLiteral 0x7ffee752c738 <col:18> 'int' 123
| |-CXXCtorInitializer Field 0x7ffee75255e8 'x' 'unsigned char'
| | `-InitListExpr 0x7ffee752c8f8 <line:20:17, col:47> 'unsigned char'
| |   `-CXXStaticCastExpr 0x7ffee752c880 <col:18, col:46> 'unsigned char' static_cast<unsigned char> <NoOp>
| |     `-ImplicitCastExpr 0x7ffee752c868 <col:45> 'unsigned char' <IntegralCast>
| |       `-ImplicitCastExpr 0x7ffee752c850 <col:45> 'int' <LValueToRValue>
| |         `-DeclRefExpr 0x7ffee752c810 <col:45> 'int' lvalue ParmVar 0x7ffee752b420 'x' 'int'
| |-CXXCtorInitializer Field 0x7ffee7525648 'y' 'unsigned char'
| | `-InitListExpr 0x7ffee752c9d0 <line:21:17, col:19> 'unsigned char'
| |   `-ImplicitCastExpr 0x7ffee752ca10 <col:18> 'unsigned char' <IntegralCast>
| |     `-IntegerLiteral 0x7ffee752c968 <col:18> 'int' 0
| |-CXXCtorInitializer Field 0x7ffee7525710 'm' 'std::mutex':'class std::__1::mutex'
| | `-CXXConstructExpr 0x7ffee752cff8 <line:25:16, col:18> 'std::mutex':'class std::__1::mutex' 'void (void) noexcept' zeroing
| |-CXXCtorInitializer Field 0x7ffee7526658 'lg' 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
| | `-CXXConstructExpr 0x7ffee752cef0 <line:24:16, col:20> 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>' 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |   `-MemberExpr 0x7ffee752ce88 <col:19> 'std::mutex':'class std::__1::mutex' lvalue ->m 0x7ffee7525710
| |     `-CXXThisExpr 0x7ffee752ce70 <col:19> 'struct C *' this
| |-CXXCtorInitializer Field 0x7ffee752b328 'f1' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7ffee752cbc8 <line:22:16, col:43> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (const char *, class ios_base::openmode)'
| |   |-ImplicitCastExpr 0x7ffee752cb98 <col:19> 'const char *' <ArrayToPointerDecay>
| |   | `-StringLiteral 0x7ffee752ca58 <col:19> 'const char [8]' lvalue "test.cc"
| |   `-ImplicitCastExpr 0x7ffee752cbb0 <col:30, col:40> 'std::__1::ios_base::openmode':'unsigned int' <LValueToRValue>
| |     `-DeclRefExpr 0x7ffee752cb10 <col:30, col:40> 'const std::__1::ios_base::openmode':'const unsigned int' lvalue Var 0x7ffee7373480 'app' 'const std::__1::ios_base::openmode':'const unsigned int'
| |-CXXCtorInitializer Field 0x7ffee752b3c0 'f2' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7ffee752ce08 <line:23:16, col:63> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (const char *, class ios_base::openmode)'
| |   |-ImplicitCastExpr 0x7ffee752cdf0 <col:19> 'const char *' <ArrayToPointerDecay>
| |   | `-StringLiteral 0x7ffee752cc30 <col:19> 'const char [9]' lvalue "test.bin"
| |   `-BinaryOperator 0x7ffee752cd90 <col:31, col:60> 'unsigned int' '|'
| |     |-ImplicitCastExpr 0x7ffee752cd60 <col:31, col:41> 'std::__1::ios_base::openmode':'unsigned int' <LValueToRValue>
| |     | `-DeclRefExpr 0x7ffee752cca8 <col:31, col:41> 'const std::__1::ios_base::openmode':'const unsigned int' lvalue Var 0x7ffee7373680 'binary' 'const std::__1::ios_base::openmode':'const unsigned int'
| |     `-ImplicitCastExpr 0x7ffee752cd78 <col:50, col:60> 'std::__1::ios_base::openmode':'unsigned int' <LValueToRValue>
| |       `-DeclRefExpr 0x7ffee752cd28 <col:50, col:60> 'const std::__1::ios_base::openmode':'const unsigned int' lvalue Var 0x7ffee7373480 'app' 'const std::__1::ios_base::openmode':'const unsigned int'
| `-CompoundStmt 0x7ffee752d0a0 <line:25:20, col:21>
|-CXXConstructorDecl 0x7ffee752b680 <line:27:5, line:31:22> line:27:5 used C 'void (double)'
| |-ParmVarDecl 0x7ffee752b5b8 <col:7, col:14> col:14 used a 'double'
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7ffee752d130 <line:28:15, col:18> 'struct B' 'void (int)'
| |   `-IntegerLiteral 0x7ffee752d0b8 <col:17> 'int' 0
| |-CXXCtorInitializer Field 0x7ffee75255e8 'x' 'unsigned char'
| | `-InitListExpr 0x7ffee752d3e0 <line:30:16, col:18> 'unsigned char'
| |   `-ImplicitCastExpr 0x7ffee752d420 <col:17> 'unsigned char' <LValueToRValue>
| |     `-MemberExpr 0x7ffee752d360 <col:17> 'unsigned char' lvalue ->y 0x7ffee7525648
| |       `-CXXThisExpr 0x7ffee752d348 <col:17> 'struct C *' this
| |-CXXCtorInitializer Field 0x7ffee7525648 'y' 'unsigned char'
| | `-InitListExpr 0x7ffee752d2d8 <line:29:16, col:50> 'unsigned char'
| |   `-CXXStaticCastExpr 0x7ffee752d260 <col:17, col:49> 'unsigned char' static_cast<unsigned char> <NoOp>
| |     `-ImplicitCastExpr 0x7ffee752d248 <col:44, col:48> 'unsigned char' <FloatingToIntegral>
| |       `-BinaryOperator 0x7ffee752d208 <col:44, col:48> 'double' '+'
| |         |-ImplicitCastExpr 0x7ffee752d1d8 <col:44> 'double' <LValueToRValue>
| |         | `-DeclRefExpr 0x7ffee752d190 <col:44> 'double' lvalue ParmVar 0x7ffee752b5b8 'a' 'double'
| |         `-ImplicitCastExpr 0x7ffee752d1f0 <col:48> 'double' <IntegralToFloating>
| |           `-IntegerLiteral 0x7ffee752d1b8 <col:48> 'int' 1
| |-CXXCtorInitializer Field 0x7ffee7525710 'm' 'std::mutex':'class std::__1::mutex'
| | `-CXXConstructExpr 0x7ffee752d560 <line:27:5> 'std::mutex':'class std::__1::mutex' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7ffee7526658 'lg' 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
| | `-CXXConstructExpr 0x7ffee752d500 <line:31:15, col:19> 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>' 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |   `-MemberExpr 0x7ffee752d480 <col:18> 'std::mutex':'class std::__1::mutex' lvalue ->m 0x7ffee7525710
| |     `-CXXThisExpr 0x7ffee752d468 <col:18> 'struct C *' this
| |-CXXCtorInitializer Field 0x7ffee752b328 'f1' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7ffee752d5b8 <line:27:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| |-CXXCtorInitializer Field 0x7ffee752b3c0 'f2' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7ffee752d610 <col:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| `-CompoundStmt 0x7ffee752d6a0 <line:31:21, col:22>
|-CXXConstructorDecl 0x7ffee752b750 <line:33:5, line:39:18> line:33:5 used C 'void (void)'
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7ffee752d730 <line:35:15, col:20> 'struct B' 'void (int)'
| |   `-IntegerLiteral 0x7ffee752d6b8 <col:17> 'int' 789
| |-CXXCtorInitializer Field 0x7ffee75255e8 'x' 'unsigned char'
| | `-InitListExpr 0x7ffee752d7f8 <line:36:16, col:18> 'unsigned char'
| |   `-ImplicitCastExpr 0x7ffee752d838 <col:17> 'unsigned char' <IntegralCast>
| |     `-IntegerLiteral 0x7ffee752d790 <col:17> 'int' 0
| |-CXXCtorInitializer Field 0x7ffee7525648 'y' 'unsigned char'
| | `-InitListExpr 0x7ffee752d8e8 <line:37:16, col:18> 'unsigned char'
| |   `-ImplicitCastExpr 0x7ffee752d928 <col:17> 'unsigned char' <IntegralCast>
| |     `-IntegerLiteral 0x7ffee752d880 <col:17> 'int' 0
| |-CXXCtorInitializer Field 0x7ffee7525710 'm' 'std::mutex':'class std::__1::mutex'
| | `-CXXConstructExpr 0x7ffee752da68 <line:33:5> 'std::mutex':'class std::__1::mutex' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7ffee7526658 'lg' 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
| | `-CXXConstructExpr 0x7ffee752da08 <line:38:15, col:19> 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>' 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |   `-MemberExpr 0x7ffee752d988 <col:18> 'std::mutex':'class std::__1::mutex' lvalue ->m 0x7ffee7525710
| |     `-CXXThisExpr 0x7ffee752d970 <col:18> 'struct C *' this
| |-CXXCtorInitializer Field 0x7ffee752b328 'f1' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7ffee752dac0 <line:33:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| |-CXXCtorInitializer Field 0x7ffee752b3c0 'f2' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7ffee752db18 <col:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| `-CXXTryStmt 0x7ffee752dbf0 <line:34:5, line:39:18>
|   |-CompoundStmt 0x7ffee752dba8 <line:38:21, col:22>
|   `-CXXCatchStmt 0x7ffee752dbd8 <line:39:5, col:18>
|     |-<<<NULL>>>
|     `-CompoundStmt 0x7ffee752dbc0 <col:17, col:18>
|-CXXConstructorDecl 0x7ffee752bba8 <line:11:8> col:8 implicit C 'void (const struct C &)' inline default_delete noexcept-unevaluated 0x7ffee752bba8
| `-ParmVarDecl 0x7ffee752bcd0 <col:8> col:8 'const struct C &'
|-CXXConstructorDecl 0x7ffee752be48 <col:8> col:8 implicit C 'void (struct C &&)' inline default_delete noexcept-unevaluated 0x7ffee752be48
| `-ParmVarDecl 0x7ffee752bf70 <col:8> col:8 'struct C &&'
|-CXXMethodDecl 0x7ffee752c008 <col:8, <invalid sloc>> col:8 implicit operator= 'struct C &(const struct C &)' inline default_delete noexcept-unevaluated 0x7ffee752c008
| `-ParmVarDecl 0x7ffee752c120 <col:8> col:8 'const struct C &'
|-CXXMethodDecl 0x7ffee752c4b8 <col:8, <invalid sloc>> col:8 implicit operator= 'struct C &(struct C &&)' inline default_delete noexcept-unevaluated 0x7ffee752c4b8
| `-ParmVarDecl 0x7ffee752c5d0 <col:8> col:8 'struct C &&'
`-CXXDestructorDecl 0x7ffee752c658 <col:8> col:8 implicit used ~C 'void (void) noexcept' inline default
  `-CompoundStmt 0x7ffee752ddb0 <col:8>

Layout: <CGRecordLayout
  LLVMType:%struct.C = type { %struct.B, i8, i8, %"class.std::__1::mutex", %"class.std::__1::lock_guard", %"class.std::__1::basic_fstream", %"class.std::__1::basic_fstream" }
  NonVirtualBaseLLVMType:%struct.C = type { %struct.B, i8, i8, %"class.std::__1::mutex", %"class.std::__1::lock_guard", %"class.std::__1::basic_fstream", %"class.std::__1::basic_fstream" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1185:9)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1203:9)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<long, long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::fpos<__mbstate_t>
         0 |   __mbstate_t __st_
         0 |     char [128] __mbstate8
         0 |     long long _mbstateL
       128 |   std::__1::streamoff __off_
           | [sizeof=136, dsize=136, align=8,
           |  nvsize=136, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffee80bb000 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:175:1, col:64> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:500:28 class fpos definition
|-TemplateArgument type '__mbstate_t'
|-CXXRecordDecl 0x7ffee75454a0 prev 0x7ffee80bb000 <col:1, col:28> col:28 implicit class fpos
|-AccessSpecDecl 0x7ffee7545538 <line:502:1, col:8> col:1 private
|-FieldDecl 0x7ffee7545598 <line:503:5, col:13> col:13 referenced __st_ '__mbstate_t':'__mbstate_t'
|-FieldDecl 0x7ffee75455e0 <line:504:5, col:15> col:15 referenced __off_ 'std::__1::streamoff':'long long'
|-AccessSpecDecl 0x7ffee7545628 <line:505:1, col:7> col:1 public
|-CXXConstructorDecl 0x7ffee7545718 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:506:93> col:31 used fpos 'void (std::__1::streamoff)'
| |-ParmVarDecl 0x7ffee7545650 <col:36, col:64> col:46 used __off 'std::__1::streamoff':'long long'
| |-CXXCtorInitializer Field 0x7ffee7545598 '__st_' '__mbstate_t':'__mbstate_t'
| | `-CXXConstructExpr 0x7ffee75483d8 <col:69, col:75> '__mbstate_t':'__mbstate_t' 'void (void) noexcept' zeroing
| |-CXXCtorInitializer Field 0x7ffee75455e0 '__off_' 'std::__1::streamoff':'long long'
| | `-ImplicitCastExpr 0x7ffee7548458 <col:85> 'std::__1::streamoff':'long long' <LValueToRValue>
| |   `-DeclRefExpr 0x7ffee7548430 <col:85> 'std::__1::streamoff':'long long' lvalue ParmVar 0x7ffee7545650 '__off' 'std::__1::streamoff':'long long'
| |-CompoundStmt 0x7ffee78dd270 <col:92, col:93>
| `-AlwaysInlineAttr 0x7ffee7545808 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConversionDecl 0x7ffee7545850 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:508:73> col:31 used operator long long 'std::__1::streamoff (void) const'
| |-CompoundStmt 0x7ffee75497b0 <col:58, col:73>
| | `-ReturnStmt 0x7ffee7549798 <col:59, col:66>
| |   `-ImplicitCastExpr 0x7ffee7549780 <col:66> 'std::__1::streamoff':'long long' <LValueToRValue>
| |     `-MemberExpr 0x7ffee7549748 <col:66> 'const std::__1::streamoff':'const long long' lvalue ->__off_ 0x7ffee75455e0
| |       `-CXXThisExpr 0x7ffee7549730 <col:66> 'const class std::__1::fpos<__mbstate_t> *' this
| `-AlwaysInlineAttr 0x7ffee75458f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee75459d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:510:67> col:39 used state '__mbstate_t (void) const'
| |-CompoundStmt 0x7ffee7549870 <col:53, col:67>
| | `-ReturnStmt 0x7ffee7549858 <col:54, col:61>
| |   `-CXXConstructExpr 0x7ffee7549820 <col:61> '__mbstate_t':'__mbstate_t' 'void (const __mbstate_t &) noexcept'
| |     `-MemberExpr 0x7ffee75497e8 <col:61> 'const __mbstate_t':'const __mbstate_t' lvalue ->__st_ 0x7ffee7545598
| |       `-CXXThisExpr 0x7ffee75497d0 <col:61> 'const class std::__1::fpos<__mbstate_t> *' this
| `-AlwaysInlineAttr 0x7ffee7545a78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee7545bd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:511:70> col:36 used state 'void (__mbstate_t)'
| |-ParmVarDecl 0x7ffee7545ad0 <col:42, col:50> col:50 used __st '__mbstate_t':'__mbstate_t'
| |-CompoundStmt 0x7ffee75489c8 <col:56, col:70>
| | `-CXXOperatorCallExpr 0x7ffee7548980 <col:57, col:65> '__mbstate_t' lvalue
| |   |-ImplicitCastExpr 0x7ffee7548968 <col:63> '__mbstate_t &(*)(const __mbstate_t &) noexcept' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7ffee7548878 <col:63> '__mbstate_t &(const __mbstate_t &) noexcept' lvalue CXXMethod 0x7ffee7548520 'operator=' '__mbstate_t &(const __mbstate_t &) noexcept'
| |   |-MemberExpr 0x7ffee75484c0 <col:57> '__mbstate_t':'__mbstate_t' lvalue ->__st_ 0x7ffee7545598
| |   | `-CXXThisExpr 0x7ffee75484a8 <col:57> 'class std::__1::fpos<__mbstate_t> *' this
| |   `-ImplicitCastExpr 0x7ffee7548828 <col:65> 'const __mbstate_t':'const __mbstate_t' lvalue <NoOp>
| |     `-DeclRefExpr 0x7ffee75484f8 <col:65> '__mbstate_t':'__mbstate_t' lvalue ParmVar 0x7ffee7545ad0 '__st' '__mbstate_t':'__mbstate_t'
| `-AlwaysInlineAttr 0x7ffee7545c80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee7545e00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:513:96> col:37 operator+= 'class std::__1::fpos<__mbstate_t> &(std::__1::streamoff)'
| |-ParmVarDecl 0x7ffee7545cf8 <col:48, col:58> col:58 __off 'std::__1::streamoff':'long long'
| `-AlwaysInlineAttr 0x7ffee7545eb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee7546000 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:514:114> col:37 operator+ 'class std::__1::fpos<__mbstate_t> (std::__1::streamoff) const'
| |-ParmVarDecl 0x7ffee7545ef8 <col:48, col:58> col:58 __off 'std::__1::streamoff':'long long'
| `-AlwaysInlineAttr 0x7ffee75460b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee7546180 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:515:96> col:37 operator-= 'class std::__1::fpos<__mbstate_t> &(std::__1::streamoff)'
| |-ParmVarDecl 0x7ffee75460f8 <col:48, col:58> col:58 __off 'std::__1::streamoff':'long long'
| `-AlwaysInlineAttr 0x7ffee7546230 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffee7546300 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:516:114> col:37 operator- 'class std::__1::fpos<__mbstate_t> (std::__1::streamoff) const'
| |-ParmVarDecl 0x7ffee7546278 <col:48, col:58> col:58 __off 'std::__1::streamoff':'long long'
| `-AlwaysInlineAttr 0x7ffee75463b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7ffee7546c08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:500:28> col:28 implicit constexpr fpos 'void (const class std::__1::fpos<__mbstate_t> &)' inline default trivial noexcept-unevaluated 0x7ffee7546c08
| `-ParmVarDecl 0x7ffee7546d30 <col:28> col:28 'const class std::__1::fpos<__mbstate_t> &'
|-CXXConstructorDecl 0x7ffee7546dc8 <col:28> col:28 implicit used constexpr fpos 'void (class std::__1::fpos<__mbstate_t> &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7ffee7546ef0 <col:28> col:28 used 'class std::__1::fpos<__mbstate_t> &&'
| |-CXXCtorInitializer Field 0x7ffee7545598 '__st_' '__mbstate_t':'__mbstate_t'
| | `-CXXConstructExpr 0x7ffee7547258 <col:28> '__mbstate_t':'__mbstate_t' 'void (__mbstate_t &&) noexcept'
| |   `-MemberExpr 0x7ffee75471f0 <col:28> '__mbstate_t':'__mbstate_t' xvalue .__st_ 0x7ffee7545598
| |     `-CXXStaticCastExpr 0x7ffee75471c0 <col:28> 'class std::__1::fpos<__mbstate_t>' xvalue static_cast<class std::__1::fpos<__mbstate_t> &&> <NoOp>
| |       `-DeclRefExpr 0x7ffee7547188 <col:28> 'class std::__1::fpos<__mbstate_t>' lvalue ParmVar 0x7ffee7546ef0 '' 'class std::__1::fpos<__mbstate_t> &&'
| |-CXXCtorInitializer Field 0x7ffee75455e0 '__off_' 'std::__1::streamoff':'long long'
| | `-ImplicitCastExpr 0x7ffee7547370 <col:28> 'std::__1::streamoff':'long long' <LValueToRValue>
| |   `-MemberExpr 0x7ffee7547320 <col:28> 'std::__1::streamoff':'long long' xvalue .__off_ 0x7ffee75455e0
| |     `-CXXStaticCastExpr 0x7ffee75472f0 <col:28> 'class std::__1::fpos<__mbstate_t>' xvalue static_cast<class std::__1::fpos<__mbstate_t> &&> <NoOp>
| |       `-DeclRefExpr 0x7ffee75472b8 <col:28> 'class std::__1::fpos<__mbstate_t>' lvalue ParmVar 0x7ffee7546ef0 '' 'class std::__1::fpos<__mbstate_t> &&'
| `-CompoundStmt 0x7ffee75473c0 <col:28>
`-CXXDestructorDecl 0x7ffee7546f90 <col:28> col:28 implicit referenced ~fpos 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::fpos" = type { %union.__mbstate_t, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::fpos" = type { %union.__mbstate_t, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffee8c761c8 prev 0x7ffee8c75b10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/mutex:571:1, line:596:1> line:571:29 referenced struct once_flag definition
|-TypeVisibilityAttr 0x7ffee8c762c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:658:52, col:81> Default
|-CXXRecordDecl 0x7ffee8c76310 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/mutex:571:1, col:29> col:29 implicit referenced struct once_flag
|-CXXConstructorDecl 0x7ffee8c76450 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/mutex:575:46> col:9 used constexpr once_flag 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7ffee8c768b8 '__state_' 'unsigned long'
| | `-ImplicitCastExpr 0x7ffee8c76e90 <col:42> 'unsigned long' <IntegralCast>
