
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__scalar_hash<struct std::__1::_PairT, 2> (empty)
         0 |   struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1509:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<unsigned long, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1000000000, 1>, false, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_mutex_t
         0 |   long __sig
         8 |   char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_cond_t
         0 |   long __sig
         8 |   char [40] __opaque
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1, 1>, true, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::once_flag
         0 |   unsigned long __state_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale::id
         0 |   struct std::__1::once_flag __flag_
         0 |     unsigned long __state_
         8 |   int32_t __id_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__basic_string_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (empty)
         0 |   class std::__1::allocator<char> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<char>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |       class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false>
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<wchar_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (empty)
         0 |   class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> >
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false> (base)
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |           union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<wchar_t>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> > __r_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false> (base)
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |             union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (base) (empty)
         0 |       class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::money_base::pattern
         0 |   char [4] field
           | [sizeof=4, dsize=4, align=1,
           |  nvsize=4, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<long, long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >
         0 |   std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >::__storage_pointer __seg_
         8 |   std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >::__storage_type __mask_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__bitset<0, 0> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct B
         0 |   int n
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | class std::__1::mutex
         0 |   struct _opaque_pthread_mutex_t __m_
         0 |     long __sig
         8 |     char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::lock_guard<class std::__1::mutex>
         0 |   std::__1::lock_guard<class std::__1::mutex>::mutex_type & __m_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::ios_base
         0 |   (ios_base vtable pointer)
         8 |   std::__1::ios_base::fmtflags __fmtflags_
        16 |   std::__1::streamsize __precision_
        24 |   std::__1::streamsize __width_
        32 |   std::__1::ios_base::iostate __rdstate_
        36 |   std::__1::ios_base::iostate __exceptions_
        40 |   void * __rdbuf_
        48 |   void * __loc_
        56 |   std::__1::ios_base::event_callback * __fn_
        64 |   int * __index_
        72 |   size_t __event_size_
        80 |   size_t __event_cap_
        88 |   long * __iarray_
        96 |   size_t __iarray_size_
       104 |   size_t __iarray_cap_
       112 |   void ** __parray_
       120 |   size_t __parray_size_
       128 |   size_t __parray_cap_
           | [sizeof=136, dsize=136, align=8,
           |  nvsize=136, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ios<char>
         0 |   class std::__1::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     std::__1::ios_base::fmtflags __fmtflags_
        16 |     std::__1::streamsize __precision_
        24 |     std::__1::streamsize __width_
        32 |     std::__1::ios_base::iostate __rdstate_
        36 |     std::__1::ios_base::iostate __exceptions_
        40 |     void * __rdbuf_
        48 |     void * __loc_
        56 |     std::__1::ios_base::event_callback * __fn_
        64 |     int * __index_
        72 |     size_t __event_size_
        80 |     size_t __event_cap_
        88 |     long * __iarray_
        96 |     size_t __iarray_size_
       104 |     size_t __iarray_cap_
       112 |     void ** __parray_
       120 |     size_t __parray_size_
       128 |     size_t __parray_cap_
       136 |   basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       144 |   std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=152, dsize=148, align=8,
           |  nvsize=148, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_istream<char>
         0 |   (basic_istream vtable pointer)
         8 |   std::__1::streamsize __gc_
        16 |   class std::__1::basic_ios<char> (virtual base)
        16 |     class std::__1::ios_base (primary base)
        16 |       (ios_base vtable pointer)
        24 |       std::__1::ios_base::fmtflags __fmtflags_
        32 |       std::__1::streamsize __precision_
        40 |       std::__1::streamsize __width_
        48 |       std::__1::ios_base::iostate __rdstate_
        52 |       std::__1::ios_base::iostate __exceptions_
        56 |       void * __rdbuf_
        64 |       void * __loc_
        72 |       std::__1::ios_base::event_callback * __fn_
        80 |       int * __index_
        88 |       size_t __event_size_
        96 |       size_t __event_cap_
       104 |       long * __iarray_
       112 |       size_t __iarray_size_
       120 |       size_t __iarray_cap_
       128 |       void ** __parray_
       136 |       size_t __parray_size_
       144 |       size_t __parray_cap_
       152 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       160 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=168, dsize=164, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ostream<char>
         0 |   (basic_ostream vtable pointer)
         8 |   class std::__1::basic_ios<char> (virtual base)
         8 |     class std::__1::ios_base (primary base)
         8 |       (ios_base vtable pointer)
        16 |       std::__1::ios_base::fmtflags __fmtflags_
        24 |       std::__1::streamsize __precision_
        32 |       std::__1::streamsize __width_
        40 |       std::__1::ios_base::iostate __rdstate_
        44 |       std::__1::ios_base::iostate __exceptions_
        48 |       void * __rdbuf_
        56 |       void * __loc_
        64 |       std::__1::ios_base::event_callback * __fn_
        72 |       int * __index_
        80 |       size_t __event_size_
        88 |       size_t __event_cap_
        96 |       long * __iarray_
       104 |       size_t __iarray_size_
       112 |       size_t __iarray_cap_
       120 |       void ** __parray_
       128 |       size_t __parray_size_
       136 |       size_t __parray_cap_
       144 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       152 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=160, dsize=156, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_iostream<char>
         0 |   class std::__1::basic_istream<char> (primary base)
         0 |     (basic_istream vtable pointer)
         8 |     std::__1::streamsize __gc_
        16 |   class std::__1::basic_ostream<char> (base)
        16 |     (basic_ostream vtable pointer)
        24 |   class std::__1::basic_ios<char> (virtual base)
        24 |     class std::__1::ios_base (primary base)
        24 |       (ios_base vtable pointer)
        32 |       std::__1::ios_base::fmtflags __fmtflags_
        40 |       std::__1::streamsize __precision_
        48 |       std::__1::streamsize __width_
        56 |       std::__1::ios_base::iostate __rdstate_
        60 |       std::__1::ios_base::iostate __exceptions_
        64 |       void * __rdbuf_
        72 |       void * __loc_
        80 |       std::__1::ios_base::event_callback * __fn_
        88 |       int * __index_
        96 |       size_t __event_size_
       104 |       size_t __event_cap_
       112 |       long * __iarray_
       120 |       size_t __iarray_size_
       128 |       size_t __iarray_cap_
       136 |       void ** __parray_
       144 |       size_t __parray_size_
       152 |       size_t __parray_cap_
       160 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       168 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=176, dsize=172, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale
         0 |   class std::__1::locale::__imp * __locale_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_streambuf<char>
         0 |   (basic_streambuf vtable pointer)
         8 |   class std::__1::locale __loc_
         8 |     class std::__1::locale::__imp * __locale_
        16 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        24 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        32 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        40 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        48 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        56 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | __mbstate_t
         0 |   char [128] __mbstate8
         0 |   long long _mbstateL
           | [sizeof=128, dsize=128, align=8,
           |  nvsize=128, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >
         0 |   class std::__1::basic_streambuf<char> (primary base)
         0 |     (basic_streambuf vtable pointer)
         8 |     class std::__1::locale __loc_
         8 |       class std::__1::locale::__imp * __locale_
        16 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        24 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        32 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        40 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        48 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        56 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
        64 |   char * __extbuf_
        72 |   const char * __extbufnext_
        80 |   const char * __extbufend_
        88 |   char [8] __extbuf_min_
        96 |   size_t __ebs_
       104 |   std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       112 |   size_t __ibs_
       120 |   FILE * __file_
       128 |   const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       136 |   __mbstate_t __st_
       136 |     char [128] __mbstate8
       136 |     long long _mbstateL
       264 |   __mbstate_t __st_last_
       264 |     char [128] __mbstate8
       264 |     long long _mbstateL
       392 |   class ios_base::openmode __om_
       396 |   class ios_base::openmode __cm_
       400 |   _Bool __owns_eb_
       401 |   _Bool __owns_ib_
       402 |   _Bool __always_noconv_
           | [sizeof=408, dsize=403, align=8,
           |  nvsize=403, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >
         0 |   class std::__1::basic_iostream<char> (primary base)
         0 |     class std::__1::basic_istream<char> (primary base)
         0 |       (basic_istream vtable pointer)
         8 |       std::__1::streamsize __gc_
        16 |     class std::__1::basic_ostream<char> (base)
        16 |       (basic_ostream vtable pointer)
        24 |   class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > __sb_
        24 |     class std::__1::basic_streambuf<char> (primary base)
        24 |       (basic_streambuf vtable pointer)
        32 |       class std::__1::locale __loc_
        32 |         class std::__1::locale::__imp * __locale_
        40 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        48 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        56 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        64 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        72 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        80 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
        88 |     char * __extbuf_
        96 |     const char * __extbufnext_
       104 |     const char * __extbufend_
       112 |     char [8] __extbuf_min_
       120 |     size_t __ebs_
       128 |     std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       136 |     size_t __ibs_
       144 |     FILE * __file_
       152 |     const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       160 |     __mbstate_t __st_
       160 |       char [128] __mbstate8
       160 |       long long _mbstateL
       288 |     __mbstate_t __st_last_
       288 |       char [128] __mbstate8
       288 |       long long _mbstateL
       416 |     class ios_base::openmode __om_
       420 |     class ios_base::openmode __cm_
       424 |     _Bool __owns_eb_
       425 |     _Bool __owns_ib_
       426 |     _Bool __always_noconv_
       432 |   class std::__1::basic_ios<char> (virtual base)
       432 |     class std::__1::ios_base (primary base)
       432 |       (ios_base vtable pointer)
       440 |       std::__1::ios_base::fmtflags __fmtflags_
       448 |       std::__1::streamsize __precision_
       456 |       std::__1::streamsize __width_
       464 |       std::__1::ios_base::iostate __rdstate_
       468 |       std::__1::ios_base::iostate __exceptions_
       472 |       void * __rdbuf_
       480 |       void * __loc_
       488 |       std::__1::ios_base::event_callback * __fn_
       496 |       int * __index_
       504 |       size_t __event_size_
       512 |       size_t __event_cap_
       520 |       long * __iarray_
       528 |       size_t __iarray_size_
       536 |       size_t __iarray_cap_
       544 |       void ** __parray_
       552 |       size_t __parray_size_
       560 |       size_t __parray_cap_
       568 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       576 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=584, dsize=580, align=8,
           |  nvsize=432, nvalign=8]

*** Dumping AST Record Layout
         0 | struct C
         0 |   struct B (base)
         0 |     int n
         4 |   unsigned char x
         5 |   unsigned char y
         8 |   class std::__1::mutex m
         8 |     struct _opaque_pthread_mutex_t __m_
         8 |       long __sig
        16 |       char [56] __opaque
        72 |   class std::__1::lock_guard<class std::__1::mutex> lg
        72 |     std::__1::lock_guard<class std::__1::mutex>::mutex_type & __m_
        80 |   class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > f1
        80 |     class std::__1::basic_iostream<char> (primary base)
        80 |       class std::__1::basic_istream<char> (primary base)
        80 |         (basic_istream vtable pointer)
        88 |         std::__1::streamsize __gc_
        96 |       class std::__1::basic_ostream<char> (base)
        96 |         (basic_ostream vtable pointer)
       104 |     class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > __sb_
       104 |       class std::__1::basic_streambuf<char> (primary base)
       104 |         (basic_streambuf vtable pointer)
       112 |         class std::__1::locale __loc_
       112 |           class std::__1::locale::__imp * __locale_
       120 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
       128 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
       136 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
       144 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
       152 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
       160 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
       168 |       char * __extbuf_
       176 |       const char * __extbufnext_
       184 |       const char * __extbufend_
       192 |       char [8] __extbuf_min_
       200 |       size_t __ebs_
       208 |       std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       216 |       size_t __ibs_
       224 |       FILE * __file_
       232 |       const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       240 |       __mbstate_t __st_
       240 |         char [128] __mbstate8
       240 |         long long _mbstateL
       368 |       __mbstate_t __st_last_
       368 |         char [128] __mbstate8
       368 |         long long _mbstateL
       496 |       class ios_base::openmode __om_
       500 |       class ios_base::openmode __cm_
       504 |       _Bool __owns_eb_
       505 |       _Bool __owns_ib_
       506 |       _Bool __always_noconv_
       512 |     class std::__1::basic_ios<char> (virtual base)
       512 |       class std::__1::ios_base (primary base)
       512 |         (ios_base vtable pointer)
       520 |         std::__1::ios_base::fmtflags __fmtflags_
       528 |         std::__1::streamsize __precision_
       536 |         std::__1::streamsize __width_
       544 |         std::__1::ios_base::iostate __rdstate_
       548 |         std::__1::ios_base::iostate __exceptions_
       552 |         void * __rdbuf_
       560 |         void * __loc_
       568 |         std::__1::ios_base::event_callback * __fn_
       576 |         int * __index_
       584 |         size_t __event_size_
       592 |         size_t __event_cap_
       600 |         long * __iarray_
       608 |         size_t __iarray_size_
       616 |         size_t __iarray_cap_
       624 |         void ** __parray_
       632 |         size_t __parray_size_
       640 |         size_t __parray_cap_
       648 |       basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       656 |       std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
       664 |   class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > f2
       664 |     class std::__1::basic_iostream<char> (primary base)
       664 |       class std::__1::basic_istream<char> (primary base)
       664 |         (basic_istream vtable pointer)
       672 |         std::__1::streamsize __gc_
       680 |       class std::__1::basic_ostream<char> (base)
       680 |         (basic_ostream vtable pointer)
       688 |     class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > __sb_
       688 |       class std::__1::basic_streambuf<char> (primary base)
       688 |         (basic_streambuf vtable pointer)
       696 |         class std::__1::locale __loc_
       696 |           class std::__1::locale::__imp * __locale_
       704 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
       712 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
       720 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
       728 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
       736 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
       744 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
       752 |       char * __extbuf_
       760 |       const char * __extbufnext_
       768 |       const char * __extbufend_
       776 |       char [8] __extbuf_min_
       784 |       size_t __ebs_
       792 |       std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       800 |       size_t __ibs_
       808 |       FILE * __file_
       816 |       const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       824 |       __mbstate_t __st_
       824 |         char [128] __mbstate8
       824 |         long long _mbstateL
       952 |       __mbstate_t __st_last_
       952 |         char [128] __mbstate8
       952 |         long long _mbstateL
      1080 |       class ios_base::openmode __om_
      1084 |       class ios_base::openmode __cm_
      1088 |       _Bool __owns_eb_
      1089 |       _Bool __owns_ib_
      1090 |       _Bool __always_noconv_
      1096 |     class std::__1::basic_ios<char> (virtual base)
      1096 |       class std::__1::ios_base (primary base)
      1096 |         (ios_base vtable pointer)
      1104 |         std::__1::ios_base::fmtflags __fmtflags_
      1112 |         std::__1::streamsize __precision_
      1120 |         std::__1::streamsize __width_
      1128 |         std::__1::ios_base::iostate __rdstate_
      1132 |         std::__1::ios_base::iostate __exceptions_
      1136 |         void * __rdbuf_
      1144 |         void * __loc_
      1152 |         std::__1::ios_base::event_callback * __fn_
      1160 |         int * __index_
      1168 |         size_t __event_size_
      1176 |         size_t __event_cap_
      1184 |         long * __iarray_
      1192 |         size_t __iarray_size_
      1200 |         size_t __iarray_cap_
      1208 |         void ** __parray_
      1216 |         size_t __parray_size_
      1224 |         size_t __parray_cap_
      1232 |       basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
      1240 |       std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=1248, dsize=1248, align=8,
           |  nvsize=1248, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f99b0e54dc8 <2_constructors/11_member_initialization_list.cpp:5:1, line:9:1> line:5:8 referenced struct B definition
|-CXXRecordDecl 0x7f99b0e54ee8 <col:1, col:8> col:8 implicit referenced struct B
|-FieldDecl 0x7f99b0e54f98 <line:6:5, col:9> col:9 n 'int'
|-CXXConstructorDecl 0x7f99b0e550d0 <line:8:5, col:22> col:5 used B 'void (int)'
| |-ParmVarDecl 0x7f99b0e54ff8 <col:7, col:11> col:11 used n 'int'
| |-CXXCtorInitializer Field 0x7f99b0e54f98 'n' 'int'
| | `-ImplicitCastExpr 0x7f99b0e551f8 <col:18> 'int' <LValueToRValue>
| |   `-DeclRefExpr 0x7f99b0e551a0 <col:18> 'int' lvalue ParmVar 0x7f99b0e54ff8 'n' 'int'
| `-CompoundStmt 0x7f99b0e55240 <col:21, col:22>
|-CXXConstructorDecl 0x7f99b0e5b6d8 <line:5:8> col:8 implicit constexpr B 'void (const struct B &)' inline default trivial noexcept-unevaluated 0x7f99b0e5b6d8
| `-ParmVarDecl 0x7f99b0e5b800 <col:8> col:8 'const struct B &'
|-CXXConstructorDecl 0x7f99b0e5b898 <col:8> col:8 implicit constexpr B 'void (struct B &&)' inline default trivial noexcept-unevaluated 0x7f99b0e5b898
| `-ParmVarDecl 0x7f99b0e5b9c0 <col:8> col:8 'struct B &&'
|-CXXDestructorDecl 0x7f99b0e5bbb8 <col:8> col:8 implicit ~B 'void (void) noexcept' inline default trivial
|-CXXMethodDecl 0x7f99b0e5c038 <col:8, <invalid sloc>> col:8 implicit operator= 'struct B &(const struct B &)' inline default trivial noexcept-unevaluated 0x7f99b0e5c038
| `-ParmVarDecl 0x7f99b0e5c150 <col:8> col:8 'const struct B &'
`-CXXMethodDecl 0x7f99b0e5c1b8 <col:8, <invalid sloc>> col:8 implicit operator= 'struct B &(struct B &&)' inline default trivial noexcept-unevaluated 0x7f99b0e5c1b8
  `-ParmVarDecl 0x7f99b0e5c2d0 <col:8> col:8 'struct B &&'

Layout: <CGRecordLayout
  LLVMType:%struct.B = type { i32 }
  NonVirtualBaseLLVMType:%struct.B = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f99b10106c0 </usr/include/sys/_pthread/_pthread_types.h:78:1, line:81:1> line:78:8 struct _opaque_pthread_mutex_t definition
|-CXXRecordDecl 0x7f99b10107e8 <col:1, col:8> col:8 implicit struct _opaque_pthread_mutex_t
|-FieldDecl 0x7f99b1010898 <line:79:2, col:7> col:7 __sig 'long'
|-FieldDecl 0x7f99b1010920 <line:80:2, col:38> col:7 __opaque 'char [56]'
`-CXXDestructorDecl 0x7f99b0c9f6f8 <line:78:8> col:8 implicit ~_opaque_pthread_mutex_t 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%struct._opaque_pthread_mutex_t = type { i64, [56 x i8] }
  NonVirtualBaseLLVMType:%struct._opaque_pthread_mutex_t = type { i64, [56 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f99b0c9e968 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:40:1, line:68:1> line:40:78 referenced class mutex definition
|-VisibilityAttr 0x7f99b0c9ea88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7f99b0c9ead0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:40:1, col:78> col:78 implicit referenced class mutex
|-FieldDecl 0x7f99b0c9eb78 <line:43:5, /usr/include/pthread.h:182:64> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:43:22 referenced __m_ 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
| `-InitListExpr 0x7f99b0c9f8b0 </usr/include/pthread.h:182:35, col:64> 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
|   |-ImplicitCastExpr 0x7f99b0c9f900 </usr/include/pthread_impl.h:41:34> 'long' <IntegralCast>
|   | `-IntegerLiteral 0x7f99b0c9f7d8 <col:34> 'int' 850045863
|   `-InitListExpr 0x7f99b0c9f918 </usr/include/pthread.h:182:61, col:63> 'char [56]'
|     |-array filler
|     | `-ImplicitValueInitExpr 0x7f99b0c9f978 <<invalid sloc>> 'char'
|     `-ImplicitCastExpr 0x7f99b0c9f958 <col:62> 'char' <IntegralCast>
|       `-IntegerLiteral 0x7f99b0c9f7f8 <col:62> 'int' 0
|-AccessSpecDecl 0x7f99b0c9ebc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:48:1, col:7> col:1 public
|-CXXConstructorDecl 0x7f99b0c9ec88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:51:31> col:15 used constexpr mutex 'void (void) noexcept' default
| |-CXXCtorInitializer Field 0x7f99b0c9eb78 '__m_' 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
| | `-CXXDefaultInitExpr 0x7f99b0e5ce10 <col:15> 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
| |-CompoundStmt 0x7f99b0e5ce60 <col:31>
| |-AlwaysInlineAttr 0x7f99b0c9ed30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b0c9ed78 <col:51, col:74> Hidden
|-CXXDestructorDecl 0x7f99b0c9edd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:55:5, col:12> col:5 used ~mutex 'void (void) noexcept'
|-AccessSpecDecl 0x7f99b0c9ee78 <line:57:1, col:8> col:1 private
|-CXXConstructorDecl 0x7f99b0c9efa0 <line:58:5, col:23> col:5 mutex 'void (const class std::__1::mutex &)'
| `-ParmVarDecl 0x7f99b0c9eed8 <col:11, col:22> col:23 'const class std::__1::mutex &'
|-CXXMethodDecl 0x7f99b0c9f150 <line:59:5, col:34> col:12 operator= 'class std::__1::mutex &(const class std::__1::mutex &)'
| `-ParmVarDecl 0x7f99b0c9f060 <col:22, col:33> col:34 'const class std::__1::mutex &'
|-AccessSpecDecl 0x7f99b0c9f1f0 <line:61:1, col:7> col:1 public
|-CXXMethodDecl 0x7f99b0c9f238 <line:62:5, col:15> col:10 lock 'void (void)'
|-CXXMethodDecl 0x7f99b0c9f2f8 <line:63:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:63:10 try_lock '_Bool (void) noexcept'
|-CXXMethodDecl 0x7f99b0c9f3b8 <line:64:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:64:10 unlock 'void (void) noexcept'
|-TypedefDecl 0x7f99b0c9f460 <line:66:5, col:31> col:31 referenced native_handle_type 'std::__1::__libcpp_mutex_t *'
| `-PointerType 0x7f99b0c66d60 'std::__1::__libcpp_mutex_t *'
|   `-TypedefType 0x7f99b0c66d40 'std::__1::__libcpp_mutex_t' sugar
|     |-Typedef 0x7f99b0c66058 '__libcpp_mutex_t'
|     `-TypedefType 0x7f99b0c3d6d0 'pthread_mutex_t' sugar
|       |-Typedef 0x7f99b0c359b0 'pthread_mutex_t'
|       `-TypedefType 0x7f99b0c35980 '__darwin_pthread_mutex_t' sugar
|         |-Typedef 0x7f99b1013380 '__darwin_pthread_mutex_t'
|         `-ElaboratedType 0x7f99b1013330 'struct _opaque_pthread_mutex_t' sugar
|           `-RecordType 0x7f99b1010760 'struct _opaque_pthread_mutex_t'
|             `-CXXRecord 0x7f99b10106c0 '_opaque_pthread_mutex_t'
`-CXXMethodDecl 0x7f99b0c9f590 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:67:80> col:50 native_handle 'std::__1::mutex::native_handle_type (void)'
  |-CompoundStmt 0x7f99b0c9fad8 <col:66, col:80>
  | `-ReturnStmt 0x7f99b0c9fac0 <col:67, col:75>
  |   `-UnaryOperator 0x7f99b0c9faa0 <col:74, col:75> 'std::__1::__libcpp_mutex_t *' prefix '&'
  |     `-MemberExpr 0x7f99b0c9fa68 <col:75> 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t' lvalue ->__m_ 0x7f99b0c9eb78
  |       `-CXXThisExpr 0x7f99b0c9fa50 <col:75> 'class std::__1::mutex *' this
  |-AlwaysInlineAttr 0x7f99b0c9f628 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
  `-VisibilityAttr 0x7f99b0c9f670 <col:51, col:74> Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::mutex" = type { %struct._opaque_pthread_mutex_t }
  NonVirtualBaseLLVMType:%"class.std::__1::mutex" = type { %struct._opaque_pthread_mutex_t }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f99b0e55648 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:91:1, line:114:1> line:93:1 class lock_guard definition
|-TemplateArgument type 'class std::__1::mutex'
|-CXXRecordDecl 0x7f99b0e558c0 prev 0x7f99b0e55648 <line:92:1, line:93:1> col:1 implicit class lock_guard
|-AccessSpecDecl 0x7f99b0e55958 <line:95:1, col:7> col:1 public
|-TypedefDecl 0x7f99b0e559b8 <line:96:5, col:20> col:20 mutex_type 'class std::__1::mutex':'class std::__1::mutex'
| `-SubstTemplateTypeParmType 0x7f99b0e55980 'class std::__1::mutex' sugar
|   |-TemplateTypeParmType 0x7f99b0ca30b0 '_Mutex' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f99b0ca3070 '_Mutex'
|   `-RecordType 0x7f99b0c9ea00 'class std::__1::mutex'
|     `-CXXRecord 0x7f99b0c9e968 'mutex'
|-AccessSpecDecl 0x7f99b0e55a10 <line:98:1, col:8> col:1 private
|-FieldDecl 0x7f99b0e55a98 <line:99:5, col:17> col:17 __m_ 'std::__1::lock_guard<class std::__1::mutex>::mutex_type &'
|-AccessSpecDecl 0x7f99b0e55ae0 <line:100:1, col:7> col:1 public
|-CXXConstructorDecl 0x7f99b0e55c20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:104:34> line:103:14 used lock_guard 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |-ParmVarDecl 0x7f99b0e55b18 <col:25, col:37> col:37 __m 'std::__1::lock_guard<class std::__1::mutex>::mutex_type &'
| `-AlwaysInlineAttr 0x7f99b0e55d08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f99b0e55eb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:107:22> line:106:5 lock_guard 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &, struct std::__1::adopt_lock_t)'
| |-ParmVarDecl 0x7f99b0e55d60 <col:16, col:28> col:28 __m 'std::__1::lock_guard<class std::__1::mutex>::mutex_type &'
| |-ParmVarDecl 0x7f99b0e55dc0 <col:33> col:45 'struct std::__1::adopt_lock_t'
| `-AlwaysInlineAttr 0x7f99b0e55f78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7f99b0e55ff0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:109:89> col:5 used ~lock_guard 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7f99b0e560a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7f99b0e560e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:111:1, col:8> col:1 private
|-CXXConstructorDecl 0x7f99b0e56230 <line:112:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:824:37> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:112:5 lock_guard 'void (const class std::__1::lock_guard<class std::__1::mutex> &)' delete trivial
| `-ParmVarDecl 0x7f99b0e56148 <col:16, col:32> col:33 'const class std::__1::lock_guard<class std::__1::mutex> &'
`-CXXMethodDecl 0x7f99b0e563f0 <line:113:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:824:37> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:113:17 operator= 'class std::__1::lock_guard<class std::__1::mutex> &(const class std::__1::lock_guard<class std::__1::mutex> &)' delete trivial
  `-ParmVarDecl 0x7f99b0e56328 <col:27, col:43> col:44 'const class std::__1::lock_guard<class std::__1::mutex> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::lock_guard" = type { %"class.std::__1::mutex"* }
  NonVirtualBaseLLVMType:%"class.std::__1::lock_guard" = type { %"class.std::__1::mutex"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f99b29deb30 prev 0x7f99b1816520 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, line:386:1> line:231:24 referenced class ios_base definition
|-VisibilityAttr 0x7f99b29dec30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7f99b29dec78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, col:24> col:24 implicit referenced class ios_base
|-AccessSpecDecl 0x7f99b29ded10 <line:233:1, col:7> col:1 public
|-CXXRecordDecl 0x7f99b29ded68 <line:234:5, col:33> col:33 class failure
| `-VisibilityAttr 0x7f99b29dee20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:701:47, col:71> Default
|-TypedefDecl 0x7f99b29dee80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:236:5, col:26> col:26 referenced fmtflags 'unsigned int'
| `-BuiltinType 0x7f99b0833c60 'unsigned int'
|-VarDecl 0x7f99b29def10 <line:237:5, col:41> col:27 referenced boolalpha 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29def90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29def70 <col:41> 'int' 1
|-VarDecl 0x7f99b29df010 <line:238:5, col:41> col:27 referenced dec 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29df090 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29df070 <col:41> 'int' 2
|-VarDecl 0x7f99b29df110 <line:239:5, col:41> col:27 referenced fixed 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29df190 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29df170 <col:41> 'int' 4
|-VarDecl 0x7f99b29df210 <line:240:5, col:41> col:27 referenced hex 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29df290 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29df270 <col:41> 'int' 8
|-VarDecl 0x7f99b29df310 <line:241:5, col:41> col:27 referenced internal 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29df390 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29df370 <col:41> 'int' 16
|-VarDecl 0x7f99b29df410 <line:242:5, col:41> col:27 referenced left 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29df490 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29df470 <col:41> 'int' 32
|-VarDecl 0x7f99b29df510 <line:243:5, col:41> col:27 referenced oct 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29df590 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29df570 <col:41> 'int' 64
|-VarDecl 0x7f99b29df610 <line:244:5, col:41> col:27 referenced right 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29df690 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29df670 <col:41> 'int' 128
|-VarDecl 0x7f99b29df710 <line:245:5, col:41> col:27 referenced scientific 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29df790 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29df770 <col:41> 'int' 256
|-VarDecl 0x7f99b29df810 <line:246:5, col:41> col:27 referenced showbase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29df890 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29df870 <col:41> 'int' 512
|-VarDecl 0x7f99b29df910 <line:247:5, col:41> col:27 referenced showpoint 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29df990 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29df970 <col:41> 'int' 1024
|-VarDecl 0x7f99b29dfa10 <line:248:5, col:41> col:27 referenced showpos 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29dfa90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29dfa70 <col:41> 'int' 2048
|-VarDecl 0x7f99b29dfb10 <line:249:5, col:41> col:27 referenced skipws 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29dfb90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29dfb70 <col:41> 'int' 4096
|-VarDecl 0x7f99b29dfc10 <line:250:5, col:41> col:27 referenced unitbuf 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29dfc90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29dfc70 <col:41> 'int' 8192
|-VarDecl 0x7f99b29dfd10 <line:251:5, col:41> col:27 referenced uppercase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29dfd90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29dfd70 <col:41> 'int' 16384
|-VarDecl 0x7f99b29dfe10 <line:252:5, col:56> col:27 referenced adjustfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7f99b29dff58 <col:41, col:56> 'unsigned int' '|'
|   |-BinaryOperator 0x7f99b29dfef0 <col:41, col:48> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7f99b29dfec0 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7f99b29dfe70 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f99b29df410 'left' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7f99b29dfed8 <col:48> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7f99b29dfe98 <col:48> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f99b29df610 'right' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7f99b29dff40 <col:56> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f99b29dff18 <col:56> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f99b29df310 'internal' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7f99b29dffe8 <line:253:5, col:53> col:27 referenced basefield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7f99b29e0130 <col:41, col:53> 'unsigned int' '|'
|   |-BinaryOperator 0x7f99b29e00c8 <col:41, col:47> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7f99b29e0098 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7f99b29e0048 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f99b29df010 'dec' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7f99b29e00b0 <col:47> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7f99b29e0070 <col:47> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f99b29df510 'oct' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7f99b29e0118 <col:53> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f99b29e00f0 <col:53> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f99b29df210 'hex' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7f99b29e01c0 <line:254:5, col:54> col:27 referenced floatfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7f99b29e02a0 <col:41, col:54> 'unsigned int' '|'
|   |-ImplicitCastExpr 0x7f99b29e0270 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | `-DeclRefExpr 0x7f99b29e0220 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f99b29df710 'scientific' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7f99b29e0288 <col:54> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f99b29e0248 <col:54> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f99b29df110 'fixed' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-TypedefDecl 0x7f99b29e0338 <line:256:5, col:26> col:26 referenced iostate 'unsigned int'
| `-BuiltinType 0x7f99b0833c60 'unsigned int'
|-VarDecl 0x7f99b29e03c0 <line:257:5, col:36> col:26 referenced badbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29e0440 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29e0420 <col:36> 'int' 1
|-VarDecl 0x7f99b29e04c0 <line:258:5, col:36> col:26 referenced eofbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29e0540 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29e0520 <col:36> 'int' 2
|-VarDecl 0x7f99b29e05c0 <line:259:5, col:36> col:26 referenced failbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29e0640 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29e0620 <col:36> 'int' 4
|-VarDecl 0x7f99b29e06c0 <line:260:5, col:36> col:26 referenced goodbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29e0740 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29e0720 <col:36> 'int' 0
|-TypedefDecl 0x7f99b29e07c8 <line:262:5, col:26> col:26 referenced openmode 'unsigned int'
| `-BuiltinType 0x7f99b0833c60 'unsigned int'
|-VarDecl 0x7f99b29e0850 <line:263:5, col:36> col:27 referenced app 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29e08d0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29e08b0 <col:36> 'int' 1
|-VarDecl 0x7f99b29e0950 <line:264:5, col:36> col:27 referenced ate 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29e09d0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29e09b0 <col:36> 'int' 2
|-VarDecl 0x7f99b29e0a50 <line:265:5, col:36> col:27 referenced binary 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29e0ad0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29e0ab0 <col:36> 'int' 4
|-VarDecl 0x7f99b29e0b50 <line:266:5, col:36> col:27 referenced in 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29e0bd0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29e0bb0 <col:36> 'int' 8
|-VarDecl 0x7f99b29e0c50 <line:267:5, col:36> col:27 referenced out 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29e0cd0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29e0cb0 <col:36> 'int' 16
|-VarDecl 0x7f99b29e0d50 <line:268:5, col:36> col:27 referenced trunc 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f99b29e0dd0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f99b29e0db0 <col:36> 'int' 32
|-EnumDecl 0x7f99b29e0e40 <line:270:5, col:32> col:10 referenced seekdir
| |-EnumConstantDecl 0x7f99b29e0f00 <col:19> col:19 referenced beg 'enum std::__1::ios_base::seekdir'
| |-EnumConstantDecl 0x7f99b29e0f48 <col:24> col:24 referenced cur 'enum std::__1::ios_base::seekdir'
| `-EnumConstantDecl 0x7f99b29e0f90 <col:29> col:29 referenced end 'enum std::__1::ios_base::seekdir'
|-TypedefDecl 0x7f99b29e0fe8 <line:273:5, col:26> col:26 io_state 'std::__1::ios_base::iostate':'unsigned int'
| `-TypedefType 0x7f99b29e0390 'std::__1::ios_base::iostate' sugar
|   |-Typedef 0x7f99b29e0338 'iostate'
|   `-BuiltinType 0x7f99b0833c60 'unsigned int'
|-TypedefDecl 0x7f99b29e1050 <line:274:5, col:26> col:26 open_mode 'std::__1::ios_base::openmode':'unsigned int'
| `-TypedefType 0x7f99b29e0820 'std::__1::ios_base::openmode' sugar
|   |-Typedef 0x7f99b29e07c8 'openmode'
|   `-BuiltinType 0x7f99b0833c60 'unsigned int'
|-TypedefDecl 0x7f99b29e10b8 <line:275:5, col:26> col:26 seek_dir 'enum std::__1::ios_base::seekdir'
| `-EnumType 0x7f99b29e0ee0 'enum std::__1::ios_base::seekdir'
|   `-Enum 0x7f99b29e0e40 'seekdir'
|-TypedefDecl 0x7f99b29e11d0 <line:277:5, col:30> col:30 streamoff 'std::__1::streamoff':'long long'
| `-ElaboratedType 0x7f99b29e1160 'std::__1::streamoff' sugar
|   `-TypedefType 0x7f99b0a3de80 'std::__1::streamoff' sugar
|     |-Typedef 0x7f99b105a958 'streamoff'
|     `-BuiltinType 0x7f99b0833c00 'long long'
|-TypedefDecl 0x7f99b29e12b0 <line:278:5, col:30> col:30 streampos 'std::__1::streampos':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f99b29e1240 'std::__1::streampos' sugar
|   `-TypedefType 0x7f99b0a3df10 'std::__1::streampos' sugar
|     |-Typedef 0x7f99b105a5b8 'streampos'
|     `-TemplateSpecializationType 0x7f99b105a510 'fpos<mbstate_t>' sugar fpos
|       |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|       `-RecordType 0x7f99b105a4f0 'class std::__1::fpos<__mbstate_t>'
|         `-ClassTemplateSpecialization 0x7f99b105a400 'fpos'
|-CXXRecordDecl 0x7f99b29e1338 <line:281:5, col:28> col:28 class Init
| `-VisibilityAttr 0x7f99b29e13f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXMethodDecl 0x7f99b29e1520 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:284:48> col:40 flags 'std::__1::ios_base::fmtflags (void) const'
| |-AlwaysInlineAttr 0x7f99b29e15b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b29e1600 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b29e1740 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:285:62> col:40 flags 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f99b29e1650 <col:46, col:55> col:55 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f99b29e17e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b29e1828 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b29e1900 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:286:61> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f99b29e1878 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f99b29e19a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b29e19e8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b29e1bc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:287:78> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags, std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f99b29e1a38 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-ParmVarDecl 0x7f99b29e1aa8 <col:63, col:72> col:72 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f99b29e1c68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b29e1cb0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b29e1dc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:288:58> col:36 used unsetf 'void (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f99b29e1d00 <col:43, col:52> col:52 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f99b29e1e60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b29e1ea8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b29e1f60 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:290:54> col:42 precision 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7f99b29e1ff8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b29e2040 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b29e2150 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:291:69> col:42 precision 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7f99b29e2090 <col:52, col:63> col:63 __prec 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7f99b29e21f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b29e2238 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b29e2298 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:292:50> col:42 width 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7f99b29e2330 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b29e2378 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b29e2450 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:293:65> col:42 width 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7f99b29e23c8 <col:48, col:59> col:59 __wide 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7f99b29e24f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b29e2538 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b29e25e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:296:5, col:37> col:12 referenced imbue 'class std::__1::locale (const class std::__1::locale &)'
| `-ParmVarDecl 0x7f99b29e2558 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f99b29e26d0 <line:297:5, col:21> col:12 referenced getloc 'class std::__1::locale (void) const'
|-CXXMethodDecl 0x7f99b29e2790 <line:300:5, col:23> col:16 xalloc 'int (void)' static
|-CXXMethodDecl 0x7f99b29e28d0 <line:301:5, col:28> col:11 iword 'long &(int)'
| `-ParmVarDecl 0x7f99b29e2840 <col:17, col:21> col:21 __index 'int'
|-CXXMethodDecl 0x7f99b29e2a58 <line:302:5, col:29> col:12 pword 'void *&(int)'
| `-ParmVarDecl 0x7f99b29e2988 <col:18, col:22> col:22 __index 'int'
|-CXXDestructorDecl 0x7f99b29e2b48 <line:305:5, col:23> col:13 ~ios_base 'void (void) noexcept' virtual
|-EnumDecl 0x7f99b29e2be8 <line:308:5, col:58> col:10 referenced event
| |-EnumConstantDecl 0x7f99b29e2ca0 <col:18> col:18 referenced erase_event 'enum std::__1::ios_base::event'
| |-EnumConstantDecl 0x7f99b29e2ce8 <col:31> col:31 imbue_event 'enum std::__1::ios_base::event'
| `-EnumConstantDecl 0x7f99b29e2d30 <col:44> col:44 referenced copyfmt_event 'enum std::__1::ios_base::event'
|-TypedefDecl 0x7f99b29e2ff0 <line:309:5, col:65> col:20 referenced event_callback 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-PointerType 0x7f99b29e2f80 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
|   `-ParenType 0x7f99b29e2f20 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' sugar
|     `-FunctionProtoType 0x7f99b29e2ed0 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' cdecl
|       |-BuiltinType 0x7f99b0833b20 'void'
|       |-EnumType 0x7f99b29e2c80 'enum std::__1::ios_base::event'
|       | `-Enum 0x7f99b29e2be8 'event'
|       |-LValueReferenceType 0x7f99b0a006c0 'class std::__1::ios_base &'
|       | `-RecordType 0x7f99b18165c0 'class std::__1::ios_base'
|       |   `-CXXRecord 0x7f99b29deb30 'ios_base'
|       `-BuiltinType 0x7f99b0833bc0 'int'
|-CXXMethodDecl 0x7f99b29e3210 <line:310:5, col:60> col:10 register_callback 'void (std::__1::ios_base::event_callback, int)'
| |-ParmVarDecl 0x7f99b29e3080 <col:28, col:43> col:43 __fn 'std::__1::ios_base::event_callback':'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-ParmVarDecl 0x7f99b29e30f8 <col:49, col:53> col:53 __index 'int'
|-AccessSpecDecl 0x7f99b29e32b8 <line:312:1, col:8> col:1 private
|-CXXConstructorDecl 0x7f99b29e3400 <line:313:5, col:29> col:5 ios_base 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f99b29e3318 <col:14, col:28> col:29 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7f99b29e3580 <line:314:5, col:40> col:15 operator= 'class std::__1::ios_base &(const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f99b29e34c0 <col:25, col:39> col:40 'const class std::__1::ios_base &'
|-AccessSpecDecl 0x7f99b29e3620 <line:316:1, col:7> col:1 public
|-CXXMethodDecl 0x7f99b29e3720 <line:317:5, col:51> col:17 sync_with_stdio '_Bool (_Bool)' static
| `-ParmVarDecl 0x7f99b29e3658 <col:33, col:47> col:38 __sync '_Bool' cinit
|   `-CXXBoolLiteralExpr 0x7f99b29e5b18 <col:47> '_Bool' true
|-CXXMethodDecl 0x7f99b29e3840 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:319:49> col:39 rdstate 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7f99b29e38d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b29e3920 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b29e3a00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:320:5, col:41> col:10 used clear 'void (std::__1::ios_base::iostate)'
| `-ParmVarDecl 0x7f99b29e3940 <col:16, col:34> col:24 __state 'std::__1::ios_base::iostate':'unsigned int' cinit
|   `-ImplicitCastExpr 0x7f99b29e5b58 <col:34> 'std::__1::ios_base::iostate':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f99b29e5b30 <col:34> 'const std::__1::ios_base::iostate':'const unsigned int' lvalue Var 0x7f99b29e06c0 'goodbit' 'const std::__1::ios_base::iostate':'const unsigned int'
|-CXXMethodDecl 0x7f99b29e3b68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:321:60> col:36 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f99b29e3ae0 <col:45, col:53> col:53 __state 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7f99b29e3c08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b29e3c50 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b29e3cb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:323:43> col:36 good '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f99b29e3d48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b29e3d90 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b29e3df0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:324:42> col:36 eof '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f99b29e3e88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b29e3ed0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b29e3f30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:325:43> col:36 fail '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f99b29e3fc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b29e4010 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b29e4070 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:326:42> col:36 bad '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f99b29e4108 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b29e4150 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b29e41b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:328:52> col:39 exceptions 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7f99b29e4248 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b29e4290 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b29e4368 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:329:64> col:36 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f99b29e42e0 <col:47, col:55> col:55 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7f99b29e4408 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b29e4450 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b29e4480 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:331:5, col:44> col:10 __set_badbit_and_consider_rethrow 'void (void)'
|-CXXMethodDecl 0x7f99b29e4538 <line:332:5, col:45> col:10 __set_failbit_and_consider_rethrow 'void (void)'
|-AccessSpecDecl 0x7f99b29e45d0 <line:334:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f99b29e4648 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:337:16> line:336:5 ios_base 'void (void)'
| |-CompoundStmt 0x7f99b29e5b70 <col:16, line:337:16>
| |-AlwaysInlineAttr 0x7f99b29e46f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b29e4738 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b29e47e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:339:5, col:25> col:10 referenced init 'void (void *)'
| `-ParmVarDecl 0x7f99b29e4760 <col:15, col:21> col:21 __sb 'void *'
|-CXXMethodDecl 0x7f99b29e4918 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:340:64> col:33 rdbuf 'void *(void) const'
| |-CompoundStmt 0x7f99b29e5c08 <col:47, col:64>
| | `-ReturnStmt 0x7f99b29e5bf0 <col:48, col:55>
| |   `-ImplicitCastExpr 0x7f99b29e5bd8 <col:55> 'void *' <LValueToRValue>
| |     `-MemberExpr 0x7f99b29e5ba0 <col:55> 'void *const' lvalue ->__rdbuf_ 0x7f99b29e5528
| |       `-CXXThisExpr 0x7f99b29e5b88 <col:55> 'const class std::__1::ios_base *' this
| |-AlwaysInlineAttr 0x7f99b29e49b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f99b29e49f8 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f99b29e4ad8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:347:5> line:343:10 rdbuf 'void (void *)'
| |-ParmVarDecl 0x7f99b29e4a50 <col:16, col:22> col:22 used __sb 'void *'
| |-CompoundStmt 0x7f99b29e5d88 <line:344:5, line:347:5>
| | |-BinaryOperator 0x7f99b29e5cb8 <line:345:9, col:20> 'void *' lvalue '='
| | | |-MemberExpr 0x7f99b29e5c40 <col:9> 'void *' lvalue ->__rdbuf_ 0x7f99b29e5528
| | | | `-CXXThisExpr 0x7f99b29e5c28 <col:9> 'class std::__1::ios_base *' this
| | | `-ImplicitCastExpr 0x7f99b29e5ca0 <col:20> 'void *' <LValueToRValue>
| | |   `-DeclRefExpr 0x7f99b29e5c78 <col:20> 'void *' lvalue ParmVar 0x7f99b29e4a50 '__sb' 'void *'
| | `-CXXMemberCallExpr 0x7f99b29e5d30 <line:346:9, col:15> 'void'
| |   |-MemberExpr 0x7f99b29e5cf8 <col:9> '<bound member function type>' ->clear 0x7f99b29e3a00
| |   | `-CXXThisExpr 0x7f99b29e5ce0 <col:9> 'class std::__1::ios_base *' this
| |   `-CXXDefaultArgExpr 0x7f99b29e5d68 <<invalid sloc>> 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7f99b29e4b78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f99b29e4bc0 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f99b29e4ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:349:5, col:32> col:10 referenced __call_callbacks 'void (enum std::__1::ios_base::event)'
| `-ParmVarDecl 0x7f99b29e4be0 <col:27> col:32 'enum std::__1::ios_base::event'
|-CXXMethodDecl 0x7f99b29e4dd8 <line:350:5, col:33> col:10 referenced copyfmt 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f99b29e4d50 <col:18, col:32> col:33 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7f99b29e4f50 <line:351:5, col:24> col:10 referenced move 'void (class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f99b29e4e88 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7f99b29e50c8 <line:352:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:352:10 referenced swap 'void (class std::__1::ios_base &) noexcept'
| `-ParmVarDecl 0x7f99b29e5000 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7f99b29e5238 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:358:5> line:355:10 referenced set_rdbuf 'void (void *)'
| |-ParmVarDecl 0x7f99b29e51b0 <col:20, col:26> col:26 used __sb 'void *'
| |-CompoundStmt 0x7f99b29e5e68 <line:356:5, line:358:5>
| | `-BinaryOperator 0x7f99b29e5e40 <line:357:9, col:20> 'void *' lvalue '='
| |   |-MemberExpr 0x7f99b29e5dc8 <col:9> 'void *' lvalue ->__rdbuf_ 0x7f99b29e5528
| |   | `-CXXThisExpr 0x7f99b29e5db0 <col:9> 'class std::__1::ios_base *' this
| |   `-ImplicitCastExpr 0x7f99b29e5e28 <col:20> 'void *' <LValueToRValue>
| |     `-DeclRefExpr 0x7f99b29e5e00 <col:20> 'void *' lvalue ParmVar 0x7f99b29e51b0 '__sb' 'void *'
| |-AlwaysInlineAttr 0x7f99b29e52d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f99b29e5320 <col:48, col:71> Hidden
|-AccessSpecDecl 0x7f99b29e5330 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:360:1, col:8> col:1 private
|-FieldDecl 0x7f99b29e5368 <line:362:5, col:21> col:21 referenced __fmtflags_ 'std::__1::ios_base::fmtflags':'unsigned int'
|-FieldDecl 0x7f99b29e53c0 <line:363:5, col:21> col:21 referenced __precision_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7f99b29e5418 <line:364:5, col:21> col:21 referenced __width_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7f99b29e5470 <line:365:5, col:21> col:21 referenced __rdstate_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7f99b29e54c8 <line:366:5, col:21> col:21 referenced __exceptions_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7f99b29e5528 <line:367:5, col:21> col:21 referenced __rdbuf_ 'void *'
|-FieldDecl 0x7f99b29e5588 <line:368:5, col:21> col:21 __loc_ 'void *'
|-FieldDecl 0x7f99b29e5638 <line:369:5, col:21> col:21 __fn_ 'std::__1::ios_base::event_callback *'
|-FieldDecl 0x7f99b29e5698 <line:370:5, col:21> col:21 __index_ 'int *'
|-FieldDecl 0x7f99b29e56f0 <line:371:5, col:21> col:21 __event_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7f99b29e5748 <line:372:5, col:21> col:21 __event_cap_ 'size_t':'unsigned long'
|-VarDecl 0x7f99b29e5858 <line:376:5, col:24> col:24 __xindex_ 'atomic<int>':'struct std::__1::atomic<int>' static
|-FieldDecl 0x7f99b29e58d0 <line:380:5, col:21> col:21 __iarray_ 'long *'
|-FieldDecl 0x7f99b29e5928 <line:381:5, col:21> col:21 __iarray_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7f99b29e5980 <line:382:5, col:21> col:21 __iarray_cap_ 'size_t':'unsigned long'
|-FieldDecl 0x7f99b29e59e0 <line:383:5, col:21> col:21 __parray_ 'void **'
|-FieldDecl 0x7f99b29e5a38 <line:384:5, col:21> col:21 __parray_size_ 'size_t':'unsigned long'
`-FieldDecl 0x7f99b29e5a90 <line:385:5, col:21> col:21 __parray_cap_ 'size_t':'unsigned long'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f99b18205f8 parent 0x7f99b1816488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:486:78> col:64 class basic_ios definition
|-public 'class std::__1::ios_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f99b2a36c58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7f99b2a36d48 prev 0x7f99b18205f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:583:1, col:28> col:28 implicit class basic_ios
|-AccessSpecDecl 0x7f99b2a36de0 <line:586:1, col:7> col:1 public
|-TypedefDecl 0x7f99b2a36e48 <line:588:5, col:20> col:20 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f99b2a36e10 'char' sugar
|   |-TemplateTypeParmType 0x7f99b29f3690 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f99b29f3650 '_CharT'
|   `-BuiltinType 0x7f99b0833b60 'char'
|-TypedefDecl 0x7f99b2a36ed8 <line:589:5, col:21> col:21 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f99b2a36ea0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f99b29f3700 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f99b29f36b8 '_Traits'
|   `-RecordType 0x7f99b1820560 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f99b0a45748 'char_traits'
|-TypedefDecl 0x7f99b2a36fe0 <line:591:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f99b2a36f90 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f99b0a47290 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f99b0a45aa8 'int_type'
|     `-BuiltinType 0x7f99b0833bc0 'int'
|-TypedefDecl 0x7f99b2a370b0 <line:592:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f99b2a37060 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f99b2a24800 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f99b0a45b78 'pos_type'
|     `-TypedefType 0x7f99b0a3df10 'std::__1::streampos' sugar
|       |-Typedef 0x7f99b105a5b8 'streampos'
|       `-TemplateSpecializationType 0x7f99b105a510 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f99b105a4f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f99b105a400 'fpos'
|-TypedefDecl 0x7f99b2a37180 <line:593:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f99b2a37130 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f99b2a248f0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f99b0a45b10 'off_type'
|     `-TypedefType 0x7f99b0a3de80 'std::__1::streamoff' sugar
|       |-Typedef 0x7f99b105a958 'streamoff'
|       `-BuiltinType 0x7f99b0833c00 'long long'
|-CXXConversionDecl 0x7f99b2a371d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:605:60> col:22 operator bool '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f99b2a372a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2a372f8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:608:69> col:32 operator! '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f99b2a373a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2a373e8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:609:81> col:35 rdstate 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7f99b2a37490 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2a37560 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:610:91> col:32 clear 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f99b2a374d8 <col:38, col:56> col:46 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7f99b2a37610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2a376e0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:611:87> col:32 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f99b2a37658 <col:41, col:49> col:49 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7f99b2a37790 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2a377d8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:612:70> col:32 good '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f99b2a37880 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2a378c8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:613:69> col:32 eof '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f99b2a37970 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2a379b8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:614:70> col:32 fail '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f99b2a37a60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2a37aa8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:615:69> col:32 bad '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f99b2a37b50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2a37b98 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:617:85> col:35 exceptions 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7f99b2a37c40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2a37d10 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:618:95> col:32 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f99b2a37c88 <col:43, col:51> col:51 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7f99b2a37dc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXConstructorDecl 0x7f99b2a38070 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:622:68> col:14 basic_ios 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f99b2a37f28 <col:24, col:64> col:64 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f99b2a38130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7f99b2a381a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:623:5, col:24> col:13 used ~basic_ios 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7f99b2a38400 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:627:50> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7f99b2a384a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f99b2a387e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:629:95> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f99b2a38698 <col:48, col:87> col:87 __tiestr 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f99b2a38890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f99b2a38a50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:632:54> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7f99b2a38af8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f99b2a38e30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:634:97> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f99b2a38ce8 <col:52, col:93> col:93 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f99b2a38ee0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f99b2a39060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:636:5, col:46> col:16 copyfmt 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)'
| `-ParmVarDecl 0x7f99b2a38f98 <col:24, col:41> col:41 __rhs 'const class std::__1::basic_ios<char> &'
|-CXXMethodDecl 0x7f99b2a39160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:639:22> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (void) const'
| `-AlwaysInlineAttr 0x7f99b2a39208 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f99b2a39360 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:641:34> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7f99b2a39260 <col:20, col:30> col:30 __ch 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7f99b2a39410 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f99b2a394e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:644:37> col:12 imbue 'class std::__1::locale (const class std::__1::locale &)'
| |-ParmVarDecl 0x7f99b2a39458 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7f99b2a39590 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f99b2a39720 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:647:47> col:10 narrow 'char (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, char) const'
| |-ParmVarDecl 0x7f99b2a395e8 <col:17, col:27> col:27 __c 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| |-ParmVarDecl 0x7f99b2a39648 <col:32, col:37> col:37 __dfault 'char'
| `-AlwaysInlineAttr 0x7f99b2a397d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f99b2a398e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:649:31> col:15 widen 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (char) const'
| |-ParmVarDecl 0x7f99b2a39820 <col:21, col:26> col:26 __c 'char'
| `-AlwaysInlineAttr 0x7f99b2a39990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7f99b2a399d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:651:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f99b2a39a20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:654:17> line:653:5 basic_ios 'void (void)'
| `-AlwaysInlineAttr 0x7f99b2a39ad8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2a39ce0 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:656:60> col:10 init 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f99b2a39c18 <col:15, col:56> col:56 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f99b2a39d90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f99b2a39eb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:659:31> col:10 move 'void (class std::__1::basic_ios<char> &)'
| |-ParmVarDecl 0x7f99b2a39de8 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7f99b2a39f60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f99b2a3a0b0 <line:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:662:47> col:10 move 'void (class std::__1::basic_ios<char> &&)'
| |-ParmVarDecl 0x7f99b2a39fe8 <col:15, col:27> col:27 __rhs 'class std::__1::basic_ios<char> &&'
| `-AlwaysInlineAttr 0x7f99b2a3a160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2a3a288 <line:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:665:10 swap 'void (class std::__1::basic_ios<char> &) noexcept'
| |-ParmVarDecl 0x7f99b2a3a1b8 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7f99b2a3a338 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f99b2a3a540 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:667:65> col:10 set_rdbuf 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f99b2a3a478 <col:20, col:61> col:61 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f99b2a3a5f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7f99b2a3a638 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:668:1, col:8> col:1 private
|-FieldDecl 0x7f99b2a3a758 <line:669:5, col:44> col:44 __tie_ 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
|-FieldDecl 0x7f99b2a3a7d0 <line:670:6, col:23> col:23 __fill_ 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' mutable
|-CXXConstructorDecl 0x7f99b2a3a858 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:486:64> col:64 implicit basic_ios 'void (const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7f99b2a3a858
| `-ParmVarDecl 0x7f99b2a3a980 <col:64> col:64 'const class std::__1::basic_ios<char> &'
`-CXXMethodDecl 0x7f99b2a3a9e8 <col:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7f99b2a3a9e8
  `-ParmVarDecl 0x7f99b2a3aac0 <col:64> col:64 'const class std::__1::basic_ios<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ios" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f99b18213c8 parent 0x7f99b1816488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1681:82> col:64 class basic_istream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f99b156c7e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7f99b156ca20 prev 0x7f99b18213c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:176:1, col:28> col:28 implicit class basic_istream
|-FieldDecl 0x7f99b156cab8 <line:179:5, col:16> col:16 __gc_ 'std::__1::streamsize':'long'
|-AccessSpecDecl 0x7f99b156cb00 <line:180:1, col:7> col:1 public
|-TypedefDecl 0x7f99b156cb38 <line:182:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f99b156c8b0 'char' sugar
|   |-TemplateTypeParmType 0x7f99b150e130 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f99b150e0e8 '_CharT'
|   `-BuiltinType 0x7f99b0833b60 'char'
|-TypedefDecl 0x7f99b156cba0 <line:183:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f99b156c8f0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f99b150e1a0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f99b150e158 '_Traits'
|   `-RecordType 0x7f99b1820560 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f99b0a45748 'char_traits'
|-TypedefDecl 0x7f99b156ccb0 <line:184:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f99b156cc60 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f99b0a47290 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f99b0a45aa8 'int_type'
|     `-BuiltinType 0x7f99b0833bc0 'int'
|-TypedefDecl 0x7f99b156cd80 <line:185:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f99b156cd30 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f99b2a24800 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f99b0a45b78 'pos_type'
|     `-TypedefType 0x7f99b0a3df10 'std::__1::streampos' sugar
|       |-Typedef 0x7f99b105a5b8 'streampos'
|       `-TemplateSpecializationType 0x7f99b105a510 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f99b105a4f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f99b105a400 'fpos'
|-TypedefDecl 0x7f99b156ce50 <line:186:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f99b156ce00 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f99b2a248f0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f99b0a45b10 'off_type'
|     `-TypedefType 0x7f99b0a3de80 'std::__1::streamoff' sugar
|       |-Typedef 0x7f99b105a958 'streamoff'
|       `-BuiltinType 0x7f99b0833c00 'long long'
|-CXXConstructorDecl 0x7f99b156d0d0 <line:189:5, line:191:25> line:190:14 basic_istream 'void (basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7f99b156cfc8 <col:28, col:69> col:69 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f99b156d1b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXDestructorDecl 0x7f99b156d230 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:192:5, col:28> col:13 ~basic_istream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7f99b156d2e0 <line:193:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f99b156d430 <line:195:5, line:196:40> col:5 basic_istream 'void (class std::__1::basic_istream<char> &&)' inline
| |-ParmVarDecl 0x7f99b156d348 <col:19, col:35> col:35 __rhs 'class std::__1::basic_istream<char> &&'
| `-AlwaysInlineAttr 0x7f99b156d4f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f99b156d640 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:199:5, line:200:51> col:20 operator= 'class std::__1::basic_istream<char> &(class std::__1::basic_istream<char> &&)' inline
| |-ParmVarDecl 0x7f99b156d578 <col:30, col:46> col:46 __rhs 'class std::__1::basic_istream<char> &&'
| `-AlwaysInlineAttr 0x7f99b156d6f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f99b156d810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:203:5, line:207:5> line:204:10 swap 'void (class std::__1::basic_istream<char> &)' inline
| |-ParmVarDecl 0x7f99b156d748 <col:15, col:30> col:30 __rhs 'class std::__1::basic_istream<char> &'
| `-AlwaysInlineAttr 0x7f99b156d8c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXConstructorDecl 0x7f99b156da30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:210:5, col:65> col:5 basic_istream 'void (const class std::__1::basic_istream<char> &)' delete
| `-ParmVarDecl 0x7f99b156d948 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_istream<char> &'
|-CXXMethodDecl 0x7f99b156dbc0 <line:211:5, col:65> col:20 operator= 'class std::__1::basic_istream<char> &(const class std::__1::basic_istream<char> &)' delete
| `-ParmVarDecl 0x7f99b156db00 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_istream<char> &'
|-AccessSpecDecl 0x7f99b156dc70 <line:213:1, col:7> col:1 public
|-CXXRecordDecl 0x7f99b156dc98 <line:216:5, col:32> col:32 class sentry definition
| |-CXXRecordDecl 0x7f99b15721d0 prev 0x7f99b156dc98 <line:293:1, col:60> col:60 implicit class sentry
| |-FieldDecl 0x7f99b1572268 <line:295:5, col:10> col:10 __ok_ '_Bool'
| |-CXXConstructorDecl 0x7f99b15723f0 <line:297:5, col:25> col:5 sentry 'void (const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7f99b15722e8 <col:12, col:24> col:25 'const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x7f99b15725b0 <line:298:5, col:36> col:13 operator= 'class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7f99b15724e8 <col:23, col:35> col:36 'const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x7f99b1572660 <line:300:1, col:7> col:1 public
| |-CXXConstructorDecl 0x7f99b1572980 <line:301:5, col:82> col:14 sentry 'void (basic_istream<char, struct std::__1::char_traits<char> > &, _Bool)'
| | |-ParmVarDecl 0x7f99b15727e8 <col:21, col:53> col:53 __is 'basic_istream<char, struct std::__1::char_traits<char> > &'
| | `-ParmVarDecl 0x7f99b1572848 <col:59, col:77> col:64 __noskipws '_Bool'
| `-CXXConversionDecl 0x7f99b1572a48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:306:45> col:9 operator bool '_Bool (void) const'
|   `-AlwaysInlineAttr 0x7f99b1572b18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f99b156dfd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:219:5, line:221:27> line:220:20 operator>> 'class std::__1::basic_istream<char> &(class std::__1::basic_istream<char> &(*)(class std::__1::basic_istream<char> &))' inline
| |-ParmVarDecl 0x7f99b156ded0 <col:31, col:68> col:48 __pf 'class std::__1::basic_istream<char> &(*)(class std::__1::basic_istream<char> &)'
| `-AlwaysInlineAttr 0x7f99b156e080 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b156e4f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:223:5, line:226:34> line:224:20 operator>> 'class std::__1::basic_istream<char> &(basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &))' inline
| |-ParmVarDecl 0x7f99b156e3f0 <col:31, line:225:73> col:33 __pf 'basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &)'
| `-AlwaysInlineAttr 0x7f99b156e5a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b156e6f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:228:5, line:230:34> line:229:20 operator>> 'class std::__1::basic_istream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))' inline
| |-ParmVarDecl 0x7f99b156e5e8 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x7f99b156e7a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b156e9f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:232:5, col:76> col:20 operator>> 'class std::__1::basic_istream<char> &(basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *)'
| `-ParmVarDecl 0x7f99b156e8e8 <col:31, col:72> col:72 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *'
|-CXXMethodDecl 0x7f99b156eb60 <line:233:5, col:40> col:20 operator>> 'class std::__1::basic_istream<char> &(_Bool &)'
| `-ParmVarDecl 0x7f99b156eaa0 <col:31, col:37> col:37 __n '_Bool &'
|-CXXMethodDecl 0x7f99b156ecd0 <line:234:5, col:41> col:20 operator>> 'class std::__1::basic_istream<char> &(short &)'
| `-ParmVarDecl 0x7f99b156ec10 <col:31, col:38> col:38 __n 'short &'
|-CXXMethodDecl 0x7f99b156ee40 <line:235:5, col:50> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned short &)'
| `-ParmVarDecl 0x7f99b156ed80 <col:31, col:47> col:47 __n 'unsigned short &'
|-CXXMethodDecl 0x7f99b156efb0 <line:236:5, col:39> col:20 operator>> 'class std::__1::basic_istream<char> &(int &)'
| `-ParmVarDecl 0x7f99b156eef0 <col:31, col:36> col:36 __n 'int &'
|-CXXMethodDecl 0x7f99b156f120 <line:237:5, col:48> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned int &)'
| `-ParmVarDecl 0x7f99b156f060 <col:31, col:45> col:45 __n 'unsigned int &'
|-CXXMethodDecl 0x7f99b156f290 <line:238:5, col:40> col:20 operator>> 'class std::__1::basic_istream<char> &(long &)'
| `-ParmVarDecl 0x7f99b156f1d0 <col:31, col:37> col:37 __n 'long &'
|-CXXMethodDecl 0x7f99b156f400 <line:239:5, col:49> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned long &)'
| `-ParmVarDecl 0x7f99b156f340 <col:31, col:46> col:46 __n 'unsigned long &'
|-CXXMethodDecl 0x7f99b156f570 <line:240:5, col:45> col:20 operator>> 'class std::__1::basic_istream<char> &(long long &)'
| `-ParmVarDecl 0x7f99b156f4b0 <col:31, col:42> col:42 __n 'long long &'
|-CXXMethodDecl 0x7f99b156f6e0 <line:241:5, col:54> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned long long &)'
| `-ParmVarDecl 0x7f99b156f620 <col:31, col:51> col:51 __n 'unsigned long long &'
|-CXXMethodDecl 0x7f99b156f850 <line:242:5, col:41> col:20 operator>> 'class std::__1::basic_istream<char> &(float &)'
| `-ParmVarDecl 0x7f99b156f790 <col:31, col:38> col:38 __f 'float &'
|-CXXMethodDecl 0x7f99b156f9c0 <line:243:5, col:42> col:20 operator>> 'class std::__1::basic_istream<char> &(double &)'
| `-ParmVarDecl 0x7f99b156f900 <col:31, col:39> col:39 __f 'double &'
|-CXXMethodDecl 0x7f99b156fb30 <line:244:5, col:47> col:20 operator>> 'class std::__1::basic_istream<char> &(long double &)'
| `-ParmVarDecl 0x7f99b156fa70 <col:31, col:44> col:44 __f 'long double &'
|-CXXMethodDecl 0x7f99b156fca0 <line:245:5, col:41> col:20 operator>> 'class std::__1::basic_istream<char> &(void *&)'
| `-ParmVarDecl 0x7f99b156fbe0 <col:31, col:38> col:38 __p 'void *&'
|-CXXMethodDecl 0x7f99b156fd50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:249:45> col:16 gcount 'std::__1::streamsize (void) const'
| `-AlwaysInlineAttr 0x7f99b156fdf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f99b156feb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:250:5, col:18> col:14 get 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type (void)'
|-CXXMethodDecl 0x7f99b15700a0 <line:252:5, line:258:5> line:253:20 get 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type &)' inline
| |-ParmVarDecl 0x7f99b156ff98 <col:24, col:35> col:35 __c 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type &'
| `-AlwaysInlineAttr 0x7f99b1570150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b1570350 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:260:5, line:262:48> line:261:20 get 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f99b15701d8 <col:24, col:35> col:35 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f99b1570238 <col:40, col:51> col:51 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f99b1570408 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b1570660 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:264:5, col:71> col:20 get 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7f99b1570460 <col:24, col:35> col:35 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f99b15704c0 <col:40, col:51> col:51 __n 'std::__1::streamsize':'long'
| `-ParmVarDecl 0x7f99b1570530 <col:56, col:66> col:66 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7f99b1570920 <line:266:5, line:268:44> line:267:20 get 'class std::__1::basic_istream<char> &(basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &)' inline
| |-ParmVarDecl 0x7f99b1570818 <col:24, col:65> col:65 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &'
| `-AlwaysInlineAttr 0x7f99b15709d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b1570ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:270:5, col:86> col:20 get 'class std::__1::basic_istream<char> &(basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7f99b1570b18 <col:24, col:65> col:65 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &'
| `-ParmVarDecl 0x7f99b1570b88 <col:71, col:81> col:81 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7f99b1570e58 <line:272:5, line:274:52> line:273:20 getline 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f99b1570d68 <col:28, col:39> col:39 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f99b1570dc8 <col:44, col:55> col:55 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f99b1570f10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b1571108 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:276:5, col:75> col:20 getline 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7f99b1570f68 <col:28, col:39> col:39 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f99b1571000 <col:44, col:55> col:55 __n 'std::__1::streamsize':'long'
| `-ParmVarDecl 0x7f99b1571070 <col:60, col:70> col:70 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7f99b1571350 <line:278:5, col:82> col:20 ignore 'class std::__1::basic_istream<char> &(std::__1::streamsize, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type)'
| |-ParmVarDecl 0x7f99b15711c8 <col:27, col:44> col:38 __n 'std::__1::streamsize':'long'
| `-ParmVarDecl 0x7f99b1571238 <col:47, col:81> col:56 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7f99b1571428 <line:279:5, col:19> col:14 peek 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type (void)'
|-CXXMethodDecl 0x7f99b15715d0 <line:280:5, col:56> col:20 read 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7f99b15714e0 <col:26, col:37> col:37 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f99b1571540 <col:42, col:53> col:53 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f99b15717d0 <line:281:5, col:55> col:16 readsome 'std::__1::streamsize (std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7f99b1571698 <col:25, col:36> col:36 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f99b15716f8 <col:41, col:52> col:52 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f99b15719a0 <line:283:5, col:41> col:20 putback 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| `-ParmVarDecl 0x7f99b1571898 <col:28, col:38> col:38 __c 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7f99b1571aa0 <line:284:5, col:26> col:20 unget 'class std::__1::basic_istream<char> &(void)'
|-CXXMethodDecl 0x7f99b1571b48 <line:285:5, col:14> col:9 sync 'int (void)'
|-CXXMethodDecl 0x7f99b1571c60 <line:287:5, col:20> col:14 tellg 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::pos_type (void)'
|-CXXMethodDecl 0x7f99b1571e20 <line:288:5, col:40> col:20 seekg 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::pos_type)'
| `-ParmVarDecl 0x7f99b1571d18 <col:26, col:35> col:35 __pos 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
`-CXXMethodDecl 0x7f99b1572070 <line:289:5, col:65> col:20 seekg 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir)'
  |-ParmVarDecl 0x7f99b1571f00 <col:26, col:35> col:35 __off 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::off_type':'long long'
  `-ParmVarDecl 0x7f99b1571f60 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_istream" = type { i32 (...)**, i64, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_istream.base" = type { i32 (...)**, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f99b18216b8 parent 0x7f99b1816488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:1084:82> col:64 class basic_ostream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f99b2aaeac8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7f99b2aaed00 prev 0x7f99b18216b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:151:1, col:28> col:28 implicit class basic_ostream
|-AccessSpecDecl 0x7f99b2aaed98 <line:154:1, col:7> col:1 public
|-TypedefDecl 0x7f99b2aaedd0 <line:156:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f99b2aaeb90 'char' sugar
|   |-TemplateTypeParmType 0x7f99b1ca6390 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f99b1ca6348 '_CharT'
|   `-BuiltinType 0x7f99b0833b60 'char'
|-TypedefDecl 0x7f99b2aaee38 <line:157:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f99b2aaebd0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f99b1ca6400 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f99b1ca63b8 '_Traits'
|   `-RecordType 0x7f99b1820560 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f99b0a45748 'char_traits'
|-TypedefDecl 0x7f99b2aaef40 <line:158:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f99b2aaeef0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f99b0a47290 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f99b0a45aa8 'int_type'
|     `-BuiltinType 0x7f99b0833bc0 'int'
|-TypedefDecl 0x7f99b2aaf010 <line:159:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f99b2aaefc0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f99b2a24800 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f99b0a45b78 'pos_type'
|     `-TypedefType 0x7f99b0a3df10 'std::__1::streampos' sugar
|       |-Typedef 0x7f99b105a5b8 'streampos'
|       `-TemplateSpecializationType 0x7f99b105a510 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f99b105a4f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f99b105a400 'fpos'
|-TypedefDecl 0x7f99b2aaf0e0 <line:160:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f99b2aaf090 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f99b2a248f0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f99b0a45b10 'off_type'
|     `-TypedefType 0x7f99b0a3de80 'std::__1::streamoff' sugar
|       |-Typedef 0x7f99b105a958 'streamoff'
|       `-BuiltinType 0x7f99b0833c00 'long long'
|-CXXConstructorDecl 0x7f99b2aaf360 <line:163:5, line:165:25> line:164:14 basic_ostream 'void (basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7f99b2aaf258 <col:28, col:69> col:69 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f99b2aaf420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXDestructorDecl 0x7f99b2aaf498 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:166:5, col:28> col:13 ~basic_ostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7f99b2aaf548 <line:167:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f99b2aaf690 <line:169:5, line:170:40> col:5 basic_ostream 'void (class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7f99b2aaf5a8 <col:19, col:35> col:35 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7f99b2aaf750 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f99b2aaf8a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:173:5, line:174:51> col:20 operator= 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7f99b2aaf7d8 <col:30, col:46> col:46 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7f99b2aaf950 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f99b2aafa70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:176:5, line:178:55> line:177:10 swap 'void (class std::__1::basic_ostream<char> &)' inline
| |-ParmVarDecl 0x7f99b2aaf9a8 <col:15, col:30> col:30 __rhs 'class std::__1::basic_ostream<char> &'
| `-AlwaysInlineAttr 0x7f99b2aafb20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXConstructorDecl 0x7f99b2aafc90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:181:5, col:65> col:5 basic_ostream 'void (const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7f99b2aafba8 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-CXXMethodDecl 0x7f99b2aafe20 <line:182:5, col:65> col:20 operator= 'class std::__1::basic_ostream<char> &(const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7f99b2aafd60 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-AccessSpecDecl 0x7f99b2aafed0 <line:187:1, col:7> col:1 public
|-CXXRecordDecl 0x7f99b2aafef8 <line:190:5, col:32> col:32 class sentry definition
| |-CXXRecordDecl 0x7f99b15085a0 prev 0x7f99b2aafef8 <line:240:1, col:60> col:60 implicit class sentry
| |-FieldDecl 0x7f99b1508638 <line:242:5, col:10> col:10 __ok_ '_Bool'
| |-FieldDecl 0x7f99b15087d8 <line:243:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXConstructorDecl 0x7f99b1508960 <line:245:5, col:25> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7f99b1508858 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x7f99b1508b20 <line:246:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7f99b1508a58 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x7f99b1508bd0 <line:248:1, col:7> col:1 public
| |-CXXConstructorDecl 0x7f99b1508de0 <line:249:5, col:57> col:14 sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| | `-ParmVarDecl 0x7f99b1508cf8 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXDestructorDecl 0x7f99b1508ed0 <line:250:5, col:13> col:5 ~sentry 'void (void)' noexcept-unevaluated 0x7f99b1508ed0
| `-CXXConversionDecl 0x7f99b1508f80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:254:45> col:9 operator bool '_Bool (void) const'
|   `-AlwaysInlineAttr 0x7f99b1509058 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2ab0230 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:193:5, line:195:27> line:194:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &))' inline
| |-ParmVarDecl 0x7f99b2ab0130 <col:31, col:68> col:48 __pf 'class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &)'
| `-AlwaysInlineAttr 0x7f99b2ab02e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2ab07c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:197:5, line:200:34> line:198:20 operator<< 'class std::__1::basic_ostream<char> &(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &))' inline
| |-ParmVarDecl 0x7f99b2ab06c0 <col:31, line:199:72> col:33 __pf 'basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &)'
| `-AlwaysInlineAttr 0x7f99b2ab0870 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2ab09c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:202:5, line:204:34> line:203:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))' inline
| |-ParmVarDecl 0x7f99b2ab08b8 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x7f99b2ab0a70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2ab0b80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:206:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(_Bool)'
| `-ParmVarDecl 0x7f99b2ab0ab8 <col:31, col:36> col:36 __n '_Bool'
|-CXXMethodDecl 0x7f99b2ab0cf0 <line:207:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(short)'
| `-ParmVarDecl 0x7f99b2ab0c30 <col:31, col:37> col:37 __n 'short'
|-CXXMethodDecl 0x7f99b2ab0e60 <line:208:5, col:49> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned short)'
| `-ParmVarDecl 0x7f99b2ab0da0 <col:31, col:46> col:46 __n 'unsigned short'
|-CXXMethodDecl 0x7f99b2ab0fd0 <line:209:5, col:38> col:20 operator<< 'class std::__1::basic_ostream<char> &(int)'
| `-ParmVarDecl 0x7f99b2ab0f10 <col:31, col:35> col:35 __n 'int'
|-CXXMethodDecl 0x7f99b2ab1140 <line:210:5, col:47> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned int)'
| `-ParmVarDecl 0x7f99b2ab1080 <col:31, col:44> col:44 __n 'unsigned int'
|-CXXMethodDecl 0x7f99b2ab12b0 <line:211:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(long)'
| `-ParmVarDecl 0x7f99b2ab11f0 <col:31, col:36> col:36 __n 'long'
|-CXXMethodDecl 0x7f99b2ab1420 <line:212:5, col:48> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long)'
| `-ParmVarDecl 0x7f99b2ab1360 <col:31, col:45> col:45 __n 'unsigned long'
|-CXXMethodDecl 0x7f99b2ab1590 <line:213:5, col:44> col:20 operator<< 'class std::__1::basic_ostream<char> &(long long)'
| `-ParmVarDecl 0x7f99b2ab14d0 <col:31, col:41> col:41 __n 'long long'
|-CXXMethodDecl 0x7f99b2ab1700 <line:214:5, col:53> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long long)'
| `-ParmVarDecl 0x7f99b2ab1640 <col:31, col:50> col:50 __n 'unsigned long long'
|-CXXMethodDecl 0x7f99b2ab1870 <line:215:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(float)'
| `-ParmVarDecl 0x7f99b2ab17b0 <col:31, col:37> col:37 __f 'float'
|-CXXMethodDecl 0x7f99b2ab19e0 <line:216:5, col:41> col:20 operator<< 'class std::__1::basic_ostream<char> &(double)'
| `-ParmVarDecl 0x7f99b2ab1920 <col:31, col:38> col:38 __f 'double'
|-CXXMethodDecl 0x7f99b2ab1b50 <line:217:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(long double)'
| `-ParmVarDecl 0x7f99b2ab1a90 <col:31, col:43> col:43 __f 'long double'
|-CXXMethodDecl 0x7f99b2ab1cc0 <line:218:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(const void *)'
| `-ParmVarDecl 0x7f99b2ab1c00 <col:31, col:43> col:43 __p 'const void *'
|-CXXMethodDecl 0x7f99b2ab1f70 <line:219:5, col:76> col:20 operator<< 'class std::__1::basic_ostream<char> &(basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)'
| `-ParmVarDecl 0x7f99b2ab1e68 <col:31, col:72> col:72 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
|-CXXMethodDecl 0x7f99b2ab2130 <line:222:5, col:37> col:20 put 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type)'
| `-ParmVarDecl 0x7f99b2ab2030 <col:24, col:34> col:34 __c 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7f99b2ab2390 <line:223:5, col:62> col:20 write 'class std::__1::basic_ostream<char> &(const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7f99b2ab2218 <col:26, col:43> col:43 __s 'const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f99b2ab2278 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f99b2ab24a0 <line:224:5, col:26> col:20 flush 'class std::__1::basic_ostream<char> &(void)'
|-CXXMethodDecl 0x7f99b2ab25f0 <line:227:5, line:228:20> col:14 tellp 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type (void)' inline
| `-AlwaysInlineAttr 0x7f99b2ab2698 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> Inherited always_inline
|-CXXMethodDecl 0x7f99b2ab27f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:229:5, line:230:40> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type)' inline
| |-ParmVarDecl 0x7f99b2ab26f0 <col:26, col:35> col:35 __pos 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-AlwaysInlineAttr 0x7f99b2ab28a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> Inherited always_inline
|-CXXMethodDecl 0x7f99b15082b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:231:5, line:232:65> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir)' inline
| |-ParmVarDecl 0x7f99b2ab2920 <col:26, col:35> col:35 __off 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7f99b2ab2980 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-AlwaysInlineAttr 0x7f99b1508368 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> Inherited always_inline
|-AccessSpecDecl 0x7f99b15083b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:234:1, col:10> col:1 protected
`-CXXConstructorDecl 0x7f99b15083f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:236:22> col:5 basic_ostream 'void (void)'
  `-AlwaysInlineAttr 0x7f99b15084b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream.base" = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f99b18219a8 parent 0x7f99b1816488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1683:83> col:64 class basic_iostream definition
|-public 'basic_istream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_istream<char>'
|-public 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f99b15791a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7f99b15794d8 prev 0x7f99b18219a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1442:1, col:28> col:28 implicit class basic_iostream
|-AccessSpecDecl 0x7f99b1579570 <line:1446:1, col:7> col:1 public
|-TypedefDecl 0x7f99b15795a8 <line:1448:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f99b1579270 'char' sugar
|   |-TemplateTypeParmType 0x7f99b1560bd0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f99b1560b90 '_CharT'
|   `-BuiltinType 0x7f99b0833b60 'char'
|-TypedefDecl 0x7f99b1579610 <line:1449:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f99b15792b0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f99b1560c40 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f99b1560bf8 '_Traits'
|   `-RecordType 0x7f99b1820560 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f99b0a45748 'char_traits'
|-TypedefDecl 0x7f99b1579720 <line:1450:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f99b15796d0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f99b0a47290 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f99b0a45aa8 'int_type'
|     `-BuiltinType 0x7f99b0833bc0 'int'
|-TypedefDecl 0x7f99b15797f0 <line:1451:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f99b15797a0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f99b2a24800 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f99b0a45b78 'pos_type'
|     `-TypedefType 0x7f99b0a3df10 'std::__1::streampos' sugar
|       |-Typedef 0x7f99b105a5b8 'streampos'
|       `-TemplateSpecializationType 0x7f99b105a510 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f99b105a4f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f99b105a400 'fpos'
|-TypedefDecl 0x7f99b15798c0 <line:1452:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f99b1579870 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f99b2a248f0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f99b0a45b10 'off_type'
|     `-TypedefType 0x7f99b0a3de80 'std::__1::streamoff' sugar
|       |-Typedef 0x7f99b105a958 'streamoff'
|       `-BuiltinType 0x7f99b0833c00 'long long'
|-CXXConstructorDecl 0x7f99b1579b40 <line:1455:5, line:1458:6> line:1456:14 basic_iostream 'void (basic_streambuf<std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7f99b1579a38 <col:29, col:70> col:70 __sb 'basic_streambuf<std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f99b1579c28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXDestructorDecl 0x7f99b1579ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1460:5, col:29> col:13 used ~basic_iostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7f99b1579d50 <line:1461:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f99b1579ea0 <line:1463:5, line:1464:42> col:5 basic_iostream 'void (class std::__1::basic_iostream<char> &&)' inline
| |-ParmVarDecl 0x7f99b1579db8 <col:20, col:37> col:37 __rhs 'class std::__1::basic_iostream<char> &&'
| `-AlwaysInlineAttr 0x7f99b1579f60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f99b157a0b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1467:5, line:1468:53> col:21 operator= 'class std::__1::basic_iostream<char> &(class std::__1::basic_iostream<char> &&)' inline
| |-ParmVarDecl 0x7f99b1579fe8 <col:31, col:48> col:48 __rhs 'class std::__1::basic_iostream<char> &&'
| `-AlwaysInlineAttr 0x7f99b157a160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f99b157a280 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1470:5, line:1472:59> line:1471:10 swap 'void (class std::__1::basic_iostream<char> &)' inline
| |-ParmVarDecl 0x7f99b157a1b8 <col:15, col:31> col:31 __rhs 'class std::__1::basic_iostream<char> &'
| `-AlwaysInlineAttr 0x7f99b157a330 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-AccessSpecDecl 0x7f99b157a378 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1473:1, col:7> col:1 public
|-CXXConstructorDecl 0x7f99b157a408 <line:1683:64> col:64 implicit basic_iostream 'void (const class std::__1::basic_iostream<char> &)' inline default_delete noexcept-unevaluated 0x7f99b157a408
| `-ParmVarDecl 0x7f99b157a530 <col:64> col:64 'const class std::__1::basic_iostream<char> &'
`-CXXMethodDecl 0x7f99b157a598 <col:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::basic_iostream<char> &(const class std::__1::basic_iostream<char> &)' inline default_delete noexcept-unevaluated 0x7f99b157a598
  `-ParmVarDecl 0x7f99b157a6b0 <col:64> col:64 'const class std::__1::basic_iostream<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_iostream" = type { %"class.std::__1::basic_istream.base", %"class.std::__1::basic_ostream.base", %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_iostream.base" = type { %"class.std::__1::basic_istream.base", %"class.std::__1::basic_ostream.base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f99b1b74b28 prev 0x7f99b1b74378 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:83:1, line:145:1> line:83:24 referenced class locale definition
|-VisibilityAttr 0x7f99b1b74c28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7f99b1b74c70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:83:1, col:24> col:24 implicit referenced class locale
|-AccessSpecDecl 0x7f99b1b74d08 <line:85:1, col:7> col:1 public
|-CXXRecordDecl 0x7f99b1b74d60 <line:87:5, col:28> col:28 referenced class facet
| `-VisibilityAttr 0x7f99b1b74e20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7f99b1b74e98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:88:5, col:28> col:28 referenced class id
| `-VisibilityAttr 0x7f99b1b74f50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-TypedefDecl 0x7f99b1b74fb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:90:5, col:17> col:17 referenced category 'int'
| `-BuiltinType 0x7f99b0833bc0 'int'
|-VarDecl 0x7f99b1b75060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1174:3, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:93:20> col:9 none 'const std::__1::locale::category':'const int' static cinit
| |-IntegerLiteral 0x7f99b1b751c8 <col:20> 'int' 0
| |-AvailabilityAttr 0x7f99b1b750c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7f99b1b75160 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7f99b1b75250 <col:3, /usr/include/xlocale.h:45:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:94:9 referenced collate 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7f99b1b75420 </usr/include/xlocale.h:45:27, col:34> 'int'
| | `-BinaryOperator 0x7f99b1b753f8 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7f99b1b753b8 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7f99b1b753d8 <col:33> 'int' 0
| |-AvailabilityAttr 0x7f99b1b752b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7f99b1b75350 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7f99b1b754a8 <col:3, /usr/include/xlocale.h:46:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:95:9 referenced ctype 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7f99b1b75678 </usr/include/xlocale.h:46:25, col:32> 'int'
| | `-BinaryOperator 0x7f99b1b75650 <col:26, col:31> 'int' '<<'
| |   |-IntegerLiteral 0x7f99b1b75610 <col:26> 'int' 1
| |   `-IntegerLiteral 0x7f99b1b75630 <col:31> 'int' 1
| |-AvailabilityAttr 0x7f99b1b75508 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7f99b1b755a8 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7f99b1b75700 <col:3, /usr/include/xlocale.h:48:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:96:9 referenced monetary 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7f99b1b758d0 </usr/include/xlocale.h:48:27, col:34> 'int'
| | `-BinaryOperator 0x7f99b1b758a8 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7f99b1b75868 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7f99b1b75888 <col:33> 'int' 3
| |-AvailabilityAttr 0x7f99b1b75760 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7f99b1b75800 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7f99b1b75958 <col:3, /usr/include/xlocale.h:49:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:97:9 referenced numeric 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7f99b1b75b28 </usr/include/xlocale.h:49:27, col:34> 'int'
| | `-BinaryOperator 0x7f99b1b75b00 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7f99b1b75ac0 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7f99b1b75ae0 <col:33> 'int' 4
| |-AvailabilityAttr 0x7f99b1b759b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7f99b1b75a58 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7f99b1b75bb0 <col:3, /usr/include/xlocale.h:50:31> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:98:9 referenced time 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7f99b1b75d80 </usr/include/xlocale.h:50:24, col:31> 'int'
| | `-BinaryOperator 0x7f99b1b75d58 <col:25, col:30> 'int' '<<'
| |   |-IntegerLiteral 0x7f99b1b75d18 <col:25> 'int' 1
| |   `-IntegerLiteral 0x7f99b1b75d38 <col:30> 'int' 5
| |-AvailabilityAttr 0x7f99b1b75c10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7f99b1b75cb0 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7f99b1b75e08 <col:3, /usr/include/xlocale.h:47:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:99:9 referenced messages 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7f99b1b75fd8 </usr/include/xlocale.h:47:27, col:34> 'int'
| | `-BinaryOperator 0x7f99b1b75fb0 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7f99b1b75f70 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7f99b1b75f90 <col:33> 'int' 2
| |-AvailabilityAttr 0x7f99b1b75e68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7f99b1b75f08 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7f99b1b76060 <col:3, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:100:61> col:9 all 'const std::__1::locale::category':'const int' static cinit
| |-BinaryOperator 0x7f99b1b763e8 <col:15, col:61> 'int' '|'
| | |-BinaryOperator 0x7f99b1b76380 <col:15, col:54> 'int' '|'
| | | |-BinaryOperator 0x7f99b1b76318 <col:15, col:44> 'int' '|'
| | | | |-BinaryOperator 0x7f99b1b762b0 <col:15, col:33> 'int' '|'
| | | | | |-BinaryOperator 0x7f99b1b76248 <col:15, col:25> 'int' '|'
| | | | | | |-ImplicitCastExpr 0x7f99b1b76218 <col:15> 'std::__1::locale::category':'int' <LValueToRValue>
| | | | | | | `-DeclRefExpr 0x7f99b1b761c8 <col:15> 'const std::__1::locale::category':'const int' lvalue Var 0x7f99b1b75250 'collate' 'const std::__1::locale::category':'const int'
| | | | | | `-ImplicitCastExpr 0x7f99b1b76230 <col:25> 'std::__1::locale::category':'int' <LValueToRValue>
| | | | | |   `-DeclRefExpr 0x7f99b1b761f0 <col:25> 'const std::__1::locale::category':'const int' lvalue Var 0x7f99b1b754a8 'ctype' 'const std::__1::locale::category':'const int'
| | | | | `-ImplicitCastExpr 0x7f99b1b76298 <col:33> 'std::__1::locale::category':'int' <LValueToRValue>
| | | | |   `-DeclRefExpr 0x7f99b1b76270 <col:33> 'const std::__1::locale::category':'const int' lvalue Var 0x7f99b1b75700 'monetary' 'const std::__1::locale::category':'const int'
| | | | `-ImplicitCastExpr 0x7f99b1b76300 <col:44> 'std::__1::locale::category':'int' <LValueToRValue>
| | | |   `-DeclRefExpr 0x7f99b1b762d8 <col:44> 'const std::__1::locale::category':'const int' lvalue Var 0x7f99b1b75958 'numeric' 'const std::__1::locale::category':'const int'
| | | `-ImplicitCastExpr 0x7f99b1b76368 <col:54> 'std::__1::locale::category':'int' <LValueToRValue>
| | |   `-DeclRefExpr 0x7f99b1b76340 <col:54> 'const std::__1::locale::category':'const int' lvalue Var 0x7f99b1b75bb0 'time' 'const std::__1::locale::category':'const int'
| | `-ImplicitCastExpr 0x7f99b1b763d0 <col:61> 'std::__1::locale::category':'int' <LValueToRValue>
| |   `-DeclRefExpr 0x7f99b1b763a8 <col:61> 'const std::__1::locale::category':'const int' lvalue Var 0x7f99b1b75e08 'messages' 'const std::__1::locale::category':'const int'
| |-AvailabilityAttr 0x7f99b1b760c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7f99b1b76160 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-CXXConstructorDecl 0x7f99b1b76520 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:103:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:103:5 locale 'void (void) noexcept'
|-CXXConstructorDecl 0x7f99b1b766e8 <line:104:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:104:5 referenced locale 'void (const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7f99b1b765d8 <col:12, col:24> col:25 'const class std::__1::locale &'
|-CXXConstructorDecl 0x7f99b1b76838 <line:105:5, col:32> col:14 locale 'void (const char *)'
| `-ParmVarDecl 0x7f99b1b767b0 <col:21, col:31> col:32 'const char *'
|-CXXConstructorDecl 0x7f99b1b76980 <line:106:5, col:34> col:14 locale 'void (const std::__1::string &)'
| `-ParmVarDecl 0x7f99b1b768f8 <col:21, col:33> col:34 'const std::__1::string &'
|-CXXConstructorDecl 0x7f99b1b76c60 <line:107:5, col:48> col:5 locale 'void (const class std::__1::locale &, const char *, std::__1::locale::category)'
| |-ParmVarDecl 0x7f99b1b76a40 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f99b1b76ab8 <col:27, col:37> col:38 'const char *'
| `-ParmVarDecl 0x7f99b1b76b28 <col:40> col:48 'std::__1::locale::category':'int'
|-CXXConstructorDecl 0x7f99b1b76f40 <line:108:5, col:50> col:5 locale 'void (const class std::__1::locale &, const std::__1::string &, std::__1::locale::category)'
| |-ParmVarDecl 0x7f99b1b76d30 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f99b1b76da0 <col:27, col:39> col:40 'const std::__1::string &'
| `-ParmVarDecl 0x7f99b1b76e10 <col:42> col:50 'std::__1::locale::category':'int'
|-FunctionTemplateDecl 0x7f99b1b77318 <line:109:5, line:110:64> col:35 locale
| |-TemplateTypeParmDecl 0x7f99b1b77000 <line:109:15, col:21> col:21 referenced class depth 0 index 0 _Facet
| `-CXXConstructorDecl 0x7f99b1b77270 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:110:64> col:35 locale 'void (const class std::__1::locale &, _Facet *)'
|   |-ParmVarDecl 0x7f99b1b770c0 <col:42, col:54> col:55 'const class std::__1::locale &'
|   |-ParmVarDecl 0x7f99b1b77158 <col:57, col:63> col:64 '_Facet *'
|   |-AlwaysInlineAttr 0x7f99b1b77378 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|   `-VisibilityAttr 0x7f99b1b773c0 <col:51, col:74> Hidden
|-CXXConstructorDecl 0x7f99b1b775f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:111:5, col:50> col:5 locale 'void (const class std::__1::locale &, const class std::__1::locale &, std::__1::locale::category)'
| |-ParmVarDecl 0x7f99b1b773e0 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f99b1b77450 <col:27, col:39> col:40 'const class std::__1::locale &'
| `-ParmVarDecl 0x7f99b1b774c0 <col:42> col:50 'std::__1::locale::category':'int'
|-CXXDestructorDecl 0x7f99b1b77700 <line:113:5, col:13> col:5 referenced ~locale 'void (void) noexcept'
|-CXXMethodDecl 0x7f99b1b778b8 <line:115:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:115:19 operator= 'const class std::__1::locale &(const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7f99b1b777b0 <col:29, col:41> col:42 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7f99b1b77ba8 <line:117:5, line:119:37> col:14 combine
| |-TemplateTypeParmDecl 0x7f99b1b77958 <line:117:15, col:21> col:21 class depth 0 index 0 _Facet
| `-CXXMethodDecl 0x7f99b1b77b10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:119:37> col:14 combine 'class std::__1::locale (const class std::__1::locale &) const' inline
|   |-ParmVarDecl 0x7f99b1b77a20 <col:22, col:34> col:35 'const class std::__1::locale &'
|   `-VisibilityAttr 0x7f99b1b77c00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:644:40, col:63> Hidden
|-CXXMethodDecl 0x7f99b1b77c68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:122:5, col:19> col:12 name 'std::__1::string (void) const'
|-CXXMethodDecl 0x7f99b1b77dd0 <line:123:5, col:36> col:10 used operator== '_Bool (const class std::__1::locale &) const'
| `-ParmVarDecl 0x7f99b1b77d10 <col:21, col:33> col:34 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f99b1b77f08 <line:124:5, col:70> col:10 operator!= '_Bool (const class std::__1::locale &) const'
| |-ParmVarDecl 0x7f99b1b77e80 <col:21, col:35> col:35 used __y 'const class std::__1::locale &'
| `-CompoundStmt 0x7f99b1b7ac20 <col:46, col:70>
|   `-ReturnStmt 0x7f99b1b7ac08 <col:47, col:68>
|     `-UnaryOperator 0x7f99b1b7abe8 <col:54, col:68> '_Bool' prefix '!'
|       `-ParenExpr 0x7f99b1b7abc8 <col:55, col:68> '_Bool'
|         `-CXXOperatorCallExpr 0x7f99b1b7ab80 <col:56, col:65> '_Bool'
|           |-ImplicitCastExpr 0x7f99b1b7ab68 <col:62> '_Bool (*)(const class std::__1::locale &) const' <FunctionToPointerDecay>
|           | `-DeclRefExpr 0x7f99b1b7ab10 <col:62> '_Bool (const class std::__1::locale &) const' lvalue CXXMethod 0x7f99b1b77dd0 'operator==' '_Bool (const class std::__1::locale &) const'
|           |-UnaryOperator 0x7f99b1b79840 <col:56, col:57> 'const class std::__1::locale' lvalue prefix '*'
|           | `-CXXThisExpr 0x7f99b1b79828 <col:57> 'const class std::__1::locale *' this
|           `-DeclRefExpr 0x7f99b1b79860 <col:65> 'const class std::__1::locale' lvalue ParmVar 0x7f99b1b77e80 '__y' 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7f99b1b78698 <line:125:5, line:128:73> line:127:12 operator()
| |-TemplateTypeParmDecl 0x7f99b1b77fa8 <line:125:15, col:21> col:21 referenced class depth 0 index 0 _CharT
| |-TemplateTypeParmDecl 0x7f99b1b78018 <col:29, col:35> col:35 referenced class depth 0 index 1 _Traits
| |-TemplateTypeParmDecl 0x7f99b1b78088 <col:44, col:50> col:50 referenced class depth 0 index 2 _Allocator
| `-CXXMethodDecl 0x7f99b1b78600 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:128:73> line:127:12 operator() '_Bool (const basic_string<_CharT, _Traits, _Allocator> &, const basic_string<_CharT, _Traits, _Allocator> &) const' inline
|   |-ParmVarDecl 0x7f99b1b782f0 <col:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   |-ParmVarDecl 0x7f99b1b784f0 <line:128:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   `-VisibilityAttr 0x7f99b1b786f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:644:40, col:63> Hidden
|-CXXMethodDecl 0x7f99b1b78810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:131:5, col:39> col:19 global 'class std::__1::locale (const class std::__1::locale &)' static
| `-ParmVarDecl 0x7f99b1b78750 <col:26, col:38> col:39 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f99b1b78900 <line:132:5, col:34> col:26 classic 'const class std::__1::locale &(void)' static
|-AccessSpecDecl 0x7f99b1b78998 <line:134:1, col:8> col:1 private
|-CXXRecordDecl 0x7f99b1b789c0 <line:135:5, col:11> col:11 referenced class __imp
|-FieldDecl 0x7f99b1b78ab8 <line:136:5, col:12> col:12 __locale_ 'class std::__1::locale::__imp *'
|-CXXMethodDecl 0x7f99b1b78d00 <line:138:5, col:52> col:10 referenced __install_ctor 'void (const class std::__1::locale &, class std::__1::locale::facet *, long)'
| |-ParmVarDecl 0x7f99b1b78b10 <col:25, col:37> col:38 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f99b1b78ba8 <col:40, col:45> col:46 'class std::__1::locale::facet *'
| `-ParmVarDecl 0x7f99b1b78c20 <col:48> col:52 'long'
|-CXXMethodDecl 0x7f99b1b78e30 <line:139:5, col:29> col:20 __global 'class std::__1::locale &(void)' static
|-CXXMethodDecl 0x7f99b1b78fd0 <line:140:5, col:25> col:10 referenced has_facet '_Bool (class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7f99b1b78f08 <col:20, col:22> col:23 'class std::__1::locale::id &'
|-CXXMethodDecl 0x7f99b1b79170 <line:141:5, col:33> col:18 referenced use_facet 'const class std::__1::locale::facet *(class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7f99b1b79080 <col:28, col:30> col:31 'class std::__1::locale::id &'
|-FriendDecl 0x7f99b1b79498 <line:143:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:143:41
| `-FunctionTemplateDecl 0x7f99b1b793d8 parent 0x7f99b1b742e0 prev 0x7f99b1b74710 <col:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:143:41 has_facet
|   |-TemplateTypeParmDecl 0x7f99b1b79210 <col:15, col:21> col:21 class depth 0 index 0 _Facet
|   `-FunctionDecl 0x7f99b1b79330 parent 0x7f99b1b742e0 prev 0x7f99b1b74678 <col:29, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:143:41 has_facet '_Bool (const class std::__1::locale &) noexcept'
|     |-ParmVarDecl 0x7f99b1b792a0 <col:51, col:63> col:64 'const class std::__1::locale &'
|     |-AlwaysInlineAttr 0x7f99b1b79478 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|     `-VisibilityAttr 0x7f99b1b79488 <col:51, col:74> Inherited Hidden
`-FriendDecl 0x7f99b1b797b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:144:5, col:73> col:50
  `-FunctionTemplateDecl 0x7f99b1b796f8 parent 0x7f99b1b742e0 prev 0x7f99b1b74a48 <col:5, col:73> col:50 use_facet
    |-TemplateTypeParmDecl 0x7f99b1b794d0 <col:15, col:21> col:21 referenced class depth 0 index 0 _Facet
    `-FunctionDecl 0x7f99b1b79650 parent 0x7f99b1b742e0 prev 0x7f99b1b749b0 <col:29, col:73> col:50 use_facet 'const _Facet &(const class std::__1::locale &)'
      |-ParmVarDecl 0x7f99b1b79560 <col:60, col:72> col:73 'const class std::__1::locale &'
      |-AlwaysInlineAttr 0x7f99b1b79798 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
      `-VisibilityAttr 0x7f99b1b797a8 <col:51, col:74> Inherited Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  NonVirtualBaseLLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f99b1820cd8 parent 0x7f99b1816488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:483:84> col:64 class basic_streambuf definition
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f99b2a24428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7f99b2a244e8 prev 0x7f99b1820cd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:125:1, col:28> col:28 implicit class basic_streambuf
|-AccessSpecDecl 0x7f99b2a24580 <line:127:1, col:7> col:1 public
|-TypedefDecl 0x7f99b2a245e8 <line:129:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f99b2a245b0 'char' sugar
|   |-TemplateTypeParmType 0x7f99b2a09d60 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f99b2a09d18 '_CharT'
|   `-BuiltinType 0x7f99b0833b60 'char'
|-TypedefDecl 0x7f99b2a24678 <line:130:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f99b2a24640 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f99b2a09dd0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f99b2a09d88 '_Traits'
|   `-RecordType 0x7f99b1820560 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f99b0a45748 'char_traits'
|-TypedefDecl 0x7f99b2a24780 <line:131:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f99b2a24730 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f99b0a47290 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f99b0a45aa8 'int_type'
|     `-BuiltinType 0x7f99b0833bc0 'int'
|-TypedefDecl 0x7f99b2a24870 <line:132:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f99b2a24820 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f99b2a24800 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f99b0a45b78 'pos_type'
|     `-TypedefType 0x7f99b0a3df10 'std::__1::streampos' sugar
|       |-Typedef 0x7f99b105a5b8 'streampos'
|       `-TemplateSpecializationType 0x7f99b105a510 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f99b105a4f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f99b105a400 'fpos'
|-TypedefDecl 0x7f99b2a24960 <line:133:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f99b2a24910 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f99b2a248f0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f99b0a45b10 'off_type'
|     `-TypedefType 0x7f99b0a3de80 'std::__1::streamoff' sugar
|       |-Typedef 0x7f99b105a958 'streamoff'
|       `-BuiltinType 0x7f99b0833c00 'long long'
|-CXXDestructorDecl 0x7f99b2a249e8 <line:135:5, col:30> col:13 ~basic_streambuf 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7f99b2a24b20 <line:138:5, line:144:5> line:139:12 pubimbue 'class std::__1::locale (const class std::__1::locale &)' inline
| |-ParmVarDecl 0x7f99b2a24a98 <col:21, col:35> col:35 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7f99b2a24bf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2a24c40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:146:5, line:147:44> col:12 getloc 'class std::__1::locale (void) const' inline
| `-AlwaysInlineAttr 0x7f99b2a24ce8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2a24f00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:150:5, line:152:32> line:151:22 pubsetbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f99b2a24d88 <col:32, col:43> col:43 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f99b2a24de8 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f99b2a24fb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2a2e640 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:154:5, line:157:46> line:155:14 referenced pubseekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7f99b2a2e450 <col:25, col:34> col:34 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7f99b2a2e4b0 <col:41, col:59> col:59 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| |-ParmVarDecl 0x7f99b2a2e510 <line:156:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7f99b2a2e700 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2a2e8d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:159:5, line:162:38> line:160:14 referenced pubseekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7f99b2a2e758 <col:25, col:34> col:34 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| |-ParmVarDecl 0x7f99b2a2e7b8 <line:161:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7f99b2a2e988 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2a2e9d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:164:5, line:165:36> col:9 referenced pubsync 'int (void)' inline
| `-AlwaysInlineAttr 0x7f99b2a2ea78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2a2eac0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:169:5, line:174:5> line:170:16 in_avail 'std::__1::streamsize (void)' inline
| `-AlwaysInlineAttr 0x7f99b2a2eb68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2a2ec20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:176:5, line:181:5> line:177:14 snextc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f99b2a2ecc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2a2ed30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:183:5, line:188:5> line:184:14 sbumpc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f99b2a2edd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2a2ee40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:190:5, line:195:5> line:191:14 sgetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f99b2a2eee8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2a2f0b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:197:5, line:199:32> line:198:16 referenced sgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f99b2a2ef40 <col:22, col:33> col:33 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f99b2a2efa0 <col:38, col:49> col:49 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f99b2a2f168 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2a2f280 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:202:5, line:207:5> line:203:14 sputbackc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7f99b2a2f1c0 <col:24, col:34> col:34 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7f99b2a2f330 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2a2f398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:209:5, line:214:5> line:210:14 sungetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f99b2a2f440 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2a2f520 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:217:5, line:223:5> line:218:14 sputc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7f99b2a2f498 <col:20, col:30> col:30 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7f99b2a2f5d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2a2f7d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:225:5, line:227:32> line:226:16 referenced sputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f99b2a2f658 <col:22, col:39> col:39 __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f99b2a2f6b8 <col:44, col:55> col:55 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f99b2a2f888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-AccessSpecDecl 0x7f99b2a2f8d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:229:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f99b2a2f938 <line:230:5, col:21> col:5 basic_streambuf 'void (void)'
|-CXXConstructorDecl 0x7f99b2a2fb10 <line:231:5, col:49> col:5 basic_streambuf 'void (const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7f99b2a2fa28 <col:21, col:44> col:44 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7f99b2a2fcd0 <line:232:5, col:60> col:22 operator= 'class std::__1::basic_streambuf<char> &(const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7f99b2a2fc08 <col:32, col:55> col:55 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7f99b2a2fe50 <line:233:5, col:37> col:10 swap 'void (class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7f99b2a2fd90 <col:15, col:32> col:32 __rhs 'class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7f99b2a2ff80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:236:68> col:38 eback 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f99b2a30028 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2a30090 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:237:68> col:38 gptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f99b2a30138 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2a301a0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:238:68> col:38 egptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f99b2a30248 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2a30318 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:240:5, line:241:43> col:10 gbump 'void (int)' inline
| |-ParmVarDecl 0x7f99b2a30290 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7f99b2a303c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2a30630 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:243:5, line:248:5> line:244:10 setg 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7f99b2a30420 <col:15, col:26> col:26 __gbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f99b2a30490 <col:34, col:45> col:45 __gnext 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f99b2a30500 <col:54, col:65> col:65 __gend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7f99b2a306f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2a30758 <line:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:251:68> col:38 pbase 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f99b2a30800 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2a30868 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:252:68> col:38 pptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f99b2a30910 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2a30978 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:253:68> col:38 epptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f99b2a30a20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f99b2a30af0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:255:5, line:256:43> col:10 pbump 'void (int)' inline
| |-ParmVarDecl 0x7f99b2a30a68 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7f99b2a30ba0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2a30d80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:258:5, line:262:5> line:259:10 setp 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7f99b2a30bf8 <col:15, col:26> col:26 __pbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f99b2a30c68 <col:34, col:45> col:45 __pend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7f99b2a30e38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f99b2a30f08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:266:5, col:43> col:18 imbue 'void (const class std::__1::locale &)' virtual
| `-ParmVarDecl 0x7f99b2a30e80 <col:24, col:38> col:38 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f99b2a310b8 <line:269:5, col:67> col:30 setbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7f99b2a30fc8 <col:37, col:48> col:48 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f99b2a31028 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f99b2a312d8 <line:270:5, line:271:87> line:270:22 seekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7f99b2a31180 <col:30, col:39> col:39 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7f99b2a311e0 <col:46, col:64> col:64 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-ParmVarDecl 0x7f99b2a31240 <line:271:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f99b2a31498 <line:272:5, line:273:87> line:272:22 seekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7f99b2a313a8 <col:30, col:39> col:39 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ParmVarDecl 0x7f99b2a31408 <line:273:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f99b2a31550 <line:274:5, col:22> col:17 sync 'int (void)' virtual
|-CXXMethodDecl 0x7f99b2a315f8 <line:277:5, col:34> col:24 showmanyc 'std::__1::streamsize (void)' virtual
|-CXXMethodDecl 0x7f99b2a317a0 <line:278:5, col:61> col:24 xsgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7f99b2a316b0 <col:31, col:42> col:42 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f99b2a31710 <col:47, col:58> col:58 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f99b2a31878 <line:279:5, col:32> col:22 underflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7f99b2a31940 <line:280:5, col:28> col:22 uflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7f99b2a31ac0 <line:283:5, col:65> col:22 pbackfail 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7f99b2a319f8 <col:32, col:64> col:41 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7f99b2a31c70 <line:286:5, col:67> col:24 xsputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7f99b2a31b80 <col:31, col:48> col:48 __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f99b2a31be0 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f99b2a31dc0 <line:287:5, col:64> col:22 overflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7f99b2a31d38 <col:31, col:63> col:40 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-AccessSpecDecl 0x7f99b2a31e70 <line:289:1, col:8> col:1 private
|-FieldDecl 0x7f99b2a31e98 <line:290:5, col:12> col:12 __loc_ 'class std::__1::locale'
|-FieldDecl 0x7f99b2a31ef0 <line:291:5, col:16> col:16 __binp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f99b2a31f48 <line:292:5, col:16> col:16 __ninp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f99b2a31fa0 <line:293:5, col:16> col:16 __einp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f99b2a31ff8 <line:294:5, col:16> col:16 __bout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f99b2a32050 <line:295:5, col:16> col:16 __nout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
`-FieldDecl 0x7f99b2a320a8 <line:296:5, col:16> col:16 __eout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct __sbuf
         0 |   unsigned char * _base
         8 |   int _size
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __sFILE
         0 |   unsigned char * _p
         8 |   int _r
        12 |   int _w
        16 |   short _flags
        18 |   short _file
        24 |   struct __sbuf _bf
        24 |     unsigned char * _base
        32 |     int _size
        40 |   int _lbfsize
        48 |   void * _cookie
        56 |   int (* _Nullable)(void *) _close
        64 |   int (* _Nullable)(void *, char *, int) _read
        72 |   fpos_t (* _Nullable)(void *, fpos_t, int) _seek
        80 |   int (* _Nullable)(void *, const char *, int) _write
        88 |   struct __sbuf _ub
        88 |     unsigned char * _base
        96 |     int _size
       104 |   struct __sFILEX * _extra
       112 |   int _ur
       116 |   unsigned char [3] _ubuf
       119 |   unsigned char [1] _nbuf
       120 |   struct __sbuf _lb
       120 |     unsigned char * _base
       128 |     int _size
       136 |   int _blksize
       144 |   fpos_t _offset
           | [sizeof=152, dsize=152, align=8,
           |  nvsize=152, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f99b08e6758 </usr/include/stdio.h:88:1, line:91:1> line:88:8 struct __sbuf definition
|-CXXRecordDecl 0x7f99b08e6878 <col:1, col:8> col:8 implicit struct __sbuf
|-FieldDecl 0x7f99b08e6950 <line:89:2, col:17> col:17 _base 'unsigned char *'
`-FieldDecl 0x7f99b08e69b0 <line:90:2, col:7> col:7 _size 'int'

Layout: <CGRecordLayout
  LLVMType:%struct.__sbuf = type { i8*, i32 }
  NonVirtualBaseLLVMType:%struct.__sbuf = type { i8*, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f99b08e6ad0 </usr/include/stdio.h:122:9, line:153:1> line:122:16 struct __sFILE definition
|-CXXRecordDecl 0x7f99b08e6bf8 <col:9, col:16> col:16 implicit struct __sFILE
|-FieldDecl 0x7f99b08e6ca8 <line:123:2, col:17> col:17 referenced _p 'unsigned char *'
|-FieldDecl 0x7f99b08e6d08 <line:124:2, col:6> col:6 _r 'int'
|-FieldDecl 0x7f99b08e6d68 <line:125:2, col:6> col:6 referenced _w 'int'
|-FieldDecl 0x7f99b08e6dc8 <line:126:2, col:8> col:8 _flags 'short'
|-FieldDecl 0x7f99b08e6e28 <line:127:2, col:8> col:8 _file 'short'
|-FieldDecl 0x7f99b08e6ec0 <line:128:2, col:16> col:16 _bf 'struct __sbuf':'struct __sbuf'
|-FieldDecl 0x7f99b08e6f20 <line:129:2, col:6> col:6 referenced _lbfsize 'int'
|-FieldDecl 0x7f99b08e6f80 <line:132:2, col:8> col:8 _cookie 'void *'
|-FieldDecl 0x7f99b08e8a00 <line:133:2, col:19> col:19 _close 'int (* _Nullable)(void *)':'int (*)(void *)'
|-FieldDecl 0x7f99b08e8d28 <line:134:2, col:19> col:19 _read 'int (* _Nullable)(void *, char *, int)':'int (*)(void *, char *, int)'
|-FieldDecl 0x7f99b08e90b0 <line:135:2, col:22> col:22 _seek 'fpos_t (* _Nullable)(void *, fpos_t, int)':'fpos_t (*)(void *, fpos_t, int)'
|-FieldDecl 0x7f99b08e93d8 <line:136:2, col:19> col:19 _write 'int (* _Nullable)(void *, const char *, int)':'int (*)(void *, const char *, int)'
|-FieldDecl 0x7f99b08e9440 <line:139:2, col:16> col:16 _ub 'struct __sbuf':'struct __sbuf'
|-FieldDecl 0x7f99b08e9540 <line:140:2, col:19> col:19 _extra 'struct __sFILEX *'
|-FieldDecl 0x7f99b08e95a0 <line:141:2, col:6> col:6 _ur 'int'
|-FieldDecl 0x7f99b08e9670 <line:144:2, col:23> col:16 _ubuf 'unsigned char [3]'
|-FieldDecl 0x7f99b08e9740 <line:145:2, col:23> col:16 _nbuf 'unsigned char [1]'
|-FieldDecl 0x7f99b08e97a8 <line:148:2, col:16> col:16 _lb 'struct __sbuf':'struct __sbuf'
|-FieldDecl 0x7f99b08e9808 <line:151:2, col:6> col:6 _blksize 'int'
`-FieldDecl 0x7f99b08e9860 <line:152:2, col:9> col:9 _offset 'fpos_t':'long long'

Layout: <CGRecordLayout
  LLVMType:%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
  NonVirtualBaseLLVMType:%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::__shared_count
         0 |   (__shared_count vtable pointer)
         8 |   long __shared_owners_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f99b120b980 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3410:1, line:3448:1> line:3410:24 referenced class __shared_count definition
|-VisibilityAttr 0x7f99b120baa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7f99b120baf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3410:1, col:24> col:24 implicit referenced class __shared_count
|-CXXConstructorDecl 0x7f99b120bce0 <line:3412:5, col:41> col:5 __shared_count 'void (const class std::__1::__shared_count &)'
| `-ParmVarDecl 0x7f99b120bbc8 <col:20, col:40> col:41 'const class std::__1::__shared_count &'
|-CXXMethodDecl 0x7f99b120be90 <line:3413:5, col:52> col:21 operator= 'class std::__1::__shared_count &(const class std::__1::__shared_count &)'
| `-ParmVarDecl 0x7f99b120bda0 <col:31, col:51> col:52 'const class std::__1::__shared_count &'
|-AccessSpecDecl 0x7f99b120bf30 <line:3415:1, col:10> col:1 protected
|-FieldDecl 0x7f99b120bf70 <line:3416:5, col:10> col:10 referenced __shared_owners_ 'long'
|-CXXDestructorDecl 0x7f99b120c008 <line:3417:5, col:29> col:13 used ~__shared_count 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7f99b120c0a8 <line:3418:1, col:8> col:1 private
|-CXXMethodDecl 0x7f99b120c0f8 <line:3419:5, col:49> col:18 referenced __on_zero_shared 'void (void) noexcept' virtual pure
|-AccessSpecDecl 0x7f99b120c190 <line:3421:1, col:7> col:1 public
|-CXXConstructorDecl 0x7f99b120c2c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3424:37> line:3423:14 used __shared_count 'void (long) noexcept'
| |-ParmVarDecl 0x7f99b120c200 <col:29, col:43> col:34 used __refs 'long' cinit
| | `-ImplicitCastExpr 0x7f99b120c898 <col:43> 'long' <IntegralCast>
| |   `-IntegerLiteral 0x7f99b120c878 <col:43> 'int' 0
| |-CXXCtorInitializer Field 0x7f99b120bf70 '__shared_owners_' 'long'
| | `-ImplicitCastExpr 0x7f99b120c908 <line:3424:28> 'long' <LValueToRValue>
| |   `-DeclRefExpr 0x7f99b120c8b0 <col:28> 'long' lvalue ParmVar 0x7f99b120c200 '__refs' 'long'
| |-CompoundStmt 0x7f99b120c950 <col:36, col:37>
| |-AlwaysInlineAttr 0x7f99b120c378 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b120c3c0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b120c428 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3434:5> line:3432:10 used __add_shared 'void (void) noexcept'
| |-CompoundStmt 0x7f99b120cea0 <col:35, line:3434:5>
| | `-CallExpr 0x7f99b120ce70 <line:3433:7, col:58> 'long':'long'
| |   |-ImplicitCastExpr 0x7f99b120ce58 <col:7> 'long (*)(long &) noexcept' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7f99b120cdc8 <col:7> 'long (long &) noexcept' lvalue Function 0x7f99b120cc88 '__libcpp_atomic_refcount_increment' 'long (long &) noexcept' (FunctionTemplate 0x7f99b120a0d0 '__libcpp_atomic_refcount_increment')
| |   `-MemberExpr 0x7f99b120c9d8 <col:42> 'long' lvalue ->__shared_owners_ 0x7f99b120bf70
| |     `-CXXThisExpr 0x7f99b120c9c0 <col:42> 'class std::__1::__shared_count *' this
| |-AlwaysInlineAttr 0x7f99b120c4c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b120c508 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f99b120c570 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3442:5> line:3436:10 used __release_shared '_Bool (void) noexcept'
| |-CompoundStmt 0x7f99b120d508 <col:39, line:3442:5>
| | |-IfStmt 0x7f99b120d4a0 <line:3437:7, line:3440:7>
| | | |-<<<NULL>>>
| | | |-<<<NULL>>>
| | | |-BinaryOperator 0x7f99b120d3a8 <line:3437:11, col:68> '_Bool' '=='
| | | | |-CallExpr 0x7f99b120d320 <col:11, col:62> 'long':'long'
| | | | | |-ImplicitCastExpr 0x7f99b120d308 <col:11> 'long (*)(long &) noexcept' <FunctionToPointerDecay>
| | | | | | `-DeclRefExpr 0x7f99b120d2a8 <col:11> 'long (long &) noexcept' lvalue Function 0x7f99b120d168 '__libcpp_atomic_refcount_decrement' 'long (long &) noexcept' (FunctionTemplate 0x7f99b120a5e0 '__libcpp_atomic_refcount_decrement')
| | | | | `-MemberExpr 0x7f99b120cf30 <col:46> 'long' lvalue ->__shared_owners_ 0x7f99b120bf70
| | | | |   `-CXXThisExpr 0x7f99b120cf18 <col:46> 'class std::__1::__shared_count *' this
| | | | `-ImplicitCastExpr 0x7f99b120d390 <col:67, col:68> 'long' <IntegralCast>
| | | |   `-UnaryOperator 0x7f99b120d370 <col:67, col:68> 'int' prefix '-'
| | | |     `-IntegerLiteral 0x7f99b120d350 <col:68> 'int' 1
| | | |-CompoundStmt 0x7f99b120d478 <col:71, line:3440:7>
| | | | |-CXXMemberCallExpr 0x7f99b120d420 <line:3438:9, col:26> 'void'
| | | | | `-MemberExpr 0x7f99b120d3e8 <col:9> '<bound member function type>' ->__on_zero_shared 0x7f99b120c0f8
| | | | |   `-CXXThisExpr 0x7f99b120d3d0 <col:9> 'class std::__1::__shared_count *' this
| | | | `-ReturnStmt 0x7f99b120d460 <line:3439:9, col:16>
| | | |   `-CXXBoolLiteralExpr 0x7f99b120d448 <col:16> '_Bool' true
| | | `-<<<NULL>>>
| | `-ReturnStmt 0x7f99b120d4f0 <line:3441:7, col:14>
| |   `-CXXBoolLiteralExpr 0x7f99b120d4d8 <col:14> '_Bool' false
| |-AlwaysInlineAttr 0x7f99b120c608 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b120c650 <col:51, col:74> Hidden
`-CXXMethodDecl 0x7f99b120c750 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3447:5> line:3445:10 used use_count 'long (void) const noexcept'
  |-CompoundStmt 0x7f99b120dab8 <col:38, line:3447:5>
  | `-ReturnStmt 0x7f99b120daa0 <line:3446:9, col:59>
  |   `-BinaryOperator 0x7f99b120da78 <col:16, col:59> 'long' '+'
  |     |-CallExpr 0x7f99b120da10 <col:16, col:55> 'long':'long'
  |     | |-ImplicitCastExpr 0x7f99b120d9f8 <col:16> 'long (*)(const long *)' <FunctionToPointerDecay>
  |     | | `-DeclRefExpr 0x7f99b120d970 <col:16> 'long (const long *)' lvalue Function 0x7f99b120d830 '__libcpp_relaxed_load' 'long (const long *)' (FunctionTemplate 0x7f99b114eb08 '__libcpp_relaxed_load')
  |     | `-UnaryOperator 0x7f99b120d5d8 <col:38, col:39> 'const long *' prefix '&'
  |     |   `-MemberExpr 0x7f99b120d5a0 <col:39> 'const long' lvalue ->__shared_owners_ 0x7f99b120bf70
  |     |     `-CXXThisExpr 0x7f99b120d588 <col:39> 'const class std::__1::__shared_count *' this
  |     `-ImplicitCastExpr 0x7f99b120da60 <col:59> 'long' <IntegralCast>
  |       `-IntegerLiteral 0x7f99b120da40 <col:59> 'int' 1
  |-AlwaysInlineAttr 0x7f99b120c7e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
  `-VisibilityAttr 0x7f99b120c830 <col:51, col:74> Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::locale::facet
         0 |   class std::__1::__shared_count (primary base)
         0 |     (__shared_count vtable pointer)
         8 |     long __shared_owners_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f99b1b7ac90 parent 0x7f99b1b74b28 prev 0x7f99b1b74d60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:147:1, line:161:1> line:147:32 referenced class facet definition
|-public 'class std::__1::__shared_count'
|-VisibilityAttr 0x7f99b1b7add0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7f99b1b7ae58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:147:1, col:32> col:32 implicit referenced class facet
|-AccessSpecDecl 0x7f99b1b7aef0 <line:150:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f99b1b7b040 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:153:56> line:152:14 used facet 'void (size_t)'
| |-ParmVarDecl 0x7f99b1b7af58 <col:20, col:36> col:27 used __refs 'size_t':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7f99b1b7b558 <col:36> 'size_t':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7f99b1b7b538 <col:36> 'int' 0
| |-CXXCtorInitializer 'class std::__1::__shared_count'
| | `-CXXConstructExpr 0x7f99b1b7b6b0 <line:153:11, col:53> 'class std::__1::__shared_count' 'void (long) noexcept'
| |   `-BinaryOperator 0x7f99b1b7b648 <col:26, col:52> 'long' '-'
| |     |-CXXStaticCastExpr 0x7f99b1b7b5e0 <col:26, col:50> 'long' static_cast<long> <NoOp>
| |     | `-ImplicitCastExpr 0x7f99b1b7b5c8 <col:44> 'long' <IntegralCast>
| |     |   `-ImplicitCastExpr 0x7f99b1b7b5b0 <col:44> 'size_t':'unsigned long' <LValueToRValue>
| |     |     `-DeclRefExpr 0x7f99b1b7b570 <col:44> 'size_t':'unsigned long' lvalue ParmVar 0x7f99b1b7af58 '__refs' 'size_t':'unsigned long'
| |     `-ImplicitCastExpr 0x7f99b1b7b630 <col:52> 'long' <IntegralCast>
| |       `-IntegerLiteral 0x7f99b1b7b610 <col:52> 'int' 1
| |-CompoundStmt 0x7f99b1b7b718 <col:55, col:56>
| |-AlwaysInlineAttr 0x7f99b1b7b0f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f99b1b7b138 <col:51, col:74> Hidden
|-CXXDestructorDecl 0x7f99b1b7b198 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:155:5, col:20> col:13 used ~facet 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7f99b1b7b238 <line:159:1, col:8> col:1 private
|-CXXMethodDecl 0x7f99b1b7b288 <line:160:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:160:18 __on_zero_shared 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7f99b1b7b3b8 <line:147:32, <invalid sloc>> col:32 implicit operator= 'class std::__1::locale::facet &(const class std::__1::locale::facet &)' inline default_delete noexcept-unevaluated 0x7f99b1b7b3b8
| `-ParmVarDecl 0x7f99b1b7b4d0 <col:32> col:32 'const class std::__1::locale::facet &'
`-CXXConstructorDecl 0x7f99b1b7fa18 <col:32> col:32 implicit facet 'void (const class std::__1::locale::facet &)' inline default_delete noexcept-unevaluated 0x7f99b1b7fa18
  `-ParmVarDecl 0x7f99b1b7fb40 <col:32> col:32 'const class std::__1::locale::facet &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
  NonVirtualBaseLLVMType:%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::codecvt_base (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f99b1ba8570 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:832:1, line:837:1> line:832:24 referenced class codecvt_base definition
|-VisibilityAttr 0x7f99b1ba8698 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7f99b1ba86e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:832:1, col:24> col:24 implicit referenced class codecvt_base
|-AccessSpecDecl 0x7f99b1ba8778 <line:834:1, col:7> col:1 public
|-CXXConstructorDecl 0x7f99b1ba8838 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:835:43> col:27 used codecvt_base 'void (void)'
| |-CompoundStmt 0x7f99b1ba8b30 <col:42, col:43>
| |-AlwaysInlineAttr 0x7f99b1ba88e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f99b1ba8928 <col:48, col:71> Hidden
|-EnumDecl 0x7f99b1ba8938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:836:5, col:44> col:10 referenced result
| |-EnumConstantDecl 0x7f99b1ba89f0 <col:18> col:18 referenced ok 'enum std::__1::codecvt_base::result'
| |-EnumConstantDecl 0x7f99b1ba8a38 <col:22> col:22 referenced partial 'enum std::__1::codecvt_base::result'
| |-EnumConstantDecl 0x7f99b1ba8a80 <col:31> col:31 referenced error 'enum std::__1::codecvt_base::result'
| `-EnumConstantDecl 0x7f99b1ba8ac8 <col:38> col:38 referenced noconv 'enum std::__1::codecvt_base::result'
|-CXXDestructorDecl 0x7f99b1bae128 <line:832:24> col:24 implicit ~codecvt_base 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f99b1bae338 <col:24> col:24 implicit constexpr codecvt_base 'void (const class std::__1::codecvt_base &)' inline default trivial noexcept-unevaluated 0x7f99b1bae338
| `-ParmVarDecl 0x7f99b1bae460 <col:24> col:24 'const class std::__1::codecvt_base &'
`-CXXConstructorDecl 0x7f99b1bae4f8 <col:24> col:24 implicit constexpr codecvt_base 'void (class std::__1::codecvt_base &&)' inline default trivial noexcept-unevaluated 0x7f99b1bae4f8
  `-ParmVarDecl 0x7f99b1bae620 <col:24> col:24 'class std::__1::codecvt_base &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::codecvt_base" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::codecvt_base.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::codecvt<char, char, mbstate_t>
         0 |   class std::__1::locale::facet (primary base)
         0 |     class std::__1::__shared_count (primary base)
         0 |       (__shared_count vtable pointer)
         8 |       long __shared_owners_
         0 |   class std::__1::codecvt_base (base) (empty)
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f99b1ba90b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:845:1, line:927:1> line:846:24 class codecvt definition
|-public 'class locale::facet':'class std::__1::locale::facet'
|-public 'class std::__1::codecvt_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'char'
|-TemplateArgument type '__mbstate_t'
|-VisibilityAttr 0x7f99b1ba9218 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7f99b1ba9478 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:846:1, col:24> col:24 implicit referenced class codecvt
|-AccessSpecDecl 0x7f99b1ba9510 <line:850:1, col:7> col:1 public
|-TypedefDecl 0x7f99b1ba9548 <line:851:5, col:23> col:23 referenced intern_type 'char'
| `-BuiltinType 0x7f99b0833b60 'char'
|-TypedefDecl 0x7f99b1ba95b0 <line:852:5, col:23> col:23 referenced extern_type 'char'
| `-BuiltinType 0x7f99b0833b60 'char'
|-TypedefDecl 0x7f99b1ba9618 <line:853:5, col:23> col:23 referenced state_type 'mbstate_t':'__mbstate_t'
| `-TypedefType 0x7f99b1805180 'mbstate_t' sugar
|   |-Typedef 0x7f99b10155f0 'mbstate_t'
|   `-TypedefType 0x7f99b10155c0 '__darwin_mbstate_t' sugar
|     |-Typedef 0x7f99b0869f50 '__darwin_mbstate_t'
|     `-TypedefType 0x7f99b0869f20 '__mbstate_t' sugar
|       |-Typedef 0x7f99b0869eb0 '__mbstate_t'
|       `-ElaboratedType 0x7f99b0869e60 'union __mbstate_t' sugar
|         `-RecordType 0x7f99b0869c90 '__mbstate_t'
|           `-CXXRecord 0x7f99b0869bf8 ''
|-CXXConstructorDecl 0x7f99b1ba9780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:857:34> line:856:14 codecvt 'void (size_t)'
| |-ParmVarDecl 0x7f99b1ba96b0 <col:22, col:38> col:29 used __refs 'size_t':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7f99b1bae0d8 <col:38> 'size_t':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7f99b1bae0b8 <col:38> 'int' 0
| |-CXXCtorInitializer 'class locale::facet':'class std::__1::locale::facet'
| | `-CXXConstructExpr 0x7f99b1bae2b0 <line:857:11, col:31> 'class locale::facet':'class std::__1::locale::facet' 'void (size_t)'
| |   `-ImplicitCastExpr 0x7f99b1bae298 <col:25> 'size_t':'unsigned long' <LValueToRValue>
| |     `-DeclRefExpr 0x7f99b1bae210 <col:25> 'size_t':'unsigned long' lvalue ParmVar 0x7f99b1ba96b0 '__refs' 'size_t':'unsigned long'
| |-CXXCtorInitializer 'class std::__1::codecvt_base'
| | `-CXXConstructExpr 0x7f99b1bae688 <line:856:14> 'class std::__1::codecvt_base' 'void (void)'
| |-CompoundStmt 0x7f99b1bae700 <line:857:33, col:34>
| |-AlwaysInlineAttr 0x7f99b1ba9830 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f99b1ba9878 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f99b1ba9f10 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:865:5> line:860:12 out 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const'
| |-ParmVarDecl 0x7f99b1ba9948 <col:16, col:28> col:28 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7f99b1ba9a08 <line:861:16, col:35> col:35 used __frm 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7f99b1ba9a78 <col:42, col:61> col:61 used __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7f99b1ba9b50 <col:72, col:92> col:92 used __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-ParmVarDecl 0x7f99b1ba9c08 <line:862:16, col:29> col:29 used __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f99b1ba9c78 <col:35, col:48> col:48 used __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f99b1ba9d50 <col:58, col:72> col:72 used __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-CompoundStmt 0x7f99b1bae958 <line:863:5, line:865:5>
| | `-ReturnStmt 0x7f99b1bae940 <line:864:9, col:82>
| |   `-CXXMemberCallExpr 0x7f99b1bae880 <col:16, col:82> 'enum std::__1::codecvt_base::result'
| |     |-MemberExpr 0x7f99b1bae730 <col:16> '<bound member function type>' ->do_out 0x7f99b1bab980
| |     | `-CXXThisExpr 0x7f99b1bae718 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7f99b1bae768 <col:23> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7f99b1ba9948 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7f99b1bae8e0 <col:29> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f99b1bae790 <col:29> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7f99b1ba9a08 '__frm' 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     |-ImplicitCastExpr 0x7f99b1bae8f8 <col:36> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f99b1bae7b8 <col:36> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7f99b1ba9a78 '__frm_end' 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     |-DeclRefExpr 0x7f99b1bae7e0 <col:47> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7f99b1ba9b50 '__frm_nxt' 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |     |-ImplicitCastExpr 0x7f99b1bae910 <col:58> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f99b1bae808 <col:58> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f99b1ba9c08 '__to' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7f99b1bae928 <col:64> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f99b1bae830 <col:64> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f99b1ba9c78 '__to_end' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     `-DeclRefExpr 0x7f99b1bae858 <col:74> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f99b1ba9d50 '__to_nxt' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-AlwaysInlineAttr 0x7f99b1ba9fe0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f99b1baa028 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f99b1baa310 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:872:5> line:868:12 unshift 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const'
| |-ParmVarDecl 0x7f99b1baa078 <col:20, col:32> col:32 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7f99b1baa0e8 <line:869:20, col:33> col:33 used __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f99b1baa158 <col:39, col:52> col:52 used __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f99b1baa1d0 <col:62, col:76> col:76 used __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-CompoundStmt 0x7f99b1baeaf8 <line:870:5, line:872:5>
| | `-ReturnStmt 0x7f99b1baeae0 <line:871:9, col:57>
| |   `-CXXMemberCallExpr 0x7f99b1baea68 <col:16, col:57> 'enum std::__1::codecvt_base::result'
| |     |-MemberExpr 0x7f99b1bae990 <col:16> '<bound member function type>' ->do_unshift 0x7f99b1bad8d8
| |     | `-CXXThisExpr 0x7f99b1bae978 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7f99b1bae9c8 <col:27> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7f99b1baa078 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7f99b1baeab0 <col:33> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f99b1bae9f0 <col:33> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f99b1baa0e8 '__to' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7f99b1baeac8 <col:39> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f99b1baea18 <col:39> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f99b1baa158 '__to_end' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     `-DeclRefExpr 0x7f99b1baea40 <col:49> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f99b1baa1d0 '__to_nxt' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-AlwaysInlineAttr 0x7f99b1baa3c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f99b1baa410 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f99b1baa8e0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:880:5> line:875:12 in 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *&) const'
| |-ParmVarDecl 0x7f99b1baa460 <col:15, col:27> col:27 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7f99b1baa4f8 <line:876:15, col:34> col:34 used __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f99b1baa568 <col:41, col:60> col:60 used __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f99b1baa610 <col:71, col:91> col:91 used __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-ParmVarDecl 0x7f99b1baa6a8 <line:877:15, col:28> col:28 used __to 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7f99b1baa718 <col:34, col:47> col:47 used __to_end 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7f99b1baa7c0 <col:57, col:71> col:71 used __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-CompoundStmt 0x7f99b1baed58 <line:878:5, line:880:5>
| | `-ReturnStmt 0x7f99b1baed40 <line:879:9, col:81>
| |   `-CXXMemberCallExpr 0x7f99b1baec80 <col:16, col:81> 'enum std::__1::codecvt_base::result'
| |     |-MemberExpr 0x7f99b1baeb30 <col:16> '<bound member function type>' ->do_in 0x7f99b1bad600
| |     | `-CXXThisExpr 0x7f99b1baeb18 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7f99b1baeb68 <col:22> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7f99b1baa460 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7f99b1baece0 <col:28> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f99b1baeb90 <col:28> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f99b1baa4f8 '__frm' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7f99b1baecf8 <col:35> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f99b1baebb8 <col:35> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f99b1baa568 '__frm_end' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-DeclRefExpr 0x7f99b1baebe0 <col:46> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f99b1baa610 '__frm_nxt' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |     |-ImplicitCastExpr 0x7f99b1baed10 <col:57> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f99b1baec08 <col:57> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7f99b1baa6a8 '__to' 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     |-ImplicitCastExpr 0x7f99b1baed28 <col:63> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f99b1baec30 <col:63> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7f99b1baa718 '__to_end' 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     `-DeclRefExpr 0x7f99b1baec58 <col:73> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7f99b1baa7c0 '__to_nxt' 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-AlwaysInlineAttr 0x7f99b1baa9b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f99b1baa9f8 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f99b1baaa68 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:886:5> line:883:9 encoding 'int (void) const noexcept'
| |-CompoundStmt 0x7f99b1baee08 <line:884:5, line:886:5>
| | `-ReturnStmt 0x7f99b1baedf0 <line:885:9, col:28>
| |   `-CXXMemberCallExpr 0x7f99b1baedc8 <col:16, col:28> 'int'
| |     `-MemberExpr 0x7f99b1baed90 <col:16> '<bound member function type>' ->do_encoding 0x7f99b1bad9c0
| |       `-CXXThisExpr 0x7f99b1baed78 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |-AlwaysInlineAttr 0x7f99b1baab00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f99b1baab48 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f99b1baabb0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:892:5> line:889:10 always_noconv '_Bool (void) const noexcept'
| |-CompoundStmt 0x7f99b1baeeb8 <line:890:5, line:892:5>
| | `-ReturnStmt 0x7f99b1baeea0 <line:891:9, col:33>
| |   `-CXXMemberCallExpr 0x7f99b1baee78 <col:16, col:33> '_Bool'
| |     `-MemberExpr 0x7f99b1baee40 <col:16> '<bound member function type>' ->do_always_noconv 0x7f99b1bada80
| |       `-CXXThisExpr 0x7f99b1baee28 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |-AlwaysInlineAttr 0x7f99b1baac48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f99b1baac90 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f99b1baaf78 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:898:5> line:895:9 length 'int (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, size_t) const'
| |-ParmVarDecl 0x7f99b1baace0 <col:16, col:28> col:28 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7f99b1baad50 <col:34, col:53> col:53 used __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f99b1baadc0 <col:60, col:79> col:79 used __end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f99b1baae30 <col:86, col:93> col:93 used __mx 'size_t':'unsigned long'
| |-CompoundStmt 0x7f99b1baf070 <line:896:5, line:898:5>
| | `-ReturnStmt 0x7f99b1baf058 <line:897:9, col:50>
| |   `-CXXMemberCallExpr 0x7f99b1baefc8 <col:16, col:50> 'int'
| |     |-MemberExpr 0x7f99b1baeef0 <col:16> '<bound member function type>' ->do_length 0x7f99b1badd20
| |     | `-CXXThisExpr 0x7f99b1baeed8 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7f99b1baef28 <col:26> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7f99b1baace0 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7f99b1baf010 <col:32> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f99b1baef50 <col:32> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f99b1baad50 '__frm' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7f99b1baf028 <col:39> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f99b1baef78 <col:39> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f99b1baadc0 '__end' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     `-ImplicitCastExpr 0x7f99b1baf040 <col:46> 'size_t':'unsigned long' <LValueToRValue>
| |       `-DeclRefExpr 0x7f99b1baefa0 <col:46> 'size_t':'unsigned long' lvalue ParmVar 0x7f99b1baae30 '__mx' 'size_t':'unsigned long'
| |-AlwaysInlineAttr 0x7f99b1bab030 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f99b1bab078 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f99b1bab0e8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:904:5> line:901:9 max_length 'int (void) const noexcept'
| |-CompoundStmt 0x7f99b1baf120 <line:902:5, line:904:5>
| | `-ReturnStmt 0x7f99b1baf108 <line:903:9, col:30>
| |   `-CXXMemberCallExpr 0x7f99b1baf0e0 <col:16, col:30> 'int'
| |     `-MemberExpr 0x7f99b1baf0a8 <col:16> '<bound member function type>' ->do_max_length 0x7f99b1bade08
| |       `-CXXThisExpr 0x7f99b1baf090 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |-AlwaysInlineAttr 0x7f99b1bab180 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f99b1bab1c8 <col:48, col:71> Hidden
|-VarDecl 0x7f99b1bab238 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:906:5, col:23> col:23 id 'class locale::id':'class std::__1::locale::id' static
|-AccessSpecDecl 0x7f99b1bab298 <line:908:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f99b1bab408 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:911:34> line:910:14 codecvt 'void (const char *, size_t)'
| |-ParmVarDecl 0x7f99b1bab308 <col:22, col:32> col:33 'const char *'
| |-ParmVarDecl 0x7f99b1bab378 <col:35, col:51> col:42 used __refs 'size_t':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7f99b1bae110 <col:51> 'size_t':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7f99b1bae0f0 <col:51> 'int' 0
| |-CXXCtorInitializer 'class locale::facet':'class std::__1::locale::facet'
| | `-CXXConstructExpr 0x7f99b1baf1e8 <line:911:11, col:31> 'class locale::facet':'class std::__1::locale::facet' 'void (size_t)'
| |   `-ImplicitCastExpr 0x7f99b1baf1d0 <col:25> 'size_t':'unsigned long' <LValueToRValue>
| |     `-DeclRefExpr 0x7f99b1baf148 <col:25> 'size_t':'unsigned long' lvalue ParmVar 0x7f99b1bab378 '__refs' 'size_t':'unsigned long'
| |-CXXCtorInitializer 'class std::__1::codecvt_base'
| | `-CXXConstructExpr 0x7f99b1baf248 <line:910:14> 'class std::__1::codecvt_base' 'void (void)'
| |-CompoundStmt 0x7f99b1baf2c0 <line:911:33, col:34>
| |-AlwaysInlineAttr 0x7f99b1bab4c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f99b1bab508 <col:48, col:71> Hidden
|-CXXDestructorDecl 0x7f99b1bab568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:913:5, col:14> col:5 ~codecvt 'void (void) noexcept'
|-CXXMethodDecl 0x7f99b1bab980 <line:915:5, line:917:93> line:915:20 used do_out 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const' virtual
| |-ParmVarDecl 0x7f99b1bab618 <col:27, col:39> col:39 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7f99b1bab688 <line:916:27, col:46> col:46 __frm 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7f99b1bab6f8 <col:53, col:72> col:72 __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7f99b1bab770 <col:83, col:103> col:103 __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-ParmVarDecl 0x7f99b1bab7e0 <line:917:27, col:40> col:40 __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f99b1bab850 <col:46, col:59> col:59 __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| `-ParmVarDecl 0x7f99b1bab8c8 <col:69, col:83> col:83 __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
|-CXXMethodDecl 0x7f99b1bad600 <line:918:5, line:920:92> line:918:20 used do_in 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *&) const' virtual
| |-ParmVarDecl 0x7f99b1baba60 <col:26, col:38> col:38 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7f99b1babad0 <line:919:26, col:45> col:45 __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f99b1babb40 <col:52, col:71> col:71 __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f99b1babbb8 <col:82, col:102> col:102 __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-ParmVarDecl 0x7f99b1babc28 <line:920:26, col:39> col:39 __to 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7f99b1babc98 <col:45, col:58> col:58 __to_end 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| `-ParmVarDecl 0x7f99b1babd10 <col:68, col:82> col:82 __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
|-CXXMethodDecl 0x7f99b1bad8d8 <line:921:5, line:922:97> line:921:20 used do_unshift 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const' virtual
| |-ParmVarDecl 0x7f99b1bad6e0 <col:31, col:43> col:43 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7f99b1bad750 <line:922:31, col:44> col:44 __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f99b1bad7c0 <col:50, col:63> col:63 __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| `-ParmVarDecl 0x7f99b1bad838 <col:73, col:87> col:87 __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
|-CXXMethodDecl 0x7f99b1bad9c0 <line:923:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:923:17 used do_encoding 'int (void) const noexcept' virtual
|-CXXMethodDecl 0x7f99b1bada80 <line:924:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:924:18 used do_always_noconv '_Bool (void) const noexcept' virtual
|-CXXMethodDecl 0x7f99b1badd20 <line:925:5, col:110> col:17 used do_length 'int (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, size_t) const' virtual
| |-ParmVarDecl 0x7f99b1badb28 <col:27, col:39> col:39 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7f99b1badb98 <col:45, col:64> col:64 __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f99b1badc08 <col:71, col:90> col:90 __end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| `-ParmVarDecl 0x7f99b1badc78 <col:97, col:104> col:104 __mx 'size_t':'unsigned long'
|-CXXMethodDecl 0x7f99b1bade08 <line:926:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:926:17 used do_max_length 'int (void) const noexcept' virtual
`-CXXMethodDecl 0x7f99b1badf38 <line:846:24, <invalid sloc>> col:24 implicit operator= 'class std::__1::codecvt<char, char, mbstate_t> &(const class std::__1::codecvt<char, char, mbstate_t> &)' inline default_delete noexcept-unevaluated 0x7f99b1badf38
  `-ParmVarDecl 0x7f99b1bae050 <col:24> col:24 'const class std::__1::codecvt<char, char, mbstate_t> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::codecvt" = type { %"class.std::__1::locale::facet" }
  NonVirtualBaseLLVMType:%"class.std::__1::codecvt" = type { %"class.std::__1::locale::facet" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f99b0869bf8 </usr/include/i386/_types.h:76:9, line:79:1> line:76:9 union definition
|-FieldDecl 0x7f99b0869d98 <line:77:2, col:22> col:8 __mbstate8 'char [128]'
|-FieldDecl 0x7f99b0869df8 <line:78:2, col:12> col:12 _mbstateL 'long long'
|-CXXConstructorDecl 0x7f99b1bc3d00 <line:76:9> col:9 implicit used  'void (void) noexcept' inline default trivial
| `-CompoundStmt 0x7f99b1bc4168 <col:9>
|-CXXConstructorDecl 0x7f99b1bc3e18 <col:9> col:9 implicit constexpr  'void (const __mbstate_t &)' inline default trivial noexcept-unevaluated 0x7f99b1bc3e18
| `-ParmVarDecl 0x7f99b1bc3f40 <col:9> col:9 'const __mbstate_t &'
|-CXXConstructorDecl 0x7f99b1bc3fd8 <col:9> col:9 implicit constexpr  'void (__mbstate_t &&)' inline default trivial noexcept-unevaluated 0x7f99b1bc3fd8
| `-ParmVarDecl 0x7f99b1bc4100 <col:9> col:9 '__mbstate_t &&'
`-CXXDestructorDecl 0x7f99b0e5ac48 <col:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.__mbstate_t = type { i64, [120 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f99b1822c28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:128:1, line:129:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:185:28 class basic_filebuf definition
|-public 'basic_streambuf<char, struct std::__1::char_traits<char> >':'class std::__1::basic_streambuf<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-CXXRecordDecl 0x7f99b0e58218 prev 0x7f99b1822c28 <col:1, col:28> col:28 implicit class basic_filebuf
|-AccessSpecDecl 0x7f99b0e582b0 <line:188:1, col:7> col:1 public
|-TypedefDecl 0x7f99b0e582e8 <line:189:5, col:46> col:46 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f99b0e580c0 'char' sugar
|   |-TemplateTypeParmType 0x7f99b157a830 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f99b157a7e8 '_CharT'
|   `-BuiltinType 0x7f99b0833b60 'char'
|-TypedefDecl 0x7f99b0e58350 <line:190:5, col:46> col:46 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f99b0e58100 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f99b157a8a0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f99b157a858 '_Traits'
|   `-RecordType 0x7f99b1820560 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f99b0a45748 'char_traits'
|-TypedefDecl 0x7f99b0e58460 <line:191:5, col:46> col:46 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f99b0e58410 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f99b0a47290 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f99b0a45aa8 'int_type'
|     `-BuiltinType 0x7f99b0833bc0 'int'
|-TypedefDecl 0x7f99b0e58530 <line:192:5, col:46> col:46 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f99b0e584e0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f99b2a24800 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f99b0a45b78 'pos_type'
|     `-TypedefType 0x7f99b0a3df10 'std::__1::streampos' sugar
|       |-Typedef 0x7f99b105a5b8 'streampos'
|       `-TemplateSpecializationType 0x7f99b105a510 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f99b105a4f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f99b105a400 'fpos'
|-TypedefDecl 0x7f99b0e58600 <line:193:5, col:46> col:46 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f99b0e585b0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f99b2a248f0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f99b0a45b10 'off_type'
|     `-TypedefType 0x7f99b0a3de80 'std::__1::streamoff' sugar
|       |-Typedef 0x7f99b105a958 'streamoff'
|       `-BuiltinType 0x7f99b0833c00 'long long'
|-TypedefDecl 0x7f99b0e586f0 <line:194:5, col:46> col:46 state_type 'typename traits_type::state_type':'__mbstate_t'
| `-ElaboratedType 0x7f99b0e586a0 'typename traits_type::state_type' sugar
|   `-TypedefType 0x7f99b0e58680 'std::__1::char_traits<char>::state_type' sugar
|     |-Typedef 0x7f99b0a45be0 'state_type'
|     `-TypedefType 0x7f99b1805180 'mbstate_t' sugar
|       |-Typedef 0x7f99b10155f0 'mbstate_t'
|       `-TypedefType 0x7f99b10155c0 '__darwin_mbstate_t' sugar
|         |-Typedef 0x7f99b0869f50 '__darwin_mbstate_t'
|         `-TypedefType 0x7f99b0869f20 '__mbstate_t' sugar
|           |-Typedef 0x7f99b0869eb0 '__mbstate_t'
|           `-ElaboratedType 0x7f99b0869e60 'union __mbstate_t' sugar
|             `-RecordType 0x7f99b0869c90 '__mbstate_t'
|               `-CXXRecord 0x7f99b0869bf8 ''
|-CXXConstructorDecl 0x7f99b0e58788 <line:197:5, col:19> col:5 basic_filebuf 'void (void)'
|-CXXConstructorDecl 0x7f99b0e58960 <line:199:5, col:40> col:5 basic_filebuf 'void (class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&)'
| `-ParmVarDecl 0x7f99b0e58878 <col:19, col:35> col:35 __rhs 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&'
|-CXXDestructorDecl 0x7f99b0e58a50 <line:201:5, col:28> col:13 used ~basic_filebuf 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7f99b0e58c00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:206:51> col:20 operator= 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &(class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&)'
| |-ParmVarDecl 0x7f99b0e58b38 <col:30, col:46> col:46 __rhs 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&'
| `-AlwaysInlineAttr 0x7f99b0e58cb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f99b0e58dd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:208:5, col:35> col:10 swap 'void (class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &)'
| `-ParmVarDecl 0x7f99b0e58d08 <col:15, col:30> col:30 __rhs 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &'
|-CXXMethodDecl 0x7f99b0e58e80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:212:20> col:10 is_open '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f99b0e58f28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f99b0e590e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:214:5, col:67> col:20 open 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > *(const char *, class ios_base::openmode)'
| |-ParmVarDecl 0x7f99b0e58f70 <col:25, col:37> col:37 __s 'const char *'
| `-ParmVarDecl 0x7f99b0e58fd0 <col:42, col:61> col:61 __mode 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f99b0e59310 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:216:69> col:20 open 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > *(const std::__1::string &, class ios_base::openmode)'
| |-ParmVarDecl 0x7f99b0e59198 <col:25, col:39> col:39 __s 'const std::__1::string &'
| |-ParmVarDecl 0x7f99b0e591f8 <col:44, col:63> col:63 __mode 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7f99b0e593c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f99b0e59460 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:218:5, col:26> col:20 close 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > *(void)'
|-AccessSpecDecl 0x7f99b0e59508 <line:220:1, col:10> col:1 protected
|-CXXMethodDecl 0x7f99b0e595a0 <line:222:5, col:32> col:22 underflow 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7f99b0e59720 <line:223:5, col:65> col:22 pbackfail 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7f99b0e59658 <col:32, col:64> col:41 __c 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7f99b0e59868 <line:224:5, col:65> col:22 overflow 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7f99b0e597e0 <col:32, col:64> col:41 __c 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7f99b0e59ba0 <line:225:5, col:91> col:54 setbuf 'basic_streambuf<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::traits_type> *(std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7f99b0e59a28 <col:61, col:72> col:72 __s 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f99b0e59a88 <col:77, col:88> col:88 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f99b0e59e50 <line:226:5, line:227:85> line:226:22 seekoff 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7f99b0e59cb0 <col:30, col:39> col:39 __off 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7f99b0e59d10 <col:46, col:64> col:64 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-ParmVarDecl 0x7f99b0e59d70 <line:227:30, col:82> col:49 __wch 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f99b0e5a050 <line:228:5, line:229:85> line:228:22 seekpos 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7f99b0e59f20 <col:30, col:39> col:39 __sp 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ParmVarDecl 0x7f99b0e59f80 <line:229:30, col:82> col:49 __wch 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f99b0e5a108 <line:230:5, col:22> col:17 sync 'int (void)' virtual
|-CXXMethodDecl 0x7f99b0e5a238 <line:231:5, col:43> col:18 imbue 'void (const class std::__1::locale &)' virtual
| `-ParmVarDecl 0x7f99b0e5a1b0 <col:24, col:38> col:38 __loc 'const class std::__1::locale &'
|-AccessSpecDecl 0x7f99b0e5a2e8 <line:233:1, col:8> col:1 private
|-FieldDecl 0x7f99b0e5a310 <line:234:5, col:17> col:17 __extbuf_ 'char *'
|-FieldDecl 0x7f99b0e5a358 <line:235:5, col:17> col:17 __extbufnext_ 'const char *'
|-FieldDecl 0x7f99b0e5a3a0 <line:236:5, col:17> col:17 __extbufend_ 'const char *'
|-FieldDecl 0x7f99b0e5a3e8 <line:237:5, col:25> col:10 __extbuf_min_ 'char [8]'
|-FieldDecl 0x7f99b0e5a430 <line:238:5, col:12> col:12 __ebs_ 'size_t':'unsigned long'
|-FieldDecl 0x7f99b0e5a488 <line:239:5, col:16> col:16 __intbuf_ 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f99b0e5a4d0 <line:240:5, col:12> col:12 __ibs_ 'size_t':'unsigned long'
|-FieldDecl 0x7f99b0e5a518 <line:241:5, col:11> col:11 __file_ 'FILE *'
|-FieldDecl 0x7f99b0e5a6b0 <line:242:5, col:49> col:49 __cv_ 'const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> *'
|-FieldDecl 0x7f99b0e5a708 <line:243:5, col:16> col:16 __st_ 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type':'__mbstate_t'
|-FieldDecl 0x7f99b0e5a760 <line:244:5, col:16> col:16 __st_last_ 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type':'__mbstate_t'
|-FieldDecl 0x7f99b0e5a7a8 <line:245:5, col:24> col:24 __om_ 'class ios_base::openmode':'unsigned int'
|-FieldDecl 0x7f99b0e5a7f0 <line:246:5, col:24> col:24 __cm_ 'class ios_base::openmode':'unsigned int'
|-FieldDecl 0x7f99b0e5a838 <line:247:5, col:10> col:10 __owns_eb_ '_Bool'
|-FieldDecl 0x7f99b0e5a880 <line:248:5, col:10> col:10 __owns_ib_ '_Bool'
|-FieldDecl 0x7f99b0e5a8c8 <line:249:5, col:10> col:10 __always_noconv_ '_Bool'
|-CXXMethodDecl 0x7f99b0e5a910 <line:251:5, col:22> col:10 __read_mode '_Bool (void)'
|-CXXMethodDecl 0x7f99b0e5a9b8 <line:252:5, col:23> col:10 __write_mode 'void (void)'
`-CXXMethodDecl 0x7f99b0e5aac8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:129:32, <invalid sloc>> col:32 implicit operator= 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &(const class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &)' inline default_delete noexcept-unevaluated 0x7f99b0e5aac8
  `-ParmVarDecl 0x7f99b0e5abe0 <col:32> col:32 'const class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_filebuf" = type <{ %"class.std::__1::basic_streambuf", i8*, i8*, i8*, [8 x i8], i64, i8*, i64, %struct.__sFILE*, %"class.std::__1::codecvt"*, %union.__mbstate_t, %union.__mbstate_t, i32, i32, i8, i8, i8, [5 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_filebuf.base" = type <{ %"class.std::__1::basic_streambuf", i8*, i8*, i8*, [8 x i8], i64, i8*, i64, %struct.__sFILE*, %"class.std::__1::codecvt"*, %union.__mbstate_t, %union.__mbstate_t, i32, i32, i8, i8, i8 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f99b1823518 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:134:1, line:135:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1323:28 class basic_fstream definition
|-public 'basic_iostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_iostream<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-CXXRecordDecl 0x7f99b0e567a0 prev 0x7f99b1823518 <col:1, col:28> col:28 implicit class basic_fstream
|-AccessSpecDecl 0x7f99b0e56838 <line:1326:1, col:7> col:1 public
|-TypedefDecl 0x7f99b0e56870 <line:1327:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f99b0e56630 'char' sugar
|   |-TemplateTypeParmType 0x7f99b0e39ed0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f99b0e39e88 '_CharT'
|   `-BuiltinType 0x7f99b0833b60 'char'
|-TypedefDecl 0x7f99b0e568d8 <line:1328:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f99b0e56670 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f99b0e39f40 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f99b0e39ef8 '_Traits'
|   `-RecordType 0x7f99b1820560 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f99b0a45748 'char_traits'
|-TypedefDecl 0x7f99b0e569e0 <line:1329:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f99b0e56990 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f99b0a47290 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f99b0a45aa8 'int_type'
|     `-BuiltinType 0x7f99b0833bc0 'int'
|-TypedefDecl 0x7f99b0e56ab0 <line:1330:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f99b0e56a60 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f99b2a24800 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f99b0a45b78 'pos_type'
|     `-TypedefType 0x7f99b0a3df10 'std::__1::streampos' sugar
|       |-Typedef 0x7f99b105a5b8 'streampos'
|       `-TemplateSpecializationType 0x7f99b105a510 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f99b105a4f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f99b105a400 'fpos'
|-TypedefDecl 0x7f99b0e56b80 <line:1331:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f99b0e56b30 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f99b2a248f0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f99b0a45b10 'off_type'
|     `-TypedefType 0x7f99b0a3de80 'std::__1::streamoff' sugar
|       |-Typedef 0x7f99b105a958 'streamoff'
|       `-BuiltinType 0x7f99b0833c00 'long long'
|-CXXConstructorDecl 0x7f99b0e56c18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1334:19> col:5 used basic_fstream 'void (void)'
| `-AlwaysInlineAttr 0x7f99b0e56cf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7f99b0e56e50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1337:101> col:14 used basic_fstream 'void (const char *, class ios_base::openmode)'
| |-ParmVarDecl 0x7f99b0e56d40 <col:28, col:40> col:40 __s 'const char *'
| |-ParmVarDecl 0x7f99b0e56da0 <col:45, col:98> col:64 __mode 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7f99b0e56f18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7f99b0e57070 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1339:103> col:14 basic_fstream 'void (const std::__1::string &, class ios_base::openmode)'
| |-ParmVarDecl 0x7f99b0e56f60 <col:28, col:42> col:42 __s 'const std::__1::string &'
| |-ParmVarDecl 0x7f99b0e56fc0 <col:47, col:100> col:66 __mode 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7f99b0e57138 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7f99b0e572a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1343:40> col:5 basic_fstream 'void (class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&)'
| |-ParmVarDecl 0x7f99b0e571b8 <col:19, col:35> col:35 __rhs 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&'
| `-AlwaysInlineAttr 0x7f99b0e57360 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f99b0e574b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1346:51> col:20 operator= 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &(class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&)'
| |-ParmVarDecl 0x7f99b0e573e8 <col:30, col:46> col:46 __rhs 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&'
| `-AlwaysInlineAttr 0x7f99b0e57560 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f99b0e57680 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1349:35> col:10 swap 'void (class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &)'
| |-ParmVarDecl 0x7f99b0e575b8 <col:15, col:30> col:30 __rhs 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &'
| `-AlwaysInlineAttr 0x7f99b0e57730 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f99b0e57940 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1352:52> col:44 rdbuf 'basic_filebuf<std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7f99b0e579e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f99b0e57a30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1354:20> col:10 is_open '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f99b0e57ad8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f99b0e57c10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1356:5, col:88> col:10 open 'void (const char *, class ios_base::openmode)'
| |-ParmVarDecl 0x7f99b0e57b20 <col:15, col:27> col:27 __s 'const char *'
| `-ParmVarDecl 0x7f99b0e57b80 <col:32, col:85> col:51 __mode 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f99b0e57db8 <line:1357:5, col:90> col:10 open 'void (const std::__1::string &, class ios_base::openmode)'
| |-ParmVarDecl 0x7f99b0e57cc8 <col:15, col:29> col:29 __s 'const std::__1::string &'
| `-ParmVarDecl 0x7f99b0e57d28 <col:34, col:87> col:53 __mode 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f99b0e57e70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1360:16> col:10 close 'void (void)'
| `-AlwaysInlineAttr 0x7f99b0e57f18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-AccessSpecDecl 0x7f99b0e57f60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1362:1, col:8> col:1 private
|-FieldDecl 0x7f99b0e5ad28 <line:1363:5, col:43> col:43 __sb_ 'basic_filebuf<std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::traits_type>':'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >'
|-CXXConstructorDecl 0x7f99b0e5ad98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:135:32> col:32 implicit basic_fstream 'void (const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &)' inline default_delete noexcept-unevaluated 0x7f99b0e5ad98
| `-ParmVarDecl 0x7f99b0e5aec0 <col:32> col:32 'const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &'
|-CXXMethodDecl 0x7f99b0e5af28 <col:32, <invalid sloc>> col:32 implicit operator= 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &(const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &)' inline default_delete noexcept-unevaluated 0x7f99b0e5af28
| `-ParmVarDecl 0x7f99b0e5b040 <col:32> col:32 'const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &'
`-CXXDestructorDecl 0x7f99b0e5b0c8 <col:32> col:32 implicit used ~basic_fstream 'void (void) noexcept' inline default
  `-CompoundStmt 0x7f99b0e5cf08 <col:32>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_fstream" = type { %"class.std::__1::basic_iostream.base", %"class.std::__1::basic_filebuf", %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_fstream.base" = type { %"class.std::__1::basic_iostream.base", %"class.std::__1::basic_filebuf" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f99b0e55258 <2_constructors/11_member_initialization_list.cpp:11:1, line:40:1> line:11:8 referenced struct C definition
|-public 'struct B'
|-CXXRecordDecl 0x7f99b0e553b8 <col:1, col:8> col:8 implicit referenced struct C
|-FieldDecl 0x7f99b0e55468 <line:12:5, col:19> col:19 x 'unsigned char'
|-FieldDecl 0x7f99b0e554c8 <line:13:5, col:19> col:19 referenced y 'unsigned char'
|-FieldDecl 0x7f99b0e55590 <line:14:5, col:16> col:16 referenced m 'std::mutex':'class std::__1::mutex'
|-FieldDecl 0x7f99b0e564d8 <line:15:5, col:33> col:33 lg 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
|-FieldDecl 0x7f99b0e5b1a8 <line:16:5, col:18> col:18 f1 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
|-FieldDecl 0x7f99b0e5b240 <line:17:5, col:18> col:18 f2 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
|-CXXConstructorDecl 0x7f99b0e5b370 <line:19:5, line:25:21> line:19:5 used C 'void (int)'
| |-ParmVarDecl 0x7f99b0e5b2a0 <col:7, col:11> col:11 used x 'int'
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7f99b0e5c630 <col:16, col:21> 'struct B' 'void (int)'
| |   `-IntegerLiteral 0x7f99b0e5c5b8 <col:18> 'int' 123
| |-CXXCtorInitializer Field 0x7f99b0e55468 'x' 'unsigned char'
| | `-InitListExpr 0x7f99b0e5c778 <line:20:17, col:47> 'unsigned char'
| |   `-CXXStaticCastExpr 0x7f99b0e5c700 <col:18, col:46> 'unsigned char' static_cast<unsigned char> <NoOp>
| |     `-ImplicitCastExpr 0x7f99b0e5c6e8 <col:45> 'unsigned char' <IntegralCast>
| |       `-ImplicitCastExpr 0x7f99b0e5c6d0 <col:45> 'int' <LValueToRValue>
| |         `-DeclRefExpr 0x7f99b0e5c690 <col:45> 'int' lvalue ParmVar 0x7f99b0e5b2a0 'x' 'int'
| |-CXXCtorInitializer Field 0x7f99b0e554c8 'y' 'unsigned char'
| | `-InitListExpr 0x7f99b0e5c850 <line:21:17, col:19> 'unsigned char'
| |   `-ImplicitCastExpr 0x7f99b0e5c890 <col:18> 'unsigned char' <IntegralCast>
| |     `-IntegerLiteral 0x7f99b0e5c7e8 <col:18> 'int' 0
| |-CXXCtorInitializer Field 0x7f99b0e55590 'm' 'std::mutex':'class std::__1::mutex'
| | `-CXXConstructExpr 0x7f99b0e5ce78 <line:25:16, col:18> 'std::mutex':'class std::__1::mutex' 'void (void) noexcept' zeroing
| |-CXXCtorInitializer Field 0x7f99b0e564d8 'lg' 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
| | `-CXXConstructExpr 0x7f99b0e5cd70 <line:24:16, col:20> 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>' 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |   `-MemberExpr 0x7f99b0e5cd08 <col:19> 'std::mutex':'class std::__1::mutex' lvalue ->m 0x7f99b0e55590
| |     `-CXXThisExpr 0x7f99b0e5ccf0 <col:19> 'struct C *' this
| |-CXXCtorInitializer Field 0x7f99b0e5b1a8 'f1' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7f99b0e5ca48 <line:22:16, col:43> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (const char *, class ios_base::openmode)'
| |   |-ImplicitCastExpr 0x7f99b0e5ca18 <col:19> 'const char *' <ArrayToPointerDecay>
| |   | `-StringLiteral 0x7f99b0e5c8d8 <col:19> 'const char [8]' lvalue "test.cc"
| |   `-ImplicitCastExpr 0x7f99b0e5ca30 <col:30, col:40> 'std::__1::ios_base::openmode':'unsigned int' <LValueToRValue>
| |     `-DeclRefExpr 0x7f99b0e5c990 <col:30, col:40> 'const std::__1::ios_base::openmode':'const unsigned int' lvalue Var 0x7f99b29e0850 'app' 'const std::__1::ios_base::openmode':'const unsigned int'
| |-CXXCtorInitializer Field 0x7f99b0e5b240 'f2' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7f99b0e5cc88 <line:23:16, col:63> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (const char *, class ios_base::openmode)'
| |   |-ImplicitCastExpr 0x7f99b0e5cc70 <col:19> 'const char *' <ArrayToPointerDecay>
| |   | `-StringLiteral 0x7f99b0e5cab0 <col:19> 'const char [9]' lvalue "test.bin"
| |   `-BinaryOperator 0x7f99b0e5cc10 <col:31, col:60> 'unsigned int' '|'
| |     |-ImplicitCastExpr 0x7f99b0e5cbe0 <col:31, col:41> 'std::__1::ios_base::openmode':'unsigned int' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f99b0e5cb28 <col:31, col:41> 'const std::__1::ios_base::openmode':'const unsigned int' lvalue Var 0x7f99b29e0a50 'binary' 'const std::__1::ios_base::openmode':'const unsigned int'
| |     `-ImplicitCastExpr 0x7f99b0e5cbf8 <col:50, col:60> 'std::__1::ios_base::openmode':'unsigned int' <LValueToRValue>
| |       `-DeclRefExpr 0x7f99b0e5cba8 <col:50, col:60> 'const std::__1::ios_base::openmode':'const unsigned int' lvalue Var 0x7f99b29e0850 'app' 'const std::__1::ios_base::openmode':'const unsigned int'
| `-CompoundStmt 0x7f99b0e5cf20 <line:25:20, col:21>
|-CXXConstructorDecl 0x7f99b0e5b500 <line:27:5, line:31:22> line:27:5 used C 'void (double)'
| |-ParmVarDecl 0x7f99b0e5b438 <col:7, col:14> col:14 used a 'double'
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7f99b0e5cfb0 <line:28:15, col:18> 'struct B' 'void (int)'
| |   `-IntegerLiteral 0x7f99b0e5cf38 <col:17> 'int' 0
| |-CXXCtorInitializer Field 0x7f99b0e55468 'x' 'unsigned char'
| | `-InitListExpr 0x7f99b0e5d260 <line:30:16, col:18> 'unsigned char'
| |   `-ImplicitCastExpr 0x7f99b0e5d2a0 <col:17> 'unsigned char' <LValueToRValue>
| |     `-MemberExpr 0x7f99b0e5d1e0 <col:17> 'unsigned char' lvalue ->y 0x7f99b0e554c8
| |       `-CXXThisExpr 0x7f99b0e5d1c8 <col:17> 'struct C *' this
| |-CXXCtorInitializer Field 0x7f99b0e554c8 'y' 'unsigned char'
| | `-InitListExpr 0x7f99b0e5d158 <line:29:16, col:50> 'unsigned char'
| |   `-CXXStaticCastExpr 0x7f99b0e5d0e0 <col:17, col:49> 'unsigned char' static_cast<unsigned char> <NoOp>
| |     `-ImplicitCastExpr 0x7f99b0e5d0c8 <col:44, col:48> 'unsigned char' <FloatingToIntegral>
| |       `-BinaryOperator 0x7f99b0e5d088 <col:44, col:48> 'double' '+'
| |         |-ImplicitCastExpr 0x7f99b0e5d058 <col:44> 'double' <LValueToRValue>
| |         | `-DeclRefExpr 0x7f99b0e5d010 <col:44> 'double' lvalue ParmVar 0x7f99b0e5b438 'a' 'double'
| |         `-ImplicitCastExpr 0x7f99b0e5d070 <col:48> 'double' <IntegralToFloating>
| |           `-IntegerLiteral 0x7f99b0e5d038 <col:48> 'int' 1
| |-CXXCtorInitializer Field 0x7f99b0e55590 'm' 'std::mutex':'class std::__1::mutex'
| | `-CXXConstructExpr 0x7f99b0e5d3e0 <line:27:5> 'std::mutex':'class std::__1::mutex' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7f99b0e564d8 'lg' 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
| | `-CXXConstructExpr 0x7f99b0e5d380 <line:31:15, col:19> 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>' 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |   `-MemberExpr 0x7f99b0e5d300 <col:18> 'std::mutex':'class std::__1::mutex' lvalue ->m 0x7f99b0e55590
| |     `-CXXThisExpr 0x7f99b0e5d2e8 <col:18> 'struct C *' this
| |-CXXCtorInitializer Field 0x7f99b0e5b1a8 'f1' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7f99b0e5d438 <line:27:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| |-CXXCtorInitializer Field 0x7f99b0e5b240 'f2' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7f99b0e5d490 <col:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| `-CompoundStmt 0x7f99b0e5d520 <line:31:21, col:22>
|-CXXConstructorDecl 0x7f99b0e5b5d0 <line:33:5, line:39:18> line:33:5 used C 'void (void)'
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7f99b0e5d5b0 <line:35:15, col:20> 'struct B' 'void (int)'
| |   `-IntegerLiteral 0x7f99b0e5d538 <col:17> 'int' 789
| |-CXXCtorInitializer Field 0x7f99b0e55468 'x' 'unsigned char'
| | `-InitListExpr 0x7f99b0e5d678 <line:36:16, col:18> 'unsigned char'
| |   `-ImplicitCastExpr 0x7f99b0e5d6b8 <col:17> 'unsigned char' <IntegralCast>
| |     `-IntegerLiteral 0x7f99b0e5d610 <col:17> 'int' 0
| |-CXXCtorInitializer Field 0x7f99b0e554c8 'y' 'unsigned char'
| | `-InitListExpr 0x7f99b0e5d768 <line:37:16, col:18> 'unsigned char'
| |   `-ImplicitCastExpr 0x7f99b0e5d7a8 <col:17> 'unsigned char' <IntegralCast>
| |     `-IntegerLiteral 0x7f99b0e5d700 <col:17> 'int' 0
| |-CXXCtorInitializer Field 0x7f99b0e55590 'm' 'std::mutex':'class std::__1::mutex'
| | `-CXXConstructExpr 0x7f99b0e5d8e8 <line:33:5> 'std::mutex':'class std::__1::mutex' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7f99b0e564d8 'lg' 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
| | `-CXXConstructExpr 0x7f99b0e5d888 <line:38:15, col:19> 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>' 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |   `-MemberExpr 0x7f99b0e5d808 <col:18> 'std::mutex':'class std::__1::mutex' lvalue ->m 0x7f99b0e55590
| |     `-CXXThisExpr 0x7f99b0e5d7f0 <col:18> 'struct C *' this
| |-CXXCtorInitializer Field 0x7f99b0e5b1a8 'f1' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7f99b0e5d940 <line:33:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| |-CXXCtorInitializer Field 0x7f99b0e5b240 'f2' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7f99b0e5d998 <col:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| `-CXXTryStmt 0x7f99b0e5da70 <line:34:5, line:39:18>
|   |-CompoundStmt 0x7f99b0e5da28 <line:38:21, col:22>
|   `-CXXCatchStmt 0x7f99b0e5da58 <line:39:5, col:18>
|     |-<<<NULL>>>
|     `-CompoundStmt 0x7f99b0e5da40 <col:17, col:18>
|-CXXConstructorDecl 0x7f99b0e5ba28 <line:11:8> col:8 implicit C 'void (const struct C &)' inline default_delete noexcept-unevaluated 0x7f99b0e5ba28
| `-ParmVarDecl 0x7f99b0e5bb50 <col:8> col:8 'const struct C &'
|-CXXConstructorDecl 0x7f99b0e5bcc8 <col:8> col:8 implicit C 'void (struct C &&)' inline default_delete noexcept-unevaluated 0x7f99b0e5bcc8
| `-ParmVarDecl 0x7f99b0e5bdf0 <col:8> col:8 'struct C &&'
|-CXXMethodDecl 0x7f99b0e5be88 <col:8, <invalid sloc>> col:8 implicit operator= 'struct C &(const struct C &)' inline default_delete noexcept-unevaluated 0x7f99b0e5be88
| `-ParmVarDecl 0x7f99b0e5bfa0 <col:8> col:8 'const struct C &'
|-CXXMethodDecl 0x7f99b0e5c338 <col:8, <invalid sloc>> col:8 implicit operator= 'struct C &(struct C &&)' inline default_delete noexcept-unevaluated 0x7f99b0e5c338
| `-ParmVarDecl 0x7f99b0e5c450 <col:8> col:8 'struct C &&'
`-CXXDestructorDecl 0x7f99b0e5c4d8 <col:8> col:8 implicit used ~C 'void (void) noexcept' inline default
  `-CompoundStmt 0x7f99b0e5dc30 <col:8>

Layout: <CGRecordLayout
  LLVMType:%struct.C = type { %struct.B, i8, i8, %"class.std::__1::mutex", %"class.std::__1::lock_guard", %"class.std::__1::basic_fstream", %"class.std::__1::basic_fstream" }
  NonVirtualBaseLLVMType:%struct.C = type { %struct.B, i8, i8, %"class.std::__1::mutex", %"class.std::__1::lock_guard", %"class.std::__1::basic_fstream", %"class.std::__1::basic_fstream" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1225:9)
         0 |   struct std::__1::_PairT __t
         0 |     size_t first
         8 |     size_t second
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__murmur2_or_cityhash<unsigned long, 64> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1190:9)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1208:9)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |       union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw
