
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__scalar_hash<struct std::__1::_PairT, 2> (empty)
         0 |   struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1509:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<unsigned long, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1000000000, 1>, false, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_mutex_t
         0 |   long __sig
         8 |   char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_cond_t
         0 |   long __sig
         8 |   char [40] __opaque
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1, 1>, true, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::once_flag
         0 |   unsigned long __state_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale::id
         0 |   struct std::__1::once_flag __flag_
         0 |     unsigned long __state_
         8 |   int32_t __id_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__basic_string_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (empty)
         0 |   class std::__1::allocator<char> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<char>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |       class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false>
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<wchar_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (empty)
         0 |   class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> >
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false> (base)
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |           union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<wchar_t>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> > __r_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false> (base)
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |             union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (base) (empty)
         0 |       class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::money_base::pattern
         0 |   char [4] field
           | [sizeof=4, dsize=4, align=1,
           |  nvsize=4, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<long, long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >
         0 |   std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >::__storage_pointer __seg_
         8 |   std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >::__storage_type __mask_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__bitset<0, 0> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct B
         0 |   int n
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | class std::__1::mutex
         0 |   struct _opaque_pthread_mutex_t __m_
         0 |     long __sig
         8 |     char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::lock_guard<class std::__1::mutex>
         0 |   std::__1::lock_guard<class std::__1::mutex>::mutex_type & __m_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::ios_base
         0 |   (ios_base vtable pointer)
         8 |   std::__1::ios_base::fmtflags __fmtflags_
        16 |   std::__1::streamsize __precision_
        24 |   std::__1::streamsize __width_
        32 |   std::__1::ios_base::iostate __rdstate_
        36 |   std::__1::ios_base::iostate __exceptions_
        40 |   void * __rdbuf_
        48 |   void * __loc_
        56 |   std::__1::ios_base::event_callback * __fn_
        64 |   int * __index_
        72 |   size_t __event_size_
        80 |   size_t __event_cap_
        88 |   long * __iarray_
        96 |   size_t __iarray_size_
       104 |   size_t __iarray_cap_
       112 |   void ** __parray_
       120 |   size_t __parray_size_
       128 |   size_t __parray_cap_
           | [sizeof=136, dsize=136, align=8,
           |  nvsize=136, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ios<char>
         0 |   class std::__1::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     std::__1::ios_base::fmtflags __fmtflags_
        16 |     std::__1::streamsize __precision_
        24 |     std::__1::streamsize __width_
        32 |     std::__1::ios_base::iostate __rdstate_
        36 |     std::__1::ios_base::iostate __exceptions_
        40 |     void * __rdbuf_
        48 |     void * __loc_
        56 |     std::__1::ios_base::event_callback * __fn_
        64 |     int * __index_
        72 |     size_t __event_size_
        80 |     size_t __event_cap_
        88 |     long * __iarray_
        96 |     size_t __iarray_size_
       104 |     size_t __iarray_cap_
       112 |     void ** __parray_
       120 |     size_t __parray_size_
       128 |     size_t __parray_cap_
       136 |   basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       144 |   std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=152, dsize=148, align=8,
           |  nvsize=148, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_istream<char>
         0 |   (basic_istream vtable pointer)
         8 |   std::__1::streamsize __gc_
        16 |   class std::__1::basic_ios<char> (virtual base)
        16 |     class std::__1::ios_base (primary base)
        16 |       (ios_base vtable pointer)
        24 |       std::__1::ios_base::fmtflags __fmtflags_
        32 |       std::__1::streamsize __precision_
        40 |       std::__1::streamsize __width_
        48 |       std::__1::ios_base::iostate __rdstate_
        52 |       std::__1::ios_base::iostate __exceptions_
        56 |       void * __rdbuf_
        64 |       void * __loc_
        72 |       std::__1::ios_base::event_callback * __fn_
        80 |       int * __index_
        88 |       size_t __event_size_
        96 |       size_t __event_cap_
       104 |       long * __iarray_
       112 |       size_t __iarray_size_
       120 |       size_t __iarray_cap_
       128 |       void ** __parray_
       136 |       size_t __parray_size_
       144 |       size_t __parray_cap_
       152 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       160 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=168, dsize=164, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ostream<char>
         0 |   (basic_ostream vtable pointer)
         8 |   class std::__1::basic_ios<char> (virtual base)
         8 |     class std::__1::ios_base (primary base)
         8 |       (ios_base vtable pointer)
        16 |       std::__1::ios_base::fmtflags __fmtflags_
        24 |       std::__1::streamsize __precision_
        32 |       std::__1::streamsize __width_
        40 |       std::__1::ios_base::iostate __rdstate_
        44 |       std::__1::ios_base::iostate __exceptions_
        48 |       void * __rdbuf_
        56 |       void * __loc_
        64 |       std::__1::ios_base::event_callback * __fn_
        72 |       int * __index_
        80 |       size_t __event_size_
        88 |       size_t __event_cap_
        96 |       long * __iarray_
       104 |       size_t __iarray_size_
       112 |       size_t __iarray_cap_
       120 |       void ** __parray_
       128 |       size_t __parray_size_
       136 |       size_t __parray_cap_
       144 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       152 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=160, dsize=156, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_iostream<char>
         0 |   class std::__1::basic_istream<char> (primary base)
         0 |     (basic_istream vtable pointer)
         8 |     std::__1::streamsize __gc_
        16 |   class std::__1::basic_ostream<char> (base)
        16 |     (basic_ostream vtable pointer)
        24 |   class std::__1::basic_ios<char> (virtual base)
        24 |     class std::__1::ios_base (primary base)
        24 |       (ios_base vtable pointer)
        32 |       std::__1::ios_base::fmtflags __fmtflags_
        40 |       std::__1::streamsize __precision_
        48 |       std::__1::streamsize __width_
        56 |       std::__1::ios_base::iostate __rdstate_
        60 |       std::__1::ios_base::iostate __exceptions_
        64 |       void * __rdbuf_
        72 |       void * __loc_
        80 |       std::__1::ios_base::event_callback * __fn_
        88 |       int * __index_
        96 |       size_t __event_size_
       104 |       size_t __event_cap_
       112 |       long * __iarray_
       120 |       size_t __iarray_size_
       128 |       size_t __iarray_cap_
       136 |       void ** __parray_
       144 |       size_t __parray_size_
       152 |       size_t __parray_cap_
       160 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       168 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=176, dsize=172, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale
         0 |   class std::__1::locale::__imp * __locale_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_streambuf<char>
         0 |   (basic_streambuf vtable pointer)
         8 |   class std::__1::locale __loc_
         8 |     class std::__1::locale::__imp * __locale_
        16 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        24 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        32 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        40 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        48 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        56 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | __mbstate_t
         0 |   char [128] __mbstate8
         0 |   long long _mbstateL
           | [sizeof=128, dsize=128, align=8,
           |  nvsize=128, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >
         0 |   class std::__1::basic_streambuf<char> (primary base)
         0 |     (basic_streambuf vtable pointer)
         8 |     class std::__1::locale __loc_
         8 |       class std::__1::locale::__imp * __locale_
        16 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        24 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        32 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        40 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        48 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        56 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
        64 |   char * __extbuf_
        72 |   const char * __extbufnext_
        80 |   const char * __extbufend_
        88 |   char [8] __extbuf_min_
        96 |   size_t __ebs_
       104 |   std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       112 |   size_t __ibs_
       120 |   FILE * __file_
       128 |   const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       136 |   __mbstate_t __st_
       136 |     char [128] __mbstate8
       136 |     long long _mbstateL
       264 |   __mbstate_t __st_last_
       264 |     char [128] __mbstate8
       264 |     long long _mbstateL
       392 |   class ios_base::openmode __om_
       396 |   class ios_base::openmode __cm_
       400 |   _Bool __owns_eb_
       401 |   _Bool __owns_ib_
       402 |   _Bool __always_noconv_
           | [sizeof=408, dsize=403, align=8,
           |  nvsize=403, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >
         0 |   class std::__1::basic_iostream<char> (primary base)
         0 |     class std::__1::basic_istream<char> (primary base)
         0 |       (basic_istream vtable pointer)
         8 |       std::__1::streamsize __gc_
        16 |     class std::__1::basic_ostream<char> (base)
        16 |       (basic_ostream vtable pointer)
        24 |   class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > __sb_
        24 |     class std::__1::basic_streambuf<char> (primary base)
        24 |       (basic_streambuf vtable pointer)
        32 |       class std::__1::locale __loc_
        32 |         class std::__1::locale::__imp * __locale_
        40 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        48 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        56 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        64 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        72 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        80 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
        88 |     char * __extbuf_
        96 |     const char * __extbufnext_
       104 |     const char * __extbufend_
       112 |     char [8] __extbuf_min_
       120 |     size_t __ebs_
       128 |     std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       136 |     size_t __ibs_
       144 |     FILE * __file_
       152 |     const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       160 |     __mbstate_t __st_
       160 |       char [128] __mbstate8
       160 |       long long _mbstateL
       288 |     __mbstate_t __st_last_
       288 |       char [128] __mbstate8
       288 |       long long _mbstateL
       416 |     class ios_base::openmode __om_
       420 |     class ios_base::openmode __cm_
       424 |     _Bool __owns_eb_
       425 |     _Bool __owns_ib_
       426 |     _Bool __always_noconv_
       432 |   class std::__1::basic_ios<char> (virtual base)
       432 |     class std::__1::ios_base (primary base)
       432 |       (ios_base vtable pointer)
       440 |       std::__1::ios_base::fmtflags __fmtflags_
       448 |       std::__1::streamsize __precision_
       456 |       std::__1::streamsize __width_
       464 |       std::__1::ios_base::iostate __rdstate_
       468 |       std::__1::ios_base::iostate __exceptions_
       472 |       void * __rdbuf_
       480 |       void * __loc_
       488 |       std::__1::ios_base::event_callback * __fn_
       496 |       int * __index_
       504 |       size_t __event_size_
       512 |       size_t __event_cap_
       520 |       long * __iarray_
       528 |       size_t __iarray_size_
       536 |       size_t __iarray_cap_
       544 |       void ** __parray_
       552 |       size_t __parray_size_
       560 |       size_t __parray_cap_
       568 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       576 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=584, dsize=580, align=8,
           |  nvsize=432, nvalign=8]

*** Dumping AST Record Layout
         0 | struct C
         0 |   struct B (base)
         0 |     int n
         4 |   unsigned char x
         5 |   unsigned char y
         8 |   class std::__1::mutex m
         8 |     struct _opaque_pthread_mutex_t __m_
         8 |       long __sig
        16 |       char [56] __opaque
        72 |   class std::__1::lock_guard<class std::__1::mutex> lg
        72 |     std::__1::lock_guard<class std::__1::mutex>::mutex_type & __m_
        80 |   class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > f1
        80 |     class std::__1::basic_iostream<char> (primary base)
        80 |       class std::__1::basic_istream<char> (primary base)
        80 |         (basic_istream vtable pointer)
        88 |         std::__1::streamsize __gc_
        96 |       class std::__1::basic_ostream<char> (base)
        96 |         (basic_ostream vtable pointer)
       104 |     class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > __sb_
       104 |       class std::__1::basic_streambuf<char> (primary base)
       104 |         (basic_streambuf vtable pointer)
       112 |         class std::__1::locale __loc_
       112 |           class std::__1::locale::__imp * __locale_
       120 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
       128 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
       136 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
       144 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
       152 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
       160 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
       168 |       char * __extbuf_
       176 |       const char * __extbufnext_
       184 |       const char * __extbufend_
       192 |       char [8] __extbuf_min_
       200 |       size_t __ebs_
       208 |       std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       216 |       size_t __ibs_
       224 |       FILE * __file_
       232 |       const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       240 |       __mbstate_t __st_
       240 |         char [128] __mbstate8
       240 |         long long _mbstateL
       368 |       __mbstate_t __st_last_
       368 |         char [128] __mbstate8
       368 |         long long _mbstateL
       496 |       class ios_base::openmode __om_
       500 |       class ios_base::openmode __cm_
       504 |       _Bool __owns_eb_
       505 |       _Bool __owns_ib_
       506 |       _Bool __always_noconv_
       512 |     class std::__1::basic_ios<char> (virtual base)
       512 |       class std::__1::ios_base (primary base)
       512 |         (ios_base vtable pointer)
       520 |         std::__1::ios_base::fmtflags __fmtflags_
       528 |         std::__1::streamsize __precision_
       536 |         std::__1::streamsize __width_
       544 |         std::__1::ios_base::iostate __rdstate_
       548 |         std::__1::ios_base::iostate __exceptions_
       552 |         void * __rdbuf_
       560 |         void * __loc_
       568 |         std::__1::ios_base::event_callback * __fn_
       576 |         int * __index_
       584 |         size_t __event_size_
       592 |         size_t __event_cap_
       600 |         long * __iarray_
       608 |         size_t __iarray_size_
       616 |         size_t __iarray_cap_
       624 |         void ** __parray_
       632 |         size_t __parray_size_
       640 |         size_t __parray_cap_
       648 |       basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       656 |       std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
       664 |   class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > f2
       664 |     class std::__1::basic_iostream<char> (primary base)
       664 |       class std::__1::basic_istream<char> (primary base)
       664 |         (basic_istream vtable pointer)
       672 |         std::__1::streamsize __gc_
       680 |       class std::__1::basic_ostream<char> (base)
       680 |         (basic_ostream vtable pointer)
       688 |     class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > __sb_
       688 |       class std::__1::basic_streambuf<char> (primary base)
       688 |         (basic_streambuf vtable pointer)
       696 |         class std::__1::locale __loc_
       696 |           class std::__1::locale::__imp * __locale_
       704 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
       712 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
       720 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
       728 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
       736 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
       744 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
       752 |       char * __extbuf_
       760 |       const char * __extbufnext_
       768 |       const char * __extbufend_
       776 |       char [8] __extbuf_min_
       784 |       size_t __ebs_
       792 |       std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       800 |       size_t __ibs_
       808 |       FILE * __file_
       816 |       const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       824 |       __mbstate_t __st_
       824 |         char [128] __mbstate8
       824 |         long long _mbstateL
       952 |       __mbstate_t __st_last_
       952 |         char [128] __mbstate8
       952 |         long long _mbstateL
      1080 |       class ios_base::openmode __om_
      1084 |       class ios_base::openmode __cm_
      1088 |       _Bool __owns_eb_
      1089 |       _Bool __owns_ib_
      1090 |       _Bool __always_noconv_
      1096 |     class std::__1::basic_ios<char> (virtual base)
      1096 |       class std::__1::ios_base (primary base)
      1096 |         (ios_base vtable pointer)
      1104 |         std::__1::ios_base::fmtflags __fmtflags_
      1112 |         std::__1::streamsize __precision_
      1120 |         std::__1::streamsize __width_
      1128 |         std::__1::ios_base::iostate __rdstate_
      1132 |         std::__1::ios_base::iostate __exceptions_
      1136 |         void * __rdbuf_
      1144 |         void * __loc_
      1152 |         std::__1::ios_base::event_callback * __fn_
      1160 |         int * __index_
      1168 |         size_t __event_size_
      1176 |         size_t __event_cap_
      1184 |         long * __iarray_
      1192 |         size_t __iarray_size_
      1200 |         size_t __iarray_cap_
      1208 |         void ** __parray_
      1216 |         size_t __parray_size_
      1224 |         size_t __parray_cap_
      1232 |       basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
      1240 |       std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=1248, dsize=1248, align=8,
           |  nvsize=1248, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fbb9ce839c8 <object_model/2_constructors/11_member_initialization_list.cpp:5:1, line:9:1> line:5:8 referenced struct B definition
|-CXXRecordDecl 0x7fbb9ce83ae8 <col:1, col:8> col:8 implicit referenced struct B
|-FieldDecl 0x7fbb9ce83b98 <line:6:5, col:9> col:9 n 'int'
|-CXXConstructorDecl 0x7fbb9ce83cd0 <line:8:5, col:22> col:5 used B 'void (int)'
| |-ParmVarDecl 0x7fbb9ce83bf8 <col:7, col:11> col:11 used n 'int'
| |-CXXCtorInitializer Field 0x7fbb9ce83b98 'n' 'int'
| | `-ImplicitCastExpr 0x7fbb9ce83df8 <col:18> 'int' <LValueToRValue>
| |   `-DeclRefExpr 0x7fbb9ce83da0 <col:18> 'int' lvalue ParmVar 0x7fbb9ce83bf8 'n' 'int'
| `-CompoundStmt 0x7fbb9ce83e40 <col:21, col:22>
|-CXXConstructorDecl 0x7fbb9ce8a2d8 <line:5:8> col:8 implicit constexpr B 'void (const struct B &)' inline default trivial noexcept-unevaluated 0x7fbb9ce8a2d8
| `-ParmVarDecl 0x7fbb9ce8a400 <col:8> col:8 'const struct B &'
|-CXXConstructorDecl 0x7fbb9ce8a498 <col:8> col:8 implicit constexpr B 'void (struct B &&)' inline default trivial noexcept-unevaluated 0x7fbb9ce8a498
| `-ParmVarDecl 0x7fbb9ce8a5c0 <col:8> col:8 'struct B &&'
|-CXXDestructorDecl 0x7fbb9ce8a7b8 <col:8> col:8 implicit ~B 'void (void) noexcept' inline default trivial
|-CXXMethodDecl 0x7fbb9ce8ac38 <col:8, <invalid sloc>> col:8 implicit operator= 'struct B &(const struct B &)' inline default trivial noexcept-unevaluated 0x7fbb9ce8ac38
| `-ParmVarDecl 0x7fbb9ce8ad50 <col:8> col:8 'const struct B &'
`-CXXMethodDecl 0x7fbb9ce8adb8 <col:8, <invalid sloc>> col:8 implicit operator= 'struct B &(struct B &&)' inline default trivial noexcept-unevaluated 0x7fbb9ce8adb8
  `-ParmVarDecl 0x7fbb9ce8aed0 <col:8> col:8 'struct B &&'

Layout: <CGRecordLayout
  LLVMType:%struct.B = type { i32 }
  NonVirtualBaseLLVMType:%struct.B = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fbb9c0106c0 </usr/include/sys/_pthread/_pthread_types.h:78:1, line:81:1> line:78:8 struct _opaque_pthread_mutex_t definition
|-CXXRecordDecl 0x7fbb9c0107e8 <col:1, col:8> col:8 implicit struct _opaque_pthread_mutex_t
|-FieldDecl 0x7fbb9c010898 <line:79:2, col:7> col:7 __sig 'long'
|-FieldDecl 0x7fbb9c010920 <line:80:2, col:38> col:7 __opaque 'char [56]'
`-CXXDestructorDecl 0x7fbb9cb0faf8 <line:78:8> col:8 implicit ~_opaque_pthread_mutex_t 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%struct._opaque_pthread_mutex_t = type { i64, [56 x i8] }
  NonVirtualBaseLLVMType:%struct._opaque_pthread_mutex_t = type { i64, [56 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fbb9cb0ed68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:40:1, line:68:1> line:40:78 referenced class mutex definition
|-VisibilityAttr 0x7fbb9cb0ee88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fbb9cb0eed0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:40:1, col:78> col:78 implicit referenced class mutex
|-FieldDecl 0x7fbb9cb0ef78 <line:43:5, /usr/include/pthread.h:182:64> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:43:22 referenced __m_ 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
| `-InitListExpr 0x7fbb9cb0fcb0 </usr/include/pthread.h:182:35, col:64> 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
|   |-ImplicitCastExpr 0x7fbb9cb0fd00 </usr/include/pthread_impl.h:41:34> 'long' <IntegralCast>
|   | `-IntegerLiteral 0x7fbb9cb0fbd8 <col:34> 'int' 850045863
|   `-InitListExpr 0x7fbb9cb0fd18 </usr/include/pthread.h:182:61, col:63> 'char [56]'
|     |-array filler
|     | `-ImplicitValueInitExpr 0x7fbb9cb0fd78 <<invalid sloc>> 'char'
|     `-ImplicitCastExpr 0x7fbb9cb0fd58 <col:62> 'char' <IntegralCast>
|       `-IntegerLiteral 0x7fbb9cb0fbf8 <col:62> 'int' 0
|-AccessSpecDecl 0x7fbb9cb0efc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:48:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fbb9cb0f088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:51:31> col:15 used constexpr mutex 'void (void) noexcept' default
| |-CXXCtorInitializer Field 0x7fbb9cb0ef78 '__m_' 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
| | `-CXXDefaultInitExpr 0x7fbb9ce8ba10 <col:15> 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
| |-CompoundStmt 0x7fbb9ce8ba60 <col:31>
| |-AlwaysInlineAttr 0x7fbb9cb0f130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9cb0f178 <col:51, col:74> Hidden
|-CXXDestructorDecl 0x7fbb9cb0f1d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:55:5, col:12> col:5 used ~mutex 'void (void) noexcept'
|-AccessSpecDecl 0x7fbb9cb0f278 <line:57:1, col:8> col:1 private
|-CXXConstructorDecl 0x7fbb9cb0f3a0 <line:58:5, col:23> col:5 mutex 'void (const class std::__1::mutex &)'
| `-ParmVarDecl 0x7fbb9cb0f2d8 <col:11, col:22> col:23 'const class std::__1::mutex &'
|-CXXMethodDecl 0x7fbb9cb0f550 <line:59:5, col:34> col:12 operator= 'class std::__1::mutex &(const class std::__1::mutex &)'
| `-ParmVarDecl 0x7fbb9cb0f460 <col:22, col:33> col:34 'const class std::__1::mutex &'
|-AccessSpecDecl 0x7fbb9cb0f5f0 <line:61:1, col:7> col:1 public
|-CXXMethodDecl 0x7fbb9cb0f638 <line:62:5, col:15> col:10 lock 'void (void)'
|-CXXMethodDecl 0x7fbb9cb0f6f8 <line:63:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:63:10 try_lock '_Bool (void) noexcept'
|-CXXMethodDecl 0x7fbb9cb0f7b8 <line:64:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:64:10 unlock 'void (void) noexcept'
|-TypedefDecl 0x7fbb9cb0f860 <line:66:5, col:31> col:31 referenced native_handle_type 'std::__1::__libcpp_mutex_t *'
| `-PointerType 0x7fbb9d48b760 'std::__1::__libcpp_mutex_t *'
|   `-TypedefType 0x7fbb9d48b740 'std::__1::__libcpp_mutex_t' sugar
|     |-Typedef 0x7fbb9d48aa58 '__libcpp_mutex_t'
|     `-TypedefType 0x7fbb9d4618d0 'pthread_mutex_t' sugar
|       |-Typedef 0x7fbb9d459bb0 'pthread_mutex_t'
|       `-TypedefType 0x7fbb9d459b80 '__darwin_pthread_mutex_t' sugar
|         |-Typedef 0x7fbb9c013380 '__darwin_pthread_mutex_t'
|         `-ElaboratedType 0x7fbb9c013330 'struct _opaque_pthread_mutex_t' sugar
|           `-RecordType 0x7fbb9c010760 'struct _opaque_pthread_mutex_t'
|             `-CXXRecord 0x7fbb9c0106c0 '_opaque_pthread_mutex_t'
`-CXXMethodDecl 0x7fbb9cb0f990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:67:80> col:50 native_handle 'std::__1::mutex::native_handle_type (void)'
  |-CompoundStmt 0x7fbb9cb0fed8 <col:66, col:80>
  | `-ReturnStmt 0x7fbb9cb0fec0 <col:67, col:75>
  |   `-UnaryOperator 0x7fbb9cb0fea0 <col:74, col:75> 'std::__1::__libcpp_mutex_t *' prefix '&'
  |     `-MemberExpr 0x7fbb9cb0fe68 <col:75> 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t' lvalue ->__m_ 0x7fbb9cb0ef78
  |       `-CXXThisExpr 0x7fbb9cb0fe50 <col:75> 'class std::__1::mutex *' this
  |-AlwaysInlineAttr 0x7fbb9cb0fa28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
  `-VisibilityAttr 0x7fbb9cb0fa70 <col:51, col:74> Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::mutex" = type { %struct._opaque_pthread_mutex_t }
  NonVirtualBaseLLVMType:%"class.std::__1::mutex" = type { %struct._opaque_pthread_mutex_t }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fbb9ce84248 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:91:1, line:114:1> line:93:1 class lock_guard definition
|-TemplateArgument type 'class std::__1::mutex'
|-CXXRecordDecl 0x7fbb9ce844c0 prev 0x7fbb9ce84248 <line:92:1, line:93:1> col:1 implicit class lock_guard
|-AccessSpecDecl 0x7fbb9ce84558 <line:95:1, col:7> col:1 public
|-TypedefDecl 0x7fbb9ce845b8 <line:96:5, col:20> col:20 mutex_type 'class std::__1::mutex':'class std::__1::mutex'
| `-SubstTemplateTypeParmType 0x7fbb9ce84580 'class std::__1::mutex' sugar
|   |-TemplateTypeParmType 0x7fbb9cb134b0 '_Mutex' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fbb9cb13470 '_Mutex'
|   `-RecordType 0x7fbb9cb0ee00 'class std::__1::mutex'
|     `-CXXRecord 0x7fbb9cb0ed68 'mutex'
|-AccessSpecDecl 0x7fbb9ce84610 <line:98:1, col:8> col:1 private
|-FieldDecl 0x7fbb9ce84698 <line:99:5, col:17> col:17 __m_ 'std::__1::lock_guard<class std::__1::mutex>::mutex_type &'
|-AccessSpecDecl 0x7fbb9ce846e0 <line:100:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fbb9ce84820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:104:34> line:103:14 used lock_guard 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |-ParmVarDecl 0x7fbb9ce84718 <col:25, col:37> col:37 __m 'std::__1::lock_guard<class std::__1::mutex>::mutex_type &'
| `-AlwaysInlineAttr 0x7fbb9ce84908 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fbb9ce84ab0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:107:22> line:106:5 lock_guard 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &, struct std::__1::adopt_lock_t)'
| |-ParmVarDecl 0x7fbb9ce84960 <col:16, col:28> col:28 __m 'std::__1::lock_guard<class std::__1::mutex>::mutex_type &'
| |-ParmVarDecl 0x7fbb9ce849c0 <col:33> col:45 'struct std::__1::adopt_lock_t'
| `-AlwaysInlineAttr 0x7fbb9ce84b78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fbb9ce84bf0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:109:89> col:5 used ~lock_guard 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fbb9ce84ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7fbb9ce84ce8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:111:1, col:8> col:1 private
|-CXXConstructorDecl 0x7fbb9ce84e30 <line:112:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:824:37> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:112:5 lock_guard 'void (const class std::__1::lock_guard<class std::__1::mutex> &)' delete trivial
| `-ParmVarDecl 0x7fbb9ce84d48 <col:16, col:32> col:33 'const class std::__1::lock_guard<class std::__1::mutex> &'
`-CXXMethodDecl 0x7fbb9ce84ff0 <line:113:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:824:37> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:113:17 operator= 'class std::__1::lock_guard<class std::__1::mutex> &(const class std::__1::lock_guard<class std::__1::mutex> &)' delete trivial
  `-ParmVarDecl 0x7fbb9ce84f28 <col:27, col:43> col:44 'const class std::__1::lock_guard<class std::__1::mutex> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::lock_guard" = type { %"class.std::__1::mutex"* }
  NonVirtualBaseLLVMType:%"class.std::__1::lock_guard" = type { %"class.std::__1::mutex"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fbb9ccdd130 prev 0x7fbb9c0cfd20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, line:386:1> line:231:24 referenced class ios_base definition
|-VisibilityAttr 0x7fbb9ccdd230 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fbb9ccdd278 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, col:24> col:24 implicit referenced class ios_base
|-AccessSpecDecl 0x7fbb9ccdd310 <line:233:1, col:7> col:1 public
|-CXXRecordDecl 0x7fbb9ccdd368 <line:234:5, col:33> col:33 class failure
| `-VisibilityAttr 0x7fbb9ccdd420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:701:47, col:71> Default
|-TypedefDecl 0x7fbb9ccdd480 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:236:5, col:26> col:26 referenced fmtflags 'unsigned int'
| `-BuiltinType 0x7fbb9b833c60 'unsigned int'
|-VarDecl 0x7fbb9ccdd510 <line:237:5, col:41> col:27 referenced boolalpha 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccdd590 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccdd570 <col:41> 'int' 1
|-VarDecl 0x7fbb9ccdd610 <line:238:5, col:41> col:27 referenced dec 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccdd690 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccdd670 <col:41> 'int' 2
|-VarDecl 0x7fbb9ccdd710 <line:239:5, col:41> col:27 referenced fixed 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccdd790 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccdd770 <col:41> 'int' 4
|-VarDecl 0x7fbb9ccdd810 <line:240:5, col:41> col:27 referenced hex 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccdd890 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccdd870 <col:41> 'int' 8
|-VarDecl 0x7fbb9ccdd910 <line:241:5, col:41> col:27 referenced internal 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccdd990 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccdd970 <col:41> 'int' 16
|-VarDecl 0x7fbb9ccdda10 <line:242:5, col:41> col:27 referenced left 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccdda90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccdda70 <col:41> 'int' 32
|-VarDecl 0x7fbb9ccddb10 <line:243:5, col:41> col:27 referenced oct 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccddb90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccddb70 <col:41> 'int' 64
|-VarDecl 0x7fbb9ccddc10 <line:244:5, col:41> col:27 referenced right 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccddc90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccddc70 <col:41> 'int' 128
|-VarDecl 0x7fbb9ccddd10 <line:245:5, col:41> col:27 referenced scientific 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccddd90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccddd70 <col:41> 'int' 256
|-VarDecl 0x7fbb9ccdde10 <line:246:5, col:41> col:27 referenced showbase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccdde90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccdde70 <col:41> 'int' 512
|-VarDecl 0x7fbb9ccddf10 <line:247:5, col:41> col:27 referenced showpoint 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccddf90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccddf70 <col:41> 'int' 1024
|-VarDecl 0x7fbb9ccde010 <line:248:5, col:41> col:27 referenced showpos 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccde090 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccde070 <col:41> 'int' 2048
|-VarDecl 0x7fbb9ccde110 <line:249:5, col:41> col:27 referenced skipws 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccde190 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccde170 <col:41> 'int' 4096
|-VarDecl 0x7fbb9ccde210 <line:250:5, col:41> col:27 referenced unitbuf 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccde290 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccde270 <col:41> 'int' 8192
|-VarDecl 0x7fbb9ccde310 <line:251:5, col:41> col:27 referenced uppercase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccde390 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccde370 <col:41> 'int' 16384
|-VarDecl 0x7fbb9ccde410 <line:252:5, col:56> col:27 referenced adjustfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7fbb9ccde558 <col:41, col:56> 'unsigned int' '|'
|   |-BinaryOperator 0x7fbb9ccde4f0 <col:41, col:48> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7fbb9ccde4c0 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7fbb9ccde470 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fbb9ccdda10 'left' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7fbb9ccde4d8 <col:48> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7fbb9ccde498 <col:48> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fbb9ccddc10 'right' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7fbb9ccde540 <col:56> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fbb9ccde518 <col:56> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fbb9ccdd910 'internal' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7fbb9ccde5e8 <line:253:5, col:53> col:27 referenced basefield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7fbb9ccde730 <col:41, col:53> 'unsigned int' '|'
|   |-BinaryOperator 0x7fbb9ccde6c8 <col:41, col:47> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7fbb9ccde698 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7fbb9ccde648 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fbb9ccdd610 'dec' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7fbb9ccde6b0 <col:47> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7fbb9ccde670 <col:47> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fbb9ccddb10 'oct' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7fbb9ccde718 <col:53> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fbb9ccde6f0 <col:53> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fbb9ccdd810 'hex' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7fbb9ccde7c0 <line:254:5, col:54> col:27 referenced floatfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7fbb9ccde8a0 <col:41, col:54> 'unsigned int' '|'
|   |-ImplicitCastExpr 0x7fbb9ccde870 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | `-DeclRefExpr 0x7fbb9ccde820 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fbb9ccddd10 'scientific' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7fbb9ccde888 <col:54> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fbb9ccde848 <col:54> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fbb9ccdd710 'fixed' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-TypedefDecl 0x7fbb9ccde938 <line:256:5, col:26> col:26 referenced iostate 'unsigned int'
| `-BuiltinType 0x7fbb9b833c60 'unsigned int'
|-VarDecl 0x7fbb9ccde9c0 <line:257:5, col:36> col:26 referenced badbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccdea40 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccdea20 <col:36> 'int' 1
|-VarDecl 0x7fbb9ccdeac0 <line:258:5, col:36> col:26 referenced eofbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccdeb40 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccdeb20 <col:36> 'int' 2
|-VarDecl 0x7fbb9ccdebc0 <line:259:5, col:36> col:26 referenced failbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccdec40 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccdec20 <col:36> 'int' 4
|-VarDecl 0x7fbb9ccdecc0 <line:260:5, col:36> col:26 referenced goodbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccded40 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccded20 <col:36> 'int' 0
|-TypedefDecl 0x7fbb9ccdedc8 <line:262:5, col:26> col:26 referenced openmode 'unsigned int'
| `-BuiltinType 0x7fbb9b833c60 'unsigned int'
|-VarDecl 0x7fbb9ccdee50 <line:263:5, col:36> col:27 referenced app 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccdeed0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccdeeb0 <col:36> 'int' 1
|-VarDecl 0x7fbb9ccdef50 <line:264:5, col:36> col:27 referenced ate 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccdefd0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccdefb0 <col:36> 'int' 2
|-VarDecl 0x7fbb9ccdf050 <line:265:5, col:36> col:27 referenced binary 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccdf0d0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccdf0b0 <col:36> 'int' 4
|-VarDecl 0x7fbb9ccdf150 <line:266:5, col:36> col:27 referenced in 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccdf1d0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccdf1b0 <col:36> 'int' 8
|-VarDecl 0x7fbb9ccdf250 <line:267:5, col:36> col:27 referenced out 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccdf2d0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccdf2b0 <col:36> 'int' 16
|-VarDecl 0x7fbb9ccdf350 <line:268:5, col:36> col:27 referenced trunc 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fbb9ccdf3d0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fbb9ccdf3b0 <col:36> 'int' 32
|-EnumDecl 0x7fbb9ccdf440 <line:270:5, col:32> col:10 referenced seekdir
| |-EnumConstantDecl 0x7fbb9ccdf500 <col:19> col:19 referenced beg 'enum std::__1::ios_base::seekdir'
| |-EnumConstantDecl 0x7fbb9ccdf548 <col:24> col:24 referenced cur 'enum std::__1::ios_base::seekdir'
| `-EnumConstantDecl 0x7fbb9ccdf590 <col:29> col:29 referenced end 'enum std::__1::ios_base::seekdir'
|-TypedefDecl 0x7fbb9ccdf5e8 <line:273:5, col:26> col:26 io_state 'std::__1::ios_base::iostate':'unsigned int'
| `-TypedefType 0x7fbb9ccde990 'std::__1::ios_base::iostate' sugar
|   |-Typedef 0x7fbb9ccde938 'iostate'
|   `-BuiltinType 0x7fbb9b833c60 'unsigned int'
|-TypedefDecl 0x7fbb9ccdf650 <line:274:5, col:26> col:26 open_mode 'std::__1::ios_base::openmode':'unsigned int'
| `-TypedefType 0x7fbb9ccdee20 'std::__1::ios_base::openmode' sugar
|   |-Typedef 0x7fbb9ccdedc8 'openmode'
|   `-BuiltinType 0x7fbb9b833c60 'unsigned int'
|-TypedefDecl 0x7fbb9ccdf6b8 <line:275:5, col:26> col:26 seek_dir 'enum std::__1::ios_base::seekdir'
| `-EnumType 0x7fbb9ccdf4e0 'enum std::__1::ios_base::seekdir'
|   `-Enum 0x7fbb9ccdf440 'seekdir'
|-TypedefDecl 0x7fbb9ccdf7d0 <line:277:5, col:30> col:30 streamoff 'std::__1::streamoff':'long long'
| `-ElaboratedType 0x7fbb9ccdf760 'std::__1::streamoff' sugar
|   `-TypedefType 0x7fbb9d20c080 'std::__1::streamoff' sugar
|     |-Typedef 0x7fbb9c0deb58 'streamoff'
|     `-BuiltinType 0x7fbb9b833c00 'long long'
|-TypedefDecl 0x7fbb9ccdf8b0 <line:278:5, col:30> col:30 streampos 'std::__1::streampos':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fbb9ccdf840 'std::__1::streampos' sugar
|   `-TypedefType 0x7fbb9d20c110 'std::__1::streampos' sugar
|     |-Typedef 0x7fbb9c0de7b8 'streampos'
|     `-TemplateSpecializationType 0x7fbb9c0de710 'fpos<mbstate_t>' sugar fpos
|       |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|       `-RecordType 0x7fbb9c0de6f0 'class std::__1::fpos<__mbstate_t>'
|         `-ClassTemplateSpecialization 0x7fbb9c0de600 'fpos'
|-CXXRecordDecl 0x7fbb9ccdf938 <line:281:5, col:28> col:28 class Init
| `-VisibilityAttr 0x7fbb9ccdf9f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXMethodDecl 0x7fbb9ccdfb20 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:284:48> col:40 flags 'std::__1::ios_base::fmtflags (void) const'
| |-AlwaysInlineAttr 0x7fbb9ccdfbb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9ccdfc00 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9ccdfd40 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:285:62> col:40 flags 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fbb9ccdfc50 <col:46, col:55> col:55 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fbb9ccdfde0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9ccdfe28 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9ccdff00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:286:61> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fbb9ccdfe78 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fbb9ccdffa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9ccdffe8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9cce01c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:287:78> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags, std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fbb9cce0038 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-ParmVarDecl 0x7fbb9cce00a8 <col:63, col:72> col:72 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fbb9cce0268 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9cce02b0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9cce03c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:288:58> col:36 used unsetf 'void (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fbb9cce0300 <col:43, col:52> col:52 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fbb9cce0460 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9cce04a8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9cce0560 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:290:54> col:42 precision 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7fbb9cce05f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9cce0640 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9cce0750 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:291:69> col:42 precision 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7fbb9cce0690 <col:52, col:63> col:63 __prec 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7fbb9cce07f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9cce0838 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9cce0898 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:292:50> col:42 width 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7fbb9cce0930 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9cce0978 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9cce0a50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:293:65> col:42 width 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7fbb9cce09c8 <col:48, col:59> col:59 __wide 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7fbb9cce0af0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9cce0b38 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9cce0be0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:296:5, col:37> col:12 referenced imbue 'class std::__1::locale (const class std::__1::locale &)'
| `-ParmVarDecl 0x7fbb9cce0b58 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7fbb9cce0cd0 <line:297:5, col:21> col:12 referenced getloc 'class std::__1::locale (void) const'
|-CXXMethodDecl 0x7fbb9cce0d90 <line:300:5, col:23> col:16 xalloc 'int (void)' static
|-CXXMethodDecl 0x7fbb9cce0ed0 <line:301:5, col:28> col:11 iword 'long &(int)'
| `-ParmVarDecl 0x7fbb9cce0e40 <col:17, col:21> col:21 __index 'int'
|-CXXMethodDecl 0x7fbb9cce1058 <line:302:5, col:29> col:12 pword 'void *&(int)'
| `-ParmVarDecl 0x7fbb9cce0f88 <col:18, col:22> col:22 __index 'int'
|-CXXDestructorDecl 0x7fbb9cce1148 <line:305:5, col:23> col:13 ~ios_base 'void (void) noexcept' virtual
|-EnumDecl 0x7fbb9cce11e8 <line:308:5, col:58> col:10 referenced event
| |-EnumConstantDecl 0x7fbb9cce12a0 <col:18> col:18 referenced erase_event 'enum std::__1::ios_base::event'
| |-EnumConstantDecl 0x7fbb9cce12e8 <col:31> col:31 imbue_event 'enum std::__1::ios_base::event'
| `-EnumConstantDecl 0x7fbb9cce1330 <col:44> col:44 referenced copyfmt_event 'enum std::__1::ios_base::event'
|-TypedefDecl 0x7fbb9cce15f0 <line:309:5, col:65> col:20 referenced event_callback 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-PointerType 0x7fbb9cce1580 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
|   `-ParenType 0x7fbb9cce1520 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' sugar
|     `-FunctionProtoType 0x7fbb9cce14d0 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' cdecl
|       |-BuiltinType 0x7fbb9b833b20 'void'
|       |-EnumType 0x7fbb9cce1280 'enum std::__1::ios_base::event'
|       | `-Enum 0x7fbb9cce11e8 'event'
|       |-LValueReferenceType 0x7fbb9c9a64c0 'class std::__1::ios_base &'
|       | `-RecordType 0x7fbb9c0cfdc0 'class std::__1::ios_base'
|       |   `-CXXRecord 0x7fbb9ccdd130 'ios_base'
|       `-BuiltinType 0x7fbb9b833bc0 'int'
|-CXXMethodDecl 0x7fbb9cce1810 <line:310:5, col:60> col:10 register_callback 'void (std::__1::ios_base::event_callback, int)'
| |-ParmVarDecl 0x7fbb9cce1680 <col:28, col:43> col:43 __fn 'std::__1::ios_base::event_callback':'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-ParmVarDecl 0x7fbb9cce16f8 <col:49, col:53> col:53 __index 'int'
|-AccessSpecDecl 0x7fbb9cce18b8 <line:312:1, col:8> col:1 private
|-CXXConstructorDecl 0x7fbb9cce1a00 <line:313:5, col:29> col:5 ios_base 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fbb9cce1918 <col:14, col:28> col:29 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7fbb9cce1b80 <line:314:5, col:40> col:15 operator= 'class std::__1::ios_base &(const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fbb9cce1ac0 <col:25, col:39> col:40 'const class std::__1::ios_base &'
|-AccessSpecDecl 0x7fbb9cce1c20 <line:316:1, col:7> col:1 public
|-CXXMethodDecl 0x7fbb9cce1d20 <line:317:5, col:51> col:17 sync_with_stdio '_Bool (_Bool)' static
| `-ParmVarDecl 0x7fbb9cce1c58 <col:33, col:47> col:38 __sync '_Bool' cinit
|   `-CXXBoolLiteralExpr 0x7fbb9cce4118 <col:47> '_Bool' true
|-CXXMethodDecl 0x7fbb9cce1e40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:319:49> col:39 rdstate 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7fbb9cce1ed8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9cce1f20 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9cce2000 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:320:5, col:41> col:10 used clear 'void (std::__1::ios_base::iostate)'
| `-ParmVarDecl 0x7fbb9cce1f40 <col:16, col:34> col:24 __state 'std::__1::ios_base::iostate':'unsigned int' cinit
|   `-ImplicitCastExpr 0x7fbb9cce4158 <col:34> 'std::__1::ios_base::iostate':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fbb9cce4130 <col:34> 'const std::__1::ios_base::iostate':'const unsigned int' lvalue Var 0x7fbb9ccdecc0 'goodbit' 'const std::__1::ios_base::iostate':'const unsigned int'
|-CXXMethodDecl 0x7fbb9cce2168 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:321:60> col:36 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fbb9cce20e0 <col:45, col:53> col:53 __state 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7fbb9cce2208 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9cce2250 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9cce22b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:323:43> col:36 good '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fbb9cce2348 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9cce2390 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9cce23f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:324:42> col:36 eof '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fbb9cce2488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9cce24d0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9cce2530 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:325:43> col:36 fail '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fbb9cce25c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9cce2610 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9cce2670 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:326:42> col:36 bad '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fbb9cce2708 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9cce2750 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9cce27b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:328:52> col:39 exceptions 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7fbb9cce2848 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9cce2890 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9cce2968 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:329:64> col:36 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fbb9cce28e0 <col:47, col:55> col:55 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7fbb9cce2a08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9cce2a50 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9cce2a80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:331:5, col:44> col:10 __set_badbit_and_consider_rethrow 'void (void)'
|-CXXMethodDecl 0x7fbb9cce2b38 <line:332:5, col:45> col:10 __set_failbit_and_consider_rethrow 'void (void)'
|-AccessSpecDecl 0x7fbb9cce2bd0 <line:334:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fbb9cce2c48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:337:16> line:336:5 ios_base 'void (void)'
| |-CompoundStmt 0x7fbb9cce4170 <col:16, line:337:16>
| |-AlwaysInlineAttr 0x7fbb9cce2cf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9cce2d38 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9cce2de8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:339:5, col:25> col:10 referenced init 'void (void *)'
| `-ParmVarDecl 0x7fbb9cce2d60 <col:15, col:21> col:21 __sb 'void *'
|-CXXMethodDecl 0x7fbb9cce2f18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:340:64> col:33 rdbuf 'void *(void) const'
| |-CompoundStmt 0x7fbb9cce4208 <col:47, col:64>
| | `-ReturnStmt 0x7fbb9cce41f0 <col:48, col:55>
| |   `-ImplicitCastExpr 0x7fbb9cce41d8 <col:55> 'void *' <LValueToRValue>
| |     `-MemberExpr 0x7fbb9cce41a0 <col:55> 'void *const' lvalue ->__rdbuf_ 0x7fbb9cce3b28
| |       `-CXXThisExpr 0x7fbb9cce4188 <col:55> 'const class std::__1::ios_base *' this
| |-AlwaysInlineAttr 0x7fbb9cce2fb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fbb9cce2ff8 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fbb9cce30d8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:347:5> line:343:10 rdbuf 'void (void *)'
| |-ParmVarDecl 0x7fbb9cce3050 <col:16, col:22> col:22 used __sb 'void *'
| |-CompoundStmt 0x7fbb9cce4388 <line:344:5, line:347:5>
| | |-BinaryOperator 0x7fbb9cce42b8 <line:345:9, col:20> 'void *' lvalue '='
| | | |-MemberExpr 0x7fbb9cce4240 <col:9> 'void *' lvalue ->__rdbuf_ 0x7fbb9cce3b28
| | | | `-CXXThisExpr 0x7fbb9cce4228 <col:9> 'class std::__1::ios_base *' this
| | | `-ImplicitCastExpr 0x7fbb9cce42a0 <col:20> 'void *' <LValueToRValue>
| | |   `-DeclRefExpr 0x7fbb9cce4278 <col:20> 'void *' lvalue ParmVar 0x7fbb9cce3050 '__sb' 'void *'
| | `-CXXMemberCallExpr 0x7fbb9cce4330 <line:346:9, col:15> 'void'
| |   |-MemberExpr 0x7fbb9cce42f8 <col:9> '<bound member function type>' ->clear 0x7fbb9cce2000
| |   | `-CXXThisExpr 0x7fbb9cce42e0 <col:9> 'class std::__1::ios_base *' this
| |   `-CXXDefaultArgExpr 0x7fbb9cce4368 <<invalid sloc>> 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7fbb9cce3178 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fbb9cce31c0 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fbb9cce32a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:349:5, col:32> col:10 referenced __call_callbacks 'void (enum std::__1::ios_base::event)'
| `-ParmVarDecl 0x7fbb9cce31e0 <col:27> col:32 'enum std::__1::ios_base::event'
|-CXXMethodDecl 0x7fbb9cce33d8 <line:350:5, col:33> col:10 referenced copyfmt 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fbb9cce3350 <col:18, col:32> col:33 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7fbb9cce3550 <line:351:5, col:24> col:10 referenced move 'void (class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fbb9cce3488 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7fbb9cce36c8 <line:352:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:352:10 referenced swap 'void (class std::__1::ios_base &) noexcept'
| `-ParmVarDecl 0x7fbb9cce3600 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7fbb9cce3838 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:358:5> line:355:10 referenced set_rdbuf 'void (void *)'
| |-ParmVarDecl 0x7fbb9cce37b0 <col:20, col:26> col:26 used __sb 'void *'
| |-CompoundStmt 0x7fbb9cce4468 <line:356:5, line:358:5>
| | `-BinaryOperator 0x7fbb9cce4440 <line:357:9, col:20> 'void *' lvalue '='
| |   |-MemberExpr 0x7fbb9cce43c8 <col:9> 'void *' lvalue ->__rdbuf_ 0x7fbb9cce3b28
| |   | `-CXXThisExpr 0x7fbb9cce43b0 <col:9> 'class std::__1::ios_base *' this
| |   `-ImplicitCastExpr 0x7fbb9cce4428 <col:20> 'void *' <LValueToRValue>
| |     `-DeclRefExpr 0x7fbb9cce4400 <col:20> 'void *' lvalue ParmVar 0x7fbb9cce37b0 '__sb' 'void *'
| |-AlwaysInlineAttr 0x7fbb9cce38d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fbb9cce3920 <col:48, col:71> Hidden
|-AccessSpecDecl 0x7fbb9cce3930 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:360:1, col:8> col:1 private
|-FieldDecl 0x7fbb9cce3968 <line:362:5, col:21> col:21 referenced __fmtflags_ 'std::__1::ios_base::fmtflags':'unsigned int'
|-FieldDecl 0x7fbb9cce39c0 <line:363:5, col:21> col:21 referenced __precision_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7fbb9cce3a18 <line:364:5, col:21> col:21 referenced __width_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7fbb9cce3a70 <line:365:5, col:21> col:21 referenced __rdstate_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7fbb9cce3ac8 <line:366:5, col:21> col:21 referenced __exceptions_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7fbb9cce3b28 <line:367:5, col:21> col:21 referenced __rdbuf_ 'void *'
|-FieldDecl 0x7fbb9cce3b88 <line:368:5, col:21> col:21 __loc_ 'void *'
|-FieldDecl 0x7fbb9cce3c38 <line:369:5, col:21> col:21 __fn_ 'std::__1::ios_base::event_callback *'
|-FieldDecl 0x7fbb9cce3c98 <line:370:5, col:21> col:21 __index_ 'int *'
|-FieldDecl 0x7fbb9cce3cf0 <line:371:5, col:21> col:21 __event_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7fbb9cce3d48 <line:372:5, col:21> col:21 __event_cap_ 'size_t':'unsigned long'
|-VarDecl 0x7fbb9cce3e58 <line:376:5, col:24> col:24 __xindex_ 'atomic<int>':'struct std::__1::atomic<int>' static
|-FieldDecl 0x7fbb9cce3ed0 <line:380:5, col:21> col:21 __iarray_ 'long *'
|-FieldDecl 0x7fbb9cce3f28 <line:381:5, col:21> col:21 __iarray_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7fbb9cce3f80 <line:382:5, col:21> col:21 __iarray_cap_ 'size_t':'unsigned long'
|-FieldDecl 0x7fbb9cce3fe0 <line:383:5, col:21> col:21 __parray_ 'void **'
|-FieldDecl 0x7fbb9cce4038 <line:384:5, col:21> col:21 __parray_size_ 'size_t':'unsigned long'
`-FieldDecl 0x7fbb9cce4090 <line:385:5, col:21> col:21 __parray_cap_ 'size_t':'unsigned long'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fbb9c0d89f8 parent 0x7fbb9c0cfc88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:486:78> col:64 class basic_ios definition
|-public 'class std::__1::ios_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fbb9d4d9058 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fbb9d4d9148 prev 0x7fbb9c0d89f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:583:1, col:28> col:28 implicit class basic_ios
|-AccessSpecDecl 0x7fbb9d4d91e0 <line:586:1, col:7> col:1 public
|-TypedefDecl 0x7fbb9d4d9248 <line:588:5, col:20> col:20 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fbb9d4d9210 'char' sugar
|   |-TemplateTypeParmType 0x7fbb9ccf5c90 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fbb9ccf5c50 '_CharT'
|   `-BuiltinType 0x7fbb9b833b60 'char'
|-TypedefDecl 0x7fbb9d4d92d8 <line:589:5, col:21> col:21 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fbb9d4d92a0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fbb9ccf5d00 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fbb9ccf5cb8 '_Traits'
|   `-RecordType 0x7fbb9c0d8960 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fbb9d215b48 'char_traits'
|-TypedefDecl 0x7fbb9d4d93e0 <line:591:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fbb9d4d9390 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fbb9d217690 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fbb9d215ea8 'int_type'
|     `-BuiltinType 0x7fbb9b833bc0 'int'
|-TypedefDecl 0x7fbb9d4d94b0 <line:592:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fbb9d4d9460 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fbb9d4d0000 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fbb9d215f78 'pos_type'
|     `-TypedefType 0x7fbb9d20c110 'std::__1::streampos' sugar
|       |-Typedef 0x7fbb9c0de7b8 'streampos'
|       `-TemplateSpecializationType 0x7fbb9c0de710 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fbb9c0de6f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fbb9c0de600 'fpos'
|-TypedefDecl 0x7fbb9d4d9580 <line:593:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fbb9d4d9530 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fbb9d4d00f0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fbb9d215f10 'off_type'
|     `-TypedefType 0x7fbb9d20c080 'std::__1::streamoff' sugar
|       |-Typedef 0x7fbb9c0deb58 'streamoff'
|       `-BuiltinType 0x7fbb9b833c00 'long long'
|-CXXConversionDecl 0x7fbb9d4d95d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:605:60> col:22 operator bool '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fbb9d4d96a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9d4d96f8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:608:69> col:32 operator! '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fbb9d4d97a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9d4d97e8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:609:81> col:35 rdstate 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7fbb9d4d9890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9d4d9960 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:610:91> col:32 clear 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fbb9d4d98d8 <col:38, col:56> col:46 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7fbb9d4d9a10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9d4d9ae0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:611:87> col:32 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fbb9d4d9a58 <col:41, col:49> col:49 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7fbb9d4d9b90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9d4d9bd8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:612:70> col:32 good '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fbb9d4d9c80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9d4d9cc8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:613:69> col:32 eof '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fbb9d4d9d70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9d4d9db8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:614:70> col:32 fail '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fbb9d4d9e60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9d4d9ea8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:615:69> col:32 bad '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fbb9d4d9f50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9d4d9f98 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:617:85> col:35 exceptions 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7fbb9d4da040 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9d4da110 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:618:95> col:32 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fbb9d4da088 <col:43, col:51> col:51 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7fbb9d4da1c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXConstructorDecl 0x7fbb9d4da470 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:622:68> col:14 basic_ios 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fbb9d4da328 <col:24, col:64> col:64 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fbb9d4da530 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fbb9d4da5a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:623:5, col:24> col:13 used ~basic_ios 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7fbb9d4da800 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:627:50> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7fbb9d4da8a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fbb9d4dabe0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:629:95> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fbb9d4daa98 <col:48, col:87> col:87 __tiestr 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fbb9d4dac90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fbb9d4dae50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:632:54> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7fbb9d4daef8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fbb9d4db230 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:634:97> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fbb9d4db0e8 <col:52, col:93> col:93 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fbb9d4db2e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fbb9d4db460 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:636:5, col:46> col:16 copyfmt 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)'
| `-ParmVarDecl 0x7fbb9d4db398 <col:24, col:41> col:41 __rhs 'const class std::__1::basic_ios<char> &'
|-CXXMethodDecl 0x7fbb9d4db560 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:639:22> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (void) const'
| `-AlwaysInlineAttr 0x7fbb9d4db608 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fbb9d4db760 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:641:34> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7fbb9d4db660 <col:20, col:30> col:30 __ch 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7fbb9d4db810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fbb9d4db8e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:644:37> col:12 imbue 'class std::__1::locale (const class std::__1::locale &)'
| |-ParmVarDecl 0x7fbb9d4db858 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7fbb9d4db990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fbb9d4dbb20 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:647:47> col:10 narrow 'char (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, char) const'
| |-ParmVarDecl 0x7fbb9d4db9e8 <col:17, col:27> col:27 __c 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| |-ParmVarDecl 0x7fbb9d4dba48 <col:32, col:37> col:37 __dfault 'char'
| `-AlwaysInlineAttr 0x7fbb9d4dbbd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fbb9d4dbce0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:649:31> col:15 widen 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (char) const'
| |-ParmVarDecl 0x7fbb9d4dbc20 <col:21, col:26> col:26 __c 'char'
| `-AlwaysInlineAttr 0x7fbb9d4dbd90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7fbb9d4dbdd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:651:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fbb9d4dbe20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:654:17> line:653:5 basic_ios 'void (void)'
| `-AlwaysInlineAttr 0x7fbb9d4dbed8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9d4dc0e0 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:656:60> col:10 init 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fbb9d4dc018 <col:15, col:56> col:56 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fbb9d4dc190 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fbb9d4dc2b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:659:31> col:10 move 'void (class std::__1::basic_ios<char> &)'
| |-ParmVarDecl 0x7fbb9d4dc1e8 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7fbb9d4dc360 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fbb9d4dc4b0 <line:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:662:47> col:10 move 'void (class std::__1::basic_ios<char> &&)'
| |-ParmVarDecl 0x7fbb9d4dc3e8 <col:15, col:27> col:27 __rhs 'class std::__1::basic_ios<char> &&'
| `-AlwaysInlineAttr 0x7fbb9d4dc560 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9d4dc688 <line:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:665:10 swap 'void (class std::__1::basic_ios<char> &) noexcept'
| |-ParmVarDecl 0x7fbb9d4dc5b8 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7fbb9d4dc738 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fbb9d4dc940 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:667:65> col:10 set_rdbuf 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fbb9d4dc878 <col:20, col:61> col:61 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fbb9d4dc9f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7fbb9d4dca38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:668:1, col:8> col:1 private
|-FieldDecl 0x7fbb9d4dcb58 <line:669:5, col:44> col:44 __tie_ 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
|-FieldDecl 0x7fbb9d4dcbd0 <line:670:6, col:23> col:23 __fill_ 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' mutable
|-CXXConstructorDecl 0x7fbb9d4dcc58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:486:64> col:64 implicit basic_ios 'void (const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7fbb9d4dcc58
| `-ParmVarDecl 0x7fbb9d4dcd80 <col:64> col:64 'const class std::__1::basic_ios<char> &'
`-CXXMethodDecl 0x7fbb9d4dcde8 <col:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7fbb9d4dcde8
  `-ParmVarDecl 0x7fbb9d4dcec0 <col:64> col:64 'const class std::__1::basic_ios<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ios" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fbb9c0d93c8 parent 0x7fbb9c0cfc88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1681:82> col:64 class basic_istream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fbb9bb491e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fbb9bb49420 prev 0x7fbb9c0d93c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:176:1, col:28> col:28 implicit class basic_istream
|-FieldDecl 0x7fbb9bb494b8 <line:179:5, col:16> col:16 __gc_ 'std::__1::streamsize':'long'
|-AccessSpecDecl 0x7fbb9bb49500 <line:180:1, col:7> col:1 public
|-TypedefDecl 0x7fbb9bb49538 <line:182:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fbb9bb492b0 'char' sugar
|   |-TemplateTypeParmType 0x7fbb9bae9b30 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fbb9bae9ae8 '_CharT'
|   `-BuiltinType 0x7fbb9b833b60 'char'
|-TypedefDecl 0x7fbb9bb495a0 <line:183:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fbb9bb492f0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fbb9bae9ba0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fbb9bae9b58 '_Traits'
|   `-RecordType 0x7fbb9c0d8960 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fbb9d215b48 'char_traits'
|-TypedefDecl 0x7fbb9bb496b0 <line:184:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fbb9bb49660 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fbb9d217690 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fbb9d215ea8 'int_type'
|     `-BuiltinType 0x7fbb9b833bc0 'int'
|-TypedefDecl 0x7fbb9bb49780 <line:185:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fbb9bb49730 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fbb9d4d0000 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fbb9d215f78 'pos_type'
|     `-TypedefType 0x7fbb9d20c110 'std::__1::streampos' sugar
|       |-Typedef 0x7fbb9c0de7b8 'streampos'
|       `-TemplateSpecializationType 0x7fbb9c0de710 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fbb9c0de6f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fbb9c0de600 'fpos'
|-TypedefDecl 0x7fbb9bb49850 <line:186:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fbb9bb49800 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fbb9d4d00f0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fbb9d215f10 'off_type'
|     `-TypedefType 0x7fbb9d20c080 'std::__1::streamoff' sugar
|       |-Typedef 0x7fbb9c0deb58 'streamoff'
|       `-BuiltinType 0x7fbb9b833c00 'long long'
|-CXXConstructorDecl 0x7fbb9bb49ad0 <line:189:5, line:191:25> line:190:14 basic_istream 'void (basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7fbb9bb499c8 <col:28, col:69> col:69 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fbb9bb49bb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXDestructorDecl 0x7fbb9bb49c30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:192:5, col:28> col:13 ~basic_istream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fbb9bb49ce0 <line:193:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fbb9bb49e30 <line:195:5, line:196:40> col:5 basic_istream 'void (class std::__1::basic_istream<char> &&)' inline
| |-ParmVarDecl 0x7fbb9bb49d48 <col:19, col:35> col:35 __rhs 'class std::__1::basic_istream<char> &&'
| `-AlwaysInlineAttr 0x7fbb9bb49ef0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fbb9bb4a040 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:199:5, line:200:51> col:20 operator= 'class std::__1::basic_istream<char> &(class std::__1::basic_istream<char> &&)' inline
| |-ParmVarDecl 0x7fbb9bb49f78 <col:30, col:46> col:46 __rhs 'class std::__1::basic_istream<char> &&'
| `-AlwaysInlineAttr 0x7fbb9bb4a0f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fbb9bb4a210 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:203:5, line:207:5> line:204:10 swap 'void (class std::__1::basic_istream<char> &)' inline
| |-ParmVarDecl 0x7fbb9bb4a148 <col:15, col:30> col:30 __rhs 'class std::__1::basic_istream<char> &'
| `-AlwaysInlineAttr 0x7fbb9bb4a2c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXConstructorDecl 0x7fbb9bb4a430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:210:5, col:65> col:5 basic_istream 'void (const class std::__1::basic_istream<char> &)' delete
| `-ParmVarDecl 0x7fbb9bb4a348 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_istream<char> &'
|-CXXMethodDecl 0x7fbb9bb4a5c0 <line:211:5, col:65> col:20 operator= 'class std::__1::basic_istream<char> &(const class std::__1::basic_istream<char> &)' delete
| `-ParmVarDecl 0x7fbb9bb4a500 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_istream<char> &'
|-AccessSpecDecl 0x7fbb9bb4a670 <line:213:1, col:7> col:1 public
|-CXXRecordDecl 0x7fbb9bb4a698 <line:216:5, col:32> col:32 class sentry definition
| |-CXXRecordDecl 0x7fbb9ce089d0 prev 0x7fbb9bb4a698 <line:293:1, col:60> col:60 implicit class sentry
| |-FieldDecl 0x7fbb9ce08a68 <line:295:5, col:10> col:10 __ok_ '_Bool'
| |-CXXConstructorDecl 0x7fbb9ce08bf0 <line:297:5, col:25> col:5 sentry 'void (const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7fbb9ce08ae8 <col:12, col:24> col:25 'const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x7fbb9ce08db0 <line:298:5, col:36> col:13 operator= 'class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7fbb9ce08ce8 <col:23, col:35> col:36 'const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x7fbb9ce08e60 <line:300:1, col:7> col:1 public
| |-CXXConstructorDecl 0x7fbb9ce09180 <line:301:5, col:82> col:14 sentry 'void (basic_istream<char, struct std::__1::char_traits<char> > &, _Bool)'
| | |-ParmVarDecl 0x7fbb9ce08fe8 <col:21, col:53> col:53 __is 'basic_istream<char, struct std::__1::char_traits<char> > &'
| | `-ParmVarDecl 0x7fbb9ce09048 <col:59, col:77> col:64 __noskipws '_Bool'
| `-CXXConversionDecl 0x7fbb9ce09248 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:306:45> col:9 operator bool '_Bool (void) const'
|   `-AlwaysInlineAttr 0x7fbb9ce09318 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fbb9bb4a9d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:219:5, line:221:27> line:220:20 operator>> 'class std::__1::basic_istream<char> &(class std::__1::basic_istream<char> &(*)(class std::__1::basic_istream<char> &))' inline
| |-ParmVarDecl 0x7fbb9bb4a8d0 <col:31, col:68> col:48 __pf 'class std::__1::basic_istream<char> &(*)(class std::__1::basic_istream<char> &)'
| `-AlwaysInlineAttr 0x7fbb9bb4aa80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9bb4aef0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:223:5, line:226:34> line:224:20 operator>> 'class std::__1::basic_istream<char> &(basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &))' inline
| |-ParmVarDecl 0x7fbb9bb4adf0 <col:31, line:225:73> col:33 __pf 'basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &)'
| `-AlwaysInlineAttr 0x7fbb9bb4afa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9bb4b0f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:228:5, line:230:34> line:229:20 operator>> 'class std::__1::basic_istream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))' inline
| |-ParmVarDecl 0x7fbb9bb4afe8 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x7fbb9bb4b1a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9bb4b3f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:232:5, col:76> col:20 operator>> 'class std::__1::basic_istream<char> &(basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *)'
| `-ParmVarDecl 0x7fbb9bb4b2e8 <col:31, col:72> col:72 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *'
|-CXXMethodDecl 0x7fbb9bb4b560 <line:233:5, col:40> col:20 operator>> 'class std::__1::basic_istream<char> &(_Bool &)'
| `-ParmVarDecl 0x7fbb9bb4b4a0 <col:31, col:37> col:37 __n '_Bool &'
|-CXXMethodDecl 0x7fbb9bb4b6d0 <line:234:5, col:41> col:20 operator>> 'class std::__1::basic_istream<char> &(short &)'
| `-ParmVarDecl 0x7fbb9bb4b610 <col:31, col:38> col:38 __n 'short &'
|-CXXMethodDecl 0x7fbb9bb4b840 <line:235:5, col:50> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned short &)'
| `-ParmVarDecl 0x7fbb9bb4b780 <col:31, col:47> col:47 __n 'unsigned short &'
|-CXXMethodDecl 0x7fbb9bb4b9b0 <line:236:5, col:39> col:20 operator>> 'class std::__1::basic_istream<char> &(int &)'
| `-ParmVarDecl 0x7fbb9bb4b8f0 <col:31, col:36> col:36 __n 'int &'
|-CXXMethodDecl 0x7fbb9bb4bb20 <line:237:5, col:48> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned int &)'
| `-ParmVarDecl 0x7fbb9bb4ba60 <col:31, col:45> col:45 __n 'unsigned int &'
|-CXXMethodDecl 0x7fbb9bb4bc90 <line:238:5, col:40> col:20 operator>> 'class std::__1::basic_istream<char> &(long &)'
| `-ParmVarDecl 0x7fbb9bb4bbd0 <col:31, col:37> col:37 __n 'long &'
|-CXXMethodDecl 0x7fbb9bb4be00 <line:239:5, col:49> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned long &)'
| `-ParmVarDecl 0x7fbb9bb4bd40 <col:31, col:46> col:46 __n 'unsigned long &'
|-CXXMethodDecl 0x7fbb9bb4bf70 <line:240:5, col:45> col:20 operator>> 'class std::__1::basic_istream<char> &(long long &)'
| `-ParmVarDecl 0x7fbb9bb4beb0 <col:31, col:42> col:42 __n 'long long &'
|-CXXMethodDecl 0x7fbb9bb4c0e0 <line:241:5, col:54> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned long long &)'
| `-ParmVarDecl 0x7fbb9bb4c020 <col:31, col:51> col:51 __n 'unsigned long long &'
|-CXXMethodDecl 0x7fbb9bb4c250 <line:242:5, col:41> col:20 operator>> 'class std::__1::basic_istream<char> &(float &)'
| `-ParmVarDecl 0x7fbb9bb4c190 <col:31, col:38> col:38 __f 'float &'
|-CXXMethodDecl 0x7fbb9bb4c3c0 <line:243:5, col:42> col:20 operator>> 'class std::__1::basic_istream<char> &(double &)'
| `-ParmVarDecl 0x7fbb9bb4c300 <col:31, col:39> col:39 __f 'double &'
|-CXXMethodDecl 0x7fbb9bb4c530 <line:244:5, col:47> col:20 operator>> 'class std::__1::basic_istream<char> &(long double &)'
| `-ParmVarDecl 0x7fbb9bb4c470 <col:31, col:44> col:44 __f 'long double &'
|-CXXMethodDecl 0x7fbb9bb4c6a0 <line:245:5, col:41> col:20 operator>> 'class std::__1::basic_istream<char> &(void *&)'
| `-ParmVarDecl 0x7fbb9bb4c5e0 <col:31, col:38> col:38 __p 'void *&'
|-CXXMethodDecl 0x7fbb9bb4c750 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:249:45> col:16 gcount 'std::__1::streamsize (void) const'
| `-AlwaysInlineAttr 0x7fbb9bb4c7f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fbb9bb4c8b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:250:5, col:18> col:14 get 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type (void)'
|-CXXMethodDecl 0x7fbb9bb4caa0 <line:252:5, line:258:5> line:253:20 get 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type &)' inline
| |-ParmVarDecl 0x7fbb9bb4c998 <col:24, col:35> col:35 __c 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type &'
| `-AlwaysInlineAttr 0x7fbb9bb4cb50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9bb4cd50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:260:5, line:262:48> line:261:20 get 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7fbb9bb4cbd8 <col:24, col:35> col:35 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fbb9bb4cc38 <col:40, col:51> col:51 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7fbb9bb4ce08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9bb4d060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:264:5, col:71> col:20 get 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7fbb9bb4ce60 <col:24, col:35> col:35 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fbb9bb4cec0 <col:40, col:51> col:51 __n 'std::__1::streamsize':'long'
| `-ParmVarDecl 0x7fbb9bb4cf30 <col:56, col:66> col:66 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7fbb9bb4d320 <line:266:5, line:268:44> line:267:20 get 'class std::__1::basic_istream<char> &(basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &)' inline
| |-ParmVarDecl 0x7fbb9bb4d218 <col:24, col:65> col:65 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &'
| `-AlwaysInlineAttr 0x7fbb9bb4d3d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9bb4d6a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:270:5, col:86> col:20 get 'class std::__1::basic_istream<char> &(basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7fbb9bb4d518 <col:24, col:65> col:65 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &'
| `-ParmVarDecl 0x7fbb9bb4d588 <col:71, col:81> col:81 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7fbb9bb4d858 <line:272:5, line:274:52> line:273:20 getline 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7fbb9bb4d768 <col:28, col:39> col:39 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fbb9bb4d7c8 <col:44, col:55> col:55 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7fbb9bb4d910 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9ce07908 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:276:5, col:75> col:20 getline 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7fbb9bb4d968 <col:28, col:39> col:39 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fbb9ce07800 <col:44, col:55> col:55 __n 'std::__1::streamsize':'long'
| `-ParmVarDecl 0x7fbb9ce07870 <col:60, col:70> col:70 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7fbb9ce07b50 <line:278:5, col:82> col:20 ignore 'class std::__1::basic_istream<char> &(std::__1::streamsize, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type)'
| |-ParmVarDecl 0x7fbb9ce079c8 <col:27, col:44> col:38 __n 'std::__1::streamsize':'long'
| `-ParmVarDecl 0x7fbb9ce07a38 <col:47, col:81> col:56 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7fbb9ce07c28 <line:279:5, col:19> col:14 peek 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type (void)'
|-CXXMethodDecl 0x7fbb9ce07dd0 <line:280:5, col:56> col:20 read 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7fbb9ce07ce0 <col:26, col:37> col:37 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fbb9ce07d40 <col:42, col:53> col:53 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fbb9ce07fd0 <line:281:5, col:55> col:16 readsome 'std::__1::streamsize (std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7fbb9ce07e98 <col:25, col:36> col:36 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fbb9ce07ef8 <col:41, col:52> col:52 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fbb9ce081a0 <line:283:5, col:41> col:20 putback 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| `-ParmVarDecl 0x7fbb9ce08098 <col:28, col:38> col:38 __c 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7fbb9ce082a0 <line:284:5, col:26> col:20 unget 'class std::__1::basic_istream<char> &(void)'
|-CXXMethodDecl 0x7fbb9ce08348 <line:285:5, col:14> col:9 sync 'int (void)'
|-CXXMethodDecl 0x7fbb9ce08460 <line:287:5, col:20> col:14 tellg 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::pos_type (void)'
|-CXXMethodDecl 0x7fbb9ce08620 <line:288:5, col:40> col:20 seekg 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::pos_type)'
| `-ParmVarDecl 0x7fbb9ce08518 <col:26, col:35> col:35 __pos 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
`-CXXMethodDecl 0x7fbb9ce08870 <line:289:5, col:65> col:20 seekg 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir)'
  |-ParmVarDecl 0x7fbb9ce08700 <col:26, col:35> col:35 __off 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::off_type':'long long'
  `-ParmVarDecl 0x7fbb9ce08760 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_istream" = type { i32 (...)**, i64, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_istream.base" = type { i32 (...)**, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fbb9c0d96b8 parent 0x7fbb9c0cfc88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:1084:82> col:64 class basic_ostream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fbb9badfcc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fbb9badff00 prev 0x7fbb9c0d96b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:151:1, col:28> col:28 implicit class basic_ostream
|-AccessSpecDecl 0x7fbb9badff98 <line:154:1, col:7> col:1 public
|-TypedefDecl 0x7fbb9badffd0 <line:156:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fbb9badfd90 'char' sugar
|   |-TemplateTypeParmType 0x7fbb9baab790 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fbb9baab748 '_CharT'
|   `-BuiltinType 0x7fbb9b833b60 'char'
|-TypedefDecl 0x7fbb9bae0038 <line:157:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fbb9badfdd0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fbb9baab800 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fbb9baab7b8 '_Traits'
|   `-RecordType 0x7fbb9c0d8960 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fbb9d215b48 'char_traits'
|-TypedefDecl 0x7fbb9bae0140 <line:158:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fbb9bae00f0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fbb9d217690 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fbb9d215ea8 'int_type'
|     `-BuiltinType 0x7fbb9b833bc0 'int'
|-TypedefDecl 0x7fbb9bae0210 <line:159:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fbb9bae01c0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fbb9d4d0000 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fbb9d215f78 'pos_type'
|     `-TypedefType 0x7fbb9d20c110 'std::__1::streampos' sugar
|       |-Typedef 0x7fbb9c0de7b8 'streampos'
|       `-TemplateSpecializationType 0x7fbb9c0de710 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fbb9c0de6f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fbb9c0de600 'fpos'
|-TypedefDecl 0x7fbb9bae02e0 <line:160:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fbb9bae0290 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fbb9d4d00f0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fbb9d215f10 'off_type'
|     `-TypedefType 0x7fbb9d20c080 'std::__1::streamoff' sugar
|       |-Typedef 0x7fbb9c0deb58 'streamoff'
|       `-BuiltinType 0x7fbb9b833c00 'long long'
|-CXXConstructorDecl 0x7fbb9bae0560 <line:163:5, line:165:25> line:164:14 basic_ostream 'void (basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7fbb9bae0458 <col:28, col:69> col:69 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fbb9bae0620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXDestructorDecl 0x7fbb9bae0698 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:166:5, col:28> col:13 ~basic_ostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fbb9bae0748 <line:167:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fbb9bae0890 <line:169:5, line:170:40> col:5 basic_ostream 'void (class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7fbb9bae07a8 <col:19, col:35> col:35 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7fbb9bae0950 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fbb9bae0aa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:173:5, line:174:51> col:20 operator= 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7fbb9bae09d8 <col:30, col:46> col:46 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7fbb9bae0b50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fbb9bae0c70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:176:5, line:178:55> line:177:10 swap 'void (class std::__1::basic_ostream<char> &)' inline
| |-ParmVarDecl 0x7fbb9bae0ba8 <col:15, col:30> col:30 __rhs 'class std::__1::basic_ostream<char> &'
| `-AlwaysInlineAttr 0x7fbb9bae0d20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXConstructorDecl 0x7fbb9bae0e90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:181:5, col:65> col:5 basic_ostream 'void (const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7fbb9bae0da8 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-CXXMethodDecl 0x7fbb9bae1020 <line:182:5, col:65> col:20 operator= 'class std::__1::basic_ostream<char> &(const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7fbb9bae0f60 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-AccessSpecDecl 0x7fbb9bae10d0 <line:187:1, col:7> col:1 public
|-CXXRecordDecl 0x7fbb9bae10f8 <line:190:5, col:32> col:32 class sentry definition
| |-CXXRecordDecl 0x7fbb9bae3fa0 prev 0x7fbb9bae10f8 <line:240:1, col:60> col:60 implicit class sentry
| |-FieldDecl 0x7fbb9bae4038 <line:242:5, col:10> col:10 __ok_ '_Bool'
| |-FieldDecl 0x7fbb9bae41d8 <line:243:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXConstructorDecl 0x7fbb9bae4360 <line:245:5, col:25> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7fbb9bae4258 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x7fbb9bae4520 <line:246:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7fbb9bae4458 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x7fbb9bae45d0 <line:248:1, col:7> col:1 public
| |-CXXConstructorDecl 0x7fbb9bae47e0 <line:249:5, col:57> col:14 sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| | `-ParmVarDecl 0x7fbb9bae46f8 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXDestructorDecl 0x7fbb9bae48d0 <line:250:5, col:13> col:5 ~sentry 'void (void)' noexcept-unevaluated 0x7fbb9bae48d0
| `-CXXConversionDecl 0x7fbb9bae4980 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:254:45> col:9 operator bool '_Bool (void) const'
|   `-AlwaysInlineAttr 0x7fbb9bae4a58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9bae1430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:193:5, line:195:27> line:194:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &))' inline
| |-ParmVarDecl 0x7fbb9bae1330 <col:31, col:68> col:48 __pf 'class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &)'
| `-AlwaysInlineAttr 0x7fbb9bae14e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9bae19c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:197:5, line:200:34> line:198:20 operator<< 'class std::__1::basic_ostream<char> &(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &))' inline
| |-ParmVarDecl 0x7fbb9bae18c0 <col:31, line:199:72> col:33 __pf 'basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &)'
| `-AlwaysInlineAttr 0x7fbb9bae1a70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9bae1bc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:202:5, line:204:34> line:203:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))' inline
| |-ParmVarDecl 0x7fbb9bae1ab8 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x7fbb9bae1c70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9bae1d80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:206:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(_Bool)'
| `-ParmVarDecl 0x7fbb9bae1cb8 <col:31, col:36> col:36 __n '_Bool'
|-CXXMethodDecl 0x7fbb9bae1ef0 <line:207:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(short)'
| `-ParmVarDecl 0x7fbb9bae1e30 <col:31, col:37> col:37 __n 'short'
|-CXXMethodDecl 0x7fbb9bae2060 <line:208:5, col:49> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned short)'
| `-ParmVarDecl 0x7fbb9bae1fa0 <col:31, col:46> col:46 __n 'unsigned short'
|-CXXMethodDecl 0x7fbb9bae21d0 <line:209:5, col:38> col:20 operator<< 'class std::__1::basic_ostream<char> &(int)'
| `-ParmVarDecl 0x7fbb9bae2110 <col:31, col:35> col:35 __n 'int'
|-CXXMethodDecl 0x7fbb9bae2340 <line:210:5, col:47> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned int)'
| `-ParmVarDecl 0x7fbb9bae2280 <col:31, col:44> col:44 __n 'unsigned int'
|-CXXMethodDecl 0x7fbb9bae24b0 <line:211:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(long)'
| `-ParmVarDecl 0x7fbb9bae23f0 <col:31, col:36> col:36 __n 'long'
|-CXXMethodDecl 0x7fbb9bae2620 <line:212:5, col:48> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long)'
| `-ParmVarDecl 0x7fbb9bae2560 <col:31, col:45> col:45 __n 'unsigned long'
|-CXXMethodDecl 0x7fbb9bae2790 <line:213:5, col:44> col:20 operator<< 'class std::__1::basic_ostream<char> &(long long)'
| `-ParmVarDecl 0x7fbb9bae26d0 <col:31, col:41> col:41 __n 'long long'
|-CXXMethodDecl 0x7fbb9bae2900 <line:214:5, col:53> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long long)'
| `-ParmVarDecl 0x7fbb9bae2840 <col:31, col:50> col:50 __n 'unsigned long long'
|-CXXMethodDecl 0x7fbb9bae2a70 <line:215:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(float)'
| `-ParmVarDecl 0x7fbb9bae29b0 <col:31, col:37> col:37 __f 'float'
|-CXXMethodDecl 0x7fbb9bae2be0 <line:216:5, col:41> col:20 operator<< 'class std::__1::basic_ostream<char> &(double)'
| `-ParmVarDecl 0x7fbb9bae2b20 <col:31, col:38> col:38 __f 'double'
|-CXXMethodDecl 0x7fbb9bae2d50 <line:217:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(long double)'
| `-ParmVarDecl 0x7fbb9bae2c90 <col:31, col:43> col:43 __f 'long double'
|-CXXMethodDecl 0x7fbb9bae2ec0 <line:218:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(const void *)'
| `-ParmVarDecl 0x7fbb9bae2e00 <col:31, col:43> col:43 __p 'const void *'
|-CXXMethodDecl 0x7fbb9bae3170 <line:219:5, col:76> col:20 operator<< 'class std::__1::basic_ostream<char> &(basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)'
| `-ParmVarDecl 0x7fbb9bae3068 <col:31, col:72> col:72 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
|-CXXMethodDecl 0x7fbb9bae3330 <line:222:5, col:37> col:20 put 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type)'
| `-ParmVarDecl 0x7fbb9bae3230 <col:24, col:34> col:34 __c 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7fbb9bae3590 <line:223:5, col:62> col:20 write 'class std::__1::basic_ostream<char> &(const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7fbb9bae3418 <col:26, col:43> col:43 __s 'const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fbb9bae3478 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fbb9bae36a0 <line:224:5, col:26> col:20 flush 'class std::__1::basic_ostream<char> &(void)'
|-CXXMethodDecl 0x7fbb9bae37f0 <line:227:5, line:228:20> col:14 tellp 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type (void)' inline
| `-AlwaysInlineAttr 0x7fbb9bae3898 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> Inherited always_inline
|-CXXMethodDecl 0x7fbb9bae39f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:229:5, line:230:40> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type)' inline
| |-ParmVarDecl 0x7fbb9bae38f0 <col:26, col:35> col:35 __pos 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-AlwaysInlineAttr 0x7fbb9bae3aa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> Inherited always_inline
|-CXXMethodDecl 0x7fbb9bae3cb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:231:5, line:232:65> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir)' inline
| |-ParmVarDecl 0x7fbb9bae3b20 <col:26, col:35> col:35 __off 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7fbb9bae3b80 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-AlwaysInlineAttr 0x7fbb9bae3d68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> Inherited always_inline
|-AccessSpecDecl 0x7fbb9bae3db0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:234:1, col:10> col:1 protected
`-CXXConstructorDecl 0x7fbb9bae3df8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:236:22> col:5 basic_ostream 'void (void)'
  `-AlwaysInlineAttr 0x7fbb9bae3eb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream.base" = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fbb9c0d99a8 parent 0x7fbb9c0cfc88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1683:83> col:64 class basic_iostream definition
|-public 'basic_istream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_istream<char>'
|-public 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fbb9ce0f9a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fbb9ce0fcd8 prev 0x7fbb9c0d99a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1442:1, col:28> col:28 implicit class basic_iostream
|-AccessSpecDecl 0x7fbb9ce0fd70 <line:1446:1, col:7> col:1 public
|-TypedefDecl 0x7fbb9ce0fda8 <line:1448:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fbb9ce0fa70 'char' sugar
|   |-TemplateTypeParmType 0x7fbb9bb3d5d0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fbb9bb3d590 '_CharT'
|   `-BuiltinType 0x7fbb9b833b60 'char'
|-TypedefDecl 0x7fbb9ce0fe10 <line:1449:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fbb9ce0fab0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fbb9bb3d640 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fbb9bb3d5f8 '_Traits'
|   `-RecordType 0x7fbb9c0d8960 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fbb9d215b48 'char_traits'
|-TypedefDecl 0x7fbb9ce0ff20 <line:1450:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fbb9ce0fed0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fbb9d217690 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fbb9d215ea8 'int_type'
|     `-BuiltinType 0x7fbb9b833bc0 'int'
|-TypedefDecl 0x7fbb9ce0fff0 <line:1451:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fbb9ce0ffa0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fbb9d4d0000 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fbb9d215f78 'pos_type'
|     `-TypedefType 0x7fbb9d20c110 'std::__1::streampos' sugar
|       |-Typedef 0x7fbb9c0de7b8 'streampos'
|       `-TemplateSpecializationType 0x7fbb9c0de710 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fbb9c0de6f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fbb9c0de600 'fpos'
|-TypedefDecl 0x7fbb9ce100c0 <line:1452:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fbb9ce10070 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fbb9d4d00f0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fbb9d215f10 'off_type'
|     `-TypedefType 0x7fbb9d20c080 'std::__1::streamoff' sugar
|       |-Typedef 0x7fbb9c0deb58 'streamoff'
|       `-BuiltinType 0x7fbb9b833c00 'long long'
|-CXXConstructorDecl 0x7fbb9ce10340 <line:1455:5, line:1458:6> line:1456:14 basic_iostream 'void (basic_streambuf<std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7fbb9ce10238 <col:29, col:70> col:70 __sb 'basic_streambuf<std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fbb9ce10428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXDestructorDecl 0x7fbb9ce104a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1460:5, col:29> col:13 used ~basic_iostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fbb9ce10550 <line:1461:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fbb9ce106a0 <line:1463:5, line:1464:42> col:5 basic_iostream 'void (class std::__1::basic_iostream<char> &&)' inline
| |-ParmVarDecl 0x7fbb9ce105b8 <col:20, col:37> col:37 __rhs 'class std::__1::basic_iostream<char> &&'
| `-AlwaysInlineAttr 0x7fbb9ce10760 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fbb9ce108b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1467:5, line:1468:53> col:21 operator= 'class std::__1::basic_iostream<char> &(class std::__1::basic_iostream<char> &&)' inline
| |-ParmVarDecl 0x7fbb9ce107e8 <col:31, col:48> col:48 __rhs 'class std::__1::basic_iostream<char> &&'
| `-AlwaysInlineAttr 0x7fbb9ce10960 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fbb9ce10a80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1470:5, line:1472:59> line:1471:10 swap 'void (class std::__1::basic_iostream<char> &)' inline
| |-ParmVarDecl 0x7fbb9ce109b8 <col:15, col:31> col:31 __rhs 'class std::__1::basic_iostream<char> &'
| `-AlwaysInlineAttr 0x7fbb9ce10b30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-AccessSpecDecl 0x7fbb9ce10b78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1473:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fbb9ce10c08 <line:1683:64> col:64 implicit basic_iostream 'void (const class std::__1::basic_iostream<char> &)' inline default_delete noexcept-unevaluated 0x7fbb9ce10c08
| `-ParmVarDecl 0x7fbb9ce10d30 <col:64> col:64 'const class std::__1::basic_iostream<char> &'
`-CXXMethodDecl 0x7fbb9ce10d98 <col:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::basic_iostream<char> &(const class std::__1::basic_iostream<char> &)' inline default_delete noexcept-unevaluated 0x7fbb9ce10d98
  `-ParmVarDecl 0x7fbb9ce10eb0 <col:64> col:64 'const class std::__1::basic_iostream<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_iostream" = type { %"class.std::__1::basic_istream.base", %"class.std::__1::basic_ostream.base", %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_iostream.base" = type { %"class.std::__1::basic_istream.base", %"class.std::__1::basic_ostream.base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fbb9c36b528 prev 0x7fbb9c36ad78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:83:1, line:145:1> line:83:24 referenced class locale definition
|-VisibilityAttr 0x7fbb9c36b628 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fbb9c36b670 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:83:1, col:24> col:24 implicit referenced class locale
|-AccessSpecDecl 0x7fbb9c36b708 <line:85:1, col:7> col:1 public
|-CXXRecordDecl 0x7fbb9c36b760 <line:87:5, col:28> col:28 referenced class facet
| `-VisibilityAttr 0x7fbb9c36b820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fbb9c36b898 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:88:5, col:28> col:28 referenced class id
| `-VisibilityAttr 0x7fbb9c36b950 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-TypedefDecl 0x7fbb9c36b9b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:90:5, col:17> col:17 referenced category 'int'
| `-BuiltinType 0x7fbb9b833bc0 'int'
|-VarDecl 0x7fbb9c36ba60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1174:3, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:93:20> col:9 none 'const std::__1::locale::category':'const int' static cinit
| |-IntegerLiteral 0x7fbb9c36bbc8 <col:20> 'int' 0
| |-AvailabilityAttr 0x7fbb9c36bac0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fbb9c36bb60 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fbb9c36bc50 <col:3, /usr/include/xlocale.h:45:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:94:9 referenced collate 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7fbb9c36be20 </usr/include/xlocale.h:45:27, col:34> 'int'
| | `-BinaryOperator 0x7fbb9c36bdf8 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7fbb9c36bdb8 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7fbb9c36bdd8 <col:33> 'int' 0
| |-AvailabilityAttr 0x7fbb9c36bcb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fbb9c36bd50 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fbb9c36bea8 <col:3, /usr/include/xlocale.h:46:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:95:9 referenced ctype 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7fbb9c36c078 </usr/include/xlocale.h:46:25, col:32> 'int'
| | `-BinaryOperator 0x7fbb9c36c050 <col:26, col:31> 'int' '<<'
| |   |-IntegerLiteral 0x7fbb9c36c010 <col:26> 'int' 1
| |   `-IntegerLiteral 0x7fbb9c36c030 <col:31> 'int' 1
| |-AvailabilityAttr 0x7fbb9c36bf08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fbb9c36bfa8 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fbb9c36c100 <col:3, /usr/include/xlocale.h:48:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:96:9 referenced monetary 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7fbb9c36c2d0 </usr/include/xlocale.h:48:27, col:34> 'int'
| | `-BinaryOperator 0x7fbb9c36c2a8 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7fbb9c36c268 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7fbb9c36c288 <col:33> 'int' 3
| |-AvailabilityAttr 0x7fbb9c36c160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fbb9c36c200 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fbb9c36c358 <col:3, /usr/include/xlocale.h:49:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:97:9 referenced numeric 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7fbb9c36c528 </usr/include/xlocale.h:49:27, col:34> 'int'
| | `-BinaryOperator 0x7fbb9c36c500 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7fbb9c36c4c0 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7fbb9c36c4e0 <col:33> 'int' 4
| |-AvailabilityAttr 0x7fbb9c36c3b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fbb9c36c458 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fbb9c36c5b0 <col:3, /usr/include/xlocale.h:50:31> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:98:9 referenced time 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7fbb9c36c780 </usr/include/xlocale.h:50:24, col:31> 'int'
| | `-BinaryOperator 0x7fbb9c36c758 <col:25, col:30> 'int' '<<'
| |   |-IntegerLiteral 0x7fbb9c36c718 <col:25> 'int' 1
| |   `-IntegerLiteral 0x7fbb9c36c738 <col:30> 'int' 5
| |-AvailabilityAttr 0x7fbb9c36c610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fbb9c36c6b0 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fbb9c36c808 <col:3, /usr/include/xlocale.h:47:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:99:9 referenced messages 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7fbb9c36c9d8 </usr/include/xlocale.h:47:27, col:34> 'int'
| | `-BinaryOperator 0x7fbb9c36c9b0 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7fbb9c36c970 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7fbb9c36c990 <col:33> 'int' 2
| |-AvailabilityAttr 0x7fbb9c36c868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fbb9c36c908 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fbb9c36ca60 <col:3, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:100:61> col:9 all 'const std::__1::locale::category':'const int' static cinit
| |-BinaryOperator 0x7fbb9c36cde8 <col:15, col:61> 'int' '|'
| | |-BinaryOperator 0x7fbb9c36cd80 <col:15, col:54> 'int' '|'
| | | |-BinaryOperator 0x7fbb9c36cd18 <col:15, col:44> 'int' '|'
| | | | |-BinaryOperator 0x7fbb9c36ccb0 <col:15, col:33> 'int' '|'
| | | | | |-BinaryOperator 0x7fbb9c36cc48 <col:15, col:25> 'int' '|'
| | | | | | |-ImplicitCastExpr 0x7fbb9c36cc18 <col:15> 'std::__1::locale::category':'int' <LValueToRValue>
| | | | | | | `-DeclRefExpr 0x7fbb9c36cbc8 <col:15> 'const std::__1::locale::category':'const int' lvalue Var 0x7fbb9c36bc50 'collate' 'const std::__1::locale::category':'const int'
| | | | | | `-ImplicitCastExpr 0x7fbb9c36cc30 <col:25> 'std::__1::locale::category':'int' <LValueToRValue>
| | | | | |   `-DeclRefExpr 0x7fbb9c36cbf0 <col:25> 'const std::__1::locale::category':'const int' lvalue Var 0x7fbb9c36bea8 'ctype' 'const std::__1::locale::category':'const int'
| | | | | `-ImplicitCastExpr 0x7fbb9c36cc98 <col:33> 'std::__1::locale::category':'int' <LValueToRValue>
| | | | |   `-DeclRefExpr 0x7fbb9c36cc70 <col:33> 'const std::__1::locale::category':'const int' lvalue Var 0x7fbb9c36c100 'monetary' 'const std::__1::locale::category':'const int'
| | | | `-ImplicitCastExpr 0x7fbb9c36cd00 <col:44> 'std::__1::locale::category':'int' <LValueToRValue>
| | | |   `-DeclRefExpr 0x7fbb9c36ccd8 <col:44> 'const std::__1::locale::category':'const int' lvalue Var 0x7fbb9c36c358 'numeric' 'const std::__1::locale::category':'const int'
| | | `-ImplicitCastExpr 0x7fbb9c36cd68 <col:54> 'std::__1::locale::category':'int' <LValueToRValue>
| | |   `-DeclRefExpr 0x7fbb9c36cd40 <col:54> 'const std::__1::locale::category':'const int' lvalue Var 0x7fbb9c36c5b0 'time' 'const std::__1::locale::category':'const int'
| | `-ImplicitCastExpr 0x7fbb9c36cdd0 <col:61> 'std::__1::locale::category':'int' <LValueToRValue>
| |   `-DeclRefExpr 0x7fbb9c36cda8 <col:61> 'const std::__1::locale::category':'const int' lvalue Var 0x7fbb9c36c808 'messages' 'const std::__1::locale::category':'const int'
| |-AvailabilityAttr 0x7fbb9c36cac0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fbb9c36cb60 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-CXXConstructorDecl 0x7fbb9c36cf20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:103:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:103:5 locale 'void (void) noexcept'
|-CXXConstructorDecl 0x7fbb9c36d0e8 <line:104:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:104:5 referenced locale 'void (const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7fbb9c36cfd8 <col:12, col:24> col:25 'const class std::__1::locale &'
|-CXXConstructorDecl 0x7fbb9c36d238 <line:105:5, col:32> col:14 locale 'void (const char *)'
| `-ParmVarDecl 0x7fbb9c36d1b0 <col:21, col:31> col:32 'const char *'
|-CXXConstructorDecl 0x7fbb9c36d380 <line:106:5, col:34> col:14 locale 'void (const std::__1::string &)'
| `-ParmVarDecl 0x7fbb9c36d2f8 <col:21, col:33> col:34 'const std::__1::string &'
|-CXXConstructorDecl 0x7fbb9c36d660 <line:107:5, col:48> col:5 locale 'void (const class std::__1::locale &, const char *, std::__1::locale::category)'
| |-ParmVarDecl 0x7fbb9c36d440 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7fbb9c36d4b8 <col:27, col:37> col:38 'const char *'
| `-ParmVarDecl 0x7fbb9c36d528 <col:40> col:48 'std::__1::locale::category':'int'
|-CXXConstructorDecl 0x7fbb9c36d940 <line:108:5, col:50> col:5 locale 'void (const class std::__1::locale &, const std::__1::string &, std::__1::locale::category)'
| |-ParmVarDecl 0x7fbb9c36d730 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7fbb9c36d7a0 <col:27, col:39> col:40 'const std::__1::string &'
| `-ParmVarDecl 0x7fbb9c36d810 <col:42> col:50 'std::__1::locale::category':'int'
|-FunctionTemplateDecl 0x7fbb9c36dd18 <line:109:5, line:110:64> col:35 locale
| |-TemplateTypeParmDecl 0x7fbb9c36da00 <line:109:15, col:21> col:21 referenced class depth 0 index 0 _Facet
| `-CXXConstructorDecl 0x7fbb9c36dc70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:110:64> col:35 locale 'void (const class std::__1::locale &, _Facet *)'
|   |-ParmVarDecl 0x7fbb9c36dac0 <col:42, col:54> col:55 'const class std::__1::locale &'
|   |-ParmVarDecl 0x7fbb9c36db58 <col:57, col:63> col:64 '_Facet *'
|   |-AlwaysInlineAttr 0x7fbb9c36dd78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|   `-VisibilityAttr 0x7fbb9c36ddc0 <col:51, col:74> Hidden
|-CXXConstructorDecl 0x7fbb9c36dff0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:111:5, col:50> col:5 locale 'void (const class std::__1::locale &, const class std::__1::locale &, std::__1::locale::category)'
| |-ParmVarDecl 0x7fbb9c36dde0 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7fbb9c36de50 <col:27, col:39> col:40 'const class std::__1::locale &'
| `-ParmVarDecl 0x7fbb9c36dec0 <col:42> col:50 'std::__1::locale::category':'int'
|-CXXDestructorDecl 0x7fbb9c36e100 <line:113:5, col:13> col:5 referenced ~locale 'void (void) noexcept'
|-CXXMethodDecl 0x7fbb9c36e2b8 <line:115:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:115:19 operator= 'const class std::__1::locale &(const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7fbb9c36e1b0 <col:29, col:41> col:42 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7fbb9c36e5a8 <line:117:5, line:119:37> col:14 combine
| |-TemplateTypeParmDecl 0x7fbb9c36e358 <line:117:15, col:21> col:21 class depth 0 index 0 _Facet
| `-CXXMethodDecl 0x7fbb9c36e510 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:119:37> col:14 combine 'class std::__1::locale (const class std::__1::locale &) const' inline
|   |-ParmVarDecl 0x7fbb9c36e420 <col:22, col:34> col:35 'const class std::__1::locale &'
|   `-VisibilityAttr 0x7fbb9c36e600 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:644:40, col:63> Hidden
|-CXXMethodDecl 0x7fbb9c36e668 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:122:5, col:19> col:12 name 'std::__1::string (void) const'
|-CXXMethodDecl 0x7fbb9c36e7d0 <line:123:5, col:36> col:10 used operator== '_Bool (const class std::__1::locale &) const'
| `-ParmVarDecl 0x7fbb9c36e710 <col:21, col:33> col:34 'const class std::__1::locale &'
|-CXXMethodDecl 0x7fbb9c36e908 <line:124:5, col:70> col:10 operator!= '_Bool (const class std::__1::locale &) const'
| |-ParmVarDecl 0x7fbb9c36e880 <col:21, col:35> col:35 used __y 'const class std::__1::locale &'
| `-CompoundStmt 0x7fbb9c371620 <col:46, col:70>
|   `-ReturnStmt 0x7fbb9c371608 <col:47, col:68>
|     `-UnaryOperator 0x7fbb9c3715e8 <col:54, col:68> '_Bool' prefix '!'
|       `-ParenExpr 0x7fbb9c3715c8 <col:55, col:68> '_Bool'
|         `-CXXOperatorCallExpr 0x7fbb9c371580 <col:56, col:65> '_Bool'
|           |-ImplicitCastExpr 0x7fbb9c371568 <col:62> '_Bool (*)(const class std::__1::locale &) const' <FunctionToPointerDecay>
|           | `-DeclRefExpr 0x7fbb9c371510 <col:62> '_Bool (const class std::__1::locale &) const' lvalue CXXMethod 0x7fbb9c36e7d0 'operator==' '_Bool (const class std::__1::locale &) const'
|           |-UnaryOperator 0x7fbb9c370240 <col:56, col:57> 'const class std::__1::locale' lvalue prefix '*'
|           | `-CXXThisExpr 0x7fbb9c370228 <col:57> 'const class std::__1::locale *' this
|           `-DeclRefExpr 0x7fbb9c370260 <col:65> 'const class std::__1::locale' lvalue ParmVar 0x7fbb9c36e880 '__y' 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7fbb9c36f098 <line:125:5, line:128:73> line:127:12 operator()
| |-TemplateTypeParmDecl 0x7fbb9c36e9a8 <line:125:15, col:21> col:21 referenced class depth 0 index 0 _CharT
| |-TemplateTypeParmDecl 0x7fbb9c36ea18 <col:29, col:35> col:35 referenced class depth 0 index 1 _Traits
| |-TemplateTypeParmDecl 0x7fbb9c36ea88 <col:44, col:50> col:50 referenced class depth 0 index 2 _Allocator
| `-CXXMethodDecl 0x7fbb9c36f000 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:128:73> line:127:12 operator() '_Bool (const basic_string<_CharT, _Traits, _Allocator> &, const basic_string<_CharT, _Traits, _Allocator> &) const' inline
|   |-ParmVarDecl 0x7fbb9c36ecf0 <col:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   |-ParmVarDecl 0x7fbb9c36eef0 <line:128:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   `-VisibilityAttr 0x7fbb9c36f0f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:644:40, col:63> Hidden
|-CXXMethodDecl 0x7fbb9c36f210 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:131:5, col:39> col:19 global 'class std::__1::locale (const class std::__1::locale &)' static
| `-ParmVarDecl 0x7fbb9c36f150 <col:26, col:38> col:39 'const class std::__1::locale &'
|-CXXMethodDecl 0x7fbb9c36f300 <line:132:5, col:34> col:26 classic 'const class std::__1::locale &(void)' static
|-AccessSpecDecl 0x7fbb9c36f398 <line:134:1, col:8> col:1 private
|-CXXRecordDecl 0x7fbb9c36f3c0 <line:135:5, col:11> col:11 referenced class __imp
|-FieldDecl 0x7fbb9c36f4b8 <line:136:5, col:12> col:12 __locale_ 'class std::__1::locale::__imp *'
|-CXXMethodDecl 0x7fbb9c36f700 <line:138:5, col:52> col:10 referenced __install_ctor 'void (const class std::__1::locale &, class std::__1::locale::facet *, long)'
| |-ParmVarDecl 0x7fbb9c36f510 <col:25, col:37> col:38 'const class std::__1::locale &'
| |-ParmVarDecl 0x7fbb9c36f5a8 <col:40, col:45> col:46 'class std::__1::locale::facet *'
| `-ParmVarDecl 0x7fbb9c36f620 <col:48> col:52 'long'
|-CXXMethodDecl 0x7fbb9c36f830 <line:139:5, col:29> col:20 __global 'class std::__1::locale &(void)' static
|-CXXMethodDecl 0x7fbb9c36f9d0 <line:140:5, col:25> col:10 referenced has_facet '_Bool (class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7fbb9c36f908 <col:20, col:22> col:23 'class std::__1::locale::id &'
|-CXXMethodDecl 0x7fbb9c36fb70 <line:141:5, col:33> col:18 referenced use_facet 'const class std::__1::locale::facet *(class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7fbb9c36fa80 <col:28, col:30> col:31 'class std::__1::locale::id &'
|-FriendDecl 0x7fbb9c36fe98 <line:143:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:143:41
| `-FunctionTemplateDecl 0x7fbb9c36fdd8 parent 0x7fbb9c36ace0 prev 0x7fbb9c36b110 <col:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:143:41 has_facet
|   |-TemplateTypeParmDecl 0x7fbb9c36fc10 <col:15, col:21> col:21 class depth 0 index 0 _Facet
|   `-FunctionDecl 0x7fbb9c36fd30 parent 0x7fbb9c36ace0 prev 0x7fbb9c36b078 <col:29, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:143:41 has_facet '_Bool (const class std::__1::locale &) noexcept'
|     |-ParmVarDecl 0x7fbb9c36fca0 <col:51, col:63> col:64 'const class std::__1::locale &'
|     |-AlwaysInlineAttr 0x7fbb9c36fe78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|     `-VisibilityAttr 0x7fbb9c36fe88 <col:51, col:74> Inherited Hidden
`-FriendDecl 0x7fbb9c3701b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:144:5, col:73> col:50
  `-FunctionTemplateDecl 0x7fbb9c3700f8 parent 0x7fbb9c36ace0 prev 0x7fbb9c36b448 <col:5, col:73> col:50 use_facet
    |-TemplateTypeParmDecl 0x7fbb9c36fed0 <col:15, col:21> col:21 referenced class depth 0 index 0 _Facet
    `-FunctionDecl 0x7fbb9c370050 parent 0x7fbb9c36ace0 prev 0x7fbb9c36b3b0 <col:29, col:73> col:50 use_facet 'const _Facet &(const class std::__1::locale &)'
      |-ParmVarDecl 0x7fbb9c36ff60 <col:60, col:72> col:73 'const class std::__1::locale &'
      |-AlwaysInlineAttr 0x7fbb9c370198 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
      `-VisibilityAttr 0x7fbb9c3701a8 <col:51, col:74> Inherited Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  NonVirtualBaseLLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fbb9c0d90d8 parent 0x7fbb9c0cfc88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:483:84> col:64 class basic_streambuf definition
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fbb9d4cfc28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fbb9d4cfce8 prev 0x7fbb9c0d90d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:125:1, col:28> col:28 implicit class basic_streambuf
|-AccessSpecDecl 0x7fbb9d4cfd80 <line:127:1, col:7> col:1 public
|-TypedefDecl 0x7fbb9d4cfde8 <line:129:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fbb9d4cfdb0 'char' sugar
|   |-TemplateTypeParmType 0x7fbb9cd0c360 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fbb9cd0c318 '_CharT'
|   `-BuiltinType 0x7fbb9b833b60 'char'
|-TypedefDecl 0x7fbb9d4cfe78 <line:130:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fbb9d4cfe40 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fbb9cd0c3d0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fbb9cd0c388 '_Traits'
|   `-RecordType 0x7fbb9c0d8960 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fbb9d215b48 'char_traits'
|-TypedefDecl 0x7fbb9d4cff80 <line:131:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fbb9d4cff30 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fbb9d217690 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fbb9d215ea8 'int_type'
|     `-BuiltinType 0x7fbb9b833bc0 'int'
|-TypedefDecl 0x7fbb9d4d0070 <line:132:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fbb9d4d0020 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fbb9d4d0000 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fbb9d215f78 'pos_type'
|     `-TypedefType 0x7fbb9d20c110 'std::__1::streampos' sugar
|       |-Typedef 0x7fbb9c0de7b8 'streampos'
|       `-TemplateSpecializationType 0x7fbb9c0de710 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fbb9c0de6f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fbb9c0de600 'fpos'
|-TypedefDecl 0x7fbb9d4d0160 <line:133:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fbb9d4d0110 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fbb9d4d00f0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fbb9d215f10 'off_type'
|     `-TypedefType 0x7fbb9d20c080 'std::__1::streamoff' sugar
|       |-Typedef 0x7fbb9c0deb58 'streamoff'
|       `-BuiltinType 0x7fbb9b833c00 'long long'
|-CXXDestructorDecl 0x7fbb9d4d01e8 <line:135:5, col:30> col:13 ~basic_streambuf 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7fbb9d4d0320 <line:138:5, line:144:5> line:139:12 pubimbue 'class std::__1::locale (const class std::__1::locale &)' inline
| |-ParmVarDecl 0x7fbb9d4d0298 <col:21, col:35> col:35 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7fbb9d4d03f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9d4d0440 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:146:5, line:147:44> col:12 getloc 'class std::__1::locale (void) const' inline
| `-AlwaysInlineAttr 0x7fbb9d4d04e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9d4d0700 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:150:5, line:152:32> line:151:22 pubsetbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7fbb9d4d0588 <col:32, col:43> col:43 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fbb9d4d05e8 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7fbb9d4d07b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9d4d0a40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:154:5, line:157:46> line:155:14 referenced pubseekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7fbb9d4d0850 <col:25, col:34> col:34 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7fbb9d4d08b0 <col:41, col:59> col:59 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| |-ParmVarDecl 0x7fbb9d4d0910 <line:156:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7fbb9d4d0b00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9d4d0cd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:159:5, line:162:38> line:160:14 referenced pubseekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7fbb9d4d0b58 <col:25, col:34> col:34 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| |-ParmVarDecl 0x7fbb9d4d0bb8 <line:161:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7fbb9d4d0d88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9d4d0dd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:164:5, line:165:36> col:9 referenced pubsync 'int (void)' inline
| `-AlwaysInlineAttr 0x7fbb9d4d0e78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9d4d0ec0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:169:5, line:174:5> line:170:16 in_avail 'std::__1::streamsize (void)' inline
| `-AlwaysInlineAttr 0x7fbb9d4d0f68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9d4d1020 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:176:5, line:181:5> line:177:14 snextc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7fbb9d4d10c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9d4d1130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:183:5, line:188:5> line:184:14 sbumpc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7fbb9d4d11d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9d4d1240 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:190:5, line:195:5> line:191:14 sgetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7fbb9d4d12e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9d4d14b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:197:5, line:199:32> line:198:16 referenced sgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7fbb9d4d1340 <col:22, col:33> col:33 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fbb9d4d13a0 <col:38, col:49> col:49 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7fbb9d4d1568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9d4d1680 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:202:5, line:207:5> line:203:14 sputbackc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7fbb9d4d15c0 <col:24, col:34> col:34 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7fbb9d4d1730 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9d4d1798 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:209:5, line:214:5> line:210:14 sungetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7fbb9d4d1840 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9d4d1920 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:217:5, line:223:5> line:218:14 sputc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7fbb9d4d1898 <col:20, col:30> col:30 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7fbb9d4d19d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9d4d1bd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:225:5, line:227:32> line:226:16 referenced sputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7fbb9d4d1a58 <col:22, col:39> col:39 __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fbb9d4d1ab8 <col:44, col:55> col:55 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7fbb9d4d1c88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-AccessSpecDecl 0x7fbb9d4d1cd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:229:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fbb9d4d1d38 <line:230:5, col:21> col:5 basic_streambuf 'void (void)'
|-CXXConstructorDecl 0x7fbb9d4d1f10 <line:231:5, col:49> col:5 basic_streambuf 'void (const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7fbb9d4d1e28 <col:21, col:44> col:44 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7fbb9d4d20d0 <line:232:5, col:60> col:22 operator= 'class std::__1::basic_streambuf<char> &(const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7fbb9d4d2008 <col:32, col:55> col:55 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7fbb9d4d2250 <line:233:5, col:37> col:10 swap 'void (class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7fbb9d4d2190 <col:15, col:32> col:32 __rhs 'class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7fbb9d4d2380 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:236:68> col:38 eback 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fbb9d4d2428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9d4d2490 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:237:68> col:38 gptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fbb9d4d2538 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9d4d25a0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:238:68> col:38 egptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fbb9d4d2648 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9d4d2718 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:240:5, line:241:43> col:10 gbump 'void (int)' inline
| |-ParmVarDecl 0x7fbb9d4d2690 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7fbb9d4d27c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9d4d2a30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:243:5, line:248:5> line:244:10 setg 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7fbb9d4d2820 <col:15, col:26> col:26 __gbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fbb9d4d2890 <col:34, col:45> col:45 __gnext 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fbb9d4d2900 <col:54, col:65> col:65 __gend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7fbb9d4d2af0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9d4d2b58 <line:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:251:68> col:38 pbase 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fbb9d4d2c00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9d4d2c68 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:252:68> col:38 pptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fbb9d4d2d10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9d4d2d78 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:253:68> col:38 epptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fbb9d4d2e20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fbb9d4d2ef0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:255:5, line:256:43> col:10 pbump 'void (int)' inline
| |-ParmVarDecl 0x7fbb9d4d2e68 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7fbb9d4d2fa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9d4d3180 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:258:5, line:262:5> line:259:10 setp 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7fbb9d4d2ff8 <col:15, col:26> col:26 __pbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fbb9d4d3068 <col:34, col:45> col:45 __pend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7fbb9d4d3238 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fbb9d4d3308 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:266:5, col:43> col:18 imbue 'void (const class std::__1::locale &)' virtual
| `-ParmVarDecl 0x7fbb9d4d3280 <col:24, col:38> col:38 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7fbb9d4d34b8 <line:269:5, col:67> col:30 setbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7fbb9d4d33c8 <col:37, col:48> col:48 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fbb9d4d3428 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fbb9d4d36d8 <line:270:5, line:271:87> line:270:22 seekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7fbb9d4d3580 <col:30, col:39> col:39 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7fbb9d4d35e0 <col:46, col:64> col:64 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-ParmVarDecl 0x7fbb9d4d3640 <line:271:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fbb9d4d3898 <line:272:5, line:273:87> line:272:22 seekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7fbb9d4d37a8 <col:30, col:39> col:39 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ParmVarDecl 0x7fbb9d4d3808 <line:273:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fbb9d4d3950 <line:274:5, col:22> col:17 sync 'int (void)' virtual
|-CXXMethodDecl 0x7fbb9d4d39f8 <line:277:5, col:34> col:24 showmanyc 'std::__1::streamsize (void)' virtual
|-CXXMethodDecl 0x7fbb9d4d3ba0 <line:278:5, col:61> col:24 xsgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7fbb9d4d3ab0 <col:31, col:42> col:42 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fbb9d4d3b10 <col:47, col:58> col:58 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fbb9d4d3c78 <line:279:5, col:32> col:22 underflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7fbb9d4d3d40 <line:280:5, col:28> col:22 uflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7fbb9d4d3ec0 <line:283:5, col:65> col:22 pbackfail 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7fbb9d4d3df8 <col:32, col:64> col:41 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7fbb9d4d4070 <line:286:5, col:67> col:24 xsputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7fbb9d4d3f80 <col:31, col:48> col:48 __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fbb9d4d3fe0 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fbb9d4d41c0 <line:287:5, col:64> col:22 overflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7fbb9d4d4138 <col:31, col:63> col:40 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-AccessSpecDecl 0x7fbb9d4d4270 <line:289:1, col:8> col:1 private
|-FieldDecl 0x7fbb9d4d4298 <line:290:5, col:12> col:12 __loc_ 'class std::__1::locale'
|-FieldDecl 0x7fbb9d4d42f0 <line:291:5, col:16> col:16 __binp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fbb9d4d4348 <line:292:5, col:16> col:16 __ninp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fbb9d4d43a0 <line:293:5, col:16> col:16 __einp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fbb9d4d43f8 <line:294:5, col:16> col:16 __bout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fbb9d4d4450 <line:295:5, col:16> col:16 __nout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
`-FieldDecl 0x7fbb9d4d44a8 <line:296:5, col:16> col:16 __eout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct __sbuf
         0 |   unsigned char * _base
         8 |   int _size
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __sFILE
         0 |   unsigned char * _p
         8 |   int _r
        12 |   int _w
        16 |   short _flags
        18 |   short _file
        24 |   struct __sbuf _bf
        24 |     unsigned char * _base
        32 |     int _size
        40 |   int _lbfsize
        48 |   void * _cookie
        56 |   int (* _Nullable)(void *) _close
        64 |   int (* _Nullable)(void *, char *, int) _read
        72 |   fpos_t (* _Nullable)(void *, fpos_t, int) _seek
        80 |   int (* _Nullable)(void *, const char *, int) _write
        88 |   struct __sbuf _ub
        88 |     unsigned char * _base
        96 |     int _size
       104 |   struct __sFILEX * _extra
       112 |   int _ur
       116 |   unsigned char [3] _ubuf
       119 |   unsigned char [1] _nbuf
       120 |   struct __sbuf _lb
       120 |     unsigned char * _base
       128 |     int _size
       136 |   int _blksize
       144 |   fpos_t _offset
           | [sizeof=152, dsize=152, align=8,
           |  nvsize=152, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fbb9c06ef58 </usr/include/stdio.h:88:1, line:91:1> line:88:8 struct __sbuf definition
|-CXXRecordDecl 0x7fbb9c06f078 <col:1, col:8> col:8 implicit struct __sbuf
|-FieldDecl 0x7fbb9c06f150 <line:89:2, col:17> col:17 _base 'unsigned char *'
`-FieldDecl 0x7fbb9c06f1b0 <line:90:2, col:7> col:7 _size 'int'

Layout: <CGRecordLayout
  LLVMType:%struct.__sbuf = type { i8*, i32 }
  NonVirtualBaseLLVMType:%struct.__sbuf = type { i8*, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fbb9c06f2d0 </usr/include/stdio.h:122:9, line:153:1> line:122:16 struct __sFILE definition
|-CXXRecordDecl 0x7fbb9c06f3f8 <col:9, col:16> col:16 implicit struct __sFILE
|-FieldDecl 0x7fbb9c06f4a8 <line:123:2, col:17> col:17 referenced _p 'unsigned char *'
|-FieldDecl 0x7fbb9c06f508 <line:124:2, col:6> col:6 _r 'int'
|-FieldDecl 0x7fbb9c06f568 <line:125:2, col:6> col:6 referenced _w 'int'
|-FieldDecl 0x7fbb9c06f5c8 <line:126:2, col:8> col:8 _flags 'short'
|-FieldDecl 0x7fbb9c06f628 <line:127:2, col:8> col:8 _file 'short'
|-FieldDecl 0x7fbb9c06f6c0 <line:128:2, col:16> col:16 _bf 'struct __sbuf':'struct __sbuf'
|-FieldDecl 0x7fbb9c06f720 <line:129:2, col:6> col:6 referenced _lbfsize 'int'
|-FieldDecl 0x7fbb9c06f780 <line:132:2, col:8> col:8 _cookie 'void *'
|-FieldDecl 0x7fbb9c071600 <line:133:2, col:19> col:19 _close 'int (* _Nullable)(void *)':'int (*)(void *)'
|-FieldDecl 0x7fbb9c071928 <line:134:2, col:19> col:19 _read 'int (* _Nullable)(void *, char *, int)':'int (*)(void *, char *, int)'
|-FieldDecl 0x7fbb9c071cb0 <line:135:2, col:22> col:22 _seek 'fpos_t (* _Nullable)(void *, fpos_t, int)':'fpos_t (*)(void *, fpos_t, int)'
|-FieldDecl 0x7fbb9c071fd8 <line:136:2, col:19> col:19 _write 'int (* _Nullable)(void *, const char *, int)':'int (*)(void *, const char *, int)'
|-FieldDecl 0x7fbb9c072040 <line:139:2, col:16> col:16 _ub 'struct __sbuf':'struct __sbuf'
|-FieldDecl 0x7fbb9c072140 <line:140:2, col:19> col:19 _extra 'struct __sFILEX *'
|-FieldDecl 0x7fbb9c0721a0 <line:141:2, col:6> col:6 _ur 'int'
|-FieldDecl 0x7fbb9c072270 <line:144:2, col:23> col:16 _ubuf 'unsigned char [3]'
|-FieldDecl 0x7fbb9c072340 <line:145:2, col:23> col:16 _nbuf 'unsigned char [1]'
|-FieldDecl 0x7fbb9c0723a8 <line:148:2, col:16> col:16 _lb 'struct __sbuf':'struct __sbuf'
|-FieldDecl 0x7fbb9c072408 <line:151:2, col:6> col:6 _blksize 'int'
`-FieldDecl 0x7fbb9c072460 <line:152:2, col:9> col:9 _offset 'fpos_t':'long long'

Layout: <CGRecordLayout
  LLVMType:%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
  NonVirtualBaseLLVMType:%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::__shared_count
         0 |   (__shared_count vtable pointer)
         8 |   long __shared_owners_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fbb9ca95380 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3410:1, line:3448:1> line:3410:24 referenced class __shared_count definition
|-VisibilityAttr 0x7fbb9ca954a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fbb9ca954f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3410:1, col:24> col:24 implicit referenced class __shared_count
|-CXXConstructorDecl 0x7fbb9ca956e0 <line:3412:5, col:41> col:5 __shared_count 'void (const class std::__1::__shared_count &)'
| `-ParmVarDecl 0x7fbb9ca955c8 <col:20, col:40> col:41 'const class std::__1::__shared_count &'
|-CXXMethodDecl 0x7fbb9ca95890 <line:3413:5, col:52> col:21 operator= 'class std::__1::__shared_count &(const class std::__1::__shared_count &)'
| `-ParmVarDecl 0x7fbb9ca957a0 <col:31, col:51> col:52 'const class std::__1::__shared_count &'
|-AccessSpecDecl 0x7fbb9ca95930 <line:3415:1, col:10> col:1 protected
|-FieldDecl 0x7fbb9ca95970 <line:3416:5, col:10> col:10 referenced __shared_owners_ 'long'
|-CXXDestructorDecl 0x7fbb9ca95a08 <line:3417:5, col:29> col:13 used ~__shared_count 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fbb9ca95aa8 <line:3418:1, col:8> col:1 private
|-CXXMethodDecl 0x7fbb9ca95af8 <line:3419:5, col:49> col:18 referenced __on_zero_shared 'void (void) noexcept' virtual pure
|-AccessSpecDecl 0x7fbb9ca95b90 <line:3421:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fbb9ca95cc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3424:37> line:3423:14 used __shared_count 'void (long) noexcept'
| |-ParmVarDecl 0x7fbb9ca95c00 <col:29, col:43> col:34 used __refs 'long' cinit
| | `-ImplicitCastExpr 0x7fbb9ca96298 <col:43> 'long' <IntegralCast>
| |   `-IntegerLiteral 0x7fbb9ca96278 <col:43> 'int' 0
| |-CXXCtorInitializer Field 0x7fbb9ca95970 '__shared_owners_' 'long'
| | `-ImplicitCastExpr 0x7fbb9ca96308 <line:3424:28> 'long' <LValueToRValue>
| |   `-DeclRefExpr 0x7fbb9ca962b0 <col:28> 'long' lvalue ParmVar 0x7fbb9ca95c00 '__refs' 'long'
| |-CompoundStmt 0x7fbb9ca96350 <col:36, col:37>
| |-AlwaysInlineAttr 0x7fbb9ca95d78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9ca95dc0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9ca95e28 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3434:5> line:3432:10 used __add_shared 'void (void) noexcept'
| |-CompoundStmt 0x7fbb9ca968a0 <col:35, line:3434:5>
| | `-CallExpr 0x7fbb9ca96870 <line:3433:7, col:58> 'long':'long'
| |   |-ImplicitCastExpr 0x7fbb9ca96858 <col:7> 'long (*)(long &) noexcept' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7fbb9ca967c8 <col:7> 'long (long &) noexcept' lvalue Function 0x7fbb9ca96688 '__libcpp_atomic_refcount_increment' 'long (long &) noexcept' (FunctionTemplate 0x7fbb9ca93ad0 '__libcpp_atomic_refcount_increment')
| |   `-MemberExpr 0x7fbb9ca963d8 <col:42> 'long' lvalue ->__shared_owners_ 0x7fbb9ca95970
| |     `-CXXThisExpr 0x7fbb9ca963c0 <col:42> 'class std::__1::__shared_count *' this
| |-AlwaysInlineAttr 0x7fbb9ca95ec0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9ca95f08 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fbb9ca95f70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3442:5> line:3436:10 used __release_shared '_Bool (void) noexcept'
| |-CompoundStmt 0x7fbb9ca96f08 <col:39, line:3442:5>
| | |-IfStmt 0x7fbb9ca96ea0 <line:3437:7, line:3440:7>
| | | |-<<<NULL>>>
| | | |-<<<NULL>>>
| | | |-BinaryOperator 0x7fbb9ca96da8 <line:3437:11, col:68> '_Bool' '=='
| | | | |-CallExpr 0x7fbb9ca96d20 <col:11, col:62> 'long':'long'
| | | | | |-ImplicitCastExpr 0x7fbb9ca96d08 <col:11> 'long (*)(long &) noexcept' <FunctionToPointerDecay>
| | | | | | `-DeclRefExpr 0x7fbb9ca96ca8 <col:11> 'long (long &) noexcept' lvalue Function 0x7fbb9ca96b68 '__libcpp_atomic_refcount_decrement' 'long (long &) noexcept' (FunctionTemplate 0x7fbb9ca93fe0 '__libcpp_atomic_refcount_decrement')
| | | | | `-MemberExpr 0x7fbb9ca96930 <col:46> 'long' lvalue ->__shared_owners_ 0x7fbb9ca95970
| | | | |   `-CXXThisExpr 0x7fbb9ca96918 <col:46> 'class std::__1::__shared_count *' this
| | | | `-ImplicitCastExpr 0x7fbb9ca96d90 <col:67, col:68> 'long' <IntegralCast>
| | | |   `-UnaryOperator 0x7fbb9ca96d70 <col:67, col:68> 'int' prefix '-'
| | | |     `-IntegerLiteral 0x7fbb9ca96d50 <col:68> 'int' 1
| | | |-CompoundStmt 0x7fbb9ca96e78 <col:71, line:3440:7>
| | | | |-CXXMemberCallExpr 0x7fbb9ca96e20 <line:3438:9, col:26> 'void'
| | | | | `-MemberExpr 0x7fbb9ca96de8 <col:9> '<bound member function type>' ->__on_zero_shared 0x7fbb9ca95af8
| | | | |   `-CXXThisExpr 0x7fbb9ca96dd0 <col:9> 'class std::__1::__shared_count *' this
| | | | `-ReturnStmt 0x7fbb9ca96e60 <line:3439:9, col:16>
| | | |   `-CXXBoolLiteralExpr 0x7fbb9ca96e48 <col:16> '_Bool' true
| | | `-<<<NULL>>>
| | `-ReturnStmt 0x7fbb9ca96ef0 <line:3441:7, col:14>
| |   `-CXXBoolLiteralExpr 0x7fbb9ca96ed8 <col:14> '_Bool' false
| |-AlwaysInlineAttr 0x7fbb9ca96008 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9ca96050 <col:51, col:74> Hidden
`-CXXMethodDecl 0x7fbb9ca96150 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3447:5> line:3445:10 used use_count 'long (void) const noexcept'
  |-CompoundStmt 0x7fbb9ca974b8 <col:38, line:3447:5>
  | `-ReturnStmt 0x7fbb9ca974a0 <line:3446:9, col:59>
  |   `-BinaryOperator 0x7fbb9ca97478 <col:16, col:59> 'long' '+'
  |     |-CallExpr 0x7fbb9ca97410 <col:16, col:55> 'long':'long'
  |     | |-ImplicitCastExpr 0x7fbb9ca973f8 <col:16> 'long (*)(const long *)' <FunctionToPointerDecay>
  |     | | `-DeclRefExpr 0x7fbb9ca97370 <col:16> 'long (const long *)' lvalue Function 0x7fbb9ca97230 '__libcpp_relaxed_load' 'long (const long *)' (FunctionTemplate 0x7fbb9d0a1b08 '__libcpp_relaxed_load')
  |     | `-UnaryOperator 0x7fbb9ca96fd8 <col:38, col:39> 'const long *' prefix '&'
  |     |   `-MemberExpr 0x7fbb9ca96fa0 <col:39> 'const long' lvalue ->__shared_owners_ 0x7fbb9ca95970
  |     |     `-CXXThisExpr 0x7fbb9ca96f88 <col:39> 'const class std::__1::__shared_count *' this
  |     `-ImplicitCastExpr 0x7fbb9ca97460 <col:59> 'long' <IntegralCast>
  |       `-IntegerLiteral 0x7fbb9ca97440 <col:59> 'int' 1
  |-AlwaysInlineAttr 0x7fbb9ca961e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
  `-VisibilityAttr 0x7fbb9ca96230 <col:51, col:74> Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::locale::facet
         0 |   class std::__1::__shared_count (primary base)
         0 |     (__shared_count vtable pointer)
         8 |     long __shared_owners_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fbb9c371690 parent 0x7fbb9c36b528 prev 0x7fbb9c36b760 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:147:1, line:161:1> line:147:32 referenced class facet definition
|-public 'class std::__1::__shared_count'
|-VisibilityAttr 0x7fbb9c3717d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fbb9c371858 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:147:1, col:32> col:32 implicit referenced class facet
|-AccessSpecDecl 0x7fbb9c3718f0 <line:150:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fbb9c371a40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:153:56> line:152:14 used facet 'void (size_t)'
| |-ParmVarDecl 0x7fbb9c371958 <col:20, col:36> col:27 used __refs 'size_t':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7fbb9c371f58 <col:36> 'size_t':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7fbb9c371f38 <col:36> 'int' 0
| |-CXXCtorInitializer 'class std::__1::__shared_count'
| | `-CXXConstructExpr 0x7fbb9c3720b0 <line:153:11, col:53> 'class std::__1::__shared_count' 'void (long) noexcept'
| |   `-BinaryOperator 0x7fbb9c372048 <col:26, col:52> 'long' '-'
| |     |-CXXStaticCastExpr 0x7fbb9c371fe0 <col:26, col:50> 'long' static_cast<long> <NoOp>
| |     | `-ImplicitCastExpr 0x7fbb9c371fc8 <col:44> 'long' <IntegralCast>
| |     |   `-ImplicitCastExpr 0x7fbb9c371fb0 <col:44> 'size_t':'unsigned long' <LValueToRValue>
| |     |     `-DeclRefExpr 0x7fbb9c371f70 <col:44> 'size_t':'unsigned long' lvalue ParmVar 0x7fbb9c371958 '__refs' 'size_t':'unsigned long'
| |     `-ImplicitCastExpr 0x7fbb9c372030 <col:52> 'long' <IntegralCast>
| |       `-IntegerLiteral 0x7fbb9c372010 <col:52> 'int' 1
| |-CompoundStmt 0x7fbb9c372118 <col:55, col:56>
| |-AlwaysInlineAttr 0x7fbb9c371af0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fbb9c371b38 <col:51, col:74> Hidden
|-CXXDestructorDecl 0x7fbb9c371b98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:155:5, col:20> col:13 used ~facet 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fbb9c371c38 <line:159:1, col:8> col:1 private
|-CXXMethodDecl 0x7fbb9c371c88 <line:160:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:160:18 __on_zero_shared 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7fbb9c371db8 <line:147:32, <invalid sloc>> col:32 implicit operator= 'class std::__1::locale::facet &(const class std::__1::locale::facet &)' inline default_delete noexcept-unevaluated 0x7fbb9c371db8
| `-ParmVarDecl 0x7fbb9c371ed0 <col:32> col:32 'const class std::__1::locale::facet &'
`-CXXConstructorDecl 0x7fbb9c376418 <col:32> col:32 implicit facet 'void (const class std::__1::locale::facet &)' inline default_delete noexcept-unevaluated 0x7fbb9c376418
  `-ParmVarDecl 0x7fbb9c376540 <col:32> col:32 'const class std::__1::locale::facet &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
  NonVirtualBaseLLVMType:%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::codecvt_base (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fbb9ccad970 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:832:1, line:837:1> line:832:24 referenced class codecvt_base definition
|-VisibilityAttr 0x7fbb9ccada98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fbb9ccadae0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:832:1, col:24> col:24 implicit referenced class codecvt_base
|-AccessSpecDecl 0x7fbb9ccadb78 <line:834:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fbb9ccadc38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:835:43> col:27 used codecvt_base 'void (void)'
| |-CompoundStmt 0x7fbb9ccadf30 <col:42, col:43>
| |-AlwaysInlineAttr 0x7fbb9ccadce0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fbb9ccadd28 <col:48, col:71> Hidden
|-EnumDecl 0x7fbb9ccadd38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:836:5, col:44> col:10 referenced result
| |-EnumConstantDecl 0x7fbb9ccaddf0 <col:18> col:18 referenced ok 'enum std::__1::codecvt_base::result'
| |-EnumConstantDecl 0x7fbb9ccade38 <col:22> col:22 referenced partial 'enum std::__1::codecvt_base::result'
| |-EnumConstantDecl 0x7fbb9ccade80 <col:31> col:31 referenced error 'enum std::__1::codecvt_base::result'
| `-EnumConstantDecl 0x7fbb9ccadec8 <col:38> col:38 referenced noconv 'enum std::__1::codecvt_base::result'
|-CXXDestructorDecl 0x7fbb9ccb1d28 <line:832:24> col:24 implicit ~codecvt_base 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fbb9ccb1f38 <col:24> col:24 implicit constexpr codecvt_base 'void (const class std::__1::codecvt_base &)' inline default trivial noexcept-unevaluated 0x7fbb9ccb1f38
| `-ParmVarDecl 0x7fbb9ccb2060 <col:24> col:24 'const class std::__1::codecvt_base &'
`-CXXConstructorDecl 0x7fbb9ccb20f8 <col:24> col:24 implicit constexpr codecvt_base 'void (class std::__1::codecvt_base &&)' inline default trivial noexcept-unevaluated 0x7fbb9ccb20f8
  `-ParmVarDecl 0x7fbb9ccb2220 <col:24> col:24 'class std::__1::codecvt_base &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::codecvt_base" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::codecvt_base.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::codecvt<char, char, mbstate_t>
         0 |   class std::__1::locale::facet (primary base)
         0 |     class std::__1::__shared_count (primary base)
         0 |       (__shared_count vtable pointer)
         8 |       long __shared_owners_
         0 |   class std::__1::codecvt_base (base) (empty)
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fbb9ccae4b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:845:1, line:927:1> line:846:24 class codecvt definition
|-public 'class locale::facet':'class std::__1::locale::facet'
|-public 'class std::__1::codecvt_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'char'
|-TemplateArgument type '__mbstate_t'
|-VisibilityAttr 0x7fbb9ccae618 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fbb9ccae878 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:846:1, col:24> col:24 implicit referenced class codecvt
|-AccessSpecDecl 0x7fbb9ccae910 <line:850:1, col:7> col:1 public
|-TypedefDecl 0x7fbb9ccae948 <line:851:5, col:23> col:23 referenced intern_type 'char'
| `-BuiltinType 0x7fbb9b833b60 'char'
|-TypedefDecl 0x7fbb9ccae9b0 <line:852:5, col:23> col:23 referenced extern_type 'char'
| `-BuiltinType 0x7fbb9b833b60 'char'
|-TypedefDecl 0x7fbb9ccaea18 <line:853:5, col:23> col:23 referenced state_type 'mbstate_t':'__mbstate_t'
| `-TypedefType 0x7fbb9c0bf980 'mbstate_t' sugar
|   |-Typedef 0x7fbb9c0155f0 'mbstate_t'
|   `-TypedefType 0x7fbb9c0155c0 '__darwin_mbstate_t' sugar
|     |-Typedef 0x7fbb9b869f50 '__darwin_mbstate_t'
|     `-TypedefType 0x7fbb9b869f20 '__mbstate_t' sugar
|       |-Typedef 0x7fbb9b869eb0 '__mbstate_t'
|       `-ElaboratedType 0x7fbb9b869e60 'union __mbstate_t' sugar
|         `-RecordType 0x7fbb9b869c90 '__mbstate_t'
|           `-CXXRecord 0x7fbb9b869bf8 ''
|-CXXConstructorDecl 0x7fbb9ccaeb80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:857:34> line:856:14 codecvt 'void (size_t)'
| |-ParmVarDecl 0x7fbb9ccaeab0 <col:22, col:38> col:29 used __refs 'size_t':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7fbb9ccb1cd8 <col:38> 'size_t':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7fbb9ccb1cb8 <col:38> 'int' 0
| |-CXXCtorInitializer 'class locale::facet':'class std::__1::locale::facet'
| | `-CXXConstructExpr 0x7fbb9ccb1eb0 <line:857:11, col:31> 'class locale::facet':'class std::__1::locale::facet' 'void (size_t)'
| |   `-ImplicitCastExpr 0x7fbb9ccb1e98 <col:25> 'size_t':'unsigned long' <LValueToRValue>
| |     `-DeclRefExpr 0x7fbb9ccb1e10 <col:25> 'size_t':'unsigned long' lvalue ParmVar 0x7fbb9ccaeab0 '__refs' 'size_t':'unsigned long'
| |-CXXCtorInitializer 'class std::__1::codecvt_base'
| | `-CXXConstructExpr 0x7fbb9ccb2288 <line:856:14> 'class std::__1::codecvt_base' 'void (void)'
| |-CompoundStmt 0x7fbb9ccb2300 <line:857:33, col:34>
| |-AlwaysInlineAttr 0x7fbb9ccaec30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fbb9ccaec78 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fbb9ccaf310 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:865:5> line:860:12 out 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const'
| |-ParmVarDecl 0x7fbb9ccaed48 <col:16, col:28> col:28 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fbb9ccaee08 <line:861:16, col:35> col:35 used __frm 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fbb9ccaee78 <col:42, col:61> col:61 used __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fbb9ccaef50 <col:72, col:92> col:92 used __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-ParmVarDecl 0x7fbb9ccaf008 <line:862:16, col:29> col:29 used __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fbb9ccaf078 <col:35, col:48> col:48 used __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fbb9ccaf150 <col:58, col:72> col:72 used __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-CompoundStmt 0x7fbb9ccb2558 <line:863:5, line:865:5>
| | `-ReturnStmt 0x7fbb9ccb2540 <line:864:9, col:82>
| |   `-CXXMemberCallExpr 0x7fbb9ccb2480 <col:16, col:82> 'enum std::__1::codecvt_base::result'
| |     |-MemberExpr 0x7fbb9ccb2330 <col:16> '<bound member function type>' ->do_out 0x7fbb9ccb0d80
| |     | `-CXXThisExpr 0x7fbb9ccb2318 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7fbb9ccb2368 <col:23> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7fbb9ccaed48 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7fbb9ccb24e0 <col:29> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fbb9ccb2390 <col:29> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7fbb9ccaee08 '__frm' 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     |-ImplicitCastExpr 0x7fbb9ccb24f8 <col:36> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fbb9ccb23b8 <col:36> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7fbb9ccaee78 '__frm_end' 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     |-DeclRefExpr 0x7fbb9ccb23e0 <col:47> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7fbb9ccaef50 '__frm_nxt' 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |     |-ImplicitCastExpr 0x7fbb9ccb2510 <col:58> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fbb9ccb2408 <col:58> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fbb9ccaf008 '__to' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7fbb9ccb2528 <col:64> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fbb9ccb2430 <col:64> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fbb9ccaf078 '__to_end' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     `-DeclRefExpr 0x7fbb9ccb2458 <col:74> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fbb9ccaf150 '__to_nxt' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-AlwaysInlineAttr 0x7fbb9ccaf3e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fbb9ccaf428 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fbb9ccaf710 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:872:5> line:868:12 unshift 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const'
| |-ParmVarDecl 0x7fbb9ccaf478 <col:20, col:32> col:32 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fbb9ccaf4e8 <line:869:20, col:33> col:33 used __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fbb9ccaf558 <col:39, col:52> col:52 used __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fbb9ccaf5d0 <col:62, col:76> col:76 used __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-CompoundStmt 0x7fbb9ccb26f8 <line:870:5, line:872:5>
| | `-ReturnStmt 0x7fbb9ccb26e0 <line:871:9, col:57>
| |   `-CXXMemberCallExpr 0x7fbb9ccb2668 <col:16, col:57> 'enum std::__1::codecvt_base::result'
| |     |-MemberExpr 0x7fbb9ccb2590 <col:16> '<bound member function type>' ->do_unshift 0x7fbb9ccb14d8
| |     | `-CXXThisExpr 0x7fbb9ccb2578 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7fbb9ccb25c8 <col:27> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7fbb9ccaf478 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7fbb9ccb26b0 <col:33> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fbb9ccb25f0 <col:33> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fbb9ccaf4e8 '__to' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7fbb9ccb26c8 <col:39> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fbb9ccb2618 <col:39> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fbb9ccaf558 '__to_end' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     `-DeclRefExpr 0x7fbb9ccb2640 <col:49> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fbb9ccaf5d0 '__to_nxt' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-AlwaysInlineAttr 0x7fbb9ccaf7c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fbb9ccaf810 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fbb9ccafce0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:880:5> line:875:12 in 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *&) const'
| |-ParmVarDecl 0x7fbb9ccaf860 <col:15, col:27> col:27 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fbb9ccaf8f8 <line:876:15, col:34> col:34 used __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fbb9ccaf968 <col:41, col:60> col:60 used __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fbb9ccafa10 <col:71, col:91> col:91 used __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-ParmVarDecl 0x7fbb9ccafaa8 <line:877:15, col:28> col:28 used __to 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fbb9ccafb18 <col:34, col:47> col:47 used __to_end 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fbb9ccafbc0 <col:57, col:71> col:71 used __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-CompoundStmt 0x7fbb9ccb2958 <line:878:5, line:880:5>
| | `-ReturnStmt 0x7fbb9ccb2940 <line:879:9, col:81>
| |   `-CXXMemberCallExpr 0x7fbb9ccb2880 <col:16, col:81> 'enum std::__1::codecvt_base::result'
| |     |-MemberExpr 0x7fbb9ccb2730 <col:16> '<bound member function type>' ->do_in 0x7fbb9ccb1200
| |     | `-CXXThisExpr 0x7fbb9ccb2718 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7fbb9ccb2768 <col:22> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7fbb9ccaf860 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7fbb9ccb28e0 <col:28> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fbb9ccb2790 <col:28> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fbb9ccaf8f8 '__frm' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7fbb9ccb28f8 <col:35> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fbb9ccb27b8 <col:35> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fbb9ccaf968 '__frm_end' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-DeclRefExpr 0x7fbb9ccb27e0 <col:46> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fbb9ccafa10 '__frm_nxt' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |     |-ImplicitCastExpr 0x7fbb9ccb2910 <col:57> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fbb9ccb2808 <col:57> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7fbb9ccafaa8 '__to' 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     |-ImplicitCastExpr 0x7fbb9ccb2928 <col:63> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fbb9ccb2830 <col:63> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7fbb9ccafb18 '__to_end' 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     `-DeclRefExpr 0x7fbb9ccb2858 <col:73> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7fbb9ccafbc0 '__to_nxt' 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-AlwaysInlineAttr 0x7fbb9ccafdb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fbb9ccafdf8 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fbb9ccafe68 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:886:5> line:883:9 encoding 'int (void) const noexcept'
| |-CompoundStmt 0x7fbb9ccb2a08 <line:884:5, line:886:5>
| | `-ReturnStmt 0x7fbb9ccb29f0 <line:885:9, col:28>
| |   `-CXXMemberCallExpr 0x7fbb9ccb29c8 <col:16, col:28> 'int'
| |     `-MemberExpr 0x7fbb9ccb2990 <col:16> '<bound member function type>' ->do_encoding 0x7fbb9ccb15c0
| |       `-CXXThisExpr 0x7fbb9ccb2978 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |-AlwaysInlineAttr 0x7fbb9ccaff00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fbb9ccaff48 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fbb9ccaffb0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:892:5> line:889:10 always_noconv '_Bool (void) const noexcept'
| |-CompoundStmt 0x7fbb9ccb2ab8 <line:890:5, line:892:5>
| | `-ReturnStmt 0x7fbb9ccb2aa0 <line:891:9, col:33>
| |   `-CXXMemberCallExpr 0x7fbb9ccb2a78 <col:16, col:33> '_Bool'
| |     `-MemberExpr 0x7fbb9ccb2a40 <col:16> '<bound member function type>' ->do_always_noconv 0x7fbb9ccb1680
| |       `-CXXThisExpr 0x7fbb9ccb2a28 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |-AlwaysInlineAttr 0x7fbb9ccb0048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fbb9ccb0090 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fbb9ccb0378 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:898:5> line:895:9 length 'int (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, size_t) const'
| |-ParmVarDecl 0x7fbb9ccb00e0 <col:16, col:28> col:28 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fbb9ccb0150 <col:34, col:53> col:53 used __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fbb9ccb01c0 <col:60, col:79> col:79 used __end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fbb9ccb0230 <col:86, col:93> col:93 used __mx 'size_t':'unsigned long'
| |-CompoundStmt 0x7fbb9ccb2c70 <line:896:5, line:898:5>
| | `-ReturnStmt 0x7fbb9ccb2c58 <line:897:9, col:50>
| |   `-CXXMemberCallExpr 0x7fbb9ccb2bc8 <col:16, col:50> 'int'
| |     |-MemberExpr 0x7fbb9ccb2af0 <col:16> '<bound member function type>' ->do_length 0x7fbb9ccb1920
| |     | `-CXXThisExpr 0x7fbb9ccb2ad8 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7fbb9ccb2b28 <col:26> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7fbb9ccb00e0 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7fbb9ccb2c10 <col:32> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fbb9ccb2b50 <col:32> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fbb9ccb0150 '__frm' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7fbb9ccb2c28 <col:39> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fbb9ccb2b78 <col:39> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fbb9ccb01c0 '__end' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     `-ImplicitCastExpr 0x7fbb9ccb2c40 <col:46> 'size_t':'unsigned long' <LValueToRValue>
| |       `-DeclRefExpr 0x7fbb9ccb2ba0 <col:46> 'size_t':'unsigned long' lvalue ParmVar 0x7fbb9ccb0230 '__mx' 'size_t':'unsigned long'
| |-AlwaysInlineAttr 0x7fbb9ccb0430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fbb9ccb0478 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fbb9ccb04e8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:904:5> line:901:9 max_length 'int (void) const noexcept'
| |-CompoundStmt 0x7fbb9ccb2d20 <line:902:5, line:904:5>
| | `-ReturnStmt 0x7fbb9ccb2d08 <line:903:9, col:30>
| |   `-CXXMemberCallExpr 0x7fbb9ccb2ce0 <col:16, col:30> 'int'
| |     `-MemberExpr 0x7fbb9ccb2ca8 <col:16> '<bound member function type>' ->do_max_length 0x7fbb9ccb1a08
| |       `-CXXThisExpr 0x7fbb9ccb2c90 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |-AlwaysInlineAttr 0x7fbb9ccb0580 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fbb9ccb05c8 <col:48, col:71> Hidden
|-VarDecl 0x7fbb9ccb0638 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:906:5, col:23> col:23 id 'class locale::id':'class std::__1::locale::id' static
|-AccessSpecDecl 0x7fbb9ccb0698 <line:908:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fbb9ccb0808 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:911:34> line:910:14 codecvt 'void (const char *, size_t)'
| |-ParmVarDecl 0x7fbb9ccb0708 <col:22, col:32> col:33 'const char *'
| |-ParmVarDecl 0x7fbb9ccb0778 <col:35, col:51> col:42 used __refs 'size_t':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7fbb9ccb1d10 <col:51> 'size_t':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7fbb9ccb1cf0 <col:51> 'int' 0
| |-CXXCtorInitializer 'class locale::facet':'class std::__1::locale::facet'
| | `-CXXConstructExpr 0x7fbb9ccb2de8 <line:911:11, col:31> 'class locale::facet':'class std::__1::locale::facet' 'void (size_t)'
| |   `-ImplicitCastExpr 0x7fbb9ccb2dd0 <col:25> 'size_t':'unsigned long' <LValueToRValue>
| |     `-DeclRefExpr 0x7fbb9ccb2d48 <col:25> 'size_t':'unsigned long' lvalue ParmVar 0x7fbb9ccb0778 '__refs' 'size_t':'unsigned long'
| |-CXXCtorInitializer 'class std::__1::codecvt_base'
| | `-CXXConstructExpr 0x7fbb9ccb2e48 <line:910:14> 'class std::__1::codecvt_base' 'void (void)'
| |-CompoundStmt 0x7fbb9ccb2ec0 <line:911:33, col:34>
| |-AlwaysInlineAttr 0x7fbb9ccb08c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fbb9ccb0908 <col:48, col:71> Hidden
|-CXXDestructorDecl 0x7fbb9ccb0968 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:913:5, col:14> col:5 ~codecvt 'void (void) noexcept'
|-CXXMethodDecl 0x7fbb9ccb0d80 <line:915:5, line:917:93> line:915:20 used do_out 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const' virtual
| |-ParmVarDecl 0x7fbb9ccb0a18 <col:27, col:39> col:39 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fbb9ccb0a88 <line:916:27, col:46> col:46 __frm 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fbb9ccb0af8 <col:53, col:72> col:72 __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fbb9ccb0b70 <col:83, col:103> col:103 __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-ParmVarDecl 0x7fbb9ccb0be0 <line:917:27, col:40> col:40 __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fbb9ccb0c50 <col:46, col:59> col:59 __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| `-ParmVarDecl 0x7fbb9ccb0cc8 <col:69, col:83> col:83 __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
|-CXXMethodDecl 0x7fbb9ccb1200 <line:918:5, line:920:92> line:918:20 used do_in 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *&) const' virtual
| |-ParmVarDecl 0x7fbb9ccb0e60 <col:26, col:38> col:38 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fbb9ccb0ed0 <line:919:26, col:45> col:45 __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fbb9ccb0f40 <col:52, col:71> col:71 __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fbb9ccb0fb8 <col:82, col:102> col:102 __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-ParmVarDecl 0x7fbb9ccb1028 <line:920:26, col:39> col:39 __to 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fbb9ccb1098 <col:45, col:58> col:58 __to_end 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| `-ParmVarDecl 0x7fbb9ccb1110 <col:68, col:82> col:82 __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
|-CXXMethodDecl 0x7fbb9ccb14d8 <line:921:5, line:922:97> line:921:20 used do_unshift 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const' virtual
| |-ParmVarDecl 0x7fbb9ccb12e0 <col:31, col:43> col:43 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fbb9ccb1350 <line:922:31, col:44> col:44 __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fbb9ccb13c0 <col:50, col:63> col:63 __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| `-ParmVarDecl 0x7fbb9ccb1438 <col:73, col:87> col:87 __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
|-CXXMethodDecl 0x7fbb9ccb15c0 <line:923:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:923:17 used do_encoding 'int (void) const noexcept' virtual
|-CXXMethodDecl 0x7fbb9ccb1680 <line:924:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:924:18 used do_always_noconv '_Bool (void) const noexcept' virtual
|-CXXMethodDecl 0x7fbb9ccb1920 <line:925:5, col:110> col:17 used do_length 'int (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, size_t) const' virtual
| |-ParmVarDecl 0x7fbb9ccb1728 <col:27, col:39> col:39 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fbb9ccb1798 <col:45, col:64> col:64 __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fbb9ccb1808 <col:71, col:90> col:90 __end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| `-ParmVarDecl 0x7fbb9ccb1878 <col:97, col:104> col:104 __mx 'size_t':'unsigned long'
|-CXXMethodDecl 0x7fbb9ccb1a08 <line:926:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:926:17 used do_max_length 'int (void) const noexcept' virtual
`-CXXMethodDecl 0x7fbb9ccb1b38 <line:846:24, <invalid sloc>> col:24 implicit operator= 'class std::__1::codecvt<char, char, mbstate_t> &(const class std::__1::codecvt<char, char, mbstate_t> &)' inline default_delete noexcept-unevaluated 0x7fbb9ccb1b38
  `-ParmVarDecl 0x7fbb9ccb1c50 <col:24> col:24 'const class std::__1::codecvt<char, char, mbstate_t> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::codecvt" = type { %"class.std::__1::locale::facet" }
  NonVirtualBaseLLVMType:%"class.std::__1::codecvt" = type { %"class.std::__1::locale::facet" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fbb9b869bf8 </usr/include/i386/_types.h:76:9, line:79:1> line:76:9 union definition
|-FieldDecl 0x7fbb9b869d98 <line:77:2, col:22> col:8 __mbstate8 'char [128]'
|-FieldDecl 0x7fbb9b869df8 <line:78:2, col:12> col:12 _mbstateL 'long long'
|-CXXConstructorDecl 0x7fbb9ccc7100 <line:76:9> col:9 implicit used  'void (void) noexcept' inline default trivial
| `-CompoundStmt 0x7fbb9ccc7568 <col:9>
|-CXXConstructorDecl 0x7fbb9ccc7218 <col:9> col:9 implicit constexpr  'void (const __mbstate_t &)' inline default trivial noexcept-unevaluated 0x7fbb9ccc7218
| `-ParmVarDecl 0x7fbb9ccc7340 <col:9> col:9 'const __mbstate_t &'
|-CXXConstructorDecl 0x7fbb9ccc73d8 <col:9> col:9 implicit constexpr  'void (__mbstate_t &&)' inline default trivial noexcept-unevaluated 0x7fbb9ccc73d8
| `-ParmVarDecl 0x7fbb9ccc7500 <col:9> col:9 '__mbstate_t &&'
`-CXXDestructorDecl 0x7fbb9ce89848 <col:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.__mbstate_t = type { i64, [120 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fbb9c0dac28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:128:1, line:129:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:185:28 class basic_filebuf definition
|-public 'basic_streambuf<char, struct std::__1::char_traits<char> >':'class std::__1::basic_streambuf<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-CXXRecordDecl 0x7fbb9ce86e18 prev 0x7fbb9c0dac28 <col:1, col:28> col:28 implicit class basic_filebuf
|-AccessSpecDecl 0x7fbb9ce86eb0 <line:188:1, col:7> col:1 public
|-TypedefDecl 0x7fbb9ce86ee8 <line:189:5, col:46> col:46 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fbb9ce86cc0 'char' sugar
|   |-TemplateTypeParmType 0x7fbb9ce11030 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fbb9ce10fe8 '_CharT'
|   `-BuiltinType 0x7fbb9b833b60 'char'
|-TypedefDecl 0x7fbb9ce86f50 <line:190:5, col:46> col:46 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fbb9ce86d00 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fbb9ce110a0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fbb9ce11058 '_Traits'
|   `-RecordType 0x7fbb9c0d8960 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fbb9d215b48 'char_traits'
|-TypedefDecl 0x7fbb9ce87060 <line:191:5, col:46> col:46 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fbb9ce87010 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fbb9d217690 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fbb9d215ea8 'int_type'
|     `-BuiltinType 0x7fbb9b833bc0 'int'
|-TypedefDecl 0x7fbb9ce87130 <line:192:5, col:46> col:46 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fbb9ce870e0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fbb9d4d0000 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fbb9d215f78 'pos_type'
|     `-TypedefType 0x7fbb9d20c110 'std::__1::streampos' sugar
|       |-Typedef 0x7fbb9c0de7b8 'streampos'
|       `-TemplateSpecializationType 0x7fbb9c0de710 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fbb9c0de6f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fbb9c0de600 'fpos'
|-TypedefDecl 0x7fbb9ce87200 <line:193:5, col:46> col:46 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fbb9ce871b0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fbb9d4d00f0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fbb9d215f10 'off_type'
|     `-TypedefType 0x7fbb9d20c080 'std::__1::streamoff' sugar
|       |-Typedef 0x7fbb9c0deb58 'streamoff'
|       `-BuiltinType 0x7fbb9b833c00 'long long'
|-TypedefDecl 0x7fbb9ce872f0 <line:194:5, col:46> col:46 state_type 'typename traits_type::state_type':'__mbstate_t'
| `-ElaboratedType 0x7fbb9ce872a0 'typename traits_type::state_type' sugar
|   `-TypedefType 0x7fbb9ce87280 'std::__1::char_traits<char>::state_type' sugar
|     |-Typedef 0x7fbb9d215fe0 'state_type'
|     `-TypedefType 0x7fbb9c0bf980 'mbstate_t' sugar
|       |-Typedef 0x7fbb9c0155f0 'mbstate_t'
|       `-TypedefType 0x7fbb9c0155c0 '__darwin_mbstate_t' sugar
|         |-Typedef 0x7fbb9b869f50 '__darwin_mbstate_t'
|         `-TypedefType 0x7fbb9b869f20 '__mbstate_t' sugar
|           |-Typedef 0x7fbb9b869eb0 '__mbstate_t'
|           `-ElaboratedType 0x7fbb9b869e60 'union __mbstate_t' sugar
|             `-RecordType 0x7fbb9b869c90 '__mbstate_t'
|               `-CXXRecord 0x7fbb9b869bf8 ''
|-CXXConstructorDecl 0x7fbb9ce87388 <line:197:5, col:19> col:5 basic_filebuf 'void (void)'
|-CXXConstructorDecl 0x7fbb9ce87560 <line:199:5, col:40> col:5 basic_filebuf 'void (class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&)'
| `-ParmVarDecl 0x7fbb9ce87478 <col:19, col:35> col:35 __rhs 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&'
|-CXXDestructorDecl 0x7fbb9ce87650 <line:201:5, col:28> col:13 used ~basic_filebuf 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7fbb9ce87800 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:206:51> col:20 operator= 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &(class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&)'
| |-ParmVarDecl 0x7fbb9ce87738 <col:30, col:46> col:46 __rhs 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&'
| `-AlwaysInlineAttr 0x7fbb9ce878b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fbb9ce879d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:208:5, col:35> col:10 swap 'void (class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &)'
| `-ParmVarDecl 0x7fbb9ce87908 <col:15, col:30> col:30 __rhs 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &'
|-CXXMethodDecl 0x7fbb9ce87a80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:212:20> col:10 is_open '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fbb9ce87b28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fbb9ce87ce0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:214:5, col:67> col:20 open 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > *(const char *, class ios_base::openmode)'
| |-ParmVarDecl 0x7fbb9ce87b70 <col:25, col:37> col:37 __s 'const char *'
| `-ParmVarDecl 0x7fbb9ce87bd0 <col:42, col:61> col:61 __mode 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fbb9ce87f10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:216:69> col:20 open 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > *(const std::__1::string &, class ios_base::openmode)'
| |-ParmVarDecl 0x7fbb9ce87d98 <col:25, col:39> col:39 __s 'const std::__1::string &'
| |-ParmVarDecl 0x7fbb9ce87df8 <col:44, col:63> col:63 __mode 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7fbb9ce87fc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fbb9ce88060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:218:5, col:26> col:20 close 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > *(void)'
|-AccessSpecDecl 0x7fbb9ce88108 <line:220:1, col:10> col:1 protected
|-CXXMethodDecl 0x7fbb9ce881a0 <line:222:5, col:32> col:22 underflow 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7fbb9ce88320 <line:223:5, col:65> col:22 pbackfail 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7fbb9ce88258 <col:32, col:64> col:41 __c 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7fbb9ce88468 <line:224:5, col:65> col:22 overflow 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7fbb9ce883e0 <col:32, col:64> col:41 __c 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7fbb9ce887a0 <line:225:5, col:91> col:54 setbuf 'basic_streambuf<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::traits_type> *(std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7fbb9ce88628 <col:61, col:72> col:72 __s 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fbb9ce88688 <col:77, col:88> col:88 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fbb9ce88a50 <line:226:5, line:227:85> line:226:22 seekoff 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7fbb9ce888b0 <col:30, col:39> col:39 __off 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7fbb9ce88910 <col:46, col:64> col:64 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-ParmVarDecl 0x7fbb9ce88970 <line:227:30, col:82> col:49 __wch 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fbb9ce88c50 <line:228:5, line:229:85> line:228:22 seekpos 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7fbb9ce88b20 <col:30, col:39> col:39 __sp 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ParmVarDecl 0x7fbb9ce88b80 <line:229:30, col:82> col:49 __wch 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fbb9ce88d08 <line:230:5, col:22> col:17 sync 'int (void)' virtual
|-CXXMethodDecl 0x7fbb9ce88e38 <line:231:5, col:43> col:18 imbue 'void (const class std::__1::locale &)' virtual
| `-ParmVarDecl 0x7fbb9ce88db0 <col:24, col:38> col:38 __loc 'const class std::__1::locale &'
|-AccessSpecDecl 0x7fbb9ce88ee8 <line:233:1, col:8> col:1 private
|-FieldDecl 0x7fbb9ce88f10 <line:234:5, col:17> col:17 __extbuf_ 'char *'
|-FieldDecl 0x7fbb9ce88f58 <line:235:5, col:17> col:17 __extbufnext_ 'const char *'
|-FieldDecl 0x7fbb9ce88fa0 <line:236:5, col:17> col:17 __extbufend_ 'const char *'
|-FieldDecl 0x7fbb9ce88fe8 <line:237:5, col:25> col:10 __extbuf_min_ 'char [8]'
|-FieldDecl 0x7fbb9ce89030 <line:238:5, col:12> col:12 __ebs_ 'size_t':'unsigned long'
|-FieldDecl 0x7fbb9ce89088 <line:239:5, col:16> col:16 __intbuf_ 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fbb9ce890d0 <line:240:5, col:12> col:12 __ibs_ 'size_t':'unsigned long'
|-FieldDecl 0x7fbb9ce89118 <line:241:5, col:11> col:11 __file_ 'FILE *'
|-FieldDecl 0x7fbb9ce892b0 <line:242:5, col:49> col:49 __cv_ 'const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> *'
|-FieldDecl 0x7fbb9ce89308 <line:243:5, col:16> col:16 __st_ 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type':'__mbstate_t'
|-FieldDecl 0x7fbb9ce89360 <line:244:5, col:16> col:16 __st_last_ 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type':'__mbstate_t'
|-FieldDecl 0x7fbb9ce893a8 <line:245:5, col:24> col:24 __om_ 'class ios_base::openmode':'unsigned int'
|-FieldDecl 0x7fbb9ce893f0 <line:246:5, col:24> col:24 __cm_ 'class ios_base::openmode':'unsigned int'
|-FieldDecl 0x7fbb9ce89438 <line:247:5, col:10> col:10 __owns_eb_ '_Bool'
|-FieldDecl 0x7fbb9ce89480 <line:248:5, col:10> col:10 __owns_ib_ '_Bool'
|-FieldDecl 0x7fbb9ce894c8 <line:249:5, col:10> col:10 __always_noconv_ '_Bool'
|-CXXMethodDecl 0x7fbb9ce89510 <line:251:5, col:22> col:10 __read_mode '_Bool (void)'
|-CXXMethodDecl 0x7fbb9ce895b8 <line:252:5, col:23> col:10 __write_mode 'void (void)'
`-CXXMethodDecl 0x7fbb9ce896c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:129:32, <invalid sloc>> col:32 implicit operator= 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &(const class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &)' inline default_delete noexcept-unevaluated 0x7fbb9ce896c8
  `-ParmVarDecl 0x7fbb9ce897e0 <col:32> col:32 'const class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_filebuf" = type <{ %"class.std::__1::basic_streambuf", i8*, i8*, i8*, [8 x i8], i64, i8*, i64, %struct.__sFILE*, %"class.std::__1::codecvt"*, %union.__mbstate_t, %union.__mbstate_t, i32, i32, i8, i8, i8, [5 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_filebuf.base" = type <{ %"class.std::__1::basic_streambuf", i8*, i8*, i8*, [8 x i8], i64, i8*, i64, %struct.__sFILE*, %"class.std::__1::codecvt"*, %union.__mbstate_t, %union.__mbstate_t, i32, i32, i8, i8, i8 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fbb9c0db518 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:134:1, line:135:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1323:28 class basic_fstream definition
|-public 'basic_iostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_iostream<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-CXXRecordDecl 0x7fbb9ce853a0 prev 0x7fbb9c0db518 <col:1, col:28> col:28 implicit class basic_fstream
|-AccessSpecDecl 0x7fbb9ce85438 <line:1326:1, col:7> col:1 public
|-TypedefDecl 0x7fbb9ce85470 <line:1327:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fbb9ce85230 'char' sugar
|   |-TemplateTypeParmType 0x7fbb9ce604d0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fbb9ce60488 '_CharT'
|   `-BuiltinType 0x7fbb9b833b60 'char'
|-TypedefDecl 0x7fbb9ce854d8 <line:1328:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fbb9ce85270 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fbb9ce60540 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fbb9ce604f8 '_Traits'
|   `-RecordType 0x7fbb9c0d8960 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fbb9d215b48 'char_traits'
|-TypedefDecl 0x7fbb9ce855e0 <line:1329:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fbb9ce85590 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fbb9d217690 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fbb9d215ea8 'int_type'
|     `-BuiltinType 0x7fbb9b833bc0 'int'
|-TypedefDecl 0x7fbb9ce856b0 <line:1330:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fbb9ce85660 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fbb9d4d0000 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fbb9d215f78 'pos_type'
|     `-TypedefType 0x7fbb9d20c110 'std::__1::streampos' sugar
|       |-Typedef 0x7fbb9c0de7b8 'streampos'
|       `-TemplateSpecializationType 0x7fbb9c0de710 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fbb9c0de6f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fbb9c0de600 'fpos'
|-TypedefDecl 0x7fbb9ce85780 <line:1331:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fbb9ce85730 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fbb9d4d00f0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fbb9d215f10 'off_type'
|     `-TypedefType 0x7fbb9d20c080 'std::__1::streamoff' sugar
|       |-Typedef 0x7fbb9c0deb58 'streamoff'
|       `-BuiltinType 0x7fbb9b833c00 'long long'
|-CXXConstructorDecl 0x7fbb9ce85818 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1334:19> col:5 used basic_fstream 'void (void)'
| `-AlwaysInlineAttr 0x7fbb9ce858f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fbb9ce85a50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1337:101> col:14 used basic_fstream 'void (const char *, class ios_base::openmode)'
| |-ParmVarDecl 0x7fbb9ce85940 <col:28, col:40> col:40 __s 'const char *'
| |-ParmVarDecl 0x7fbb9ce859a0 <col:45, col:98> col:64 __mode 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7fbb9ce85b18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fbb9ce85c70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1339:103> col:14 basic_fstream 'void (const std::__1::string &, class ios_base::openmode)'
| |-ParmVarDecl 0x7fbb9ce85b60 <col:28, col:42> col:42 __s 'const std::__1::string &'
| |-ParmVarDecl 0x7fbb9ce85bc0 <col:47, col:100> col:66 __mode 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7fbb9ce85d38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fbb9ce85ea0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1343:40> col:5 basic_fstream 'void (class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&)'
| |-ParmVarDecl 0x7fbb9ce85db8 <col:19, col:35> col:35 __rhs 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&'
| `-AlwaysInlineAttr 0x7fbb9ce85f60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fbb9ce860b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1346:51> col:20 operator= 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &(class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&)'
| |-ParmVarDecl 0x7fbb9ce85fe8 <col:30, col:46> col:46 __rhs 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&'
| `-AlwaysInlineAttr 0x7fbb9ce86160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fbb9ce86280 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1349:35> col:10 swap 'void (class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &)'
| |-ParmVarDecl 0x7fbb9ce861b8 <col:15, col:30> col:30 __rhs 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &'
| `-AlwaysInlineAttr 0x7fbb9ce86330 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fbb9ce86540 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1352:52> col:44 rdbuf 'basic_filebuf<std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7fbb9ce865e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fbb9ce86630 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1354:20> col:10 is_open '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fbb9ce866d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fbb9ce86810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1356:5, col:88> col:10 open 'void (const char *, class ios_base::openmode)'
| |-ParmVarDecl 0x7fbb9ce86720 <col:15, col:27> col:27 __s 'const char *'
| `-ParmVarDecl 0x7fbb9ce86780 <col:32, col:85> col:51 __mode 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fbb9ce869b8 <line:1357:5, col:90> col:10 open 'void (const std::__1::string &, class ios_base::openmode)'
| |-ParmVarDecl 0x7fbb9ce868c8 <col:15, col:29> col:29 __s 'const std::__1::string &'
| `-ParmVarDecl 0x7fbb9ce86928 <col:34, col:87> col:53 __mode 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fbb9ce86a70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1360:16> col:10 close 'void (void)'
| `-AlwaysInlineAttr 0x7fbb9ce86b18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-AccessSpecDecl 0x7fbb9ce86b60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1362:1, col:8> col:1 private
|-FieldDecl 0x7fbb9ce89928 <line:1363:5, col:43> col:43 __sb_ 'basic_filebuf<std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::traits_type>':'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >'
|-CXXConstructorDecl 0x7fbb9ce89998 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:135:32> col:32 implicit basic_fstream 'void (const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &)' inline default_delete noexcept-unevaluated 0x7fbb9ce89998
| `-ParmVarDecl 0x7fbb9ce89ac0 <col:32> col:32 'const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &'
|-CXXMethodDecl 0x7fbb9ce89b28 <col:32, <invalid sloc>> col:32 implicit operator= 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &(const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &)' inline default_delete noexcept-unevaluated 0x7fbb9ce89b28
| `-ParmVarDecl 0x7fbb9ce89c40 <col:32> col:32 'const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &'
`-CXXDestructorDecl 0x7fbb9ce89cc8 <col:32> col:32 implicit used ~basic_fstream 'void (void) noexcept' inline default
  `-CompoundStmt 0x7fbb9ce8bb08 <col:32>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_fstream" = type { %"class.std::__1::basic_iostream.base", %"class.std::__1::basic_filebuf", %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_fstream.base" = type { %"class.std::__1::basic_iostream.base", %"class.std::__1::basic_filebuf" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fbb9ce83e58 <object_model/2_constructors/11_member_initialization_list.cpp:11:1, line:40:1> line:11:8 referenced struct C definition
|-public 'struct B'
|-CXXRecordDecl 0x7fbb9ce83fb8 <col:1, col:8> col:8 implicit referenced struct C
|-FieldDecl 0x7fbb9ce84068 <line:12:5, col:19> col:19 x 'unsigned char'
|-FieldDecl 0x7fbb9ce840c8 <line:13:5, col:19> col:19 referenced y 'unsigned char'
|-FieldDecl 0x7fbb9ce84190 <line:14:5, col:16> col:16 referenced m 'std::mutex':'class std::__1::mutex'
|-FieldDecl 0x7fbb9ce850d8 <line:15:5, col:33> col:33 lg 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
|-FieldDecl 0x7fbb9ce89da8 <line:16:5, col:18> col:18 f1 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
|-FieldDecl 0x7fbb9ce89e40 <line:17:5, col:18> col:18 f2 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
|-CXXConstructorDecl 0x7fbb9ce89f70 <line:19:5, line:25:21> line:19:5 used C 'void (int)'
| |-ParmVarDecl 0x7fbb9ce89ea0 <col:7, col:11> col:11 used x 'int'
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7fbb9ce8b230 <col:16, col:21> 'struct B' 'void (int)'
| |   `-IntegerLiteral 0x7fbb9ce8b1b8 <col:18> 'int' 123
| |-CXXCtorInitializer Field 0x7fbb9ce84068 'x' 'unsigned char'
| | `-InitListExpr 0x7fbb9ce8b378 <line:20:17, col:47> 'unsigned char'
| |   `-CXXStaticCastExpr 0x7fbb9ce8b300 <col:18, col:46> 'unsigned char' static_cast<unsigned char> <NoOp>
| |     `-ImplicitCastExpr 0x7fbb9ce8b2e8 <col:45> 'unsigned char' <IntegralCast>
| |       `-ImplicitCastExpr 0x7fbb9ce8b2d0 <col:45> 'int' <LValueToRValue>
| |         `-DeclRefExpr 0x7fbb9ce8b290 <col:45> 'int' lvalue ParmVar 0x7fbb9ce89ea0 'x' 'int'
| |-CXXCtorInitializer Field 0x7fbb9ce840c8 'y' 'unsigned char'
| | `-InitListExpr 0x7fbb9ce8b450 <line:21:17, col:19> 'unsigned char'
| |   `-ImplicitCastExpr 0x7fbb9ce8b490 <col:18> 'unsigned char' <IntegralCast>
| |     `-IntegerLiteral 0x7fbb9ce8b3e8 <col:18> 'int' 0
| |-CXXCtorInitializer Field 0x7fbb9ce84190 'm' 'std::mutex':'class std::__1::mutex'
| | `-CXXConstructExpr 0x7fbb9ce8ba78 <line:25:16, col:18> 'std::mutex':'class std::__1::mutex' 'void (void) noexcept' zeroing
| |-CXXCtorInitializer Field 0x7fbb9ce850d8 'lg' 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
| | `-CXXConstructExpr 0x7fbb9ce8b970 <line:24:16, col:20> 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>' 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |   `-MemberExpr 0x7fbb9ce8b908 <col:19> 'std::mutex':'class std::__1::mutex' lvalue ->m 0x7fbb9ce84190
| |     `-CXXThisExpr 0x7fbb9ce8b8f0 <col:19> 'struct C *' this
| |-CXXCtorInitializer Field 0x7fbb9ce89da8 'f1' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7fbb9ce8b648 <line:22:16, col:43> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (const char *, class ios_base::openmode)'
| |   |-ImplicitCastExpr 0x7fbb9ce8b618 <col:19> 'const char *' <ArrayToPointerDecay>
| |   | `-StringLiteral 0x7fbb9ce8b4d8 <col:19> 'const char [8]' lvalue "test.cc"
| |   `-ImplicitCastExpr 0x7fbb9ce8b630 <col:30, col:40> 'std::__1::ios_base::openmode':'unsigned int' <LValueToRValue>
| |     `-DeclRefExpr 0x7fbb9ce8b590 <col:30, col:40> 'const std::__1::ios_base::openmode':'const unsigned int' lvalue Var 0x7fbb9ccdee50 'app' 'const std::__1::ios_base::openmode':'const unsigned int'
| |-CXXCtorInitializer Field 0x7fbb9ce89e40 'f2' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7fbb9ce8b888 <line:23:16, col:63> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (const char *, class ios_base::openmode)'
| |   |-ImplicitCastExpr 0x7fbb9ce8b870 <col:19> 'const char *' <ArrayToPointerDecay>
| |   | `-StringLiteral 0x7fbb9ce8b6b0 <col:19> 'const char [9]' lvalue "test.bin"
| |   `-BinaryOperator 0x7fbb9ce8b810 <col:31, col:60> 'unsigned int' '|'
| |     |-ImplicitCastExpr 0x7fbb9ce8b7e0 <col:31, col:41> 'std::__1::ios_base::openmode':'unsigned int' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fbb9ce8b728 <col:31, col:41> 'const std::__1::ios_base::openmode':'const unsigned int' lvalue Var 0x7fbb9ccdf050 'binary' 'const std::__1::ios_base::openmode':'const unsigned int'
| |     `-ImplicitCastExpr 0x7fbb9ce8b7f8 <col:50, col:60> 'std::__1::ios_base::openmode':'unsigned int' <LValueToRValue>
| |       `-DeclRefExpr 0x7fbb9ce8b7a8 <col:50, col:60> 'const std::__1::ios_base::openmode':'const unsigned int' lvalue Var 0x7fbb9ccdee50 'app' 'const std::__1::ios_base::openmode':'const unsigned int'
| `-CompoundStmt 0x7fbb9ce8bb20 <line:25:20, col:21>
|-CXXConstructorDecl 0x7fbb9ce8a100 <line:27:5, line:31:22> line:27:5 used C 'void (double)'
| |-ParmVarDecl 0x7fbb9ce8a038 <col:7, col:14> col:14 used a 'double'
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7fbb9ce8bbb0 <line:28:15, col:18> 'struct B' 'void (int)'
| |   `-IntegerLiteral 0x7fbb9ce8bb38 <col:17> 'int' 0
| |-CXXCtorInitializer Field 0x7fbb9ce84068 'x' 'unsigned char'
| | `-InitListExpr 0x7fbb9ce8be60 <line:30:16, col:18> 'unsigned char'
| |   `-ImplicitCastExpr 0x7fbb9ce8bea0 <col:17> 'unsigned char' <LValueToRValue>
| |     `-MemberExpr 0x7fbb9ce8bde0 <col:17> 'unsigned char' lvalue ->y 0x7fbb9ce840c8
| |       `-CXXThisExpr 0x7fbb9ce8bdc8 <col:17> 'struct C *' this
| |-CXXCtorInitializer Field 0x7fbb9ce840c8 'y' 'unsigned char'
| | `-InitListExpr 0x7fbb9ce8bd58 <line:29:16, col:50> 'unsigned char'
| |   `-CXXStaticCastExpr 0x7fbb9ce8bce0 <col:17, col:49> 'unsigned char' static_cast<unsigned char> <NoOp>
| |     `-ImplicitCastExpr 0x7fbb9ce8bcc8 <col:44, col:48> 'unsigned char' <FloatingToIntegral>
| |       `-BinaryOperator 0x7fbb9ce8bc88 <col:44, col:48> 'double' '+'
| |         |-ImplicitCastExpr 0x7fbb9ce8bc58 <col:44> 'double' <LValueToRValue>
| |         | `-DeclRefExpr 0x7fbb9ce8bc10 <col:44> 'double' lvalue ParmVar 0x7fbb9ce8a038 'a' 'double'
| |         `-ImplicitCastExpr 0x7fbb9ce8bc70 <col:48> 'double' <IntegralToFloating>
| |           `-IntegerLiteral 0x7fbb9ce8bc38 <col:48> 'int' 1
| |-CXXCtorInitializer Field 0x7fbb9ce84190 'm' 'std::mutex':'class std::__1::mutex'
| | `-CXXConstructExpr 0x7fbb9ce8bfe0 <line:27:5> 'std::mutex':'class std::__1::mutex' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7fbb9ce850d8 'lg' 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
| | `-CXXConstructExpr 0x7fbb9ce8bf80 <line:31:15, col:19> 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>' 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |   `-MemberExpr 0x7fbb9ce8bf00 <col:18> 'std::mutex':'class std::__1::mutex' lvalue ->m 0x7fbb9ce84190
| |     `-CXXThisExpr 0x7fbb9ce8bee8 <col:18> 'struct C *' this
| |-CXXCtorInitializer Field 0x7fbb9ce89da8 'f1' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7fbb9ce8c038 <line:27:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| |-CXXCtorInitializer Field 0x7fbb9ce89e40 'f2' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7fbb9ce8c090 <col:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| `-CompoundStmt 0x7fbb9ce8c120 <line:31:21, col:22>
|-CXXConstructorDecl 0x7fbb9ce8a1d0 <line:33:5, line:39:18> line:33:5 used C 'void (void)'
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7fbb9ce8c1b0 <line:35:15, col:20> 'struct B' 'void (int)'
| |   `-IntegerLiteral 0x7fbb9ce8c138 <col:17> 'int' 789
| |-CXXCtorInitializer Field 0x7fbb9ce84068 'x' 'unsigned char'
| | `-InitListExpr 0x7fbb9ce8c278 <line:36:16, col:18> 'unsigned char'
| |   `-ImplicitCastExpr 0x7fbb9ce8c2b8 <col:17> 'unsigned char' <IntegralCast>
| |     `-IntegerLiteral 0x7fbb9ce8c210 <col:17> 'int' 0
| |-CXXCtorInitializer Field 0x7fbb9ce840c8 'y' 'unsigned char'
| | `-InitListExpr 0x7fbb9ce8c368 <line:37:16, col:18> 'unsigned char'
| |   `-ImplicitCastExpr 0x7fbb9ce8c3a8 <col:17> 'unsigned char' <IntegralCast>
| |     `-IntegerLiteral 0x7fbb9ce8c300 <col:17> 'int' 0
| |-CXXCtorInitializer Field 0x7fbb9ce84190 'm' 'std::mutex':'class std::__1::mutex'
| | `-CXXConstructExpr 0x7fbb9ce8c4e8 <line:33:5> 'std::mutex':'class std::__1::mutex' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7fbb9ce850d8 'lg' 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
| | `-CXXConstructExpr 0x7fbb9ce8c488 <line:38:15, col:19> 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>' 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |   `-MemberExpr 0x7fbb9ce8c408 <col:18> 'std::mutex':'class std::__1::mutex' lvalue ->m 0x7fbb9ce84190
| |     `-CXXThisExpr 0x7fbb9ce8c3f0 <col:18> 'struct C *' this
| |-CXXCtorInitializer Field 0x7fbb9ce89da8 'f1' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7fbb9ce8c540 <line:33:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| |-CXXCtorInitializer Field 0x7fbb9ce89e40 'f2' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7fbb9ce8c598 <col:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| `-CXXTryStmt 0x7fbb9ce8c670 <line:34:5, line:39:18>
|   |-CompoundStmt 0x7fbb9ce8c628 <line:38:21, col:22>
|   `-CXXCatchStmt 0x7fbb9ce8c658 <line:39:5, col:18>
|     |-<<<NULL>>>
|     `-CompoundStmt 0x7fbb9ce8c640 <col:17, col:18>
|-CXXConstructorDecl 0x7fbb9ce8a628 <line:11:8> col:8 implicit C 'void (const struct C &)' inline default_delete noexcept-unevaluated 0x7fbb9ce8a628
| `-ParmVarDecl 0x7fbb9ce8a750 <col:8> col:8 'const struct C &'
|-CXXConstructorDecl 0x7fbb9ce8a8c8 <col:8> col:8 implicit C 'void (struct C &&)' inline default_delete noexcept-unevaluated 0x7fbb9ce8a8c8
| `-ParmVarDecl 0x7fbb9ce8a9f0 <col:8> col:8 'struct C &&'
|-CXXMethodDecl 0x7fbb9ce8aa88 <col:8, <invalid sloc>> col:8 implicit operator= 'struct C &(const struct C &)' inline default_delete noexcept-unevaluated 0x7fbb9ce8aa88
| `-ParmVarDecl 0x7fbb9ce8aba0 <col:8> col:8 'const struct C &'
|-CXXMethodDecl 0x7fbb9ce8af38 <col:8, <invalid sloc>> col:8 implicit operator= 'struct C &(struct C &&)' inline default_delete noexcept-unevaluated 0x7fbb9ce8af38
| `-ParmVarDecl 0x7fbb9ce8b050 <col:8> col:8 'struct C &&'
`-CXXDestructorDecl 0x7fbb9ce8b0d8 <col:8> col:8 implicit used ~C 'void (void) noexcept' inline default
  `-CompoundStmt 0x7fbb9ce8c830 <col:8>

Layout: <CGRecordLayout
  LLVMType:%struct.C = type { %struct.B, i8, i8, %"class.std::__1::mutex", %"class.std::__1::lock_guard", %"class.std::__1::basic_fstream", %"class.std::__1::basic_fstream" }
  NonVirtualBaseLLVMType:%struct.C = type { %struct.B, i8, i8, %"class.std::__1::mutex", %"class.std::__1::lock_guard", %"class.std::__1::basic_fstream", %"class.std::__1::basic_fstream" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1225:9)
         0 |   struct std::__1::_PairT __t
         0 |     size_t first
         8 |     size_t second
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__murmur2_or_cityhash<unsigned long, 64> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1190:9)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1208:9)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |       union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw
