
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__scalar_hash<struct std::__1::_PairT, 2> (empty)
         0 |   struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1509:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<unsigned long, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1000000000, 1>, false, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_mutex_t
         0 |   long __sig
         8 |   char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_cond_t
         0 |   long __sig
         8 |   char [40] __opaque
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1, 1>, true, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::once_flag
         0 |   unsigned long __state_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale::id
         0 |   struct std::__1::once_flag __flag_
         0 |     unsigned long __state_
         8 |   int32_t __id_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__basic_string_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (empty)
         0 |   class std::__1::allocator<char> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<char>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |       class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false>
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<wchar_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (empty)
         0 |   class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> >
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false> (base)
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |           union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<wchar_t>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> > __r_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false> (base)
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |             union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (base) (empty)
         0 |       class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::money_base::pattern
         0 |   char [4] field
           | [sizeof=4, dsize=4, align=1,
           |  nvsize=4, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<long, long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >
         0 |   std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >::__storage_pointer __seg_
         8 |   std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >::__storage_type __mask_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__bitset<0, 0> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct B
         0 |   int n
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | class std::__1::mutex
         0 |   struct _opaque_pthread_mutex_t __m_
         0 |     long __sig
         8 |     char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::lock_guard<class std::__1::mutex>
         0 |   std::__1::lock_guard<class std::__1::mutex>::mutex_type & __m_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::ios_base
         0 |   (ios_base vtable pointer)
         8 |   std::__1::ios_base::fmtflags __fmtflags_
        16 |   std::__1::streamsize __precision_
        24 |   std::__1::streamsize __width_
        32 |   std::__1::ios_base::iostate __rdstate_
        36 |   std::__1::ios_base::iostate __exceptions_
        40 |   void * __rdbuf_
        48 |   void * __loc_
        56 |   std::__1::ios_base::event_callback * __fn_
        64 |   int * __index_
        72 |   size_t __event_size_
        80 |   size_t __event_cap_
        88 |   long * __iarray_
        96 |   size_t __iarray_size_
       104 |   size_t __iarray_cap_
       112 |   void ** __parray_
       120 |   size_t __parray_size_
       128 |   size_t __parray_cap_
           | [sizeof=136, dsize=136, align=8,
           |  nvsize=136, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ios<char>
         0 |   class std::__1::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     std::__1::ios_base::fmtflags __fmtflags_
        16 |     std::__1::streamsize __precision_
        24 |     std::__1::streamsize __width_
        32 |     std::__1::ios_base::iostate __rdstate_
        36 |     std::__1::ios_base::iostate __exceptions_
        40 |     void * __rdbuf_
        48 |     void * __loc_
        56 |     std::__1::ios_base::event_callback * __fn_
        64 |     int * __index_
        72 |     size_t __event_size_
        80 |     size_t __event_cap_
        88 |     long * __iarray_
        96 |     size_t __iarray_size_
       104 |     size_t __iarray_cap_
       112 |     void ** __parray_
       120 |     size_t __parray_size_
       128 |     size_t __parray_cap_
       136 |   basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       144 |   std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=152, dsize=148, align=8,
           |  nvsize=148, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_istream<char>
         0 |   (basic_istream vtable pointer)
         8 |   std::__1::streamsize __gc_
        16 |   class std::__1::basic_ios<char> (virtual base)
        16 |     class std::__1::ios_base (primary base)
        16 |       (ios_base vtable pointer)
        24 |       std::__1::ios_base::fmtflags __fmtflags_
        32 |       std::__1::streamsize __precision_
        40 |       std::__1::streamsize __width_
        48 |       std::__1::ios_base::iostate __rdstate_
        52 |       std::__1::ios_base::iostate __exceptions_
        56 |       void * __rdbuf_
        64 |       void * __loc_
        72 |       std::__1::ios_base::event_callback * __fn_
        80 |       int * __index_
        88 |       size_t __event_size_
        96 |       size_t __event_cap_
       104 |       long * __iarray_
       112 |       size_t __iarray_size_
       120 |       size_t __iarray_cap_
       128 |       void ** __parray_
       136 |       size_t __parray_size_
       144 |       size_t __parray_cap_
       152 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       160 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=168, dsize=164, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ostream<char>
         0 |   (basic_ostream vtable pointer)
         8 |   class std::__1::basic_ios<char> (virtual base)
         8 |     class std::__1::ios_base (primary base)
         8 |       (ios_base vtable pointer)
        16 |       std::__1::ios_base::fmtflags __fmtflags_
        24 |       std::__1::streamsize __precision_
        32 |       std::__1::streamsize __width_
        40 |       std::__1::ios_base::iostate __rdstate_
        44 |       std::__1::ios_base::iostate __exceptions_
        48 |       void * __rdbuf_
        56 |       void * __loc_
        64 |       std::__1::ios_base::event_callback * __fn_
        72 |       int * __index_
        80 |       size_t __event_size_
        88 |       size_t __event_cap_
        96 |       long * __iarray_
       104 |       size_t __iarray_size_
       112 |       size_t __iarray_cap_
       120 |       void ** __parray_
       128 |       size_t __parray_size_
       136 |       size_t __parray_cap_
       144 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       152 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=160, dsize=156, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_iostream<char>
         0 |   class std::__1::basic_istream<char> (primary base)
         0 |     (basic_istream vtable pointer)
         8 |     std::__1::streamsize __gc_
        16 |   class std::__1::basic_ostream<char> (base)
        16 |     (basic_ostream vtable pointer)
        24 |   class std::__1::basic_ios<char> (virtual base)
        24 |     class std::__1::ios_base (primary base)
        24 |       (ios_base vtable pointer)
        32 |       std::__1::ios_base::fmtflags __fmtflags_
        40 |       std::__1::streamsize __precision_
        48 |       std::__1::streamsize __width_
        56 |       std::__1::ios_base::iostate __rdstate_
        60 |       std::__1::ios_base::iostate __exceptions_
        64 |       void * __rdbuf_
        72 |       void * __loc_
        80 |       std::__1::ios_base::event_callback * __fn_
        88 |       int * __index_
        96 |       size_t __event_size_
       104 |       size_t __event_cap_
       112 |       long * __iarray_
       120 |       size_t __iarray_size_
       128 |       size_t __iarray_cap_
       136 |       void ** __parray_
       144 |       size_t __parray_size_
       152 |       size_t __parray_cap_
       160 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       168 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=176, dsize=172, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale
         0 |   class std::__1::locale::__imp * __locale_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_streambuf<char>
         0 |   (basic_streambuf vtable pointer)
         8 |   class std::__1::locale __loc_
         8 |     class std::__1::locale::__imp * __locale_
        16 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        24 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        32 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        40 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        48 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        56 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | __mbstate_t
         0 |   char [128] __mbstate8
         0 |   long long _mbstateL
           | [sizeof=128, dsize=128, align=8,
           |  nvsize=128, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >
         0 |   class std::__1::basic_streambuf<char> (primary base)
         0 |     (basic_streambuf vtable pointer)
         8 |     class std::__1::locale __loc_
         8 |       class std::__1::locale::__imp * __locale_
        16 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        24 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        32 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        40 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        48 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        56 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
        64 |   char * __extbuf_
        72 |   const char * __extbufnext_
        80 |   const char * __extbufend_
        88 |   char [8] __extbuf_min_
        96 |   size_t __ebs_
       104 |   std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       112 |   size_t __ibs_
       120 |   FILE * __file_
       128 |   const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       136 |   __mbstate_t __st_
       136 |     char [128] __mbstate8
       136 |     long long _mbstateL
       264 |   __mbstate_t __st_last_
       264 |     char [128] __mbstate8
       264 |     long long _mbstateL
       392 |   class ios_base::openmode __om_
       396 |   class ios_base::openmode __cm_
       400 |   _Bool __owns_eb_
       401 |   _Bool __owns_ib_
       402 |   _Bool __always_noconv_
           | [sizeof=408, dsize=403, align=8,
           |  nvsize=403, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >
         0 |   class std::__1::basic_iostream<char> (primary base)
         0 |     class std::__1::basic_istream<char> (primary base)
         0 |       (basic_istream vtable pointer)
         8 |       std::__1::streamsize __gc_
        16 |     class std::__1::basic_ostream<char> (base)
        16 |       (basic_ostream vtable pointer)
        24 |   class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > __sb_
        24 |     class std::__1::basic_streambuf<char> (primary base)
        24 |       (basic_streambuf vtable pointer)
        32 |       class std::__1::locale __loc_
        32 |         class std::__1::locale::__imp * __locale_
        40 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        48 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        56 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        64 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        72 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        80 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
        88 |     char * __extbuf_
        96 |     const char * __extbufnext_
       104 |     const char * __extbufend_
       112 |     char [8] __extbuf_min_
       120 |     size_t __ebs_
       128 |     std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       136 |     size_t __ibs_
       144 |     FILE * __file_
       152 |     const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       160 |     __mbstate_t __st_
       160 |       char [128] __mbstate8
       160 |       long long _mbstateL
       288 |     __mbstate_t __st_last_
       288 |       char [128] __mbstate8
       288 |       long long _mbstateL
       416 |     class ios_base::openmode __om_
       420 |     class ios_base::openmode __cm_
       424 |     _Bool __owns_eb_
       425 |     _Bool __owns_ib_
       426 |     _Bool __always_noconv_
       432 |   class std::__1::basic_ios<char> (virtual base)
       432 |     class std::__1::ios_base (primary base)
       432 |       (ios_base vtable pointer)
       440 |       std::__1::ios_base::fmtflags __fmtflags_
       448 |       std::__1::streamsize __precision_
       456 |       std::__1::streamsize __width_
       464 |       std::__1::ios_base::iostate __rdstate_
       468 |       std::__1::ios_base::iostate __exceptions_
       472 |       void * __rdbuf_
       480 |       void * __loc_
       488 |       std::__1::ios_base::event_callback * __fn_
       496 |       int * __index_
       504 |       size_t __event_size_
       512 |       size_t __event_cap_
       520 |       long * __iarray_
       528 |       size_t __iarray_size_
       536 |       size_t __iarray_cap_
       544 |       void ** __parray_
       552 |       size_t __parray_size_
       560 |       size_t __parray_cap_
       568 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       576 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=584, dsize=580, align=8,
           |  nvsize=432, nvalign=8]

*** Dumping AST Record Layout
         0 | struct C
         0 |   struct B (base)
         0 |     int n
         4 |   unsigned char x
         5 |   unsigned char y
         8 |   class std::__1::mutex m
         8 |     struct _opaque_pthread_mutex_t __m_
         8 |       long __sig
        16 |       char [56] __opaque
        72 |   class std::__1::lock_guard<class std::__1::mutex> lg
        72 |     std::__1::lock_guard<class std::__1::mutex>::mutex_type & __m_
        80 |   class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > f1
        80 |     class std::__1::basic_iostream<char> (primary base)
        80 |       class std::__1::basic_istream<char> (primary base)
        80 |         (basic_istream vtable pointer)
        88 |         std::__1::streamsize __gc_
        96 |       class std::__1::basic_ostream<char> (base)
        96 |         (basic_ostream vtable pointer)
       104 |     class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > __sb_
       104 |       class std::__1::basic_streambuf<char> (primary base)
       104 |         (basic_streambuf vtable pointer)
       112 |         class std::__1::locale __loc_
       112 |           class std::__1::locale::__imp * __locale_
       120 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
       128 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
       136 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
       144 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
       152 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
       160 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
       168 |       char * __extbuf_
       176 |       const char * __extbufnext_
       184 |       const char * __extbufend_
       192 |       char [8] __extbuf_min_
       200 |       size_t __ebs_
       208 |       std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       216 |       size_t __ibs_
       224 |       FILE * __file_
       232 |       const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       240 |       __mbstate_t __st_
       240 |         char [128] __mbstate8
       240 |         long long _mbstateL
       368 |       __mbstate_t __st_last_
       368 |         char [128] __mbstate8
       368 |         long long _mbstateL
       496 |       class ios_base::openmode __om_
       500 |       class ios_base::openmode __cm_
       504 |       _Bool __owns_eb_
       505 |       _Bool __owns_ib_
       506 |       _Bool __always_noconv_
       512 |     class std::__1::basic_ios<char> (virtual base)
       512 |       class std::__1::ios_base (primary base)
       512 |         (ios_base vtable pointer)
       520 |         std::__1::ios_base::fmtflags __fmtflags_
       528 |         std::__1::streamsize __precision_
       536 |         std::__1::streamsize __width_
       544 |         std::__1::ios_base::iostate __rdstate_
       548 |         std::__1::ios_base::iostate __exceptions_
       552 |         void * __rdbuf_
       560 |         void * __loc_
       568 |         std::__1::ios_base::event_callback * __fn_
       576 |         int * __index_
       584 |         size_t __event_size_
       592 |         size_t __event_cap_
       600 |         long * __iarray_
       608 |         size_t __iarray_size_
       616 |         size_t __iarray_cap_
       624 |         void ** __parray_
       632 |         size_t __parray_size_
       640 |         size_t __parray_cap_
       648 |       basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       656 |       std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
       664 |   class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > f2
       664 |     class std::__1::basic_iostream<char> (primary base)
       664 |       class std::__1::basic_istream<char> (primary base)
       664 |         (basic_istream vtable pointer)
       672 |         std::__1::streamsize __gc_
       680 |       class std::__1::basic_ostream<char> (base)
       680 |         (basic_ostream vtable pointer)
       688 |     class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > __sb_
       688 |       class std::__1::basic_streambuf<char> (primary base)
       688 |         (basic_streambuf vtable pointer)
       696 |         class std::__1::locale __loc_
       696 |           class std::__1::locale::__imp * __locale_
       704 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
       712 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
       720 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
       728 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
       736 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
       744 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
       752 |       char * __extbuf_
       760 |       const char * __extbufnext_
       768 |       const char * __extbufend_
       776 |       char [8] __extbuf_min_
       784 |       size_t __ebs_
       792 |       std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       800 |       size_t __ibs_
       808 |       FILE * __file_
       816 |       const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       824 |       __mbstate_t __st_
       824 |         char [128] __mbstate8
       824 |         long long _mbstateL
       952 |       __mbstate_t __st_last_
       952 |         char [128] __mbstate8
       952 |         long long _mbstateL
      1080 |       class ios_base::openmode __om_
      1084 |       class ios_base::openmode __cm_
      1088 |       _Bool __owns_eb_
      1089 |       _Bool __owns_ib_
      1090 |       _Bool __always_noconv_
      1096 |     class std::__1::basic_ios<char> (virtual base)
      1096 |       class std::__1::ios_base (primary base)
      1096 |         (ios_base vtable pointer)
      1104 |         std::__1::ios_base::fmtflags __fmtflags_
      1112 |         std::__1::streamsize __precision_
      1120 |         std::__1::streamsize __width_
      1128 |         std::__1::ios_base::iostate __rdstate_
      1132 |         std::__1::ios_base::iostate __exceptions_
      1136 |         void * __rdbuf_
      1144 |         void * __loc_
      1152 |         std::__1::ios_base::event_callback * __fn_
      1160 |         int * __index_
      1168 |         size_t __event_size_
      1176 |         size_t __event_cap_
      1184 |         long * __iarray_
      1192 |         size_t __iarray_size_
      1200 |         size_t __iarray_cap_
      1208 |         void ** __parray_
      1216 |         size_t __parray_size_
      1224 |         size_t __parray_cap_
      1232 |       basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
      1240 |       std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=1248, dsize=1248, align=8,
           |  nvsize=1248, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9fba6f3be8 </Users/tskull/Documents/Programming/Cpp/object_model_refined/2_constructors/11_member_initialization_list.cpp:5:1, line:9:1> line:5:8 referenced struct B definition
|-CXXRecordDecl 0x7f9fba6f3d08 <col:1, col:8> col:8 implicit referenced struct B
|-FieldDecl 0x7f9fba6f3db8 <line:6:5, col:9> col:9 n 'int'
|-CXXConstructorDecl 0x7f9fba6f3ef0 <line:8:5, col:22> col:5 used B 'void (int)'
| |-ParmVarDecl 0x7f9fba6f3e18 <col:7, col:11> col:11 used n 'int'
| |-CXXCtorInitializer Field 0x7f9fba6f3db8 'n' 'int'
| | `-ImplicitCastExpr 0x7f9fba6f4018 <col:18> 'int' <LValueToRValue>
| |   `-DeclRefExpr 0x7f9fba6f3fc0 <col:18> 'int' lvalue ParmVar 0x7f9fba6f3e18 'n' 'int'
| `-CompoundStmt 0x7f9fba6f4060 <col:21, col:22>
|-CXXConstructorDecl 0x7f9fba6fa4f8 <line:5:8> col:8 implicit constexpr B 'void (const struct B &)' inline default trivial noexcept-unevaluated 0x7f9fba6fa4f8
| `-ParmVarDecl 0x7f9fba6fa620 <col:8> col:8 'const struct B &'
|-CXXConstructorDecl 0x7f9fba6fa6b8 <col:8> col:8 implicit constexpr B 'void (struct B &&)' inline default trivial noexcept-unevaluated 0x7f9fba6fa6b8
| `-ParmVarDecl 0x7f9fba6fa7e0 <col:8> col:8 'struct B &&'
|-CXXDestructorDecl 0x7f9fba6fa9d8 <col:8> col:8 implicit ~B 'void (void) noexcept' inline default trivial
|-CXXMethodDecl 0x7f9fba6fae58 <col:8, <invalid sloc>> col:8 implicit operator= 'struct B &(const struct B &)' inline default trivial noexcept-unevaluated 0x7f9fba6fae58
| `-ParmVarDecl 0x7f9fba6faf70 <col:8> col:8 'const struct B &'
`-CXXMethodDecl 0x7f9fba6fafd8 <col:8, <invalid sloc>> col:8 implicit operator= 'struct B &(struct B &&)' inline default trivial noexcept-unevaluated 0x7f9fba6fafd8
  `-ParmVarDecl 0x7f9fba6fb0f0 <col:8> col:8 'struct B &&'

Layout: <CGRecordLayout
  LLVMType:%struct.B = type { i32 }
  NonVirtualBaseLLVMType:%struct.B = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9fba80f6c0 </usr/include/sys/_pthread/_pthread_types.h:78:1, line:81:1> line:78:8 struct _opaque_pthread_mutex_t definition
|-CXXRecordDecl 0x7f9fba80f7e8 <col:1, col:8> col:8 implicit struct _opaque_pthread_mutex_t
|-FieldDecl 0x7f9fba80f898 <line:79:2, col:7> col:7 __sig 'long'
|-FieldDecl 0x7f9fba80f920 <line:80:2, col:38> col:7 __opaque 'char [56]'
`-CXXDestructorDecl 0x7f9fbc9313a8 <line:78:8> col:8 implicit ~_opaque_pthread_mutex_t 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%struct._opaque_pthread_mutex_t = type { i64, [56 x i8] }
  NonVirtualBaseLLVMType:%struct._opaque_pthread_mutex_t = type { i64, [56 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9fbc930618 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:40:1, line:68:1> line:40:78 referenced class mutex definition
|-VisibilityAttr 0x7f9fbc930738 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7f9fbc930780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:40:1, col:78> col:78 implicit referenced class mutex
|-FieldDecl 0x7f9fbc930828 <line:43:5, /usr/include/pthread.h:182:64> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:43:22 referenced __m_ 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
| `-InitListExpr 0x7f9fbc931560 </usr/include/pthread.h:182:35, col:64> 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
|   |-ImplicitCastExpr 0x7f9fbc9315b0 </usr/include/pthread_impl.h:41:34> 'long' <IntegralCast>
|   | `-IntegerLiteral 0x7f9fbc931488 <col:34> 'int' 850045863
|   `-InitListExpr 0x7f9fbc9315c8 </usr/include/pthread.h:182:61, col:63> 'char [56]'
|     |-array filler
|     | `-ImplicitValueInitExpr 0x7f9fbc931628 <<invalid sloc>> 'char'
|     `-ImplicitCastExpr 0x7f9fbc931608 <col:62> 'char' <IntegralCast>
|       `-IntegerLiteral 0x7f9fbc9314a8 <col:62> 'int' 0
|-AccessSpecDecl 0x7f9fbc930870 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:48:1, col:7> col:1 public
|-CXXConstructorDecl 0x7f9fbc930938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:51:31> col:15 used constexpr mutex 'void (void) noexcept' default
| |-CXXCtorInitializer Field 0x7f9fbc930828 '__m_' 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
| | `-CXXDefaultInitExpr 0x7f9fba6fbc30 <col:15> 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
| |-CompoundStmt 0x7f9fba6fbc80 <col:31>
| |-AlwaysInlineAttr 0x7f9fbc9309e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbc930a28 <col:51, col:74> Hidden
|-CXXDestructorDecl 0x7f9fbc930a88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:55:5, col:12> col:5 used ~mutex 'void (void) noexcept'
|-AccessSpecDecl 0x7f9fbc930b28 <line:57:1, col:8> col:1 private
|-CXXConstructorDecl 0x7f9fbc930c50 <line:58:5, col:23> col:5 mutex 'void (const class std::__1::mutex &)'
| `-ParmVarDecl 0x7f9fbc930b88 <col:11, col:22> col:23 'const class std::__1::mutex &'
|-CXXMethodDecl 0x7f9fbc930e00 <line:59:5, col:34> col:12 operator= 'class std::__1::mutex &(const class std::__1::mutex &)'
| `-ParmVarDecl 0x7f9fbc930d10 <col:22, col:33> col:34 'const class std::__1::mutex &'
|-AccessSpecDecl 0x7f9fbc930ea0 <line:61:1, col:7> col:1 public
|-CXXMethodDecl 0x7f9fbc930ee8 <line:62:5, col:15> col:10 lock 'void (void)'
|-CXXMethodDecl 0x7f9fbc930fa8 <line:63:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:63:10 try_lock '_Bool (void) noexcept'
|-CXXMethodDecl 0x7f9fbc931068 <line:64:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:64:10 unlock 'void (void) noexcept'
|-TypedefDecl 0x7f9fbc931110 <line:66:5, col:31> col:31 referenced native_handle_type 'std::__1::__libcpp_mutex_t *'
| `-PointerType 0x7f9fbc8fb240 'std::__1::__libcpp_mutex_t *'
|   `-TypedefType 0x7f9fbc8fb220 'std::__1::__libcpp_mutex_t' sugar
|     |-Typedef 0x7f9fbc8fa538 '__libcpp_mutex_t'
|     `-TypedefType 0x7f9fbc8d2d80 'pthread_mutex_t' sugar
|       |-Typedef 0x7f9fbc8cb060 'pthread_mutex_t'
|       `-TypedefType 0x7f9fbc8cb030 '__darwin_pthread_mutex_t' sugar
|         |-Typedef 0x7f9fba812380 '__darwin_pthread_mutex_t'
|         `-ElaboratedType 0x7f9fba812330 'struct _opaque_pthread_mutex_t' sugar
|           `-RecordType 0x7f9fba80f760 'struct _opaque_pthread_mutex_t'
|             `-CXXRecord 0x7f9fba80f6c0 '_opaque_pthread_mutex_t'
`-CXXMethodDecl 0x7f9fbc931240 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:67:80> col:50 native_handle 'std::__1::mutex::native_handle_type (void)'
  |-CompoundStmt 0x7f9fbc931778 <col:66, col:80>
  | `-ReturnStmt 0x7f9fbc931760 <col:67, col:75>
  |   `-UnaryOperator 0x7f9fbc931740 <col:74, col:75> 'std::__1::__libcpp_mutex_t *' prefix '&'
  |     `-MemberExpr 0x7f9fbc931708 <col:75> 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t' lvalue ->__m_ 0x7f9fbc930828
  |       `-CXXThisExpr 0x7f9fbc9316f0 <col:75> 'class std::__1::mutex *' this
  |-AlwaysInlineAttr 0x7f9fbc9312d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
  `-VisibilityAttr 0x7f9fbc931320 <col:51, col:74> Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::mutex" = type { %struct._opaque_pthread_mutex_t }
  NonVirtualBaseLLVMType:%"class.std::__1::mutex" = type { %struct._opaque_pthread_mutex_t }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9fba6f4468 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:91:1, line:114:1> line:93:1 class lock_guard definition
|-TemplateArgument type 'class std::__1::mutex'
|-CXXRecordDecl 0x7f9fba6f46e0 prev 0x7f9fba6f4468 <line:92:1, line:93:1> col:1 implicit class lock_guard
|-AccessSpecDecl 0x7f9fba6f4778 <line:95:1, col:7> col:1 public
|-TypedefDecl 0x7f9fba6f47d8 <line:96:5, col:20> col:20 mutex_type 'class std::__1::mutex':'class std::__1::mutex'
| `-SubstTemplateTypeParmType 0x7f9fba6f47a0 'class std::__1::mutex' sugar
|   |-TemplateTypeParmType 0x7f9fbc934d20 '_Mutex' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9fbc934ce0 '_Mutex'
|   `-RecordType 0x7f9fbc9306b0 'class std::__1::mutex'
|     `-CXXRecord 0x7f9fbc930618 'mutex'
|-AccessSpecDecl 0x7f9fba6f4830 <line:98:1, col:8> col:1 private
|-FieldDecl 0x7f9fba6f48b8 <line:99:5, col:17> col:17 __m_ 'std::__1::lock_guard<class std::__1::mutex>::mutex_type &'
|-AccessSpecDecl 0x7f9fba6f4900 <line:100:1, col:7> col:1 public
|-CXXConstructorDecl 0x7f9fba6f4a40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:104:34> line:103:14 used lock_guard 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |-ParmVarDecl 0x7f9fba6f4938 <col:25, col:37> col:37 __m 'std::__1::lock_guard<class std::__1::mutex>::mutex_type &'
| `-AlwaysInlineAttr 0x7f9fba6f4b28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9fba6f4cd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:107:22> line:106:5 lock_guard 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &, struct std::__1::adopt_lock_t)'
| |-ParmVarDecl 0x7f9fba6f4b80 <col:16, col:28> col:28 __m 'std::__1::lock_guard<class std::__1::mutex>::mutex_type &'
| |-ParmVarDecl 0x7f9fba6f4be0 <col:33> col:45 'struct std::__1::adopt_lock_t'
| `-AlwaysInlineAttr 0x7f9fba6f4d98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7f9fba6f4e10 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:109:89> col:5 used ~lock_guard 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7f9fba6f4ec0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7f9fba6f4f08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:111:1, col:8> col:1 private
|-CXXConstructorDecl 0x7f9fba6f5050 <line:112:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:824:37> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:112:5 lock_guard 'void (const class std::__1::lock_guard<class std::__1::mutex> &)' delete trivial
| `-ParmVarDecl 0x7f9fba6f4f68 <col:16, col:32> col:33 'const class std::__1::lock_guard<class std::__1::mutex> &'
`-CXXMethodDecl 0x7f9fba6f5210 <line:113:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:824:37> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:113:17 operator= 'class std::__1::lock_guard<class std::__1::mutex> &(const class std::__1::lock_guard<class std::__1::mutex> &)' delete trivial
  `-ParmVarDecl 0x7f9fba6f5148 <col:27, col:43> col:44 'const class std::__1::lock_guard<class std::__1::mutex> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::lock_guard" = type { %"class.std::__1::mutex"* }
  NonVirtualBaseLLVMType:%"class.std::__1::lock_guard" = type { %"class.std::__1::mutex"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9fbcae4ca0 prev 0x7f9fbb87f720 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, line:386:1> line:231:24 referenced class ios_base definition
|-VisibilityAttr 0x7f9fbcae4da0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7f9fbcae4de8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, col:24> col:24 implicit referenced class ios_base
|-AccessSpecDecl 0x7f9fbcae4e80 <line:233:1, col:7> col:1 public
|-CXXRecordDecl 0x7f9fbcae4ed8 <line:234:5, col:33> col:33 class failure
| `-VisibilityAttr 0x7f9fbcae4f90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:701:47, col:71> Default
|-TypedefDecl 0x7f9fbcae4ff0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:236:5, col:26> col:26 referenced fmtflags 'unsigned int'
| `-BuiltinType 0x7f9fba033660 'unsigned int'
|-VarDecl 0x7f9fbcae5080 <line:237:5, col:41> col:27 referenced boolalpha 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae5100 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae50e0 <col:41> 'int' 1
|-VarDecl 0x7f9fbcae5180 <line:238:5, col:41> col:27 referenced dec 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae5200 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae51e0 <col:41> 'int' 2
|-VarDecl 0x7f9fbcae5280 <line:239:5, col:41> col:27 referenced fixed 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae5300 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae52e0 <col:41> 'int' 4
|-VarDecl 0x7f9fbcae5380 <line:240:5, col:41> col:27 referenced hex 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae5400 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae53e0 <col:41> 'int' 8
|-VarDecl 0x7f9fbcae5480 <line:241:5, col:41> col:27 referenced internal 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae5500 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae54e0 <col:41> 'int' 16
|-VarDecl 0x7f9fbcae5580 <line:242:5, col:41> col:27 referenced left 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae5600 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae55e0 <col:41> 'int' 32
|-VarDecl 0x7f9fbcae5680 <line:243:5, col:41> col:27 referenced oct 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae5700 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae56e0 <col:41> 'int' 64
|-VarDecl 0x7f9fbcae5780 <line:244:5, col:41> col:27 referenced right 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae5800 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae57e0 <col:41> 'int' 128
|-VarDecl 0x7f9fbcae5880 <line:245:5, col:41> col:27 referenced scientific 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae5900 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae58e0 <col:41> 'int' 256
|-VarDecl 0x7f9fbcae5980 <line:246:5, col:41> col:27 referenced showbase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae5a00 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae59e0 <col:41> 'int' 512
|-VarDecl 0x7f9fbcae5a80 <line:247:5, col:41> col:27 referenced showpoint 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae5b00 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae5ae0 <col:41> 'int' 1024
|-VarDecl 0x7f9fbcae5b80 <line:248:5, col:41> col:27 referenced showpos 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae5c00 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae5be0 <col:41> 'int' 2048
|-VarDecl 0x7f9fbcae5c80 <line:249:5, col:41> col:27 referenced skipws 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae5d00 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae5ce0 <col:41> 'int' 4096
|-VarDecl 0x7f9fbcae5d80 <line:250:5, col:41> col:27 referenced unitbuf 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae5e00 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae5de0 <col:41> 'int' 8192
|-VarDecl 0x7f9fbcae5e80 <line:251:5, col:41> col:27 referenced uppercase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae5f00 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae5ee0 <col:41> 'int' 16384
|-VarDecl 0x7f9fbcae5f80 <line:252:5, col:56> col:27 referenced adjustfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7f9fbcae60c8 <col:41, col:56> 'unsigned int' '|'
|   |-BinaryOperator 0x7f9fbcae6060 <col:41, col:48> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7f9fbcae6030 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7f9fbcae5fe0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f9fbcae5580 'left' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7f9fbcae6048 <col:48> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7f9fbcae6008 <col:48> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f9fbcae5780 'right' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7f9fbcae60b0 <col:56> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f9fbcae6088 <col:56> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f9fbcae5480 'internal' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7f9fbcae6158 <line:253:5, col:53> col:27 referenced basefield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7f9fbcae62a0 <col:41, col:53> 'unsigned int' '|'
|   |-BinaryOperator 0x7f9fbcae6238 <col:41, col:47> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7f9fbcae6208 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7f9fbcae61b8 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f9fbcae5180 'dec' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7f9fbcae6220 <col:47> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7f9fbcae61e0 <col:47> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f9fbcae5680 'oct' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7f9fbcae6288 <col:53> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f9fbcae6260 <col:53> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f9fbcae5380 'hex' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7f9fbcae6330 <line:254:5, col:54> col:27 referenced floatfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7f9fbcae6410 <col:41, col:54> 'unsigned int' '|'
|   |-ImplicitCastExpr 0x7f9fbcae63e0 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | `-DeclRefExpr 0x7f9fbcae6390 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f9fbcae5880 'scientific' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7f9fbcae63f8 <col:54> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f9fbcae63b8 <col:54> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f9fbcae5280 'fixed' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-TypedefDecl 0x7f9fbcae64a8 <line:256:5, col:26> col:26 referenced iostate 'unsigned int'
| `-BuiltinType 0x7f9fba033660 'unsigned int'
|-VarDecl 0x7f9fbcae6530 <line:257:5, col:36> col:26 referenced badbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae65b0 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae6590 <col:36> 'int' 1
|-VarDecl 0x7f9fbcae6630 <line:258:5, col:36> col:26 referenced eofbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae66b0 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae6690 <col:36> 'int' 2
|-VarDecl 0x7f9fbcae6730 <line:259:5, col:36> col:26 referenced failbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae67b0 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae6790 <col:36> 'int' 4
|-VarDecl 0x7f9fbcae6830 <line:260:5, col:36> col:26 referenced goodbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae68b0 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae6890 <col:36> 'int' 0
|-TypedefDecl 0x7f9fbcae6938 <line:262:5, col:26> col:26 referenced openmode 'unsigned int'
| `-BuiltinType 0x7f9fba033660 'unsigned int'
|-VarDecl 0x7f9fbcae69c0 <line:263:5, col:36> col:27 referenced app 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae6a40 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae6a20 <col:36> 'int' 1
|-VarDecl 0x7f9fbcae6ac0 <line:264:5, col:36> col:27 referenced ate 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae6b40 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae6b20 <col:36> 'int' 2
|-VarDecl 0x7f9fbcae6bc0 <line:265:5, col:36> col:27 referenced binary 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae6c40 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae6c20 <col:36> 'int' 4
|-VarDecl 0x7f9fbcae6cc0 <line:266:5, col:36> col:27 referenced in 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae6d40 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae6d20 <col:36> 'int' 8
|-VarDecl 0x7f9fbcae6dc0 <line:267:5, col:36> col:27 referenced out 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae6e40 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae6e20 <col:36> 'int' 16
|-VarDecl 0x7f9fbcae6ec0 <line:268:5, col:36> col:27 referenced trunc 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f9fbcae6f40 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f9fbcae6f20 <col:36> 'int' 32
|-EnumDecl 0x7f9fbcae6fb0 <line:270:5, col:32> col:10 referenced seekdir
| |-EnumConstantDecl 0x7f9fbcae7070 <col:19> col:19 referenced beg 'enum std::__1::ios_base::seekdir'
| |-EnumConstantDecl 0x7f9fbcae70b8 <col:24> col:24 referenced cur 'enum std::__1::ios_base::seekdir'
| `-EnumConstantDecl 0x7f9fbcae7100 <col:29> col:29 referenced end 'enum std::__1::ios_base::seekdir'
|-TypedefDecl 0x7f9fbcae7158 <line:273:5, col:26> col:26 io_state 'std::__1::ios_base::iostate':'unsigned int'
| `-TypedefType 0x7f9fbcae6500 'std::__1::ios_base::iostate' sugar
|   |-Typedef 0x7f9fbcae64a8 'iostate'
|   `-BuiltinType 0x7f9fba033660 'unsigned int'
|-TypedefDecl 0x7f9fbcae71c0 <line:274:5, col:26> col:26 open_mode 'std::__1::ios_base::openmode':'unsigned int'
| `-TypedefType 0x7f9fbcae6990 'std::__1::ios_base::openmode' sugar
|   |-Typedef 0x7f9fbcae6938 'openmode'
|   `-BuiltinType 0x7f9fba033660 'unsigned int'
|-TypedefDecl 0x7f9fbcae7228 <line:275:5, col:26> col:26 seek_dir 'enum std::__1::ios_base::seekdir'
| `-EnumType 0x7f9fbcae7050 'enum std::__1::ios_base::seekdir'
|   `-Enum 0x7f9fbcae6fb0 'seekdir'
|-TypedefDecl 0x7f9fbcae7340 <line:277:5, col:30> col:30 streamoff 'std::__1::streamoff':'long long'
| `-ElaboratedType 0x7f9fbcae72d0 'std::__1::streamoff' sugar
|   `-TypedefType 0x7f9fba237a80 'std::__1::streamoff' sugar
|     |-Typedef 0x7f9fbb88e558 'streamoff'
|     `-BuiltinType 0x7f9fba033600 'long long'
|-TypedefDecl 0x7f9fbcae7420 <line:278:5, col:30> col:30 streampos 'std::__1::streampos':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f9fbcae73b0 'std::__1::streampos' sugar
|   `-TypedefType 0x7f9fba237b10 'std::__1::streampos' sugar
|     |-Typedef 0x7f9fbb88e1b8 'streampos'
|     `-TemplateSpecializationType 0x7f9fbb88e110 'fpos<mbstate_t>' sugar fpos
|       |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|       `-RecordType 0x7f9fbb88e0f0 'class std::__1::fpos<__mbstate_t>'
|         `-ClassTemplateSpecialization 0x7f9fbb88e000 'fpos'
|-CXXRecordDecl 0x7f9fbcae74a8 <line:281:5, col:28> col:28 class Init
| `-VisibilityAttr 0x7f9fbcae7560 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXMethodDecl 0x7f9fbcae7690 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:284:48> col:40 flags 'std::__1::ios_base::fmtflags (void) const'
| |-AlwaysInlineAttr 0x7f9fbcae7728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbcae7770 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbcae78b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:285:62> col:40 flags 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f9fbcae77c0 <col:46, col:55> col:55 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f9fbcae7950 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbcae7998 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbcae7a70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:286:61> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f9fbcae79e8 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f9fbcae7b10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbcae7b58 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbcae7d30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:287:78> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags, std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f9fbcae7ba8 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-ParmVarDecl 0x7f9fbcae7c18 <col:63, col:72> col:72 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f9fbcae7dd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbcae7e20 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbcae7f30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:288:58> col:36 used unsetf 'void (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f9fbcae7e70 <col:43, col:52> col:52 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f9fbcae7fd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbcae8018 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbcae80d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:290:54> col:42 precision 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7f9fbcae8168 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbcae81b0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbcae82c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:291:69> col:42 precision 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7f9fbcae8200 <col:52, col:63> col:63 __prec 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7f9fbcae8360 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbcae83a8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbcae8408 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:292:50> col:42 width 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7f9fbcae84a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbcae84e8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbcae85c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:293:65> col:42 width 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7f9fbcae8538 <col:48, col:59> col:59 __wide 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7f9fbcae8660 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbcae86a8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbcae8750 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:296:5, col:37> col:12 referenced imbue 'class std::__1::locale (const class std::__1::locale &)'
| `-ParmVarDecl 0x7f9fbcae86c8 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f9fbcae8840 <line:297:5, col:21> col:12 referenced getloc 'class std::__1::locale (void) const'
|-CXXMethodDecl 0x7f9fbcae8900 <line:300:5, col:23> col:16 xalloc 'int (void)' static
|-CXXMethodDecl 0x7f9fbcae8a40 <line:301:5, col:28> col:11 iword 'long &(int)'
| `-ParmVarDecl 0x7f9fbcae89b0 <col:17, col:21> col:21 __index 'int'
|-CXXMethodDecl 0x7f9fbcae8bc8 <line:302:5, col:29> col:12 pword 'void *&(int)'
| `-ParmVarDecl 0x7f9fbcae8af8 <col:18, col:22> col:22 __index 'int'
|-CXXDestructorDecl 0x7f9fbcae8cb8 <line:305:5, col:23> col:13 ~ios_base 'void (void) noexcept' virtual
|-EnumDecl 0x7f9fbcae8d58 <line:308:5, col:58> col:10 referenced event
| |-EnumConstantDecl 0x7f9fbcae8e10 <col:18> col:18 referenced erase_event 'enum std::__1::ios_base::event'
| |-EnumConstantDecl 0x7f9fbcae8e58 <col:31> col:31 imbue_event 'enum std::__1::ios_base::event'
| `-EnumConstantDecl 0x7f9fbcae8ea0 <col:44> col:44 referenced copyfmt_event 'enum std::__1::ios_base::event'
|-TypedefDecl 0x7f9fbcae9160 <line:309:5, col:65> col:20 referenced event_callback 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-PointerType 0x7f9fbcae90f0 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
|   `-ParenType 0x7f9fbcae9090 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' sugar
|     `-FunctionProtoType 0x7f9fbcae9040 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' cdecl
|       |-BuiltinType 0x7f9fba033520 'void'
|       |-EnumType 0x7f9fbcae8df0 'enum std::__1::ios_base::event'
|       | `-Enum 0x7f9fbcae8d58 'event'
|       |-LValueReferenceType 0x7f9fbbbe0ac0 'class std::__1::ios_base &'
|       | `-RecordType 0x7f9fbb87f7c0 'class std::__1::ios_base'
|       |   `-CXXRecord 0x7f9fbcae4ca0 'ios_base'
|       `-BuiltinType 0x7f9fba0335c0 'int'
|-CXXMethodDecl 0x7f9fbcae9380 <line:310:5, col:60> col:10 register_callback 'void (std::__1::ios_base::event_callback, int)'
| |-ParmVarDecl 0x7f9fbcae91f0 <col:28, col:43> col:43 __fn 'std::__1::ios_base::event_callback':'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-ParmVarDecl 0x7f9fbcae9268 <col:49, col:53> col:53 __index 'int'
|-AccessSpecDecl 0x7f9fbcae9428 <line:312:1, col:8> col:1 private
|-CXXConstructorDecl 0x7f9fbcae9570 <line:313:5, col:29> col:5 ios_base 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f9fbcae9488 <col:14, col:28> col:29 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7f9fbcae96f0 <line:314:5, col:40> col:15 operator= 'class std::__1::ios_base &(const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f9fbcae9630 <col:25, col:39> col:40 'const class std::__1::ios_base &'
|-AccessSpecDecl 0x7f9fbcae9790 <line:316:1, col:7> col:1 public
|-CXXMethodDecl 0x7f9fbcae9890 <line:317:5, col:51> col:17 sync_with_stdio '_Bool (_Bool)' static
| `-ParmVarDecl 0x7f9fbcae97c8 <col:33, col:47> col:38 __sync '_Bool' cinit
|   `-CXXBoolLiteralExpr 0x7f9fbcaebc88 <col:47> '_Bool' true
|-CXXMethodDecl 0x7f9fbcae99b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:319:49> col:39 rdstate 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7f9fbcae9a48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbcae9a90 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbcae9b70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:320:5, col:41> col:10 used clear 'void (std::__1::ios_base::iostate)'
| `-ParmVarDecl 0x7f9fbcae9ab0 <col:16, col:34> col:24 __state 'std::__1::ios_base::iostate':'unsigned int' cinit
|   `-ImplicitCastExpr 0x7f9fbcaebcc8 <col:34> 'std::__1::ios_base::iostate':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f9fbcaebca0 <col:34> 'const std::__1::ios_base::iostate':'const unsigned int' lvalue Var 0x7f9fbcae6830 'goodbit' 'const std::__1::ios_base::iostate':'const unsigned int'
|-CXXMethodDecl 0x7f9fbcae9cd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:321:60> col:36 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f9fbcae9c50 <col:45, col:53> col:53 __state 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7f9fbcae9d78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbcae9dc0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbcae9e20 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:323:43> col:36 good '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f9fbcae9eb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbcae9f00 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbcae9f60 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:324:42> col:36 eof '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f9fbcae9ff8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbcaea040 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbcaea0a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:325:43> col:36 fail '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f9fbcaea138 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbcaea180 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbcaea1e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:326:42> col:36 bad '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f9fbcaea278 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbcaea2c0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbcaea320 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:328:52> col:39 exceptions 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7f9fbcaea3b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbcaea400 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbcaea4d8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:329:64> col:36 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f9fbcaea450 <col:47, col:55> col:55 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7f9fbcaea578 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbcaea5c0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbcaea5f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:331:5, col:44> col:10 __set_badbit_and_consider_rethrow 'void (void)'
|-CXXMethodDecl 0x7f9fbcaea6a8 <line:332:5, col:45> col:10 __set_failbit_and_consider_rethrow 'void (void)'
|-AccessSpecDecl 0x7f9fbcaea740 <line:334:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f9fbcaea7b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:337:16> line:336:5 ios_base 'void (void)'
| |-CompoundStmt 0x7f9fbcaebce0 <col:16, line:337:16>
| |-AlwaysInlineAttr 0x7f9fbcaea860 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbcaea8a8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbcaea958 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:339:5, col:25> col:10 referenced init 'void (void *)'
| `-ParmVarDecl 0x7f9fbcaea8d0 <col:15, col:21> col:21 __sb 'void *'
|-CXXMethodDecl 0x7f9fbcaeaa88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:340:64> col:33 rdbuf 'void *(void) const'
| |-CompoundStmt 0x7f9fbcaebd78 <col:47, col:64>
| | `-ReturnStmt 0x7f9fbcaebd60 <col:48, col:55>
| |   `-ImplicitCastExpr 0x7f9fbcaebd48 <col:55> 'void *' <LValueToRValue>
| |     `-MemberExpr 0x7f9fbcaebd10 <col:55> 'void *const' lvalue ->__rdbuf_ 0x7f9fbcaeb698
| |       `-CXXThisExpr 0x7f9fbcaebcf8 <col:55> 'const class std::__1::ios_base *' this
| |-AlwaysInlineAttr 0x7f9fbcaeab20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f9fbcaeab68 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f9fbcaeac48 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:347:5> line:343:10 rdbuf 'void (void *)'
| |-ParmVarDecl 0x7f9fbcaeabc0 <col:16, col:22> col:22 used __sb 'void *'
| |-CompoundStmt 0x7f9fbcaebef8 <line:344:5, line:347:5>
| | |-BinaryOperator 0x7f9fbcaebe28 <line:345:9, col:20> 'void *' lvalue '='
| | | |-MemberExpr 0x7f9fbcaebdb0 <col:9> 'void *' lvalue ->__rdbuf_ 0x7f9fbcaeb698
| | | | `-CXXThisExpr 0x7f9fbcaebd98 <col:9> 'class std::__1::ios_base *' this
| | | `-ImplicitCastExpr 0x7f9fbcaebe10 <col:20> 'void *' <LValueToRValue>
| | |   `-DeclRefExpr 0x7f9fbcaebde8 <col:20> 'void *' lvalue ParmVar 0x7f9fbcaeabc0 '__sb' 'void *'
| | `-CXXMemberCallExpr 0x7f9fbcaebea0 <line:346:9, col:15> 'void'
| |   |-MemberExpr 0x7f9fbcaebe68 <col:9> '<bound member function type>' ->clear 0x7f9fbcae9b70
| |   | `-CXXThisExpr 0x7f9fbcaebe50 <col:9> 'class std::__1::ios_base *' this
| |   `-CXXDefaultArgExpr 0x7f9fbcaebed8 <<invalid sloc>> 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7f9fbcaeace8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f9fbcaead30 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f9fbcaeae10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:349:5, col:32> col:10 referenced __call_callbacks 'void (enum std::__1::ios_base::event)'
| `-ParmVarDecl 0x7f9fbcaead50 <col:27> col:32 'enum std::__1::ios_base::event'
|-CXXMethodDecl 0x7f9fbcaeaf48 <line:350:5, col:33> col:10 referenced copyfmt 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f9fbcaeaec0 <col:18, col:32> col:33 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7f9fbcaeb0c0 <line:351:5, col:24> col:10 referenced move 'void (class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f9fbcaeaff8 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7f9fbcaeb238 <line:352:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:352:10 referenced swap 'void (class std::__1::ios_base &) noexcept'
| `-ParmVarDecl 0x7f9fbcaeb170 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7f9fbcaeb3a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:358:5> line:355:10 referenced set_rdbuf 'void (void *)'
| |-ParmVarDecl 0x7f9fbcaeb320 <col:20, col:26> col:26 used __sb 'void *'
| |-CompoundStmt 0x7f9fbcaebfd8 <line:356:5, line:358:5>
| | `-BinaryOperator 0x7f9fbcaebfb0 <line:357:9, col:20> 'void *' lvalue '='
| |   |-MemberExpr 0x7f9fbcaebf38 <col:9> 'void *' lvalue ->__rdbuf_ 0x7f9fbcaeb698
| |   | `-CXXThisExpr 0x7f9fbcaebf20 <col:9> 'class std::__1::ios_base *' this
| |   `-ImplicitCastExpr 0x7f9fbcaebf98 <col:20> 'void *' <LValueToRValue>
| |     `-DeclRefExpr 0x7f9fbcaebf70 <col:20> 'void *' lvalue ParmVar 0x7f9fbcaeb320 '__sb' 'void *'
| |-AlwaysInlineAttr 0x7f9fbcaeb448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f9fbcaeb490 <col:48, col:71> Hidden
|-AccessSpecDecl 0x7f9fbcaeb4a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:360:1, col:8> col:1 private
|-FieldDecl 0x7f9fbcaeb4d8 <line:362:5, col:21> col:21 referenced __fmtflags_ 'std::__1::ios_base::fmtflags':'unsigned int'
|-FieldDecl 0x7f9fbcaeb530 <line:363:5, col:21> col:21 referenced __precision_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7f9fbcaeb588 <line:364:5, col:21> col:21 referenced __width_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7f9fbcaeb5e0 <line:365:5, col:21> col:21 referenced __rdstate_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7f9fbcaeb638 <line:366:5, col:21> col:21 referenced __exceptions_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7f9fbcaeb698 <line:367:5, col:21> col:21 referenced __rdbuf_ 'void *'
|-FieldDecl 0x7f9fbcaeb6f8 <line:368:5, col:21> col:21 __loc_ 'void *'
|-FieldDecl 0x7f9fbcaeb7a8 <line:369:5, col:21> col:21 __fn_ 'std::__1::ios_base::event_callback *'
|-FieldDecl 0x7f9fbcaeb808 <line:370:5, col:21> col:21 __index_ 'int *'
|-FieldDecl 0x7f9fbcaeb860 <line:371:5, col:21> col:21 __event_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7f9fbcaeb8b8 <line:372:5, col:21> col:21 __event_cap_ 'size_t':'unsigned long'
|-VarDecl 0x7f9fbcaeb9c8 <line:376:5, col:24> col:24 __xindex_ 'atomic<int>':'struct std::__1::atomic<int>' static
|-FieldDecl 0x7f9fbcaeba40 <line:380:5, col:21> col:21 __iarray_ 'long *'
|-FieldDecl 0x7f9fbcaeba98 <line:381:5, col:21> col:21 __iarray_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7f9fbcaebaf0 <line:382:5, col:21> col:21 __iarray_cap_ 'size_t':'unsigned long'
|-FieldDecl 0x7f9fbcaebb50 <line:383:5, col:21> col:21 __parray_ 'void **'
|-FieldDecl 0x7f9fbcaebba8 <line:384:5, col:21> col:21 __parray_size_ 'size_t':'unsigned long'
`-FieldDecl 0x7f9fbcaebc00 <line:385:5, col:21> col:21 __parray_cap_ 'size_t':'unsigned long'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9fbb8883f8 parent 0x7f9fbb87f688 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:486:78> col:64 class basic_ios definition
|-public 'class std::__1::ios_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f9fbcb3e018 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7f9fbcb3e108 prev 0x7f9fbb8883f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:583:1, col:28> col:28 implicit class basic_ios
|-AccessSpecDecl 0x7f9fbcb3e1a0 <line:586:1, col:7> col:1 public
|-TypedefDecl 0x7f9fbcb3e208 <line:588:5, col:20> col:20 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f9fbcb3e1d0 'char' sugar
|   |-TemplateTypeParmType 0x7f9fbcafd810 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9fbcafd7d0 '_CharT'
|   `-BuiltinType 0x7f9fba033560 'char'
|-TypedefDecl 0x7f9fbcb3e298 <line:589:5, col:21> col:21 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f9fbcb3e260 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f9fbcafd880 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f9fbcafd838 '_Traits'
|   `-RecordType 0x7f9fbb888360 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f9fba241548 'char_traits'
|-TypedefDecl 0x7f9fbcb3e3a0 <line:591:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f9fbcb3e350 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f9fba243090 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f9fba2418a8 'int_type'
|     `-BuiltinType 0x7f9fba0335c0 'int'
|-TypedefDecl 0x7f9fbcb3e470 <line:592:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f9fbcb3e420 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f9fbcb2e9a0 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f9fba241978 'pos_type'
|     `-TypedefType 0x7f9fba237b10 'std::__1::streampos' sugar
|       |-Typedef 0x7f9fbb88e1b8 'streampos'
|       `-TemplateSpecializationType 0x7f9fbb88e110 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f9fbb88e0f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f9fbb88e000 'fpos'
|-TypedefDecl 0x7f9fbcb3e540 <line:593:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f9fbcb3e4f0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f9fbcb2ea90 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f9fba241910 'off_type'
|     `-TypedefType 0x7f9fba237a80 'std::__1::streamoff' sugar
|       |-Typedef 0x7f9fbb88e558 'streamoff'
|       `-BuiltinType 0x7f9fba033600 'long long'
|-CXXConversionDecl 0x7f9fbcb3e598 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:605:60> col:22 operator bool '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f9fbcb3e668 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fbcb3e6b8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:608:69> col:32 operator! '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f9fbcb3e760 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fbcb3e7a8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:609:81> col:35 rdstate 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7f9fbcb3e850 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fbcb3e920 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:610:91> col:32 clear 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f9fbcb3e898 <col:38, col:56> col:46 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7f9fbcb3e9d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fbcb3eaa0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:611:87> col:32 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f9fbcb3ea18 <col:41, col:49> col:49 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7f9fbcb3eb50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fbcb3eb98 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:612:70> col:32 good '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f9fbcb3ec40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fbcb3ec88 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:613:69> col:32 eof '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f9fbcb3ed30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fbcb3ed78 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:614:70> col:32 fail '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f9fbcb3ee20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fbcb3ee68 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:615:69> col:32 bad '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f9fbcb3ef10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fbcb3ef58 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:617:85> col:35 exceptions 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7f9fbcb3f000 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fbcb3f0d0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:618:95> col:32 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f9fbcb3f048 <col:43, col:51> col:51 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7f9fbcb3f180 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXConstructorDecl 0x7f9fbcb3f430 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:622:68> col:14 basic_ios 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f9fbcb3f2e8 <col:24, col:64> col:64 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f9fbcb3f4f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7f9fbcb3f568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:623:5, col:24> col:13 used ~basic_ios 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7f9fbcb3f7c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:627:50> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7f9fbcb3f868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9fbcb3fba0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:629:95> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f9fbcb3fa58 <col:48, col:87> col:87 __tiestr 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f9fbcb3fc50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9fbcb3fe10 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:632:54> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7f9fbcb3feb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9fbcb401f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:634:97> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f9fbcb400a8 <col:52, col:93> col:93 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f9fbcb402a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9fbcb40420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:636:5, col:46> col:16 copyfmt 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)'
| `-ParmVarDecl 0x7f9fbcb40358 <col:24, col:41> col:41 __rhs 'const class std::__1::basic_ios<char> &'
|-CXXMethodDecl 0x7f9fbcb40520 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:639:22> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (void) const'
| `-AlwaysInlineAttr 0x7f9fbcb405c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9fbcb40720 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:641:34> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7f9fbcb40620 <col:20, col:30> col:30 __ch 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7f9fbcb407d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9fbcb408a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:644:37> col:12 imbue 'class std::__1::locale (const class std::__1::locale &)'
| |-ParmVarDecl 0x7f9fbcb40818 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7f9fbcb40950 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9fbcb40ae0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:647:47> col:10 narrow 'char (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, char) const'
| |-ParmVarDecl 0x7f9fbcb409a8 <col:17, col:27> col:27 __c 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| |-ParmVarDecl 0x7f9fbcb40a08 <col:32, col:37> col:37 __dfault 'char'
| `-AlwaysInlineAttr 0x7f9fbcb40b98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9fbcb40ca0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:649:31> col:15 widen 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (char) const'
| |-ParmVarDecl 0x7f9fbcb40be0 <col:21, col:26> col:26 __c 'char'
| `-AlwaysInlineAttr 0x7f9fbcb40d50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7f9fbcb40d98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:651:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f9fbcb40de0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:654:17> line:653:5 basic_ios 'void (void)'
| `-AlwaysInlineAttr 0x7f9fbcb40e98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fbcb410a0 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:656:60> col:10 init 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f9fbcb40fd8 <col:15, col:56> col:56 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f9fbcb41150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9fbcb41270 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:659:31> col:10 move 'void (class std::__1::basic_ios<char> &)'
| |-ParmVarDecl 0x7f9fbcb411a8 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7f9fbcb41320 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9fbcb41470 <line:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:662:47> col:10 move 'void (class std::__1::basic_ios<char> &&)'
| |-ParmVarDecl 0x7f9fbcb413a8 <col:15, col:27> col:27 __rhs 'class std::__1::basic_ios<char> &&'
| `-AlwaysInlineAttr 0x7f9fbcb41520 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fbcb41648 <line:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:665:10 swap 'void (class std::__1::basic_ios<char> &) noexcept'
| |-ParmVarDecl 0x7f9fbcb41578 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7f9fbcb416f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9fbcb41900 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:667:65> col:10 set_rdbuf 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f9fbcb41838 <col:20, col:61> col:61 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f9fbcb419b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7f9fbcb419f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:668:1, col:8> col:1 private
|-FieldDecl 0x7f9fbcb41b18 <line:669:5, col:44> col:44 __tie_ 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
|-FieldDecl 0x7f9fbcb41b90 <line:670:6, col:23> col:23 __fill_ 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' mutable
|-CXXConstructorDecl 0x7f9fbcb41c18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:486:64> col:64 implicit basic_ios 'void (const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7f9fbcb41c18
| `-ParmVarDecl 0x7f9fbcb41d40 <col:64> col:64 'const class std::__1::basic_ios<char> &'
`-CXXMethodDecl 0x7f9fbcb41da8 <col:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7f9fbcb41da8
  `-ParmVarDecl 0x7f9fbcb41e80 <col:64> col:64 'const class std::__1::basic_ios<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ios" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9fbb888dc8 parent 0x7f9fbb87f688 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1681:82> col:64 class basic_istream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f9fba66c668 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7f9fba66c8a0 prev 0x7f9fbb888dc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:176:1, col:28> col:28 implicit class basic_istream
|-FieldDecl 0x7f9fba66c938 <line:179:5, col:16> col:16 __gc_ 'std::__1::streamsize':'long'
|-AccessSpecDecl 0x7f9fba66c980 <line:180:1, col:7> col:1 public
|-TypedefDecl 0x7f9fba66c9b8 <line:182:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f9fba66c730 'char' sugar
|   |-TemplateTypeParmType 0x7f9fba60db90 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9fba60db48 '_CharT'
|   `-BuiltinType 0x7f9fba033560 'char'
|-TypedefDecl 0x7f9fba66ca20 <line:183:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f9fba66c770 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f9fba60dc00 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f9fba60dbb8 '_Traits'
|   `-RecordType 0x7f9fbb888360 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f9fba241548 'char_traits'
|-TypedefDecl 0x7f9fba66cb30 <line:184:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f9fba66cae0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f9fba243090 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f9fba2418a8 'int_type'
|     `-BuiltinType 0x7f9fba0335c0 'int'
|-TypedefDecl 0x7f9fba66cc00 <line:185:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f9fba66cbb0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f9fbcb2e9a0 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f9fba241978 'pos_type'
|     `-TypedefType 0x7f9fba237b10 'std::__1::streampos' sugar
|       |-Typedef 0x7f9fbb88e1b8 'streampos'
|       `-TemplateSpecializationType 0x7f9fbb88e110 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f9fbb88e0f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f9fbb88e000 'fpos'
|-TypedefDecl 0x7f9fba66ccd0 <line:186:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f9fba66cc80 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f9fbcb2ea90 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f9fba241910 'off_type'
|     `-TypedefType 0x7f9fba237a80 'std::__1::streamoff' sugar
|       |-Typedef 0x7f9fbb88e558 'streamoff'
|       `-BuiltinType 0x7f9fba033600 'long long'
|-CXXConstructorDecl 0x7f9fba66cf50 <line:189:5, line:191:25> line:190:14 basic_istream 'void (basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7f9fba66ce48 <col:28, col:69> col:69 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f9fba66d038 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXDestructorDecl 0x7f9fba66d0b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:192:5, col:28> col:13 ~basic_istream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7f9fba66d160 <line:193:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f9fba66d2b0 <line:195:5, line:196:40> col:5 basic_istream 'void (class std::__1::basic_istream<char> &&)' inline
| |-ParmVarDecl 0x7f9fba66d1c8 <col:19, col:35> col:35 __rhs 'class std::__1::basic_istream<char> &&'
| `-AlwaysInlineAttr 0x7f9fba66d370 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f9fba66d4c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:199:5, line:200:51> col:20 operator= 'class std::__1::basic_istream<char> &(class std::__1::basic_istream<char> &&)' inline
| |-ParmVarDecl 0x7f9fba66d3f8 <col:30, col:46> col:46 __rhs 'class std::__1::basic_istream<char> &&'
| `-AlwaysInlineAttr 0x7f9fba66d570 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f9fba66d690 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:203:5, line:207:5> line:204:10 swap 'void (class std::__1::basic_istream<char> &)' inline
| |-ParmVarDecl 0x7f9fba66d5c8 <col:15, col:30> col:30 __rhs 'class std::__1::basic_istream<char> &'
| `-AlwaysInlineAttr 0x7f9fba66d740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXConstructorDecl 0x7f9fba66d8b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:210:5, col:65> col:5 basic_istream 'void (const class std::__1::basic_istream<char> &)' delete
| `-ParmVarDecl 0x7f9fba66d7c8 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_istream<char> &'
|-CXXMethodDecl 0x7f9fba66da40 <line:211:5, col:65> col:20 operator= 'class std::__1::basic_istream<char> &(const class std::__1::basic_istream<char> &)' delete
| `-ParmVarDecl 0x7f9fba66d980 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_istream<char> &'
|-AccessSpecDecl 0x7f9fba66daf0 <line:213:1, col:7> col:1 public
|-CXXRecordDecl 0x7f9fba66db18 <line:216:5, col:32> col:32 class sentry definition
| |-CXXRecordDecl 0x7f9fba672480 prev 0x7f9fba66db18 <line:293:1, col:60> col:60 implicit class sentry
| |-FieldDecl 0x7f9fba672518 <line:295:5, col:10> col:10 __ok_ '_Bool'
| |-CXXConstructorDecl 0x7f9fba6726a0 <line:297:5, col:25> col:5 sentry 'void (const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7f9fba672598 <col:12, col:24> col:25 'const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x7f9fba672860 <line:298:5, col:36> col:13 operator= 'class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7f9fba672798 <col:23, col:35> col:36 'const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x7f9fba672910 <line:300:1, col:7> col:1 public
| |-CXXConstructorDecl 0x7f9fba672c30 <line:301:5, col:82> col:14 sentry 'void (basic_istream<char, struct std::__1::char_traits<char> > &, _Bool)'
| | |-ParmVarDecl 0x7f9fba672a98 <col:21, col:53> col:53 __is 'basic_istream<char, struct std::__1::char_traits<char> > &'
| | `-ParmVarDecl 0x7f9fba672af8 <col:59, col:77> col:64 __noskipws '_Bool'
| `-CXXConversionDecl 0x7f9fba672cf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:306:45> col:9 operator bool '_Bool (void) const'
|   `-AlwaysInlineAttr 0x7f9fba672dc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9fba66de50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:219:5, line:221:27> line:220:20 operator>> 'class std::__1::basic_istream<char> &(class std::__1::basic_istream<char> &(*)(class std::__1::basic_istream<char> &))' inline
| |-ParmVarDecl 0x7f9fba66dd50 <col:31, col:68> col:48 __pf 'class std::__1::basic_istream<char> &(*)(class std::__1::basic_istream<char> &)'
| `-AlwaysInlineAttr 0x7f9fba66df00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fba66e370 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:223:5, line:226:34> line:224:20 operator>> 'class std::__1::basic_istream<char> &(basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &))' inline
| |-ParmVarDecl 0x7f9fba66e270 <col:31, line:225:73> col:33 __pf 'basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &)'
| `-AlwaysInlineAttr 0x7f9fba66e420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fba66e570 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:228:5, line:230:34> line:229:20 operator>> 'class std::__1::basic_istream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))' inline
| |-ParmVarDecl 0x7f9fba66e468 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x7f9fba66e620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fba66e870 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:232:5, col:76> col:20 operator>> 'class std::__1::basic_istream<char> &(basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *)'
| `-ParmVarDecl 0x7f9fba66e768 <col:31, col:72> col:72 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *'
|-CXXMethodDecl 0x7f9fba66e9e0 <line:233:5, col:40> col:20 operator>> 'class std::__1::basic_istream<char> &(_Bool &)'
| `-ParmVarDecl 0x7f9fba66e920 <col:31, col:37> col:37 __n '_Bool &'
|-CXXMethodDecl 0x7f9fba66eb50 <line:234:5, col:41> col:20 operator>> 'class std::__1::basic_istream<char> &(short &)'
| `-ParmVarDecl 0x7f9fba66ea90 <col:31, col:38> col:38 __n 'short &'
|-CXXMethodDecl 0x7f9fba66ecc0 <line:235:5, col:50> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned short &)'
| `-ParmVarDecl 0x7f9fba66ec00 <col:31, col:47> col:47 __n 'unsigned short &'
|-CXXMethodDecl 0x7f9fba66ee30 <line:236:5, col:39> col:20 operator>> 'class std::__1::basic_istream<char> &(int &)'
| `-ParmVarDecl 0x7f9fba66ed70 <col:31, col:36> col:36 __n 'int &'
|-CXXMethodDecl 0x7f9fba66efa0 <line:237:5, col:48> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned int &)'
| `-ParmVarDecl 0x7f9fba66eee0 <col:31, col:45> col:45 __n 'unsigned int &'
|-CXXMethodDecl 0x7f9fba66f110 <line:238:5, col:40> col:20 operator>> 'class std::__1::basic_istream<char> &(long &)'
| `-ParmVarDecl 0x7f9fba66f050 <col:31, col:37> col:37 __n 'long &'
|-CXXMethodDecl 0x7f9fba66f280 <line:239:5, col:49> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned long &)'
| `-ParmVarDecl 0x7f9fba66f1c0 <col:31, col:46> col:46 __n 'unsigned long &'
|-CXXMethodDecl 0x7f9fba66f3f0 <line:240:5, col:45> col:20 operator>> 'class std::__1::basic_istream<char> &(long long &)'
| `-ParmVarDecl 0x7f9fba66f330 <col:31, col:42> col:42 __n 'long long &'
|-CXXMethodDecl 0x7f9fba66f560 <line:241:5, col:54> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned long long &)'
| `-ParmVarDecl 0x7f9fba66f4a0 <col:31, col:51> col:51 __n 'unsigned long long &'
|-CXXMethodDecl 0x7f9fba66f6d0 <line:242:5, col:41> col:20 operator>> 'class std::__1::basic_istream<char> &(float &)'
| `-ParmVarDecl 0x7f9fba66f610 <col:31, col:38> col:38 __f 'float &'
|-CXXMethodDecl 0x7f9fba66f840 <line:243:5, col:42> col:20 operator>> 'class std::__1::basic_istream<char> &(double &)'
| `-ParmVarDecl 0x7f9fba66f780 <col:31, col:39> col:39 __f 'double &'
|-CXXMethodDecl 0x7f9fba66f9b0 <line:244:5, col:47> col:20 operator>> 'class std::__1::basic_istream<char> &(long double &)'
| `-ParmVarDecl 0x7f9fba66f8f0 <col:31, col:44> col:44 __f 'long double &'
|-CXXMethodDecl 0x7f9fba66fb20 <line:245:5, col:41> col:20 operator>> 'class std::__1::basic_istream<char> &(void *&)'
| `-ParmVarDecl 0x7f9fba66fa60 <col:31, col:38> col:38 __p 'void *&'
|-CXXMethodDecl 0x7f9fba66fbd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:249:45> col:16 gcount 'std::__1::streamsize (void) const'
| `-AlwaysInlineAttr 0x7f9fba66fc78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9fba66fd30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:250:5, col:18> col:14 get 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type (void)'
|-CXXMethodDecl 0x7f9fba66ff20 <line:252:5, line:258:5> line:253:20 get 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type &)' inline
| |-ParmVarDecl 0x7f9fba66fe18 <col:24, col:35> col:35 __c 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type &'
| `-AlwaysInlineAttr 0x7f9fba66ffd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fba6701d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:260:5, line:262:48> line:261:20 get 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f9fba670058 <col:24, col:35> col:35 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f9fba6700b8 <col:40, col:51> col:51 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f9fba670288 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fba6704e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:264:5, col:71> col:20 get 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7f9fba6702e0 <col:24, col:35> col:35 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f9fba670340 <col:40, col:51> col:51 __n 'std::__1::streamsize':'long'
| `-ParmVarDecl 0x7f9fba6703b0 <col:56, col:66> col:66 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7f9fba6707a0 <line:266:5, line:268:44> line:267:20 get 'class std::__1::basic_istream<char> &(basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &)' inline
| |-ParmVarDecl 0x7f9fba670698 <col:24, col:65> col:65 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &'
| `-AlwaysInlineAttr 0x7f9fba670850 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fba670b20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:270:5, col:86> col:20 get 'class std::__1::basic_istream<char> &(basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7f9fba670998 <col:24, col:65> col:65 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &'
| `-ParmVarDecl 0x7f9fba670a08 <col:71, col:81> col:81 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7f9fba670cd8 <line:272:5, line:274:52> line:273:20 getline 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f9fba670be8 <col:28, col:39> col:39 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f9fba670c48 <col:44, col:55> col:55 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f9fba670d90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fba670f50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:276:5, col:75> col:20 getline 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7f9fba670de8 <col:28, col:39> col:39 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f9fba670e48 <col:44, col:55> col:55 __n 'std::__1::streamsize':'long'
| `-ParmVarDecl 0x7f9fba670eb8 <col:60, col:70> col:70 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7f9fba671600 <line:278:5, col:82> col:20 ignore 'class std::__1::basic_istream<char> &(std::__1::streamsize, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type)'
| |-ParmVarDecl 0x7f9fba671010 <col:27, col:44> col:38 __n 'std::__1::streamsize':'long'
| `-ParmVarDecl 0x7f9fba671080 <col:47, col:81> col:56 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7f9fba6716d8 <line:279:5, col:19> col:14 peek 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type (void)'
|-CXXMethodDecl 0x7f9fba671880 <line:280:5, col:56> col:20 read 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7f9fba671790 <col:26, col:37> col:37 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f9fba6717f0 <col:42, col:53> col:53 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f9fba671a80 <line:281:5, col:55> col:16 readsome 'std::__1::streamsize (std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7f9fba671948 <col:25, col:36> col:36 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f9fba6719a8 <col:41, col:52> col:52 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f9fba671c50 <line:283:5, col:41> col:20 putback 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| `-ParmVarDecl 0x7f9fba671b48 <col:28, col:38> col:38 __c 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7f9fba671d50 <line:284:5, col:26> col:20 unget 'class std::__1::basic_istream<char> &(void)'
|-CXXMethodDecl 0x7f9fba671df8 <line:285:5, col:14> col:9 sync 'int (void)'
|-CXXMethodDecl 0x7f9fba671f10 <line:287:5, col:20> col:14 tellg 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::pos_type (void)'
|-CXXMethodDecl 0x7f9fba6720d0 <line:288:5, col:40> col:20 seekg 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::pos_type)'
| `-ParmVarDecl 0x7f9fba671fc8 <col:26, col:35> col:35 __pos 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
`-CXXMethodDecl 0x7f9fba672320 <line:289:5, col:65> col:20 seekg 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir)'
  |-ParmVarDecl 0x7f9fba6721b0 <col:26, col:35> col:35 __off 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::off_type':'long long'
  `-ParmVarDecl 0x7f9fba672210 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_istream" = type { i32 (...)**, i64, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_istream.base" = type { i32 (...)**, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9fbb8890b8 parent 0x7f9fbb87f688 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:1084:82> col:64 class basic_ostream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f9fba603d18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7f9fba603f50 prev 0x7f9fbb8890b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:151:1, col:28> col:28 implicit class basic_ostream
|-AccessSpecDecl 0x7f9fba603fe8 <line:154:1, col:7> col:1 public
|-TypedefDecl 0x7f9fba604020 <line:156:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f9fba603de0 'char' sugar
|   |-TemplateTypeParmType 0x7f9fba5d39c0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9fba5d3978 '_CharT'
|   `-BuiltinType 0x7f9fba033560 'char'
|-TypedefDecl 0x7f9fba604088 <line:157:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f9fba603e20 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f9fba5d3a30 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f9fba5d39e8 '_Traits'
|   `-RecordType 0x7f9fbb888360 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f9fba241548 'char_traits'
|-TypedefDecl 0x7f9fba604190 <line:158:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f9fba604140 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f9fba243090 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f9fba2418a8 'int_type'
|     `-BuiltinType 0x7f9fba0335c0 'int'
|-TypedefDecl 0x7f9fba604260 <line:159:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f9fba604210 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f9fbcb2e9a0 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f9fba241978 'pos_type'
|     `-TypedefType 0x7f9fba237b10 'std::__1::streampos' sugar
|       |-Typedef 0x7f9fbb88e1b8 'streampos'
|       `-TemplateSpecializationType 0x7f9fbb88e110 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f9fbb88e0f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f9fbb88e000 'fpos'
|-TypedefDecl 0x7f9fba604330 <line:160:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f9fba6042e0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f9fbcb2ea90 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f9fba241910 'off_type'
|     `-TypedefType 0x7f9fba237a80 'std::__1::streamoff' sugar
|       |-Typedef 0x7f9fbb88e558 'streamoff'
|       `-BuiltinType 0x7f9fba033600 'long long'
|-CXXConstructorDecl 0x7f9fba6045b0 <line:163:5, line:165:25> line:164:14 basic_ostream 'void (basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7f9fba6044a8 <col:28, col:69> col:69 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f9fba604670 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXDestructorDecl 0x7f9fba6046e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:166:5, col:28> col:13 ~basic_ostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7f9fba604798 <line:167:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f9fba6048e0 <line:169:5, line:170:40> col:5 basic_ostream 'void (class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7f9fba6047f8 <col:19, col:35> col:35 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7f9fba6049a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f9fba604af0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:173:5, line:174:51> col:20 operator= 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7f9fba604a28 <col:30, col:46> col:46 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7f9fba604ba0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f9fba604cc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:176:5, line:178:55> line:177:10 swap 'void (class std::__1::basic_ostream<char> &)' inline
| |-ParmVarDecl 0x7f9fba604bf8 <col:15, col:30> col:30 __rhs 'class std::__1::basic_ostream<char> &'
| `-AlwaysInlineAttr 0x7f9fba604d70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXConstructorDecl 0x7f9fba604ee0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:181:5, col:65> col:5 basic_ostream 'void (const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7f9fba604df8 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-CXXMethodDecl 0x7f9fba605070 <line:182:5, col:65> col:20 operator= 'class std::__1::basic_ostream<char> &(const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7f9fba604fb0 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-AccessSpecDecl 0x7f9fba605120 <line:187:1, col:7> col:1 public
|-CXXRecordDecl 0x7f9fba605148 <line:190:5, col:32> col:32 class sentry definition
| |-CXXRecordDecl 0x7f9fba608000 prev 0x7f9fba605148 <line:240:1, col:60> col:60 implicit class sentry
| |-FieldDecl 0x7f9fba608098 <line:242:5, col:10> col:10 __ok_ '_Bool'
| |-FieldDecl 0x7f9fba608238 <line:243:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXConstructorDecl 0x7f9fba6083c0 <line:245:5, col:25> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7f9fba6082b8 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x7f9fba608580 <line:246:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7f9fba6084b8 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x7f9fba608630 <line:248:1, col:7> col:1 public
| |-CXXConstructorDecl 0x7f9fba608840 <line:249:5, col:57> col:14 sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| | `-ParmVarDecl 0x7f9fba608758 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXDestructorDecl 0x7f9fba608930 <line:250:5, col:13> col:5 ~sentry 'void (void)' noexcept-unevaluated 0x7f9fba608930
| `-CXXConversionDecl 0x7f9fba6089e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:254:45> col:9 operator bool '_Bool (void) const'
|   `-AlwaysInlineAttr 0x7f9fba608ab8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fba605480 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:193:5, line:195:27> line:194:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &))' inline
| |-ParmVarDecl 0x7f9fba605380 <col:31, col:68> col:48 __pf 'class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &)'
| `-AlwaysInlineAttr 0x7f9fba605530 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fba605a10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:197:5, line:200:34> line:198:20 operator<< 'class std::__1::basic_ostream<char> &(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &))' inline
| |-ParmVarDecl 0x7f9fba605910 <col:31, line:199:72> col:33 __pf 'basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &)'
| `-AlwaysInlineAttr 0x7f9fba605ac0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fba605c10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:202:5, line:204:34> line:203:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))' inline
| |-ParmVarDecl 0x7f9fba605b08 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x7f9fba605cc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fba605dd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:206:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(_Bool)'
| `-ParmVarDecl 0x7f9fba605d08 <col:31, col:36> col:36 __n '_Bool'
|-CXXMethodDecl 0x7f9fba605f40 <line:207:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(short)'
| `-ParmVarDecl 0x7f9fba605e80 <col:31, col:37> col:37 __n 'short'
|-CXXMethodDecl 0x7f9fba6060b0 <line:208:5, col:49> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned short)'
| `-ParmVarDecl 0x7f9fba605ff0 <col:31, col:46> col:46 __n 'unsigned short'
|-CXXMethodDecl 0x7f9fba606220 <line:209:5, col:38> col:20 operator<< 'class std::__1::basic_ostream<char> &(int)'
| `-ParmVarDecl 0x7f9fba606160 <col:31, col:35> col:35 __n 'int'
|-CXXMethodDecl 0x7f9fba606390 <line:210:5, col:47> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned int)'
| `-ParmVarDecl 0x7f9fba6062d0 <col:31, col:44> col:44 __n 'unsigned int'
|-CXXMethodDecl 0x7f9fba606500 <line:211:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(long)'
| `-ParmVarDecl 0x7f9fba606440 <col:31, col:36> col:36 __n 'long'
|-CXXMethodDecl 0x7f9fba606670 <line:212:5, col:48> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long)'
| `-ParmVarDecl 0x7f9fba6065b0 <col:31, col:45> col:45 __n 'unsigned long'
|-CXXMethodDecl 0x7f9fba6067e0 <line:213:5, col:44> col:20 operator<< 'class std::__1::basic_ostream<char> &(long long)'
| `-ParmVarDecl 0x7f9fba606720 <col:31, col:41> col:41 __n 'long long'
|-CXXMethodDecl 0x7f9fba606950 <line:214:5, col:53> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long long)'
| `-ParmVarDecl 0x7f9fba606890 <col:31, col:50> col:50 __n 'unsigned long long'
|-CXXMethodDecl 0x7f9fba606ac0 <line:215:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(float)'
| `-ParmVarDecl 0x7f9fba606a00 <col:31, col:37> col:37 __f 'float'
|-CXXMethodDecl 0x7f9fba606c30 <line:216:5, col:41> col:20 operator<< 'class std::__1::basic_ostream<char> &(double)'
| `-ParmVarDecl 0x7f9fba606b70 <col:31, col:38> col:38 __f 'double'
|-CXXMethodDecl 0x7f9fba606da0 <line:217:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(long double)'
| `-ParmVarDecl 0x7f9fba606ce0 <col:31, col:43> col:43 __f 'long double'
|-CXXMethodDecl 0x7f9fba606f10 <line:218:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(const void *)'
| `-ParmVarDecl 0x7f9fba606e50 <col:31, col:43> col:43 __p 'const void *'
|-CXXMethodDecl 0x7f9fba6071c0 <line:219:5, col:76> col:20 operator<< 'class std::__1::basic_ostream<char> &(basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)'
| `-ParmVarDecl 0x7f9fba6070b8 <col:31, col:72> col:72 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
|-CXXMethodDecl 0x7f9fba607380 <line:222:5, col:37> col:20 put 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type)'
| `-ParmVarDecl 0x7f9fba607280 <col:24, col:34> col:34 __c 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7f9fba6075e0 <line:223:5, col:62> col:20 write 'class std::__1::basic_ostream<char> &(const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7f9fba607468 <col:26, col:43> col:43 __s 'const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f9fba6074c8 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f9fba6076f0 <line:224:5, col:26> col:20 flush 'class std::__1::basic_ostream<char> &(void)'
|-CXXMethodDecl 0x7f9fba607840 <line:227:5, line:228:20> col:14 tellp 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type (void)' inline
| `-AlwaysInlineAttr 0x7f9fba6078e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> Inherited always_inline
|-CXXMethodDecl 0x7f9fba607a40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:229:5, line:230:40> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type)' inline
| |-ParmVarDecl 0x7f9fba607940 <col:26, col:35> col:35 __pos 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-AlwaysInlineAttr 0x7f9fba607af0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> Inherited always_inline
|-CXXMethodDecl 0x7f9fba607ce0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:231:5, line:232:65> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir)' inline
| |-ParmVarDecl 0x7f9fba607b70 <col:26, col:35> col:35 __off 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7f9fba607bd0 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-AlwaysInlineAttr 0x7f9fba607d98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> Inherited always_inline
|-AccessSpecDecl 0x7f9fba607de0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:234:1, col:10> col:1 protected
`-CXXConstructorDecl 0x7f9fba607e28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:236:22> col:5 basic_ostream 'void (void)'
  `-AlwaysInlineAttr 0x7f9fba607ee0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream.base" = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9fbb8893a8 parent 0x7f9fbb87f688 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1683:83> col:64 class basic_iostream definition
|-public 'basic_istream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_istream<char>'
|-public 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f9fba679458 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7f9fba679788 prev 0x7f9fbb8893a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1442:1, col:28> col:28 implicit class basic_iostream
|-AccessSpecDecl 0x7f9fba679820 <line:1446:1, col:7> col:1 public
|-TypedefDecl 0x7f9fba679858 <line:1448:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f9fba679520 'char' sugar
|   |-TemplateTypeParmType 0x7f9fba660a10 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9fba6609d0 '_CharT'
|   `-BuiltinType 0x7f9fba033560 'char'
|-TypedefDecl 0x7f9fba6798c0 <line:1449:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f9fba679560 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f9fba660a80 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f9fba660a38 '_Traits'
|   `-RecordType 0x7f9fbb888360 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f9fba241548 'char_traits'
|-TypedefDecl 0x7f9fba6799d0 <line:1450:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f9fba679980 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f9fba243090 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f9fba2418a8 'int_type'
|     `-BuiltinType 0x7f9fba0335c0 'int'
|-TypedefDecl 0x7f9fba679aa0 <line:1451:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f9fba679a50 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f9fbcb2e9a0 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f9fba241978 'pos_type'
|     `-TypedefType 0x7f9fba237b10 'std::__1::streampos' sugar
|       |-Typedef 0x7f9fbb88e1b8 'streampos'
|       `-TemplateSpecializationType 0x7f9fbb88e110 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f9fbb88e0f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f9fbb88e000 'fpos'
|-TypedefDecl 0x7f9fba679b70 <line:1452:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f9fba679b20 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f9fbcb2ea90 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f9fba241910 'off_type'
|     `-TypedefType 0x7f9fba237a80 'std::__1::streamoff' sugar
|       |-Typedef 0x7f9fbb88e558 'streamoff'
|       `-BuiltinType 0x7f9fba033600 'long long'
|-CXXConstructorDecl 0x7f9fba679df0 <line:1455:5, line:1458:6> line:1456:14 basic_iostream 'void (basic_streambuf<std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7f9fba679ce8 <col:29, col:70> col:70 __sb 'basic_streambuf<std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f9fba679ed8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXDestructorDecl 0x7f9fba679f50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1460:5, col:29> col:13 used ~basic_iostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7f9fba67a000 <line:1461:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f9fba67a150 <line:1463:5, line:1464:42> col:5 basic_iostream 'void (class std::__1::basic_iostream<char> &&)' inline
| |-ParmVarDecl 0x7f9fba67a068 <col:20, col:37> col:37 __rhs 'class std::__1::basic_iostream<char> &&'
| `-AlwaysInlineAttr 0x7f9fba67a210 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f9fba67a360 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1467:5, line:1468:53> col:21 operator= 'class std::__1::basic_iostream<char> &(class std::__1::basic_iostream<char> &&)' inline
| |-ParmVarDecl 0x7f9fba67a298 <col:31, col:48> col:48 __rhs 'class std::__1::basic_iostream<char> &&'
| `-AlwaysInlineAttr 0x7f9fba67a410 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f9fba67a530 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1470:5, line:1472:59> line:1471:10 swap 'void (class std::__1::basic_iostream<char> &)' inline
| |-ParmVarDecl 0x7f9fba67a468 <col:15, col:31> col:31 __rhs 'class std::__1::basic_iostream<char> &'
| `-AlwaysInlineAttr 0x7f9fba67a5e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-AccessSpecDecl 0x7f9fba67a628 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1473:1, col:7> col:1 public
|-CXXConstructorDecl 0x7f9fba67a6b8 <line:1683:64> col:64 implicit basic_iostream 'void (const class std::__1::basic_iostream<char> &)' inline default_delete noexcept-unevaluated 0x7f9fba67a6b8
| `-ParmVarDecl 0x7f9fba67a7e0 <col:64> col:64 'const class std::__1::basic_iostream<char> &'
`-CXXMethodDecl 0x7f9fba67a848 <col:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::basic_iostream<char> &(const class std::__1::basic_iostream<char> &)' inline default_delete noexcept-unevaluated 0x7f9fba67a848
  `-ParmVarDecl 0x7f9fba67a960 <col:64> col:64 'const class std::__1::basic_iostream<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_iostream" = type { %"class.std::__1::basic_istream.base", %"class.std::__1::basic_ostream.base", %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_iostream.base" = type { %"class.std::__1::basic_istream.base", %"class.std::__1::basic_ostream.base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9fbca7ee98 prev 0x7f9fbca7e6e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:83:1, line:145:1> line:83:24 referenced class locale definition
|-VisibilityAttr 0x7f9fbca7ef98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7f9fbca7efe0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:83:1, col:24> col:24 implicit referenced class locale
|-AccessSpecDecl 0x7f9fbca7f078 <line:85:1, col:7> col:1 public
|-CXXRecordDecl 0x7f9fbca7f0d0 <line:87:5, col:28> col:28 referenced class facet
| `-VisibilityAttr 0x7f9fbca7f190 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7f9fbca7f208 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:88:5, col:28> col:28 referenced class id
| `-VisibilityAttr 0x7f9fbca7f2c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-TypedefDecl 0x7f9fbca7f320 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:90:5, col:17> col:17 referenced category 'int'
| `-BuiltinType 0x7f9fba0335c0 'int'
|-VarDecl 0x7f9fbca7f3d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:3, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:93:20> col:9 none 'const std::__1::locale::category':'const int' static cinit
| |-IntegerLiteral 0x7f9fbca7f538 <col:20> 'int' 0
| |-AvailabilityAttr 0x7f9fbca7f430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1176:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7f9fbca7f4d0 <line:1175:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7f9fbca7f5c0 <col:3, /usr/include/xlocale.h:45:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:94:9 referenced collate 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7f9fbca7f790 </usr/include/xlocale.h:45:27, col:34> 'int'
| | `-BinaryOperator 0x7f9fbca7f768 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7f9fbca7f728 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7f9fbca7f748 <col:33> 'int' 0
| |-AvailabilityAttr 0x7f9fbca7f620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1176:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7f9fbca7f6c0 <line:1175:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7f9fbca7f818 <col:3, /usr/include/xlocale.h:46:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:95:9 referenced ctype 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7f9fbca7f9e8 </usr/include/xlocale.h:46:25, col:32> 'int'
| | `-BinaryOperator 0x7f9fbca7f9c0 <col:26, col:31> 'int' '<<'
| |   |-IntegerLiteral 0x7f9fbca7f980 <col:26> 'int' 1
| |   `-IntegerLiteral 0x7f9fbca7f9a0 <col:31> 'int' 1
| |-AvailabilityAttr 0x7f9fbca7f878 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1176:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7f9fbca7f918 <line:1175:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7f9fbca7fa70 <col:3, /usr/include/xlocale.h:48:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:96:9 referenced monetary 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7f9fbca7fc40 </usr/include/xlocale.h:48:27, col:34> 'int'
| | `-BinaryOperator 0x7f9fbca7fc18 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7f9fbca7fbd8 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7f9fbca7fbf8 <col:33> 'int' 3
| |-AvailabilityAttr 0x7f9fbca7fad0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1176:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7f9fbca7fb70 <line:1175:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7f9fbca7fcc8 <col:3, /usr/include/xlocale.h:49:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:97:9 referenced numeric 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7f9fbca7fe98 </usr/include/xlocale.h:49:27, col:34> 'int'
| | `-BinaryOperator 0x7f9fbca7fe70 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7f9fbca7fe30 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7f9fbca7fe50 <col:33> 'int' 4
| |-AvailabilityAttr 0x7f9fbca7fd28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1176:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7f9fbca7fdc8 <line:1175:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7f9fbca7ff20 <col:3, /usr/include/xlocale.h:50:31> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:98:9 referenced time 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7f9fbca800f0 </usr/include/xlocale.h:50:24, col:31> 'int'
| | `-BinaryOperator 0x7f9fbca800c8 <col:25, col:30> 'int' '<<'
| |   |-IntegerLiteral 0x7f9fbca80088 <col:25> 'int' 1
| |   `-IntegerLiteral 0x7f9fbca800a8 <col:30> 'int' 5
| |-AvailabilityAttr 0x7f9fbca7ff80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1176:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7f9fbca80020 <line:1175:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7f9fbca80178 <col:3, /usr/include/xlocale.h:47:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:99:9 referenced messages 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7f9fbca80348 </usr/include/xlocale.h:47:27, col:34> 'int'
| | `-BinaryOperator 0x7f9fbca80320 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7f9fbca802e0 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7f9fbca80300 <col:33> 'int' 2
| |-AvailabilityAttr 0x7f9fbca801d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1176:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7f9fbca80278 <line:1175:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7f9fbca803d0 <col:3, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:100:61> col:9 all 'const std::__1::locale::category':'const int' static cinit
| |-BinaryOperator 0x7f9fbca80758 <col:15, col:61> 'int' '|'
| | |-BinaryOperator 0x7f9fbca806f0 <col:15, col:54> 'int' '|'
| | | |-BinaryOperator 0x7f9fbca80688 <col:15, col:44> 'int' '|'
| | | | |-BinaryOperator 0x7f9fbca80620 <col:15, col:33> 'int' '|'
| | | | | |-BinaryOperator 0x7f9fbca805b8 <col:15, col:25> 'int' '|'
| | | | | | |-ImplicitCastExpr 0x7f9fbca80588 <col:15> 'std::__1::locale::category':'int' <LValueToRValue>
| | | | | | | `-DeclRefExpr 0x7f9fbca80538 <col:15> 'const std::__1::locale::category':'const int' lvalue Var 0x7f9fbca7f5c0 'collate' 'const std::__1::locale::category':'const int'
| | | | | | `-ImplicitCastExpr 0x7f9fbca805a0 <col:25> 'std::__1::locale::category':'int' <LValueToRValue>
| | | | | |   `-DeclRefExpr 0x7f9fbca80560 <col:25> 'const std::__1::locale::category':'const int' lvalue Var 0x7f9fbca7f818 'ctype' 'const std::__1::locale::category':'const int'
| | | | | `-ImplicitCastExpr 0x7f9fbca80608 <col:33> 'std::__1::locale::category':'int' <LValueToRValue>
| | | | |   `-DeclRefExpr 0x7f9fbca805e0 <col:33> 'const std::__1::locale::category':'const int' lvalue Var 0x7f9fbca7fa70 'monetary' 'const std::__1::locale::category':'const int'
| | | | `-ImplicitCastExpr 0x7f9fbca80670 <col:44> 'std::__1::locale::category':'int' <LValueToRValue>
| | | |   `-DeclRefExpr 0x7f9fbca80648 <col:44> 'const std::__1::locale::category':'const int' lvalue Var 0x7f9fbca7fcc8 'numeric' 'const std::__1::locale::category':'const int'
| | | `-ImplicitCastExpr 0x7f9fbca806d8 <col:54> 'std::__1::locale::category':'int' <LValueToRValue>
| | |   `-DeclRefExpr 0x7f9fbca806b0 <col:54> 'const std::__1::locale::category':'const int' lvalue Var 0x7f9fbca7ff20 'time' 'const std::__1::locale::category':'const int'
| | `-ImplicitCastExpr 0x7f9fbca80740 <col:61> 'std::__1::locale::category':'int' <LValueToRValue>
| |   `-DeclRefExpr 0x7f9fbca80718 <col:61> 'const std::__1::locale::category':'const int' lvalue Var 0x7f9fbca80178 'messages' 'const std::__1::locale::category':'const int'
| |-AvailabilityAttr 0x7f9fbca80430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1176:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7f9fbca804d0 <line:1175:18, col:60> macos 10.9 0 0 "" Strict ""
|-CXXConstructorDecl 0x7f9fbca80890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:103:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:103:5 locale 'void (void) noexcept'
|-CXXConstructorDecl 0x7f9fbca80a58 <line:104:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:104:5 referenced locale 'void (const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7f9fbca80948 <col:12, col:24> col:25 'const class std::__1::locale &'
|-CXXConstructorDecl 0x7f9fbca80ba8 <line:105:5, col:32> col:14 locale 'void (const char *)'
| `-ParmVarDecl 0x7f9fbca80b20 <col:21, col:31> col:32 'const char *'
|-CXXConstructorDecl 0x7f9fbca80cf0 <line:106:5, col:34> col:14 locale 'void (const std::__1::string &)'
| `-ParmVarDecl 0x7f9fbca80c68 <col:21, col:33> col:34 'const std::__1::string &'
|-CXXConstructorDecl 0x7f9fbca80fd0 <line:107:5, col:48> col:5 locale 'void (const class std::__1::locale &, const char *, std::__1::locale::category)'
| |-ParmVarDecl 0x7f9fbca80db0 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f9fbca80e28 <col:27, col:37> col:38 'const char *'
| `-ParmVarDecl 0x7f9fbca80e98 <col:40> col:48 'std::__1::locale::category':'int'
|-CXXConstructorDecl 0x7f9fbca812b0 <line:108:5, col:50> col:5 locale 'void (const class std::__1::locale &, const std::__1::string &, std::__1::locale::category)'
| |-ParmVarDecl 0x7f9fbca810a0 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f9fbca81110 <col:27, col:39> col:40 'const std::__1::string &'
| `-ParmVarDecl 0x7f9fbca81180 <col:42> col:50 'std::__1::locale::category':'int'
|-FunctionTemplateDecl 0x7f9fbca81688 <line:109:5, line:110:64> col:35 locale
| |-TemplateTypeParmDecl 0x7f9fbca81370 <line:109:15, col:21> col:21 referenced class depth 0 index 0 _Facet
| `-CXXConstructorDecl 0x7f9fbca815e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:110:64> col:35 locale 'void (const class std::__1::locale &, _Facet *)'
|   |-ParmVarDecl 0x7f9fbca81430 <col:42, col:54> col:55 'const class std::__1::locale &'
|   |-ParmVarDecl 0x7f9fbca814c8 <col:57, col:63> col:64 '_Facet *'
|   |-AlwaysInlineAttr 0x7f9fbca816e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|   `-VisibilityAttr 0x7f9fbca81730 <col:51, col:74> Hidden
|-CXXConstructorDecl 0x7f9fbca81960 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:111:5, col:50> col:5 locale 'void (const class std::__1::locale &, const class std::__1::locale &, std::__1::locale::category)'
| |-ParmVarDecl 0x7f9fbca81750 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f9fbca817c0 <col:27, col:39> col:40 'const class std::__1::locale &'
| `-ParmVarDecl 0x7f9fbca81830 <col:42> col:50 'std::__1::locale::category':'int'
|-CXXDestructorDecl 0x7f9fbca81a70 <line:113:5, col:13> col:5 referenced ~locale 'void (void) noexcept'
|-CXXMethodDecl 0x7f9fbca81c28 <line:115:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:115:19 operator= 'const class std::__1::locale &(const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7f9fbca81b20 <col:29, col:41> col:42 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7f9fbca81f18 <line:117:5, line:119:37> col:14 combine
| |-TemplateTypeParmDecl 0x7f9fbca81cc8 <line:117:15, col:21> col:21 class depth 0 index 0 _Facet
| `-CXXMethodDecl 0x7f9fbca81e80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:119:37> col:14 combine 'class std::__1::locale (const class std::__1::locale &) const' inline
|   |-ParmVarDecl 0x7f9fbca81d90 <col:22, col:34> col:35 'const class std::__1::locale &'
|   `-VisibilityAttr 0x7f9fbca81f70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:644:40, col:63> Hidden
|-CXXMethodDecl 0x7f9fbca81fd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:122:5, col:19> col:12 name 'std::__1::string (void) const'
|-CXXMethodDecl 0x7f9fbca82140 <line:123:5, col:36> col:10 used operator== '_Bool (const class std::__1::locale &) const'
| `-ParmVarDecl 0x7f9fbca82080 <col:21, col:33> col:34 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f9fbca82278 <line:124:5, col:70> col:10 operator!= '_Bool (const class std::__1::locale &) const'
| |-ParmVarDecl 0x7f9fbca821f0 <col:21, col:35> col:35 used __y 'const class std::__1::locale &'
| `-CompoundStmt 0x7f9fbca84f90 <col:46, col:70>
|   `-ReturnStmt 0x7f9fbca84f78 <col:47, col:68>
|     `-UnaryOperator 0x7f9fbca84f58 <col:54, col:68> '_Bool' prefix '!'
|       `-ParenExpr 0x7f9fbca84f38 <col:55, col:68> '_Bool'
|         `-CXXOperatorCallExpr 0x7f9fbca84ef0 <col:56, col:65> '_Bool'
|           |-ImplicitCastExpr 0x7f9fbca84ed8 <col:62> '_Bool (*)(const class std::__1::locale &) const' <FunctionToPointerDecay>
|           | `-DeclRefExpr 0x7f9fbca84e80 <col:62> '_Bool (const class std::__1::locale &) const' lvalue CXXMethod 0x7f9fbca82140 'operator==' '_Bool (const class std::__1::locale &) const'
|           |-UnaryOperator 0x7f9fbca83bb0 <col:56, col:57> 'const class std::__1::locale' lvalue prefix '*'
|           | `-CXXThisExpr 0x7f9fbca83b98 <col:57> 'const class std::__1::locale *' this
|           `-DeclRefExpr 0x7f9fbca83bd0 <col:65> 'const class std::__1::locale' lvalue ParmVar 0x7f9fbca821f0 '__y' 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7f9fbca82a08 <line:125:5, line:128:73> line:127:12 operator()
| |-TemplateTypeParmDecl 0x7f9fbca82318 <line:125:15, col:21> col:21 referenced class depth 0 index 0 _CharT
| |-TemplateTypeParmDecl 0x7f9fbca82388 <col:29, col:35> col:35 referenced class depth 0 index 1 _Traits
| |-TemplateTypeParmDecl 0x7f9fbca823f8 <col:44, col:50> col:50 referenced class depth 0 index 2 _Allocator
| `-CXXMethodDecl 0x7f9fbca82970 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:128:73> line:127:12 operator() '_Bool (const basic_string<_CharT, _Traits, _Allocator> &, const basic_string<_CharT, _Traits, _Allocator> &) const' inline
|   |-ParmVarDecl 0x7f9fbca82660 <col:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   |-ParmVarDecl 0x7f9fbca82860 <line:128:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   `-VisibilityAttr 0x7f9fbca82a68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:644:40, col:63> Hidden
|-CXXMethodDecl 0x7f9fbca82b80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:131:5, col:39> col:19 global 'class std::__1::locale (const class std::__1::locale &)' static
| `-ParmVarDecl 0x7f9fbca82ac0 <col:26, col:38> col:39 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f9fbca82c70 <line:132:5, col:34> col:26 classic 'const class std::__1::locale &(void)' static
|-AccessSpecDecl 0x7f9fbca82d08 <line:134:1, col:8> col:1 private
|-CXXRecordDecl 0x7f9fbca82d30 <line:135:5, col:11> col:11 referenced class __imp
|-FieldDecl 0x7f9fbca82e28 <line:136:5, col:12> col:12 __locale_ 'class std::__1::locale::__imp *'
|-CXXMethodDecl 0x7f9fbca83070 <line:138:5, col:52> col:10 referenced __install_ctor 'void (const class std::__1::locale &, class std::__1::locale::facet *, long)'
| |-ParmVarDecl 0x7f9fbca82e80 <col:25, col:37> col:38 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f9fbca82f18 <col:40, col:45> col:46 'class std::__1::locale::facet *'
| `-ParmVarDecl 0x7f9fbca82f90 <col:48> col:52 'long'
|-CXXMethodDecl 0x7f9fbca831a0 <line:139:5, col:29> col:20 __global 'class std::__1::locale &(void)' static
|-CXXMethodDecl 0x7f9fbca83340 <line:140:5, col:25> col:10 referenced has_facet '_Bool (class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7f9fbca83278 <col:20, col:22> col:23 'class std::__1::locale::id &'
|-CXXMethodDecl 0x7f9fbca834e0 <line:141:5, col:33> col:18 referenced use_facet 'const class std::__1::locale::facet *(class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7f9fbca833f0 <col:28, col:30> col:31 'class std::__1::locale::id &'
|-FriendDecl 0x7f9fbca83808 <line:143:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:143:41
| `-FunctionTemplateDecl 0x7f9fbca83748 parent 0x7f9fbca7e650 prev 0x7f9fbca7ea80 <col:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:143:41 has_facet
|   |-TemplateTypeParmDecl 0x7f9fbca83580 <col:15, col:21> col:21 class depth 0 index 0 _Facet
|   `-FunctionDecl 0x7f9fbca836a0 parent 0x7f9fbca7e650 prev 0x7f9fbca7e9e8 <col:29, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:143:41 has_facet '_Bool (const class std::__1::locale &) noexcept'
|     |-ParmVarDecl 0x7f9fbca83610 <col:51, col:63> col:64 'const class std::__1::locale &'
|     |-AlwaysInlineAttr 0x7f9fbca837e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|     `-VisibilityAttr 0x7f9fbca837f8 <col:51, col:74> Inherited Hidden
`-FriendDecl 0x7f9fbca83b28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:144:5, col:73> col:50
  `-FunctionTemplateDecl 0x7f9fbca83a68 parent 0x7f9fbca7e650 prev 0x7f9fbca7edb8 <col:5, col:73> col:50 use_facet
    |-TemplateTypeParmDecl 0x7f9fbca83840 <col:15, col:21> col:21 referenced class depth 0 index 0 _Facet
    `-FunctionDecl 0x7f9fbca839c0 parent 0x7f9fbca7e650 prev 0x7f9fbca7ed20 <col:29, col:73> col:50 use_facet 'const _Facet &(const class std::__1::locale &)'
      |-ParmVarDecl 0x7f9fbca838d0 <col:60, col:72> col:73 'const class std::__1::locale &'
      |-AlwaysInlineAttr 0x7f9fbca83b08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
      `-VisibilityAttr 0x7f9fbca83b18 <col:51, col:74> Inherited Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  NonVirtualBaseLLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9fbb888ad8 parent 0x7f9fbb87f688 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:483:84> col:64 class basic_streambuf definition
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f9fbcb2e5c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7f9fbcb2e688 prev 0x7f9fbb888ad8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:125:1, col:28> col:28 implicit class basic_streambuf
|-AccessSpecDecl 0x7f9fbcb2e720 <line:127:1, col:7> col:1 public
|-TypedefDecl 0x7f9fbcb2e788 <line:129:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f9fbcb2e750 'char' sugar
|   |-TemplateTypeParmType 0x7f9fbcb13ed0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9fbcb13e88 '_CharT'
|   `-BuiltinType 0x7f9fba033560 'char'
|-TypedefDecl 0x7f9fbcb2e818 <line:130:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f9fbcb2e7e0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f9fbcb13f40 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f9fbcb13ef8 '_Traits'
|   `-RecordType 0x7f9fbb888360 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f9fba241548 'char_traits'
|-TypedefDecl 0x7f9fbcb2e920 <line:131:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f9fbcb2e8d0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f9fba243090 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f9fba2418a8 'int_type'
|     `-BuiltinType 0x7f9fba0335c0 'int'
|-TypedefDecl 0x7f9fbcb2ea10 <line:132:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f9fbcb2e9c0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f9fbcb2e9a0 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f9fba241978 'pos_type'
|     `-TypedefType 0x7f9fba237b10 'std::__1::streampos' sugar
|       |-Typedef 0x7f9fbb88e1b8 'streampos'
|       `-TemplateSpecializationType 0x7f9fbb88e110 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f9fbb88e0f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f9fbb88e000 'fpos'
|-TypedefDecl 0x7f9fbcb2eb00 <line:133:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f9fbcb2eab0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f9fbcb2ea90 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f9fba241910 'off_type'
|     `-TypedefType 0x7f9fba237a80 'std::__1::streamoff' sugar
|       |-Typedef 0x7f9fbb88e558 'streamoff'
|       `-BuiltinType 0x7f9fba033600 'long long'
|-CXXDestructorDecl 0x7f9fbcb2eb88 <line:135:5, col:30> col:13 ~basic_streambuf 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7f9fbcb2ecc0 <line:138:5, line:144:5> line:139:12 pubimbue 'class std::__1::locale (const class std::__1::locale &)' inline
| |-ParmVarDecl 0x7f9fbcb2ec38 <col:21, col:35> col:35 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7f9fbcb2ed98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fbcb2ede0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:146:5, line:147:44> col:12 getloc 'class std::__1::locale (void) const' inline
| `-AlwaysInlineAttr 0x7f9fbcb2ee88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fbcb2f0a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:150:5, line:152:32> line:151:22 pubsetbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f9fbcb2ef28 <col:32, col:43> col:43 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f9fbcb2ef88 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f9fbcb2f158 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fbcb35a00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:154:5, line:157:46> line:155:14 referenced pubseekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7f9fbcb2f1f0 <col:25, col:34> col:34 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7f9fbcb2f250 <col:41, col:59> col:59 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| |-ParmVarDecl 0x7f9fbcb2f2b0 <line:156:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7f9fbcb35ac0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fbcb35c90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:159:5, line:162:38> line:160:14 referenced pubseekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7f9fbcb35b18 <col:25, col:34> col:34 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| |-ParmVarDecl 0x7f9fbcb35b78 <line:161:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7f9fbcb35d48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fbcb35d90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:164:5, line:165:36> col:9 referenced pubsync 'int (void)' inline
| `-AlwaysInlineAttr 0x7f9fbcb35e38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fbcb35e80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:169:5, line:174:5> line:170:16 in_avail 'std::__1::streamsize (void)' inline
| `-AlwaysInlineAttr 0x7f9fbcb35f28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fbcb35fe0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:176:5, line:181:5> line:177:14 snextc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f9fbcb36088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fbcb360f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:183:5, line:188:5> line:184:14 sbumpc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f9fbcb36198 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fbcb36200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:190:5, line:195:5> line:191:14 sgetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f9fbcb362a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fbcb36470 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:197:5, line:199:32> line:198:16 referenced sgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f9fbcb36300 <col:22, col:33> col:33 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f9fbcb36360 <col:38, col:49> col:49 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f9fbcb36528 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fbcb36640 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:202:5, line:207:5> line:203:14 sputbackc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7f9fbcb36580 <col:24, col:34> col:34 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7f9fbcb366f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fbcb36758 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:209:5, line:214:5> line:210:14 sungetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f9fbcb36800 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fbcb368e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:217:5, line:223:5> line:218:14 sputc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7f9fbcb36858 <col:20, col:30> col:30 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7f9fbcb36990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fbcb36b90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:225:5, line:227:32> line:226:16 referenced sputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f9fbcb36a18 <col:22, col:39> col:39 __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f9fbcb36a78 <col:44, col:55> col:55 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f9fbcb36c48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-AccessSpecDecl 0x7f9fbcb36c90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:229:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f9fbcb36cf8 <line:230:5, col:21> col:5 basic_streambuf 'void (void)'
|-CXXConstructorDecl 0x7f9fbcb36ed0 <line:231:5, col:49> col:5 basic_streambuf 'void (const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7f9fbcb36de8 <col:21, col:44> col:44 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7f9fbcb37090 <line:232:5, col:60> col:22 operator= 'class std::__1::basic_streambuf<char> &(const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7f9fbcb36fc8 <col:32, col:55> col:55 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7f9fbcb37210 <line:233:5, col:37> col:10 swap 'void (class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7f9fbcb37150 <col:15, col:32> col:32 __rhs 'class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7f9fbcb37340 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:236:68> col:38 eback 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f9fbcb373e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fbcb37450 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:237:68> col:38 gptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f9fbcb374f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fbcb37560 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:238:68> col:38 egptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f9fbcb37608 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fbcb376d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:240:5, line:241:43> col:10 gbump 'void (int)' inline
| |-ParmVarDecl 0x7f9fbcb37650 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7f9fbcb37788 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fbcb379f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:243:5, line:248:5> line:244:10 setg 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7f9fbcb377e0 <col:15, col:26> col:26 __gbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f9fbcb37850 <col:34, col:45> col:45 __gnext 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f9fbcb378c0 <col:54, col:65> col:65 __gend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7f9fbcb37ab0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fbcb37b18 <line:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:251:68> col:38 pbase 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f9fbcb37bc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fbcb37c28 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:252:68> col:38 pptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f9fbcb37cd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fbcb37d38 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:253:68> col:38 epptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f9fbcb37de0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9fbcb37eb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:255:5, line:256:43> col:10 pbump 'void (int)' inline
| |-ParmVarDecl 0x7f9fbcb37e28 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7f9fbcb37f60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fbcb38140 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:258:5, line:262:5> line:259:10 setp 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7f9fbcb37fb8 <col:15, col:26> col:26 __pbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f9fbcb38028 <col:34, col:45> col:45 __pend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7f9fbcb381f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7f9fbcb382c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:266:5, col:43> col:18 imbue 'void (const class std::__1::locale &)' virtual
| `-ParmVarDecl 0x7f9fbcb38240 <col:24, col:38> col:38 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f9fbcb38478 <line:269:5, col:67> col:30 setbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7f9fbcb38388 <col:37, col:48> col:48 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f9fbcb383e8 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f9fbcb38698 <line:270:5, line:271:87> line:270:22 seekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7f9fbcb38540 <col:30, col:39> col:39 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7f9fbcb385a0 <col:46, col:64> col:64 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-ParmVarDecl 0x7f9fbcb38600 <line:271:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f9fbcb38858 <line:272:5, line:273:87> line:272:22 seekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7f9fbcb38768 <col:30, col:39> col:39 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ParmVarDecl 0x7f9fbcb387c8 <line:273:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f9fbcb38910 <line:274:5, col:22> col:17 sync 'int (void)' virtual
|-CXXMethodDecl 0x7f9fbcb389b8 <line:277:5, col:34> col:24 showmanyc 'std::__1::streamsize (void)' virtual
|-CXXMethodDecl 0x7f9fbcb38b60 <line:278:5, col:61> col:24 xsgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7f9fbcb38a70 <col:31, col:42> col:42 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f9fbcb38ad0 <col:47, col:58> col:58 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f9fbcb38c38 <line:279:5, col:32> col:22 underflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7f9fbcb38d00 <line:280:5, col:28> col:22 uflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7f9fbcb38e80 <line:283:5, col:65> col:22 pbackfail 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7f9fbcb38db8 <col:32, col:64> col:41 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7f9fbcb39030 <line:286:5, col:67> col:24 xsputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7f9fbcb38f40 <col:31, col:48> col:48 __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f9fbcb38fa0 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f9fbcb39180 <line:287:5, col:64> col:22 overflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7f9fbcb390f8 <col:31, col:63> col:40 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-AccessSpecDecl 0x7f9fbcb39230 <line:289:1, col:8> col:1 private
|-FieldDecl 0x7f9fbcb39258 <line:290:5, col:12> col:12 __loc_ 'class std::__1::locale'
|-FieldDecl 0x7f9fbcb392b0 <line:291:5, col:16> col:16 __binp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f9fbcb39308 <line:292:5, col:16> col:16 __ninp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f9fbcb39360 <line:293:5, col:16> col:16 __einp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f9fbcb393b8 <line:294:5, col:16> col:16 __bout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f9fbcb39410 <line:295:5, col:16> col:16 __nout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
`-FieldDecl 0x7f9fbcb39468 <line:296:5, col:16> col:16 __eout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct __sbuf
         0 |   unsigned char * _base
         8 |   int _size
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __sFILE
         0 |   unsigned char * _p
         8 |   int _r
        12 |   int _w
        16 |   short _flags
        18 |   short _file
        24 |   struct __sbuf _bf
        24 |     unsigned char * _base
        32 |     int _size
        40 |   int _lbfsize
        48 |   void * _cookie
        56 |   int (* _Nullable)(void *) _close
        64 |   int (* _Nullable)(void *, char *, int) _read
        72 |   fpos_t (* _Nullable)(void *, fpos_t, int) _seek
        80 |   int (* _Nullable)(void *, const char *, int) _write
        88 |   struct __sbuf _ub
        88 |     unsigned char * _base
        96 |     int _size
       104 |   struct __sFILEX * _extra
       112 |   int _ur
       116 |   unsigned char [3] _ubuf
       119 |   unsigned char [1] _nbuf
       120 |   struct __sbuf _lb
       120 |     unsigned char * _base
       128 |     int _size
       136 |   int _blksize
       144 |   fpos_t _offset
           | [sizeof=152, dsize=152, align=8,
           |  nvsize=152, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9fbb81a558 </usr/include/stdio.h:88:1, line:91:1> line:88:8 struct __sbuf definition
|-CXXRecordDecl 0x7f9fbb81a678 <col:1, col:8> col:8 implicit struct __sbuf
|-FieldDecl 0x7f9fbb81a750 <line:89:2, col:17> col:17 _base 'unsigned char *'
`-FieldDecl 0x7f9fbb81a7b0 <line:90:2, col:7> col:7 _size 'int'

Layout: <CGRecordLayout
  LLVMType:%struct.__sbuf = type { i8*, i32 }
  NonVirtualBaseLLVMType:%struct.__sbuf = type { i8*, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9fbb81a8d0 </usr/include/stdio.h:122:9, line:153:1> line:122:16 struct __sFILE definition
|-CXXRecordDecl 0x7f9fbb81a9f8 <col:9, col:16> col:16 implicit struct __sFILE
|-FieldDecl 0x7f9fbb81aaa8 <line:123:2, col:17> col:17 referenced _p 'unsigned char *'
|-FieldDecl 0x7f9fbb81ab08 <line:124:2, col:6> col:6 _r 'int'
|-FieldDecl 0x7f9fbb81ab68 <line:125:2, col:6> col:6 referenced _w 'int'
|-FieldDecl 0x7f9fbb81abc8 <line:126:2, col:8> col:8 _flags 'short'
|-FieldDecl 0x7f9fbb81ac28 <line:127:2, col:8> col:8 _file 'short'
|-FieldDecl 0x7f9fbb81acc0 <line:128:2, col:16> col:16 _bf 'struct __sbuf':'struct __sbuf'
|-FieldDecl 0x7f9fbb81ad20 <line:129:2, col:6> col:6 referenced _lbfsize 'int'
|-FieldDecl 0x7f9fbb81ad80 <line:132:2, col:8> col:8 _cookie 'void *'
|-FieldDecl 0x7f9fbb81cc00 <line:133:2, col:19> col:19 _close 'int (* _Nullable)(void *)':'int (*)(void *)'
|-FieldDecl 0x7f9fbb81cf28 <line:134:2, col:19> col:19 _read 'int (* _Nullable)(void *, char *, int)':'int (*)(void *, char *, int)'
|-FieldDecl 0x7f9fbb81d2b0 <line:135:2, col:22> col:22 _seek 'fpos_t (* _Nullable)(void *, fpos_t, int)':'fpos_t (*)(void *, fpos_t, int)'
|-FieldDecl 0x7f9fbb81d5d8 <line:136:2, col:19> col:19 _write 'int (* _Nullable)(void *, const char *, int)':'int (*)(void *, const char *, int)'
|-FieldDecl 0x7f9fbb81d640 <line:139:2, col:16> col:16 _ub 'struct __sbuf':'struct __sbuf'
|-FieldDecl 0x7f9fbb81d740 <line:140:2, col:19> col:19 _extra 'struct __sFILEX *'
|-FieldDecl 0x7f9fbb81d7a0 <line:141:2, col:6> col:6 _ur 'int'
|-FieldDecl 0x7f9fbb81d870 <line:144:2, col:23> col:16 _ubuf 'unsigned char [3]'
|-FieldDecl 0x7f9fbb81d940 <line:145:2, col:23> col:16 _nbuf 'unsigned char [1]'
|-FieldDecl 0x7f9fbb81d9a8 <line:148:2, col:16> col:16 _lb 'struct __sbuf':'struct __sbuf'
|-FieldDecl 0x7f9fbb81da08 <line:151:2, col:6> col:6 _blksize 'int'
`-FieldDecl 0x7f9fbb81da60 <line:152:2, col:9> col:9 _offset 'fpos_t':'long long'

Layout: <CGRecordLayout
  LLVMType:%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
  NonVirtualBaseLLVMType:%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::__shared_count
         0 |   (__shared_count vtable pointer)
         8 |   long __shared_owners_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9fbbdac980 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3410:1, line:3448:1> line:3410:24 referenced class __shared_count definition
|-VisibilityAttr 0x7f9fbbdacaa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7f9fbbdacaf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3410:1, col:24> col:24 implicit referenced class __shared_count
|-CXXConstructorDecl 0x7f9fbbdacce0 <line:3412:5, col:41> col:5 __shared_count 'void (const class std::__1::__shared_count &)'
| `-ParmVarDecl 0x7f9fbbdacbc8 <col:20, col:40> col:41 'const class std::__1::__shared_count &'
|-CXXMethodDecl 0x7f9fbbdace90 <line:3413:5, col:52> col:21 operator= 'class std::__1::__shared_count &(const class std::__1::__shared_count &)'
| `-ParmVarDecl 0x7f9fbbdacda0 <col:31, col:51> col:52 'const class std::__1::__shared_count &'
|-AccessSpecDecl 0x7f9fbbdacf30 <line:3415:1, col:10> col:1 protected
|-FieldDecl 0x7f9fbbdacf70 <line:3416:5, col:10> col:10 referenced __shared_owners_ 'long'
|-CXXDestructorDecl 0x7f9fbbdad008 <line:3417:5, col:29> col:13 used ~__shared_count 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7f9fbbdad0a8 <line:3418:1, col:8> col:1 private
|-CXXMethodDecl 0x7f9fbbdad0f8 <line:3419:5, col:49> col:18 referenced __on_zero_shared 'void (void) noexcept' virtual pure
|-AccessSpecDecl 0x7f9fbbdad190 <line:3421:1, col:7> col:1 public
|-CXXConstructorDecl 0x7f9fbbdad2c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3424:37> line:3423:14 used __shared_count 'void (long) noexcept'
| |-ParmVarDecl 0x7f9fbbdad200 <col:29, col:43> col:34 used __refs 'long' cinit
| | `-ImplicitCastExpr 0x7f9fbbdad898 <col:43> 'long' <IntegralCast>
| |   `-IntegerLiteral 0x7f9fbbdad878 <col:43> 'int' 0
| |-CXXCtorInitializer Field 0x7f9fbbdacf70 '__shared_owners_' 'long'
| | `-ImplicitCastExpr 0x7f9fbbdad908 <line:3424:28> 'long' <LValueToRValue>
| |   `-DeclRefExpr 0x7f9fbbdad8b0 <col:28> 'long' lvalue ParmVar 0x7f9fbbdad200 '__refs' 'long'
| |-CompoundStmt 0x7f9fbbdad950 <col:36, col:37>
| |-AlwaysInlineAttr 0x7f9fbbdad378 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbbdad3c0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbbdad428 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3434:5> line:3432:10 used __add_shared 'void (void) noexcept'
| |-CompoundStmt 0x7f9fbbdadea0 <col:35, line:3434:5>
| | `-CallExpr 0x7f9fbbdade70 <line:3433:7, col:58> 'long':'long'
| |   |-ImplicitCastExpr 0x7f9fbbdade58 <col:7> 'long (*)(long &) noexcept' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7f9fbbdaddc8 <col:7> 'long (long &) noexcept' lvalue Function 0x7f9fbbdadc88 '__libcpp_atomic_refcount_increment' 'long (long &) noexcept' (FunctionTemplate 0x7f9fbbdab0d0 '__libcpp_atomic_refcount_increment')
| |   `-MemberExpr 0x7f9fbbdad9d8 <col:42> 'long' lvalue ->__shared_owners_ 0x7f9fbbdacf70
| |     `-CXXThisExpr 0x7f9fbbdad9c0 <col:42> 'class std::__1::__shared_count *' this
| |-AlwaysInlineAttr 0x7f9fbbdad4c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbbdad508 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9fbbdad570 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3442:5> line:3436:10 used __release_shared '_Bool (void) noexcept'
| |-CompoundStmt 0x7f9fbbdae508 <col:39, line:3442:5>
| | |-IfStmt 0x7f9fbbdae4a0 <line:3437:7, line:3440:7>
| | | |-<<<NULL>>>
| | | |-<<<NULL>>>
| | | |-BinaryOperator 0x7f9fbbdae3a8 <line:3437:11, col:68> '_Bool' '=='
| | | | |-CallExpr 0x7f9fbbdae320 <col:11, col:62> 'long':'long'
| | | | | |-ImplicitCastExpr 0x7f9fbbdae308 <col:11> 'long (*)(long &) noexcept' <FunctionToPointerDecay>
| | | | | | `-DeclRefExpr 0x7f9fbbdae2a8 <col:11> 'long (long &) noexcept' lvalue Function 0x7f9fbbdae168 '__libcpp_atomic_refcount_decrement' 'long (long &) noexcept' (FunctionTemplate 0x7f9fbbdab5e0 '__libcpp_atomic_refcount_decrement')
| | | | | `-MemberExpr 0x7f9fbbdadf30 <col:46> 'long' lvalue ->__shared_owners_ 0x7f9fbbdacf70
| | | | |   `-CXXThisExpr 0x7f9fbbdadf18 <col:46> 'class std::__1::__shared_count *' this
| | | | `-ImplicitCastExpr 0x7f9fbbdae390 <col:67, col:68> 'long' <IntegralCast>
| | | |   `-UnaryOperator 0x7f9fbbdae370 <col:67, col:68> 'int' prefix '-'
| | | |     `-IntegerLiteral 0x7f9fbbdae350 <col:68> 'int' 1
| | | |-CompoundStmt 0x7f9fbbdae478 <col:71, line:3440:7>
| | | | |-CXXMemberCallExpr 0x7f9fbbdae420 <line:3438:9, col:26> 'void'
| | | | | `-MemberExpr 0x7f9fbbdae3e8 <col:9> '<bound member function type>' ->__on_zero_shared 0x7f9fbbdad0f8
| | | | |   `-CXXThisExpr 0x7f9fbbdae3d0 <col:9> 'class std::__1::__shared_count *' this
| | | | `-ReturnStmt 0x7f9fbbdae460 <line:3439:9, col:16>
| | | |   `-CXXBoolLiteralExpr 0x7f9fbbdae448 <col:16> '_Bool' true
| | | `-<<<NULL>>>
| | `-ReturnStmt 0x7f9fbbdae4f0 <line:3441:7, col:14>
| |   `-CXXBoolLiteralExpr 0x7f9fbbdae4d8 <col:14> '_Bool' false
| |-AlwaysInlineAttr 0x7f9fbbdad608 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbbdad650 <col:51, col:74> Hidden
`-CXXMethodDecl 0x7f9fbbdad750 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3447:5> line:3445:10 used use_count 'long (void) const noexcept'
  |-CompoundStmt 0x7f9fbbdaeab8 <col:38, line:3447:5>
  | `-ReturnStmt 0x7f9fbbdaeaa0 <line:3446:9, col:59>
  |   `-BinaryOperator 0x7f9fbbdaea78 <col:16, col:59> 'long' '+'
  |     |-CallExpr 0x7f9fbbdaea10 <col:16, col:55> 'long':'long'
  |     | |-ImplicitCastExpr 0x7f9fbbdae9f8 <col:16> 'long (*)(const long *)' <FunctionToPointerDecay>
  |     | | `-DeclRefExpr 0x7f9fbbdae970 <col:16> 'long (const long *)' lvalue Function 0x7f9fbbdae830 '__libcpp_relaxed_load' 'long (const long *)' (FunctionTemplate 0x7f9fbbcf1308 '__libcpp_relaxed_load')
  |     | `-UnaryOperator 0x7f9fbbdae5d8 <col:38, col:39> 'const long *' prefix '&'
  |     |   `-MemberExpr 0x7f9fbbdae5a0 <col:39> 'const long' lvalue ->__shared_owners_ 0x7f9fbbdacf70
  |     |     `-CXXThisExpr 0x7f9fbbdae588 <col:39> 'const class std::__1::__shared_count *' this
  |     `-ImplicitCastExpr 0x7f9fbbdaea60 <col:59> 'long' <IntegralCast>
  |       `-IntegerLiteral 0x7f9fbbdaea40 <col:59> 'int' 1
  |-AlwaysInlineAttr 0x7f9fbbdad7e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
  `-VisibilityAttr 0x7f9fbbdad830 <col:51, col:74> Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::locale::facet
         0 |   class std::__1::__shared_count (primary base)
         0 |     (__shared_count vtable pointer)
         8 |     long __shared_owners_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9fbca85000 parent 0x7f9fbca7ee98 prev 0x7f9fbca7f0d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:147:1, line:161:1> line:147:32 referenced class facet definition
|-public 'class std::__1::__shared_count'
|-VisibilityAttr 0x7f9fbca85140 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7f9fbca851c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:147:1, col:32> col:32 implicit referenced class facet
|-AccessSpecDecl 0x7f9fbca85260 <line:150:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f9fbca853b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:153:56> line:152:14 used facet 'void (size_t)'
| |-ParmVarDecl 0x7f9fbca852c8 <col:20, col:36> col:27 used __refs 'size_t':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7f9fbca858c8 <col:36> 'size_t':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7f9fbca858a8 <col:36> 'int' 0
| |-CXXCtorInitializer 'class std::__1::__shared_count'
| | `-CXXConstructExpr 0x7f9fbca85a20 <line:153:11, col:53> 'class std::__1::__shared_count' 'void (long) noexcept'
| |   `-BinaryOperator 0x7f9fbca859b8 <col:26, col:52> 'long' '-'
| |     |-CXXStaticCastExpr 0x7f9fbca85950 <col:26, col:50> 'long' static_cast<long> <NoOp>
| |     | `-ImplicitCastExpr 0x7f9fbca85938 <col:44> 'long' <IntegralCast>
| |     |   `-ImplicitCastExpr 0x7f9fbca85920 <col:44> 'size_t':'unsigned long' <LValueToRValue>
| |     |     `-DeclRefExpr 0x7f9fbca858e0 <col:44> 'size_t':'unsigned long' lvalue ParmVar 0x7f9fbca852c8 '__refs' 'size_t':'unsigned long'
| |     `-ImplicitCastExpr 0x7f9fbca859a0 <col:52> 'long' <IntegralCast>
| |       `-IntegerLiteral 0x7f9fbca85980 <col:52> 'int' 1
| |-CompoundStmt 0x7f9fbca85a88 <col:55, col:56>
| |-AlwaysInlineAttr 0x7f9fbca85460 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9fbca854a8 <col:51, col:74> Hidden
|-CXXDestructorDecl 0x7f9fbca85508 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:155:5, col:20> col:13 used ~facet 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7f9fbca855a8 <line:159:1, col:8> col:1 private
|-CXXMethodDecl 0x7f9fbca855f8 <line:160:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:160:18 __on_zero_shared 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7f9fbca85728 <line:147:32, <invalid sloc>> col:32 implicit operator= 'class std::__1::locale::facet &(const class std::__1::locale::facet &)' inline default_delete noexcept-unevaluated 0x7f9fbca85728
| `-ParmVarDecl 0x7f9fbca85840 <col:32> col:32 'const class std::__1::locale::facet &'
`-CXXConstructorDecl 0x7f9fbca89d78 <col:32> col:32 implicit facet 'void (const class std::__1::locale::facet &)' inline default_delete noexcept-unevaluated 0x7f9fbca89d78
  `-ParmVarDecl 0x7f9fbca89ea0 <col:32> col:32 'const class std::__1::locale::facet &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
  NonVirtualBaseLLVMType:%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::codecvt_base (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9fbcab1c80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:832:1, line:837:1> line:832:24 referenced class codecvt_base definition
|-VisibilityAttr 0x7f9fbcab1da8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7f9fbcab1df0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:832:1, col:24> col:24 implicit referenced class codecvt_base
|-AccessSpecDecl 0x7f9fbcab1e88 <line:834:1, col:7> col:1 public
|-CXXConstructorDecl 0x7f9fbcab1f48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:835:43> col:27 used codecvt_base 'void (void)'
| |-CompoundStmt 0x7f9fbcab2240 <col:42, col:43>
| |-AlwaysInlineAttr 0x7f9fbcab1ff0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f9fbcab2038 <col:48, col:71> Hidden
|-EnumDecl 0x7f9fbcab2048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:836:5, col:44> col:10 referenced result
| |-EnumConstantDecl 0x7f9fbcab2100 <col:18> col:18 referenced ok 'enum std::__1::codecvt_base::result'
| |-EnumConstantDecl 0x7f9fbcab2148 <col:22> col:22 referenced partial 'enum std::__1::codecvt_base::result'
| |-EnumConstantDecl 0x7f9fbcab2190 <col:31> col:31 referenced error 'enum std::__1::codecvt_base::result'
| `-EnumConstantDecl 0x7f9fbcab21d8 <col:38> col:38 referenced noconv 'enum std::__1::codecvt_base::result'
|-CXXDestructorDecl 0x7f9fbcab7858 <line:832:24> col:24 implicit ~codecvt_base 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f9fbcab7a68 <col:24> col:24 implicit constexpr codecvt_base 'void (const class std::__1::codecvt_base &)' inline default trivial noexcept-unevaluated 0x7f9fbcab7a68
| `-ParmVarDecl 0x7f9fbcab7b90 <col:24> col:24 'const class std::__1::codecvt_base &'
`-CXXConstructorDecl 0x7f9fbcab7c28 <col:24> col:24 implicit constexpr codecvt_base 'void (class std::__1::codecvt_base &&)' inline default trivial noexcept-unevaluated 0x7f9fbcab7c28
  `-ParmVarDecl 0x7f9fbcab7d50 <col:24> col:24 'class std::__1::codecvt_base &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::codecvt_base" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::codecvt_base.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::codecvt<char, char, mbstate_t>
         0 |   class std::__1::locale::facet (primary base)
         0 |     class std::__1::__shared_count (primary base)
         0 |       (__shared_count vtable pointer)
         8 |       long __shared_owners_
         0 |   class std::__1::codecvt_base (base) (empty)
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9fbcab27c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:845:1, line:927:1> line:846:24 class codecvt definition
|-public 'class locale::facet':'class std::__1::locale::facet'
|-public 'class std::__1::codecvt_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'char'
|-TemplateArgument type '__mbstate_t'
|-VisibilityAttr 0x7f9fbcab2928 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7f9fbcab2b88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:846:1, col:24> col:24 implicit referenced class codecvt
|-AccessSpecDecl 0x7f9fbcab2c20 <line:850:1, col:7> col:1 public
|-TypedefDecl 0x7f9fbcab2c58 <line:851:5, col:23> col:23 referenced intern_type 'char'
| `-BuiltinType 0x7f9fba033560 'char'
|-TypedefDecl 0x7f9fbcab2cc0 <line:852:5, col:23> col:23 referenced extern_type 'char'
| `-BuiltinType 0x7f9fba033560 'char'
|-TypedefDecl 0x7f9fbcab2d28 <line:853:5, col:23> col:23 referenced state_type 'mbstate_t':'__mbstate_t'
| `-TypedefType 0x7f9fbb86f380 'mbstate_t' sugar
|   |-Typedef 0x7f9fba8155f0 'mbstate_t'
|   `-TypedefType 0x7f9fba8155c0 '__darwin_mbstate_t' sugar
|     |-Typedef 0x7f9fba069550 '__darwin_mbstate_t'
|     `-TypedefType 0x7f9fba069520 '__mbstate_t' sugar
|       |-Typedef 0x7f9fba0694b0 '__mbstate_t'
|       `-ElaboratedType 0x7f9fba069460 'union __mbstate_t' sugar
|         `-RecordType 0x7f9fba069290 '__mbstate_t'
|           `-CXXRecord 0x7f9fba0691f8 ''
|-CXXConstructorDecl 0x7f9fbcab2e90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:857:34> line:856:14 codecvt 'void (size_t)'
| |-ParmVarDecl 0x7f9fbcab2dc0 <col:22, col:38> col:29 used __refs 'size_t':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7f9fbcab7808 <col:38> 'size_t':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7f9fbcab77e8 <col:38> 'int' 0
| |-CXXCtorInitializer 'class locale::facet':'class std::__1::locale::facet'
| | `-CXXConstructExpr 0x7f9fbcab79e0 <line:857:11, col:31> 'class locale::facet':'class std::__1::locale::facet' 'void (size_t)'
| |   `-ImplicitCastExpr 0x7f9fbcab79c8 <col:25> 'size_t':'unsigned long' <LValueToRValue>
| |     `-DeclRefExpr 0x7f9fbcab7940 <col:25> 'size_t':'unsigned long' lvalue ParmVar 0x7f9fbcab2dc0 '__refs' 'size_t':'unsigned long'
| |-CXXCtorInitializer 'class std::__1::codecvt_base'
| | `-CXXConstructExpr 0x7f9fbcab7db8 <line:856:14> 'class std::__1::codecvt_base' 'void (void)'
| |-CompoundStmt 0x7f9fbcab7e30 <line:857:33, col:34>
| |-AlwaysInlineAttr 0x7f9fbcab2f40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f9fbcab2f88 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f9fbcab3620 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:865:5> line:860:12 out 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const'
| |-ParmVarDecl 0x7f9fbcab3058 <col:16, col:28> col:28 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7f9fbcab3118 <line:861:16, col:35> col:35 used __frm 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7f9fbcab3188 <col:42, col:61> col:61 used __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7f9fbcab3260 <col:72, col:92> col:92 used __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-ParmVarDecl 0x7f9fbcab3318 <line:862:16, col:29> col:29 used __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f9fbcab3388 <col:35, col:48> col:48 used __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f9fbcab3460 <col:58, col:72> col:72 used __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-CompoundStmt 0x7f9fbcab8088 <line:863:5, line:865:5>
| | `-ReturnStmt 0x7f9fbcab8070 <line:864:9, col:82>
| |   `-CXXMemberCallExpr 0x7f9fbcab7fb0 <col:16, col:82> 'enum std::__1::codecvt_base::result'
| |     |-MemberExpr 0x7f9fbcab7e60 <col:16> '<bound member function type>' ->do_out 0x7f9fbcab5090
| |     | `-CXXThisExpr 0x7f9fbcab7e48 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7f9fbcab7e98 <col:23> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7f9fbcab3058 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7f9fbcab8010 <col:29> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f9fbcab7ec0 <col:29> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7f9fbcab3118 '__frm' 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     |-ImplicitCastExpr 0x7f9fbcab8028 <col:36> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f9fbcab7ee8 <col:36> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7f9fbcab3188 '__frm_end' 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     |-DeclRefExpr 0x7f9fbcab7f10 <col:47> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7f9fbcab3260 '__frm_nxt' 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |     |-ImplicitCastExpr 0x7f9fbcab8040 <col:58> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f9fbcab7f38 <col:58> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f9fbcab3318 '__to' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7f9fbcab8058 <col:64> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f9fbcab7f60 <col:64> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f9fbcab3388 '__to_end' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     `-DeclRefExpr 0x7f9fbcab7f88 <col:74> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f9fbcab3460 '__to_nxt' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-AlwaysInlineAttr 0x7f9fbcab36f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f9fbcab3738 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f9fbcab3a20 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:872:5> line:868:12 unshift 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const'
| |-ParmVarDecl 0x7f9fbcab3788 <col:20, col:32> col:32 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7f9fbcab37f8 <line:869:20, col:33> col:33 used __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f9fbcab3868 <col:39, col:52> col:52 used __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f9fbcab38e0 <col:62, col:76> col:76 used __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-CompoundStmt 0x7f9fbcab8228 <line:870:5, line:872:5>
| | `-ReturnStmt 0x7f9fbcab8210 <line:871:9, col:57>
| |   `-CXXMemberCallExpr 0x7f9fbcab8198 <col:16, col:57> 'enum std::__1::codecvt_base::result'
| |     |-MemberExpr 0x7f9fbcab80c0 <col:16> '<bound member function type>' ->do_unshift 0x7f9fbcab7000
| |     | `-CXXThisExpr 0x7f9fbcab80a8 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7f9fbcab80f8 <col:27> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7f9fbcab3788 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7f9fbcab81e0 <col:33> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f9fbcab8120 <col:33> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f9fbcab37f8 '__to' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7f9fbcab81f8 <col:39> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f9fbcab8148 <col:39> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f9fbcab3868 '__to_end' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     `-DeclRefExpr 0x7f9fbcab8170 <col:49> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f9fbcab38e0 '__to_nxt' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-AlwaysInlineAttr 0x7f9fbcab3ad8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f9fbcab3b20 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f9fbcab3ff0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:880:5> line:875:12 in 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *&) const'
| |-ParmVarDecl 0x7f9fbcab3b70 <col:15, col:27> col:27 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7f9fbcab3c08 <line:876:15, col:34> col:34 used __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f9fbcab3c78 <col:41, col:60> col:60 used __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f9fbcab3d20 <col:71, col:91> col:91 used __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-ParmVarDecl 0x7f9fbcab3db8 <line:877:15, col:28> col:28 used __to 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7f9fbcab3e28 <col:34, col:47> col:47 used __to_end 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7f9fbcab3ed0 <col:57, col:71> col:71 used __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-CompoundStmt 0x7f9fbcab8488 <line:878:5, line:880:5>
| | `-ReturnStmt 0x7f9fbcab8470 <line:879:9, col:81>
| |   `-CXXMemberCallExpr 0x7f9fbcab83b0 <col:16, col:81> 'enum std::__1::codecvt_base::result'
| |     |-MemberExpr 0x7f9fbcab8260 <col:16> '<bound member function type>' ->do_in 0x7f9fbcab54d8
| |     | `-CXXThisExpr 0x7f9fbcab8248 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7f9fbcab8298 <col:22> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7f9fbcab3b70 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7f9fbcab8410 <col:28> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f9fbcab82c0 <col:28> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f9fbcab3c08 '__frm' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7f9fbcab8428 <col:35> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f9fbcab82e8 <col:35> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f9fbcab3c78 '__frm_end' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-DeclRefExpr 0x7f9fbcab8310 <col:46> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f9fbcab3d20 '__frm_nxt' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |     |-ImplicitCastExpr 0x7f9fbcab8440 <col:57> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f9fbcab8338 <col:57> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7f9fbcab3db8 '__to' 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     |-ImplicitCastExpr 0x7f9fbcab8458 <col:63> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f9fbcab8360 <col:63> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7f9fbcab3e28 '__to_end' 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     `-DeclRefExpr 0x7f9fbcab8388 <col:73> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7f9fbcab3ed0 '__to_nxt' 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-AlwaysInlineAttr 0x7f9fbcab40c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f9fbcab4108 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f9fbcab4178 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:886:5> line:883:9 encoding 'int (void) const noexcept'
| |-CompoundStmt 0x7f9fbcab8538 <line:884:5, line:886:5>
| | `-ReturnStmt 0x7f9fbcab8520 <line:885:9, col:28>
| |   `-CXXMemberCallExpr 0x7f9fbcab84f8 <col:16, col:28> 'int'
| |     `-MemberExpr 0x7f9fbcab84c0 <col:16> '<bound member function type>' ->do_encoding 0x7f9fbcab70e8
| |       `-CXXThisExpr 0x7f9fbcab84a8 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |-AlwaysInlineAttr 0x7f9fbcab4210 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f9fbcab4258 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f9fbcab42c0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:892:5> line:889:10 always_noconv '_Bool (void) const noexcept'
| |-CompoundStmt 0x7f9fbcab85e8 <line:890:5, line:892:5>
| | `-ReturnStmt 0x7f9fbcab85d0 <line:891:9, col:33>
| |   `-CXXMemberCallExpr 0x7f9fbcab85a8 <col:16, col:33> '_Bool'
| |     `-MemberExpr 0x7f9fbcab8570 <col:16> '<bound member function type>' ->do_always_noconv 0x7f9fbcab71a8
| |       `-CXXThisExpr 0x7f9fbcab8558 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |-AlwaysInlineAttr 0x7f9fbcab4358 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f9fbcab43a0 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f9fbcab4688 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:898:5> line:895:9 length 'int (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, size_t) const'
| |-ParmVarDecl 0x7f9fbcab43f0 <col:16, col:28> col:28 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7f9fbcab4460 <col:34, col:53> col:53 used __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f9fbcab44d0 <col:60, col:79> col:79 used __end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f9fbcab4540 <col:86, col:93> col:93 used __mx 'size_t':'unsigned long'
| |-CompoundStmt 0x7f9fbcab87a0 <line:896:5, line:898:5>
| | `-ReturnStmt 0x7f9fbcab8788 <line:897:9, col:50>
| |   `-CXXMemberCallExpr 0x7f9fbcab86f8 <col:16, col:50> 'int'
| |     |-MemberExpr 0x7f9fbcab8620 <col:16> '<bound member function type>' ->do_length 0x7f9fbcab7448
| |     | `-CXXThisExpr 0x7f9fbcab8608 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7f9fbcab8658 <col:26> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7f9fbcab43f0 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7f9fbcab8740 <col:32> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f9fbcab8680 <col:32> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f9fbcab4460 '__frm' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7f9fbcab8758 <col:39> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f9fbcab86a8 <col:39> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7f9fbcab44d0 '__end' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     `-ImplicitCastExpr 0x7f9fbcab8770 <col:46> 'size_t':'unsigned long' <LValueToRValue>
| |       `-DeclRefExpr 0x7f9fbcab86d0 <col:46> 'size_t':'unsigned long' lvalue ParmVar 0x7f9fbcab4540 '__mx' 'size_t':'unsigned long'
| |-AlwaysInlineAttr 0x7f9fbcab4740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f9fbcab4788 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f9fbcab47f8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:904:5> line:901:9 max_length 'int (void) const noexcept'
| |-CompoundStmt 0x7f9fbcab8850 <line:902:5, line:904:5>
| | `-ReturnStmt 0x7f9fbcab8838 <line:903:9, col:30>
| |   `-CXXMemberCallExpr 0x7f9fbcab8810 <col:16, col:30> 'int'
| |     `-MemberExpr 0x7f9fbcab87d8 <col:16> '<bound member function type>' ->do_max_length 0x7f9fbcab7530
| |       `-CXXThisExpr 0x7f9fbcab87c0 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |-AlwaysInlineAttr 0x7f9fbcab4890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f9fbcab48d8 <col:48, col:71> Hidden
|-VarDecl 0x7f9fbcab4948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:906:5, col:23> col:23 id 'class locale::id':'class std::__1::locale::id' static
|-AccessSpecDecl 0x7f9fbcab49a8 <line:908:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f9fbcab4b18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:911:34> line:910:14 codecvt 'void (const char *, size_t)'
| |-ParmVarDecl 0x7f9fbcab4a18 <col:22, col:32> col:33 'const char *'
| |-ParmVarDecl 0x7f9fbcab4a88 <col:35, col:51> col:42 used __refs 'size_t':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7f9fbcab7840 <col:51> 'size_t':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7f9fbcab7820 <col:51> 'int' 0
| |-CXXCtorInitializer 'class locale::facet':'class std::__1::locale::facet'
| | `-CXXConstructExpr 0x7f9fbcab8918 <line:911:11, col:31> 'class locale::facet':'class std::__1::locale::facet' 'void (size_t)'
| |   `-ImplicitCastExpr 0x7f9fbcab8900 <col:25> 'size_t':'unsigned long' <LValueToRValue>
| |     `-DeclRefExpr 0x7f9fbcab8878 <col:25> 'size_t':'unsigned long' lvalue ParmVar 0x7f9fbcab4a88 '__refs' 'size_t':'unsigned long'
| |-CXXCtorInitializer 'class std::__1::codecvt_base'
| | `-CXXConstructExpr 0x7f9fbcab8978 <line:910:14> 'class std::__1::codecvt_base' 'void (void)'
| |-CompoundStmt 0x7f9fbcab89f0 <line:911:33, col:34>
| |-AlwaysInlineAttr 0x7f9fbcab4bd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7f9fbcab4c18 <col:48, col:71> Hidden
|-CXXDestructorDecl 0x7f9fbcab4c78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:913:5, col:14> col:5 ~codecvt 'void (void) noexcept'
|-CXXMethodDecl 0x7f9fbcab5090 <line:915:5, line:917:93> line:915:20 used do_out 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const' virtual
| |-ParmVarDecl 0x7f9fbcab4d28 <col:27, col:39> col:39 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7f9fbcab4d98 <line:916:27, col:46> col:46 __frm 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7f9fbcab4e08 <col:53, col:72> col:72 __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7f9fbcab4e80 <col:83, col:103> col:103 __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-ParmVarDecl 0x7f9fbcab4ef0 <line:917:27, col:40> col:40 __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f9fbcab4f60 <col:46, col:59> col:59 __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| `-ParmVarDecl 0x7f9fbcab4fd8 <col:69, col:83> col:83 __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
|-CXXMethodDecl 0x7f9fbcab54d8 <line:918:5, line:920:92> line:918:20 used do_in 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *&) const' virtual
| |-ParmVarDecl 0x7f9fbcab5170 <col:26, col:38> col:38 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7f9fbcab51e0 <line:919:26, col:45> col:45 __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f9fbcab5250 <col:52, col:71> col:71 __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f9fbcab52c8 <col:82, col:102> col:102 __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-ParmVarDecl 0x7f9fbcab5338 <line:920:26, col:39> col:39 __to 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7f9fbcab53a8 <col:45, col:58> col:58 __to_end 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| `-ParmVarDecl 0x7f9fbcab5420 <col:68, col:82> col:82 __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
|-CXXMethodDecl 0x7f9fbcab7000 <line:921:5, line:922:97> line:921:20 used do_unshift 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const' virtual
| |-ParmVarDecl 0x7f9fbcab55b8 <col:31, col:43> col:43 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7f9fbcab5628 <line:922:31, col:44> col:44 __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f9fbcab5698 <col:50, col:63> col:63 __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| `-ParmVarDecl 0x7f9fbcab5710 <col:73, col:87> col:87 __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
|-CXXMethodDecl 0x7f9fbcab70e8 <line:923:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:923:17 used do_encoding 'int (void) const noexcept' virtual
|-CXXMethodDecl 0x7f9fbcab71a8 <line:924:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:924:18 used do_always_noconv '_Bool (void) const noexcept' virtual
|-CXXMethodDecl 0x7f9fbcab7448 <line:925:5, col:110> col:17 used do_length 'int (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, size_t) const' virtual
| |-ParmVarDecl 0x7f9fbcab7250 <col:27, col:39> col:39 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7f9fbcab72c0 <col:45, col:64> col:64 __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7f9fbcab7330 <col:71, col:90> col:90 __end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| `-ParmVarDecl 0x7f9fbcab73a0 <col:97, col:104> col:104 __mx 'size_t':'unsigned long'
|-CXXMethodDecl 0x7f9fbcab7530 <line:926:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:926:17 used do_max_length 'int (void) const noexcept' virtual
`-CXXMethodDecl 0x7f9fbcab7668 <line:846:24, <invalid sloc>> col:24 implicit operator= 'class std::__1::codecvt<char, char, mbstate_t> &(const class std::__1::codecvt<char, char, mbstate_t> &)' inline default_delete noexcept-unevaluated 0x7f9fbcab7668
  `-ParmVarDecl 0x7f9fbcab7780 <col:24> col:24 'const class std::__1::codecvt<char, char, mbstate_t> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::codecvt" = type { %"class.std::__1::locale::facet" }
  NonVirtualBaseLLVMType:%"class.std::__1::codecvt" = type { %"class.std::__1::locale::facet" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9fba0691f8 </usr/include/i386/_types.h:76:9, line:79:1> line:76:9 union definition
|-FieldDecl 0x7f9fba069398 <line:77:2, col:22> col:8 __mbstate8 'char [128]'
|-FieldDecl 0x7f9fba0693f8 <line:78:2, col:12> col:12 _mbstateL 'long long'
|-CXXConstructorDecl 0x7f9fbcacd470 <line:76:9> col:9 implicit used  'void (void) noexcept' inline default trivial
| `-CompoundStmt 0x7f9fbcacd8d8 <col:9>
|-CXXConstructorDecl 0x7f9fbcacd588 <col:9> col:9 implicit constexpr  'void (const __mbstate_t &)' inline default trivial noexcept-unevaluated 0x7f9fbcacd588
| `-ParmVarDecl 0x7f9fbcacd6b0 <col:9> col:9 'const __mbstate_t &'
|-CXXConstructorDecl 0x7f9fbcacd748 <col:9> col:9 implicit constexpr  'void (__mbstate_t &&)' inline default trivial noexcept-unevaluated 0x7f9fbcacd748
| `-ParmVarDecl 0x7f9fbcacd870 <col:9> col:9 '__mbstate_t &&'
`-CXXDestructorDecl 0x7f9fba6f9a68 <col:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.__mbstate_t = type { i64, [120 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9fbb88a628 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:128:1, line:129:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:185:28 class basic_filebuf definition
|-public 'basic_streambuf<char, struct std::__1::char_traits<char> >':'class std::__1::basic_streambuf<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-CXXRecordDecl 0x7f9fba6f7038 prev 0x7f9fbb88a628 <col:1, col:28> col:28 implicit class basic_filebuf
|-AccessSpecDecl 0x7f9fba6f70d0 <line:188:1, col:7> col:1 public
|-TypedefDecl 0x7f9fba6f7108 <line:189:5, col:46> col:46 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f9fba6f6ee0 'char' sugar
|   |-TemplateTypeParmType 0x7f9fba67aae0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9fba67aa98 '_CharT'
|   `-BuiltinType 0x7f9fba033560 'char'
|-TypedefDecl 0x7f9fba6f7170 <line:190:5, col:46> col:46 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f9fba6f6f20 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f9fba67ab50 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f9fba67ab08 '_Traits'
|   `-RecordType 0x7f9fbb888360 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f9fba241548 'char_traits'
|-TypedefDecl 0x7f9fba6f7280 <line:191:5, col:46> col:46 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f9fba6f7230 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f9fba243090 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f9fba2418a8 'int_type'
|     `-BuiltinType 0x7f9fba0335c0 'int'
|-TypedefDecl 0x7f9fba6f7350 <line:192:5, col:46> col:46 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f9fba6f7300 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f9fbcb2e9a0 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f9fba241978 'pos_type'
|     `-TypedefType 0x7f9fba237b10 'std::__1::streampos' sugar
|       |-Typedef 0x7f9fbb88e1b8 'streampos'
|       `-TemplateSpecializationType 0x7f9fbb88e110 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f9fbb88e0f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f9fbb88e000 'fpos'
|-TypedefDecl 0x7f9fba6f7420 <line:193:5, col:46> col:46 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f9fba6f73d0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f9fbcb2ea90 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f9fba241910 'off_type'
|     `-TypedefType 0x7f9fba237a80 'std::__1::streamoff' sugar
|       |-Typedef 0x7f9fbb88e558 'streamoff'
|       `-BuiltinType 0x7f9fba033600 'long long'
|-TypedefDecl 0x7f9fba6f7510 <line:194:5, col:46> col:46 state_type 'typename traits_type::state_type':'__mbstate_t'
| `-ElaboratedType 0x7f9fba6f74c0 'typename traits_type::state_type' sugar
|   `-TypedefType 0x7f9fba6f74a0 'std::__1::char_traits<char>::state_type' sugar
|     |-Typedef 0x7f9fba2419e0 'state_type'
|     `-TypedefType 0x7f9fbb86f380 'mbstate_t' sugar
|       |-Typedef 0x7f9fba8155f0 'mbstate_t'
|       `-TypedefType 0x7f9fba8155c0 '__darwin_mbstate_t' sugar
|         |-Typedef 0x7f9fba069550 '__darwin_mbstate_t'
|         `-TypedefType 0x7f9fba069520 '__mbstate_t' sugar
|           |-Typedef 0x7f9fba0694b0 '__mbstate_t'
|           `-ElaboratedType 0x7f9fba069460 'union __mbstate_t' sugar
|             `-RecordType 0x7f9fba069290 '__mbstate_t'
|               `-CXXRecord 0x7f9fba0691f8 ''
|-CXXConstructorDecl 0x7f9fba6f75a8 <line:197:5, col:19> col:5 basic_filebuf 'void (void)'
|-CXXConstructorDecl 0x7f9fba6f7780 <line:199:5, col:40> col:5 basic_filebuf 'void (class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&)'
| `-ParmVarDecl 0x7f9fba6f7698 <col:19, col:35> col:35 __rhs 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&'
|-CXXDestructorDecl 0x7f9fba6f7870 <line:201:5, col:28> col:13 used ~basic_filebuf 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7f9fba6f7a20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:206:51> col:20 operator= 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &(class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&)'
| |-ParmVarDecl 0x7f9fba6f7958 <col:30, col:46> col:46 __rhs 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&'
| `-AlwaysInlineAttr 0x7f9fba6f7ad0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f9fba6f7bf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:208:5, col:35> col:10 swap 'void (class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &)'
| `-ParmVarDecl 0x7f9fba6f7b28 <col:15, col:30> col:30 __rhs 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &'
|-CXXMethodDecl 0x7f9fba6f7ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:212:20> col:10 is_open '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f9fba6f7d48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f9fba6f7f00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:214:5, col:67> col:20 open 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > *(const char *, class ios_base::openmode)'
| |-ParmVarDecl 0x7f9fba6f7d90 <col:25, col:37> col:37 __s 'const char *'
| `-ParmVarDecl 0x7f9fba6f7df0 <col:42, col:61> col:61 __mode 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f9fba6f8130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:216:69> col:20 open 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > *(const std::__1::string &, class ios_base::openmode)'
| |-ParmVarDecl 0x7f9fba6f7fb8 <col:25, col:39> col:39 __s 'const std::__1::string &'
| |-ParmVarDecl 0x7f9fba6f8018 <col:44, col:63> col:63 __mode 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7f9fba6f81e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f9fba6f8280 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:218:5, col:26> col:20 close 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > *(void)'
|-AccessSpecDecl 0x7f9fba6f8328 <line:220:1, col:10> col:1 protected
|-CXXMethodDecl 0x7f9fba6f83c0 <line:222:5, col:32> col:22 underflow 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7f9fba6f8540 <line:223:5, col:65> col:22 pbackfail 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7f9fba6f8478 <col:32, col:64> col:41 __c 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7f9fba6f8688 <line:224:5, col:65> col:22 overflow 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7f9fba6f8600 <col:32, col:64> col:41 __c 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7f9fba6f89c0 <line:225:5, col:91> col:54 setbuf 'basic_streambuf<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::traits_type> *(std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7f9fba6f8848 <col:61, col:72> col:72 __s 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f9fba6f88a8 <col:77, col:88> col:88 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f9fba6f8c70 <line:226:5, line:227:85> line:226:22 seekoff 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7f9fba6f8ad0 <col:30, col:39> col:39 __off 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7f9fba6f8b30 <col:46, col:64> col:64 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-ParmVarDecl 0x7f9fba6f8b90 <line:227:30, col:82> col:49 __wch 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f9fba6f8e70 <line:228:5, line:229:85> line:228:22 seekpos 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7f9fba6f8d40 <col:30, col:39> col:39 __sp 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ParmVarDecl 0x7f9fba6f8da0 <line:229:30, col:82> col:49 __wch 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f9fba6f8f28 <line:230:5, col:22> col:17 sync 'int (void)' virtual
|-CXXMethodDecl 0x7f9fba6f9058 <line:231:5, col:43> col:18 imbue 'void (const class std::__1::locale &)' virtual
| `-ParmVarDecl 0x7f9fba6f8fd0 <col:24, col:38> col:38 __loc 'const class std::__1::locale &'
|-AccessSpecDecl 0x7f9fba6f9108 <line:233:1, col:8> col:1 private
|-FieldDecl 0x7f9fba6f9130 <line:234:5, col:17> col:17 __extbuf_ 'char *'
|-FieldDecl 0x7f9fba6f9178 <line:235:5, col:17> col:17 __extbufnext_ 'const char *'
|-FieldDecl 0x7f9fba6f91c0 <line:236:5, col:17> col:17 __extbufend_ 'const char *'
|-FieldDecl 0x7f9fba6f9208 <line:237:5, col:25> col:10 __extbuf_min_ 'char [8]'
|-FieldDecl 0x7f9fba6f9250 <line:238:5, col:12> col:12 __ebs_ 'size_t':'unsigned long'
|-FieldDecl 0x7f9fba6f92a8 <line:239:5, col:16> col:16 __intbuf_ 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f9fba6f92f0 <line:240:5, col:12> col:12 __ibs_ 'size_t':'unsigned long'
|-FieldDecl 0x7f9fba6f9338 <line:241:5, col:11> col:11 __file_ 'FILE *'
|-FieldDecl 0x7f9fba6f94d0 <line:242:5, col:49> col:49 __cv_ 'const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> *'
|-FieldDecl 0x7f9fba6f9528 <line:243:5, col:16> col:16 __st_ 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type':'__mbstate_t'
|-FieldDecl 0x7f9fba6f9580 <line:244:5, col:16> col:16 __st_last_ 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type':'__mbstate_t'
|-FieldDecl 0x7f9fba6f95c8 <line:245:5, col:24> col:24 __om_ 'class ios_base::openmode':'unsigned int'
|-FieldDecl 0x7f9fba6f9610 <line:246:5, col:24> col:24 __cm_ 'class ios_base::openmode':'unsigned int'
|-FieldDecl 0x7f9fba6f9658 <line:247:5, col:10> col:10 __owns_eb_ '_Bool'
|-FieldDecl 0x7f9fba6f96a0 <line:248:5, col:10> col:10 __owns_ib_ '_Bool'
|-FieldDecl 0x7f9fba6f96e8 <line:249:5, col:10> col:10 __always_noconv_ '_Bool'
|-CXXMethodDecl 0x7f9fba6f9730 <line:251:5, col:22> col:10 __read_mode '_Bool (void)'
|-CXXMethodDecl 0x7f9fba6f97d8 <line:252:5, col:23> col:10 __write_mode 'void (void)'
`-CXXMethodDecl 0x7f9fba6f98e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:129:32, <invalid sloc>> col:32 implicit operator= 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &(const class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &)' inline default_delete noexcept-unevaluated 0x7f9fba6f98e8
  `-ParmVarDecl 0x7f9fba6f9a00 <col:32> col:32 'const class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_filebuf" = type <{ %"class.std::__1::basic_streambuf", i8*, i8*, i8*, [8 x i8], i64, i8*, i64, %struct.__sFILE*, %"class.std::__1::codecvt"*, %union.__mbstate_t, %union.__mbstate_t, i32, i32, i8, i8, i8, [5 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_filebuf.base" = type <{ %"class.std::__1::basic_streambuf", i8*, i8*, i8*, [8 x i8], i64, i8*, i64, %struct.__sFILE*, %"class.std::__1::codecvt"*, %union.__mbstate_t, %union.__mbstate_t, i32, i32, i8, i8, i8 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9fbb88af18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:134:1, line:135:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1323:28 class basic_fstream definition
|-public 'basic_iostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_iostream<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-CXXRecordDecl 0x7f9fba6f55c0 prev 0x7f9fbb88af18 <col:1, col:28> col:28 implicit class basic_fstream
|-AccessSpecDecl 0x7f9fba6f5658 <line:1326:1, col:7> col:1 public
|-TypedefDecl 0x7f9fba6f5690 <line:1327:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f9fba6f5450 'char' sugar
|   |-TemplateTypeParmType 0x7f9fba6d2cf0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9fba6d2ca8 '_CharT'
|   `-BuiltinType 0x7f9fba033560 'char'
|-TypedefDecl 0x7f9fba6f56f8 <line:1328:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f9fba6f5490 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f9fba6d2d60 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f9fba6d2d18 '_Traits'
|   `-RecordType 0x7f9fbb888360 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f9fba241548 'char_traits'
|-TypedefDecl 0x7f9fba6f5800 <line:1329:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f9fba6f57b0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f9fba243090 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f9fba2418a8 'int_type'
|     `-BuiltinType 0x7f9fba0335c0 'int'
|-TypedefDecl 0x7f9fba6f58d0 <line:1330:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f9fba6f5880 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f9fbcb2e9a0 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f9fba241978 'pos_type'
|     `-TypedefType 0x7f9fba237b10 'std::__1::streampos' sugar
|       |-Typedef 0x7f9fbb88e1b8 'streampos'
|       `-TemplateSpecializationType 0x7f9fbb88e110 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f9fbb88e0f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f9fbb88e000 'fpos'
|-TypedefDecl 0x7f9fba6f59a0 <line:1331:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f9fba6f5950 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f9fbcb2ea90 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f9fba241910 'off_type'
|     `-TypedefType 0x7f9fba237a80 'std::__1::streamoff' sugar
|       |-Typedef 0x7f9fbb88e558 'streamoff'
|       `-BuiltinType 0x7f9fba033600 'long long'
|-CXXConstructorDecl 0x7f9fba6f5a38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1334:19> col:5 used basic_fstream 'void (void)'
| `-AlwaysInlineAttr 0x7f9fba6f5b18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7f9fba6f5c70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1337:101> col:14 used basic_fstream 'void (const char *, class ios_base::openmode)'
| |-ParmVarDecl 0x7f9fba6f5b60 <col:28, col:40> col:40 __s 'const char *'
| |-ParmVarDecl 0x7f9fba6f5bc0 <col:45, col:98> col:64 __mode 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7f9fba6f5d38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7f9fba6f5e90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1339:103> col:14 basic_fstream 'void (const std::__1::string &, class ios_base::openmode)'
| |-ParmVarDecl 0x7f9fba6f5d80 <col:28, col:42> col:42 __s 'const std::__1::string &'
| |-ParmVarDecl 0x7f9fba6f5de0 <col:47, col:100> col:66 __mode 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7f9fba6f5f58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7f9fba6f60c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1343:40> col:5 basic_fstream 'void (class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&)'
| |-ParmVarDecl 0x7f9fba6f5fd8 <col:19, col:35> col:35 __rhs 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&'
| `-AlwaysInlineAttr 0x7f9fba6f6180 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f9fba6f62d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1346:51> col:20 operator= 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &(class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&)'
| |-ParmVarDecl 0x7f9fba6f6208 <col:30, col:46> col:46 __rhs 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&'
| `-AlwaysInlineAttr 0x7f9fba6f6380 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f9fba6f64a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1349:35> col:10 swap 'void (class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &)'
| |-ParmVarDecl 0x7f9fba6f63d8 <col:15, col:30> col:30 __rhs 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &'
| `-AlwaysInlineAttr 0x7f9fba6f6550 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f9fba6f6760 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1352:52> col:44 rdbuf 'basic_filebuf<std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7f9fba6f6808 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f9fba6f6850 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1354:20> col:10 is_open '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f9fba6f68f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f9fba6f6a30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1356:5, col:88> col:10 open 'void (const char *, class ios_base::openmode)'
| |-ParmVarDecl 0x7f9fba6f6940 <col:15, col:27> col:27 __s 'const char *'
| `-ParmVarDecl 0x7f9fba6f69a0 <col:32, col:85> col:51 __mode 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f9fba6f6bd8 <line:1357:5, col:90> col:10 open 'void (const std::__1::string &, class ios_base::openmode)'
| |-ParmVarDecl 0x7f9fba6f6ae8 <col:15, col:29> col:29 __s 'const std::__1::string &'
| `-ParmVarDecl 0x7f9fba6f6b48 <col:34, col:87> col:53 __mode 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f9fba6f6c90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1360:16> col:10 close 'void (void)'
| `-AlwaysInlineAttr 0x7f9fba6f6d38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-AccessSpecDecl 0x7f9fba6f6d80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1362:1, col:8> col:1 private
|-FieldDecl 0x7f9fba6f9b48 <line:1363:5, col:43> col:43 __sb_ 'basic_filebuf<std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::traits_type>':'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >'
|-CXXConstructorDecl 0x7f9fba6f9bb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:135:32> col:32 implicit basic_fstream 'void (const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &)' inline default_delete noexcept-unevaluated 0x7f9fba6f9bb8
| `-ParmVarDecl 0x7f9fba6f9ce0 <col:32> col:32 'const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &'
|-CXXMethodDecl 0x7f9fba6f9d48 <col:32, <invalid sloc>> col:32 implicit operator= 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &(const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &)' inline default_delete noexcept-unevaluated 0x7f9fba6f9d48
| `-ParmVarDecl 0x7f9fba6f9e60 <col:32> col:32 'const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &'
`-CXXDestructorDecl 0x7f9fba6f9ee8 <col:32> col:32 implicit used ~basic_fstream 'void (void) noexcept' inline default
  `-CompoundStmt 0x7f9fba6fbd28 <col:32>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_fstream" = type { %"class.std::__1::basic_iostream.base", %"class.std::__1::basic_filebuf", %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_fstream.base" = type { %"class.std::__1::basic_iostream.base", %"class.std::__1::basic_filebuf" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9fba6f4078 </Users/tskull/Documents/Programming/Cpp/object_model_refined/2_constructors/11_member_initialization_list.cpp:11:1, line:40:1> line:11:8 referenced struct C definition
|-public 'struct B'
|-CXXRecordDecl 0x7f9fba6f41d8 <col:1, col:8> col:8 implicit referenced struct C
|-FieldDecl 0x7f9fba6f4288 <line:12:5, col:19> col:19 x 'unsigned char'
|-FieldDecl 0x7f9fba6f42e8 <line:13:5, col:19> col:19 referenced y 'unsigned char'
|-FieldDecl 0x7f9fba6f43b0 <line:14:5, col:16> col:16 referenced m 'std::mutex':'class std::__1::mutex'
|-FieldDecl 0x7f9fba6f52f8 <line:15:5, col:33> col:33 lg 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
|-FieldDecl 0x7f9fba6f9fc8 <line:16:5, col:18> col:18 f1 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
|-FieldDecl 0x7f9fba6fa060 <line:17:5, col:18> col:18 f2 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
|-CXXConstructorDecl 0x7f9fba6fa190 <line:19:5, line:25:21> line:19:5 used C 'void (int)'
| |-ParmVarDecl 0x7f9fba6fa0c0 <col:7, col:11> col:11 used x 'int'
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7f9fba6fb450 <col:16, col:21> 'struct B' 'void (int)'
| |   `-IntegerLiteral 0x7f9fba6fb3d8 <col:18> 'int' 123
| |-CXXCtorInitializer Field 0x7f9fba6f4288 'x' 'unsigned char'
| | `-InitListExpr 0x7f9fba6fb598 <line:20:17, col:47> 'unsigned char'
| |   `-CXXStaticCastExpr 0x7f9fba6fb520 <col:18, col:46> 'unsigned char' static_cast<unsigned char> <NoOp>
| |     `-ImplicitCastExpr 0x7f9fba6fb508 <col:45> 'unsigned char' <IntegralCast>
| |       `-ImplicitCastExpr 0x7f9fba6fb4f0 <col:45> 'int' <LValueToRValue>
| |         `-DeclRefExpr 0x7f9fba6fb4b0 <col:45> 'int' lvalue ParmVar 0x7f9fba6fa0c0 'x' 'int'
| |-CXXCtorInitializer Field 0x7f9fba6f42e8 'y' 'unsigned char'
| | `-InitListExpr 0x7f9fba6fb670 <line:21:17, col:19> 'unsigned char'
| |   `-ImplicitCastExpr 0x7f9fba6fb6b0 <col:18> 'unsigned char' <IntegralCast>
| |     `-IntegerLiteral 0x7f9fba6fb608 <col:18> 'int' 0
| |-CXXCtorInitializer Field 0x7f9fba6f43b0 'm' 'std::mutex':'class std::__1::mutex'
| | `-CXXConstructExpr 0x7f9fba6fbc98 <line:25:16, col:18> 'std::mutex':'class std::__1::mutex' 'void (void) noexcept' zeroing
| |-CXXCtorInitializer Field 0x7f9fba6f52f8 'lg' 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
| | `-CXXConstructExpr 0x7f9fba6fbb90 <line:24:16, col:20> 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>' 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |   `-MemberExpr 0x7f9fba6fbb28 <col:19> 'std::mutex':'class std::__1::mutex' lvalue ->m 0x7f9fba6f43b0
| |     `-CXXThisExpr 0x7f9fba6fbb10 <col:19> 'struct C *' this
| |-CXXCtorInitializer Field 0x7f9fba6f9fc8 'f1' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7f9fba6fb868 <line:22:16, col:43> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (const char *, class ios_base::openmode)'
| |   |-ImplicitCastExpr 0x7f9fba6fb838 <col:19> 'const char *' <ArrayToPointerDecay>
| |   | `-StringLiteral 0x7f9fba6fb6f8 <col:19> 'const char [8]' lvalue "test.cc"
| |   `-ImplicitCastExpr 0x7f9fba6fb850 <col:30, col:40> 'std::__1::ios_base::openmode':'unsigned int' <LValueToRValue>
| |     `-DeclRefExpr 0x7f9fba6fb7b0 <col:30, col:40> 'const std::__1::ios_base::openmode':'const unsigned int' lvalue Var 0x7f9fbcae69c0 'app' 'const std::__1::ios_base::openmode':'const unsigned int'
| |-CXXCtorInitializer Field 0x7f9fba6fa060 'f2' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7f9fba6fbaa8 <line:23:16, col:63> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (const char *, class ios_base::openmode)'
| |   |-ImplicitCastExpr 0x7f9fba6fba90 <col:19> 'const char *' <ArrayToPointerDecay>
| |   | `-StringLiteral 0x7f9fba6fb8d0 <col:19> 'const char [9]' lvalue "test.bin"
| |   `-BinaryOperator 0x7f9fba6fba30 <col:31, col:60> 'unsigned int' '|'
| |     |-ImplicitCastExpr 0x7f9fba6fba00 <col:31, col:41> 'std::__1::ios_base::openmode':'unsigned int' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f9fba6fb948 <col:31, col:41> 'const std::__1::ios_base::openmode':'const unsigned int' lvalue Var 0x7f9fbcae6bc0 'binary' 'const std::__1::ios_base::openmode':'const unsigned int'
| |     `-ImplicitCastExpr 0x7f9fba6fba18 <col:50, col:60> 'std::__1::ios_base::openmode':'unsigned int' <LValueToRValue>
| |       `-DeclRefExpr 0x7f9fba6fb9c8 <col:50, col:60> 'const std::__1::ios_base::openmode':'const unsigned int' lvalue Var 0x7f9fbcae69c0 'app' 'const std::__1::ios_base::openmode':'const unsigned int'
| `-CompoundStmt 0x7f9fba6fbd40 <line:25:20, col:21>
|-CXXConstructorDecl 0x7f9fba6fa320 <line:27:5, line:31:22> line:27:5 used C 'void (double)'
| |-ParmVarDecl 0x7f9fba6fa258 <col:7, col:14> col:14 used a 'double'
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7f9fba6fbdd0 <line:28:15, col:18> 'struct B' 'void (int)'
| |   `-IntegerLiteral 0x7f9fba6fbd58 <col:17> 'int' 0
| |-CXXCtorInitializer Field 0x7f9fba6f4288 'x' 'unsigned char'
| | `-InitListExpr 0x7f9fba6fc080 <line:30:16, col:18> 'unsigned char'
| |   `-ImplicitCastExpr 0x7f9fba6fc0c0 <col:17> 'unsigned char' <LValueToRValue>
| |     `-MemberExpr 0x7f9fba6fc000 <col:17> 'unsigned char' lvalue ->y 0x7f9fba6f42e8
| |       `-CXXThisExpr 0x7f9fba6fbfe8 <col:17> 'struct C *' this
| |-CXXCtorInitializer Field 0x7f9fba6f42e8 'y' 'unsigned char'
| | `-InitListExpr 0x7f9fba6fbf78 <line:29:16, col:50> 'unsigned char'
| |   `-CXXStaticCastExpr 0x7f9fba6fbf00 <col:17, col:49> 'unsigned char' static_cast<unsigned char> <NoOp>
| |     `-ImplicitCastExpr 0x7f9fba6fbee8 <col:44, col:48> 'unsigned char' <FloatingToIntegral>
| |       `-BinaryOperator 0x7f9fba6fbea8 <col:44, col:48> 'double' '+'
| |         |-ImplicitCastExpr 0x7f9fba6fbe78 <col:44> 'double' <LValueToRValue>
| |         | `-DeclRefExpr 0x7f9fba6fbe30 <col:44> 'double' lvalue ParmVar 0x7f9fba6fa258 'a' 'double'
| |         `-ImplicitCastExpr 0x7f9fba6fbe90 <col:48> 'double' <IntegralToFloating>
| |           `-IntegerLiteral 0x7f9fba6fbe58 <col:48> 'int' 1
| |-CXXCtorInitializer Field 0x7f9fba6f43b0 'm' 'std::mutex':'class std::__1::mutex'
| | `-CXXConstructExpr 0x7f9fba6fc200 <line:27:5> 'std::mutex':'class std::__1::mutex' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7f9fba6f52f8 'lg' 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
| | `-CXXConstructExpr 0x7f9fba6fc1a0 <line:31:15, col:19> 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>' 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |   `-MemberExpr 0x7f9fba6fc120 <col:18> 'std::mutex':'class std::__1::mutex' lvalue ->m 0x7f9fba6f43b0
| |     `-CXXThisExpr 0x7f9fba6fc108 <col:18> 'struct C *' this
| |-CXXCtorInitializer Field 0x7f9fba6f9fc8 'f1' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7f9fba6fc258 <line:27:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| |-CXXCtorInitializer Field 0x7f9fba6fa060 'f2' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7f9fba6fc2b0 <col:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| `-CompoundStmt 0x7f9fba6fc340 <line:31:21, col:22>
|-CXXConstructorDecl 0x7f9fba6fa3f0 <line:33:5, line:39:18> line:33:5 used C 'void (void)'
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7f9fba6fc3d0 <line:35:15, col:20> 'struct B' 'void (int)'
| |   `-IntegerLiteral 0x7f9fba6fc358 <col:17> 'int' 789
| |-CXXCtorInitializer Field 0x7f9fba6f4288 'x' 'unsigned char'
| | `-InitListExpr 0x7f9fba6fc498 <line:36:16, col:18> 'unsigned char'
| |   `-ImplicitCastExpr 0x7f9fba6fc4d8 <col:17> 'unsigned char' <IntegralCast>
| |     `-IntegerLiteral 0x7f9fba6fc430 <col:17> 'int' 0
| |-CXXCtorInitializer Field 0x7f9fba6f42e8 'y' 'unsigned char'
| | `-InitListExpr 0x7f9fba6fc588 <line:37:16, col:18> 'unsigned char'
| |   `-ImplicitCastExpr 0x7f9fba6fc5c8 <col:17> 'unsigned char' <IntegralCast>
| |     `-IntegerLiteral 0x7f9fba6fc520 <col:17> 'int' 0
| |-CXXCtorInitializer Field 0x7f9fba6f43b0 'm' 'std::mutex':'class std::__1::mutex'
| | `-CXXConstructExpr 0x7f9fba6fc708 <line:33:5> 'std::mutex':'class std::__1::mutex' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7f9fba6f52f8 'lg' 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
| | `-CXXConstructExpr 0x7f9fba6fc6a8 <line:38:15, col:19> 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>' 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |   `-MemberExpr 0x7f9fba6fc628 <col:18> 'std::mutex':'class std::__1::mutex' lvalue ->m 0x7f9fba6f43b0
| |     `-CXXThisExpr 0x7f9fba6fc610 <col:18> 'struct C *' this
| |-CXXCtorInitializer Field 0x7f9fba6f9fc8 'f1' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7f9fba6fc760 <line:33:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| |-CXXCtorInitializer Field 0x7f9fba6fa060 'f2' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7f9fba6fc7b8 <col:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| `-CXXTryStmt 0x7f9fba6fc890 <line:34:5, line:39:18>
|   |-CompoundStmt 0x7f9fba6fc848 <line:38:21, col:22>
|   `-CXXCatchStmt 0x7f9fba6fc878 <line:39:5, col:18>
|     |-<<<NULL>>>
|     `-CompoundStmt 0x7f9fba6fc860 <col:17, col:18>
|-CXXConstructorDecl 0x7f9fba6fa848 <line:11:8> col:8 implicit C 'void (const struct C &)' inline default_delete noexcept-unevaluated 0x7f9fba6fa848
| `-ParmVarDecl 0x7f9fba6fa970 <col:8> col:8 'const struct C &'
|-CXXConstructorDecl 0x7f9fba6faae8 <col:8> col:8 implicit C 'void (struct C &&)' inline default_delete noexcept-unevaluated 0x7f9fba6faae8
| `-ParmVarDecl 0x7f9fba6fac10 <col:8> col:8 'struct C &&'
|-CXXMethodDecl 0x7f9fba6faca8 <col:8, <invalid sloc>> col:8 implicit operator= 'struct C &(const struct C &)' inline default_delete noexcept-unevaluated 0x7f9fba6faca8
| `-ParmVarDecl 0x7f9fba6fadc0 <col:8> col:8 'const struct C &'
|-CXXMethodDecl 0x7f9fba6fb158 <col:8, <invalid sloc>> col:8 implicit operator= 'struct C &(struct C &&)' inline default_delete noexcept-unevaluated 0x7f9fba6fb158
| `-ParmVarDecl 0x7f9fba6fb270 <col:8> col:8 'struct C &&'
`-CXXDestructorDecl 0x7f9fba6fb2f8 <col:8> col:8 implicit used ~C 'void (void) noexcept' inline default
  `-CompoundStmt 0x7f9fba6fca50 <col:8>

Layout: <CGRecordLayout
  LLVMType:%struct.C = type { %struct.B, i8, i8, %"class.std::__1::mutex", %"class.std::__1::lock_guard", %"class.std::__1::basic_fstream", %"class.std::__1::basic_fstream" }
  NonVirtualBaseLLVMType:%struct.C = type { %struct.B, i8, i8, %"class.std::__1::mutex", %"class.std::__1::lock_guard", %"class.std::__1::basic_fstream", %"class.std::__1::basic_fstream" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1225:9)
         0 |   struct std::__1::_PairT __t
         0 |     size_t first
         8 |     size_t second
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__murmur2_or_cityhash<unsigned long, 64> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1190:9)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1208:9)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |       union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw
