
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__scalar_hash<struct std::__1::_PairT, 2> (empty)
         0 |   struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1509:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<unsigned long, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1000000000, 1>, false, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_mutex_t
         0 |   long __sig
         8 |   char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_cond_t
         0 |   long __sig
         8 |   char [40] __opaque
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1, 1>, true, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::once_flag
         0 |   unsigned long __state_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale::id
         0 |   struct std::__1::once_flag __flag_
         0 |     unsigned long __state_
         8 |   int32_t __id_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__basic_string_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (empty)
         0 |   class std::__1::allocator<char> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<char>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |       class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false>
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<wchar_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (empty)
         0 |   class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> >
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false> (base)
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |           union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<wchar_t>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> > __r_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false> (base)
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |             union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (base) (empty)
         0 |       class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::money_base::pattern
         0 |   char [4] field
           | [sizeof=4, dsize=4, align=1,
           |  nvsize=4, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<long, long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >
         0 |   std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >::__storage_pointer __seg_
         8 |   std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >::__storage_type __mask_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__bitset<0, 0> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct B
         0 |   int n
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | class std::__1::mutex
         0 |   struct _opaque_pthread_mutex_t __m_
         0 |     long __sig
         8 |     char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::lock_guard<class std::__1::mutex>
         0 |   std::__1::lock_guard<class std::__1::mutex>::mutex_type & __m_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::ios_base
         0 |   (ios_base vtable pointer)
         8 |   std::__1::ios_base::fmtflags __fmtflags_
        16 |   std::__1::streamsize __precision_
        24 |   std::__1::streamsize __width_
        32 |   std::__1::ios_base::iostate __rdstate_
        36 |   std::__1::ios_base::iostate __exceptions_
        40 |   void * __rdbuf_
        48 |   void * __loc_
        56 |   std::__1::ios_base::event_callback * __fn_
        64 |   int * __index_
        72 |   size_t __event_size_
        80 |   size_t __event_cap_
        88 |   long * __iarray_
        96 |   size_t __iarray_size_
       104 |   size_t __iarray_cap_
       112 |   void ** __parray_
       120 |   size_t __parray_size_
       128 |   size_t __parray_cap_
           | [sizeof=136, dsize=136, align=8,
           |  nvsize=136, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ios<char>
         0 |   class std::__1::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     std::__1::ios_base::fmtflags __fmtflags_
        16 |     std::__1::streamsize __precision_
        24 |     std::__1::streamsize __width_
        32 |     std::__1::ios_base::iostate __rdstate_
        36 |     std::__1::ios_base::iostate __exceptions_
        40 |     void * __rdbuf_
        48 |     void * __loc_
        56 |     std::__1::ios_base::event_callback * __fn_
        64 |     int * __index_
        72 |     size_t __event_size_
        80 |     size_t __event_cap_
        88 |     long * __iarray_
        96 |     size_t __iarray_size_
       104 |     size_t __iarray_cap_
       112 |     void ** __parray_
       120 |     size_t __parray_size_
       128 |     size_t __parray_cap_
       136 |   basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       144 |   std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=152, dsize=148, align=8,
           |  nvsize=148, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_istream<char>
         0 |   (basic_istream vtable pointer)
         8 |   std::__1::streamsize __gc_
        16 |   class std::__1::basic_ios<char> (virtual base)
        16 |     class std::__1::ios_base (primary base)
        16 |       (ios_base vtable pointer)
        24 |       std::__1::ios_base::fmtflags __fmtflags_
        32 |       std::__1::streamsize __precision_
        40 |       std::__1::streamsize __width_
        48 |       std::__1::ios_base::iostate __rdstate_
        52 |       std::__1::ios_base::iostate __exceptions_
        56 |       void * __rdbuf_
        64 |       void * __loc_
        72 |       std::__1::ios_base::event_callback * __fn_
        80 |       int * __index_
        88 |       size_t __event_size_
        96 |       size_t __event_cap_
       104 |       long * __iarray_
       112 |       size_t __iarray_size_
       120 |       size_t __iarray_cap_
       128 |       void ** __parray_
       136 |       size_t __parray_size_
       144 |       size_t __parray_cap_
       152 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       160 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=168, dsize=164, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ostream<char>
         0 |   (basic_ostream vtable pointer)
         8 |   class std::__1::basic_ios<char> (virtual base)
         8 |     class std::__1::ios_base (primary base)
         8 |       (ios_base vtable pointer)
        16 |       std::__1::ios_base::fmtflags __fmtflags_
        24 |       std::__1::streamsize __precision_
        32 |       std::__1::streamsize __width_
        40 |       std::__1::ios_base::iostate __rdstate_
        44 |       std::__1::ios_base::iostate __exceptions_
        48 |       void * __rdbuf_
        56 |       void * __loc_
        64 |       std::__1::ios_base::event_callback * __fn_
        72 |       int * __index_
        80 |       size_t __event_size_
        88 |       size_t __event_cap_
        96 |       long * __iarray_
       104 |       size_t __iarray_size_
       112 |       size_t __iarray_cap_
       120 |       void ** __parray_
       128 |       size_t __parray_size_
       136 |       size_t __parray_cap_
       144 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       152 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=160, dsize=156, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_iostream<char>
         0 |   class std::__1::basic_istream<char> (primary base)
         0 |     (basic_istream vtable pointer)
         8 |     std::__1::streamsize __gc_
        16 |   class std::__1::basic_ostream<char> (base)
        16 |     (basic_ostream vtable pointer)
        24 |   class std::__1::basic_ios<char> (virtual base)
        24 |     class std::__1::ios_base (primary base)
        24 |       (ios_base vtable pointer)
        32 |       std::__1::ios_base::fmtflags __fmtflags_
        40 |       std::__1::streamsize __precision_
        48 |       std::__1::streamsize __width_
        56 |       std::__1::ios_base::iostate __rdstate_
        60 |       std::__1::ios_base::iostate __exceptions_
        64 |       void * __rdbuf_
        72 |       void * __loc_
        80 |       std::__1::ios_base::event_callback * __fn_
        88 |       int * __index_
        96 |       size_t __event_size_
       104 |       size_t __event_cap_
       112 |       long * __iarray_
       120 |       size_t __iarray_size_
       128 |       size_t __iarray_cap_
       136 |       void ** __parray_
       144 |       size_t __parray_size_
       152 |       size_t __parray_cap_
       160 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       168 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=176, dsize=172, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale
         0 |   class std::__1::locale::__imp * __locale_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_streambuf<char>
         0 |   (basic_streambuf vtable pointer)
         8 |   class std::__1::locale __loc_
         8 |     class std::__1::locale::__imp * __locale_
        16 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        24 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        32 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        40 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        48 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        56 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | __mbstate_t
         0 |   char [128] __mbstate8
         0 |   long long _mbstateL
           | [sizeof=128, dsize=128, align=8,
           |  nvsize=128, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >
         0 |   class std::__1::basic_streambuf<char> (primary base)
         0 |     (basic_streambuf vtable pointer)
         8 |     class std::__1::locale __loc_
         8 |       class std::__1::locale::__imp * __locale_
        16 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        24 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        32 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        40 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        48 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        56 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
        64 |   char * __extbuf_
        72 |   const char * __extbufnext_
        80 |   const char * __extbufend_
        88 |   char [8] __extbuf_min_
        96 |   size_t __ebs_
       104 |   std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       112 |   size_t __ibs_
       120 |   FILE * __file_
       128 |   const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       136 |   __mbstate_t __st_
       136 |     char [128] __mbstate8
       136 |     long long _mbstateL
       264 |   __mbstate_t __st_last_
       264 |     char [128] __mbstate8
       264 |     long long _mbstateL
       392 |   class ios_base::openmode __om_
       396 |   class ios_base::openmode __cm_
       400 |   _Bool __owns_eb_
       401 |   _Bool __owns_ib_
       402 |   _Bool __always_noconv_
           | [sizeof=408, dsize=403, align=8,
           |  nvsize=403, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >
         0 |   class std::__1::basic_iostream<char> (primary base)
         0 |     class std::__1::basic_istream<char> (primary base)
         0 |       (basic_istream vtable pointer)
         8 |       std::__1::streamsize __gc_
        16 |     class std::__1::basic_ostream<char> (base)
        16 |       (basic_ostream vtable pointer)
        24 |   class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > __sb_
        24 |     class std::__1::basic_streambuf<char> (primary base)
        24 |       (basic_streambuf vtable pointer)
        32 |       class std::__1::locale __loc_
        32 |         class std::__1::locale::__imp * __locale_
        40 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        48 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        56 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        64 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        72 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        80 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
        88 |     char * __extbuf_
        96 |     const char * __extbufnext_
       104 |     const char * __extbufend_
       112 |     char [8] __extbuf_min_
       120 |     size_t __ebs_
       128 |     std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       136 |     size_t __ibs_
       144 |     FILE * __file_
       152 |     const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       160 |     __mbstate_t __st_
       160 |       char [128] __mbstate8
       160 |       long long _mbstateL
       288 |     __mbstate_t __st_last_
       288 |       char [128] __mbstate8
       288 |       long long _mbstateL
       416 |     class ios_base::openmode __om_
       420 |     class ios_base::openmode __cm_
       424 |     _Bool __owns_eb_
       425 |     _Bool __owns_ib_
       426 |     _Bool __always_noconv_
       432 |   class std::__1::basic_ios<char> (virtual base)
       432 |     class std::__1::ios_base (primary base)
       432 |       (ios_base vtable pointer)
       440 |       std::__1::ios_base::fmtflags __fmtflags_
       448 |       std::__1::streamsize __precision_
       456 |       std::__1::streamsize __width_
       464 |       std::__1::ios_base::iostate __rdstate_
       468 |       std::__1::ios_base::iostate __exceptions_
       472 |       void * __rdbuf_
       480 |       void * __loc_
       488 |       std::__1::ios_base::event_callback * __fn_
       496 |       int * __index_
       504 |       size_t __event_size_
       512 |       size_t __event_cap_
       520 |       long * __iarray_
       528 |       size_t __iarray_size_
       536 |       size_t __iarray_cap_
       544 |       void ** __parray_
       552 |       size_t __parray_size_
       560 |       size_t __parray_cap_
       568 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       576 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=584, dsize=580, align=8,
           |  nvsize=432, nvalign=8]

*** Dumping AST Record Layout
         0 | struct C
         0 |   struct B (base)
         0 |     int n
         4 |   unsigned char x
         5 |   unsigned char y
         8 |   class std::__1::mutex m
         8 |     struct _opaque_pthread_mutex_t __m_
         8 |       long __sig
        16 |       char [56] __opaque
        72 |   class std::__1::lock_guard<class std::__1::mutex> lg
        72 |     std::__1::lock_guard<class std::__1::mutex>::mutex_type & __m_
        80 |   class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > f1
        80 |     class std::__1::basic_iostream<char> (primary base)
        80 |       class std::__1::basic_istream<char> (primary base)
        80 |         (basic_istream vtable pointer)
        88 |         std::__1::streamsize __gc_
        96 |       class std::__1::basic_ostream<char> (base)
        96 |         (basic_ostream vtable pointer)
       104 |     class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > __sb_
       104 |       class std::__1::basic_streambuf<char> (primary base)
       104 |         (basic_streambuf vtable pointer)
       112 |         class std::__1::locale __loc_
       112 |           class std::__1::locale::__imp * __locale_
       120 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
       128 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
       136 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
       144 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
       152 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
       160 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
       168 |       char * __extbuf_
       176 |       const char * __extbufnext_
       184 |       const char * __extbufend_
       192 |       char [8] __extbuf_min_
       200 |       size_t __ebs_
       208 |       std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       216 |       size_t __ibs_
       224 |       FILE * __file_
       232 |       const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       240 |       __mbstate_t __st_
       240 |         char [128] __mbstate8
       240 |         long long _mbstateL
       368 |       __mbstate_t __st_last_
       368 |         char [128] __mbstate8
       368 |         long long _mbstateL
       496 |       class ios_base::openmode __om_
       500 |       class ios_base::openmode __cm_
       504 |       _Bool __owns_eb_
       505 |       _Bool __owns_ib_
       506 |       _Bool __always_noconv_
       512 |     class std::__1::basic_ios<char> (virtual base)
       512 |       class std::__1::ios_base (primary base)
       512 |         (ios_base vtable pointer)
       520 |         std::__1::ios_base::fmtflags __fmtflags_
       528 |         std::__1::streamsize __precision_
       536 |         std::__1::streamsize __width_
       544 |         std::__1::ios_base::iostate __rdstate_
       548 |         std::__1::ios_base::iostate __exceptions_
       552 |         void * __rdbuf_
       560 |         void * __loc_
       568 |         std::__1::ios_base::event_callback * __fn_
       576 |         int * __index_
       584 |         size_t __event_size_
       592 |         size_t __event_cap_
       600 |         long * __iarray_
       608 |         size_t __iarray_size_
       616 |         size_t __iarray_cap_
       624 |         void ** __parray_
       632 |         size_t __parray_size_
       640 |         size_t __parray_cap_
       648 |       basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       656 |       std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
       664 |   class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > f2
       664 |     class std::__1::basic_iostream<char> (primary base)
       664 |       class std::__1::basic_istream<char> (primary base)
       664 |         (basic_istream vtable pointer)
       672 |         std::__1::streamsize __gc_
       680 |       class std::__1::basic_ostream<char> (base)
       680 |         (basic_ostream vtable pointer)
       688 |     class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > __sb_
       688 |       class std::__1::basic_streambuf<char> (primary base)
       688 |         (basic_streambuf vtable pointer)
       696 |         class std::__1::locale __loc_
       696 |           class std::__1::locale::__imp * __locale_
       704 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
       712 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
       720 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
       728 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
       736 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
       744 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
       752 |       char * __extbuf_
       760 |       const char * __extbufnext_
       768 |       const char * __extbufend_
       776 |       char [8] __extbuf_min_
       784 |       size_t __ebs_
       792 |       std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       800 |       size_t __ibs_
       808 |       FILE * __file_
       816 |       const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       824 |       __mbstate_t __st_
       824 |         char [128] __mbstate8
       824 |         long long _mbstateL
       952 |       __mbstate_t __st_last_
       952 |         char [128] __mbstate8
       952 |         long long _mbstateL
      1080 |       class ios_base::openmode __om_
      1084 |       class ios_base::openmode __cm_
      1088 |       _Bool __owns_eb_
      1089 |       _Bool __owns_ib_
      1090 |       _Bool __always_noconv_
      1096 |     class std::__1::basic_ios<char> (virtual base)
      1096 |       class std::__1::ios_base (primary base)
      1096 |         (ios_base vtable pointer)
      1104 |         std::__1::ios_base::fmtflags __fmtflags_
      1112 |         std::__1::streamsize __precision_
      1120 |         std::__1::streamsize __width_
      1128 |         std::__1::ios_base::iostate __rdstate_
      1132 |         std::__1::ios_base::iostate __exceptions_
      1136 |         void * __rdbuf_
      1144 |         void * __loc_
      1152 |         std::__1::ios_base::event_callback * __fn_
      1160 |         int * __index_
      1168 |         size_t __event_size_
      1176 |         size_t __event_cap_
      1184 |         long * __iarray_
      1192 |         size_t __iarray_size_
      1200 |         size_t __iarray_cap_
      1208 |         void ** __parray_
      1216 |         size_t __parray_size_
      1224 |         size_t __parray_cap_
      1232 |       basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
      1240 |       std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=1248, dsize=1248, align=8,
           |  nvsize=1248, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd74b36cfe8 <object_model_refined/2_constructors/11_member_initialization_list.cpp:5:1, line:9:1> line:5:8 referenced struct B definition
|-CXXRecordDecl 0x7fd74b36d108 <col:1, col:8> col:8 implicit referenced struct B
|-FieldDecl 0x7fd74b36d1b8 <line:6:5, col:9> col:9 n 'int'
|-CXXConstructorDecl 0x7fd74b36d2f0 <line:8:5, col:22> col:5 used B 'void (int)'
| |-ParmVarDecl 0x7fd74b36d218 <col:7, col:11> col:11 used n 'int'
| |-CXXCtorInitializer Field 0x7fd74b36d1b8 'n' 'int'
| | `-ImplicitCastExpr 0x7fd74b36d418 <col:18> 'int' <LValueToRValue>
| |   `-DeclRefExpr 0x7fd74b36d3c0 <col:18> 'int' lvalue ParmVar 0x7fd74b36d218 'n' 'int'
| `-CompoundStmt 0x7fd74b36d460 <col:21, col:22>
|-CXXConstructorDecl 0x7fd74b3738f8 <line:5:8> col:8 implicit constexpr B 'void (const struct B &)' inline default trivial noexcept-unevaluated 0x7fd74b3738f8
| `-ParmVarDecl 0x7fd74b373a20 <col:8> col:8 'const struct B &'
|-CXXConstructorDecl 0x7fd74b373ab8 <col:8> col:8 implicit constexpr B 'void (struct B &&)' inline default trivial noexcept-unevaluated 0x7fd74b373ab8
| `-ParmVarDecl 0x7fd74b373be0 <col:8> col:8 'struct B &&'
|-CXXDestructorDecl 0x7fd74b373dd8 <col:8> col:8 implicit ~B 'void (void) noexcept' inline default trivial
|-CXXMethodDecl 0x7fd74b374258 <col:8, <invalid sloc>> col:8 implicit operator= 'struct B &(const struct B &)' inline default trivial noexcept-unevaluated 0x7fd74b374258
| `-ParmVarDecl 0x7fd74b374370 <col:8> col:8 'const struct B &'
`-CXXMethodDecl 0x7fd74b3743d8 <col:8, <invalid sloc>> col:8 implicit operator= 'struct B &(struct B &&)' inline default trivial noexcept-unevaluated 0x7fd74b3743d8
  `-ParmVarDecl 0x7fd74b3744f0 <col:8> col:8 'struct B &&'

Layout: <CGRecordLayout
  LLVMType:%struct.B = type { i32 }
  NonVirtualBaseLLVMType:%struct.B = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd74a8c32c0 </usr/include/sys/_pthread/_pthread_types.h:78:1, line:81:1> line:78:8 struct _opaque_pthread_mutex_t definition
|-CXXRecordDecl 0x7fd74a8c33e8 <col:1, col:8> col:8 implicit struct _opaque_pthread_mutex_t
|-FieldDecl 0x7fd74a8c3498 <line:79:2, col:7> col:7 __sig 'long'
|-FieldDecl 0x7fd74a8c3520 <line:80:2, col:38> col:7 __opaque 'char [56]'
`-CXXDestructorDecl 0x7fd74d8313a8 <line:78:8> col:8 implicit ~_opaque_pthread_mutex_t 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%struct._opaque_pthread_mutex_t = type { i64, [56 x i8] }
  NonVirtualBaseLLVMType:%struct._opaque_pthread_mutex_t = type { i64, [56 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd74d830618 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:40:1, line:68:1> line:40:78 referenced class mutex definition
|-VisibilityAttr 0x7fd74d830738 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fd74d830780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:40:1, col:78> col:78 implicit referenced class mutex
|-FieldDecl 0x7fd74d830828 <line:43:5, /usr/include/pthread.h:182:64> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:43:22 referenced __m_ 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
| `-InitListExpr 0x7fd74d831560 </usr/include/pthread.h:182:35, col:64> 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
|   |-ImplicitCastExpr 0x7fd74d8315b0 </usr/include/pthread_impl.h:41:34> 'long' <IntegralCast>
|   | `-IntegerLiteral 0x7fd74d831488 <col:34> 'int' 850045863
|   `-InitListExpr 0x7fd74d8315c8 </usr/include/pthread.h:182:61, col:63> 'char [56]'
|     |-array filler
|     | `-ImplicitValueInitExpr 0x7fd74d831628 <<invalid sloc>> 'char'
|     `-ImplicitCastExpr 0x7fd74d831608 <col:62> 'char' <IntegralCast>
|       `-IntegerLiteral 0x7fd74d8314a8 <col:62> 'int' 0
|-AccessSpecDecl 0x7fd74d830870 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:48:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fd74d830938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:51:31> col:15 used constexpr mutex 'void (void) noexcept' default
| |-CXXCtorInitializer Field 0x7fd74d830828 '__m_' 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
| | `-CXXDefaultInitExpr 0x7fd74b375030 <col:15> 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
| |-CompoundStmt 0x7fd74b375080 <col:31>
| |-AlwaysInlineAttr 0x7fd74d8309e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d830a28 <col:51, col:74> Hidden
|-CXXDestructorDecl 0x7fd74d830a88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:55:5, col:12> col:5 used ~mutex 'void (void) noexcept'
|-AccessSpecDecl 0x7fd74d830b28 <line:57:1, col:8> col:1 private
|-CXXConstructorDecl 0x7fd74d830c50 <line:58:5, col:23> col:5 mutex 'void (const class std::__1::mutex &)'
| `-ParmVarDecl 0x7fd74d830b88 <col:11, col:22> col:23 'const class std::__1::mutex &'
|-CXXMethodDecl 0x7fd74d830e00 <line:59:5, col:34> col:12 operator= 'class std::__1::mutex &(const class std::__1::mutex &)'
| `-ParmVarDecl 0x7fd74d830d10 <col:22, col:33> col:34 'const class std::__1::mutex &'
|-AccessSpecDecl 0x7fd74d830ea0 <line:61:1, col:7> col:1 public
|-CXXMethodDecl 0x7fd74d830ee8 <line:62:5, col:15> col:10 lock 'void (void)'
|-CXXMethodDecl 0x7fd74d830fa8 <line:63:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:63:10 try_lock '_Bool (void) noexcept'
|-CXXMethodDecl 0x7fd74d831068 <line:64:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:64:10 unlock 'void (void) noexcept'
|-TypedefDecl 0x7fd74d831110 <line:66:5, col:31> col:31 referenced native_handle_type 'std::__1::__libcpp_mutex_t *'
| `-PointerType 0x7fd74d168840 'std::__1::__libcpp_mutex_t *'
|   `-TypedefType 0x7fd74d168820 'std::__1::__libcpp_mutex_t' sugar
|     |-Typedef 0x7fd74d167b38 '__libcpp_mutex_t'
|     `-TypedefType 0x7fd74d13e380 'pthread_mutex_t' sugar
|       |-Typedef 0x7fd74d136660 'pthread_mutex_t'
|       `-TypedefType 0x7fd74d136630 '__darwin_pthread_mutex_t' sugar
|         |-Typedef 0x7fd74a8c5f80 '__darwin_pthread_mutex_t'
|         `-ElaboratedType 0x7fd74a8c5f30 'struct _opaque_pthread_mutex_t' sugar
|           `-RecordType 0x7fd74a8c3360 'struct _opaque_pthread_mutex_t'
|             `-CXXRecord 0x7fd74a8c32c0 '_opaque_pthread_mutex_t'
`-CXXMethodDecl 0x7fd74d831240 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:67:80> col:50 native_handle 'std::__1::mutex::native_handle_type (void)'
  |-CompoundStmt 0x7fd74d831778 <col:66, col:80>
  | `-ReturnStmt 0x7fd74d831760 <col:67, col:75>
  |   `-UnaryOperator 0x7fd74d831740 <col:74, col:75> 'std::__1::__libcpp_mutex_t *' prefix '&'
  |     `-MemberExpr 0x7fd74d831708 <col:75> 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t' lvalue ->__m_ 0x7fd74d830828
  |       `-CXXThisExpr 0x7fd74d8316f0 <col:75> 'class std::__1::mutex *' this
  |-AlwaysInlineAttr 0x7fd74d8312d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
  `-VisibilityAttr 0x7fd74d831320 <col:51, col:74> Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::mutex" = type { %struct._opaque_pthread_mutex_t }
  NonVirtualBaseLLVMType:%"class.std::__1::mutex" = type { %struct._opaque_pthread_mutex_t }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fd74b36d868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:91:1, line:114:1> line:93:1 class lock_guard definition
|-TemplateArgument type 'class std::__1::mutex'
|-CXXRecordDecl 0x7fd74b36dae0 prev 0x7fd74b36d868 <line:92:1, line:93:1> col:1 implicit class lock_guard
|-AccessSpecDecl 0x7fd74b36db78 <line:95:1, col:7> col:1 public
|-TypedefDecl 0x7fd74b36dbd8 <line:96:5, col:20> col:20 mutex_type 'class std::__1::mutex':'class std::__1::mutex'
| `-SubstTemplateTypeParmType 0x7fd74b36dba0 'class std::__1::mutex' sugar
|   |-TemplateTypeParmType 0x7fd74d834d20 '_Mutex' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fd74d834ce0 '_Mutex'
|   `-RecordType 0x7fd74d8306b0 'class std::__1::mutex'
|     `-CXXRecord 0x7fd74d830618 'mutex'
|-AccessSpecDecl 0x7fd74b36dc30 <line:98:1, col:8> col:1 private
|-FieldDecl 0x7fd74b36dcb8 <line:99:5, col:17> col:17 __m_ 'std::__1::lock_guard<class std::__1::mutex>::mutex_type &'
|-AccessSpecDecl 0x7fd74b36dd00 <line:100:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fd74b36de40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:104:34> line:103:14 used lock_guard 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |-ParmVarDecl 0x7fd74b36dd38 <col:25, col:37> col:37 __m 'std::__1::lock_guard<class std::__1::mutex>::mutex_type &'
| `-AlwaysInlineAttr 0x7fd74b36df28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fd74b36e0d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:107:22> line:106:5 lock_guard 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &, struct std::__1::adopt_lock_t)'
| |-ParmVarDecl 0x7fd74b36df80 <col:16, col:28> col:28 __m 'std::__1::lock_guard<class std::__1::mutex>::mutex_type &'
| |-ParmVarDecl 0x7fd74b36dfe0 <col:33> col:45 'struct std::__1::adopt_lock_t'
| `-AlwaysInlineAttr 0x7fd74b36e198 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fd74b36e210 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:109:89> col:5 used ~lock_guard 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fd74b36e2c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7fd74b36e308 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:111:1, col:8> col:1 private
|-CXXConstructorDecl 0x7fd74b36e450 <line:112:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:824:37> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:112:5 lock_guard 'void (const class std::__1::lock_guard<class std::__1::mutex> &)' delete trivial
| `-ParmVarDecl 0x7fd74b36e368 <col:16, col:32> col:33 'const class std::__1::lock_guard<class std::__1::mutex> &'
`-CXXMethodDecl 0x7fd74b36e610 <line:113:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:824:37> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:113:17 operator= 'class std::__1::lock_guard<class std::__1::mutex> &(const class std::__1::lock_guard<class std::__1::mutex> &)' delete trivial
  `-ParmVarDecl 0x7fd74b36e548 <col:27, col:43> col:44 'const class std::__1::lock_guard<class std::__1::mutex> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::lock_guard" = type { %"class.std::__1::mutex"* }
  NonVirtualBaseLLVMType:%"class.std::__1::lock_guard" = type { %"class.std::__1::mutex"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd74d9f24a0 prev 0x7fd74b061f20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, line:386:1> line:231:24 referenced class ios_base definition
|-VisibilityAttr 0x7fd74d9f25a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fd74d9f25e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, col:24> col:24 implicit referenced class ios_base
|-AccessSpecDecl 0x7fd74d9f2680 <line:233:1, col:7> col:1 public
|-CXXRecordDecl 0x7fd74d9f26d8 <line:234:5, col:33> col:33 class failure
| `-VisibilityAttr 0x7fd74d9f2790 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:701:47, col:71> Default
|-TypedefDecl 0x7fd74d9f27f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:236:5, col:26> col:26 referenced fmtflags 'unsigned int'
| `-BuiltinType 0x7fd74a833660 'unsigned int'
|-VarDecl 0x7fd74d9f2880 <line:237:5, col:41> col:27 referenced boolalpha 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f2900 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f28e0 <col:41> 'int' 1
|-VarDecl 0x7fd74d9f2980 <line:238:5, col:41> col:27 referenced dec 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f2a00 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f29e0 <col:41> 'int' 2
|-VarDecl 0x7fd74d9f2a80 <line:239:5, col:41> col:27 referenced fixed 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f2b00 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f2ae0 <col:41> 'int' 4
|-VarDecl 0x7fd74d9f2b80 <line:240:5, col:41> col:27 referenced hex 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f2c00 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f2be0 <col:41> 'int' 8
|-VarDecl 0x7fd74d9f2c80 <line:241:5, col:41> col:27 referenced internal 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f2d00 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f2ce0 <col:41> 'int' 16
|-VarDecl 0x7fd74d9f2d80 <line:242:5, col:41> col:27 referenced left 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f2e00 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f2de0 <col:41> 'int' 32
|-VarDecl 0x7fd74d9f2e80 <line:243:5, col:41> col:27 referenced oct 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f2f00 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f2ee0 <col:41> 'int' 64
|-VarDecl 0x7fd74d9f2f80 <line:244:5, col:41> col:27 referenced right 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f3000 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f2fe0 <col:41> 'int' 128
|-VarDecl 0x7fd74d9f3080 <line:245:5, col:41> col:27 referenced scientific 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f3100 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f30e0 <col:41> 'int' 256
|-VarDecl 0x7fd74d9f3180 <line:246:5, col:41> col:27 referenced showbase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f3200 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f31e0 <col:41> 'int' 512
|-VarDecl 0x7fd74d9f3280 <line:247:5, col:41> col:27 referenced showpoint 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f3300 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f32e0 <col:41> 'int' 1024
|-VarDecl 0x7fd74d9f3380 <line:248:5, col:41> col:27 referenced showpos 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f3400 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f33e0 <col:41> 'int' 2048
|-VarDecl 0x7fd74d9f3480 <line:249:5, col:41> col:27 referenced skipws 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f3500 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f34e0 <col:41> 'int' 4096
|-VarDecl 0x7fd74d9f3580 <line:250:5, col:41> col:27 referenced unitbuf 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f3600 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f35e0 <col:41> 'int' 8192
|-VarDecl 0x7fd74d9f3680 <line:251:5, col:41> col:27 referenced uppercase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f3700 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f36e0 <col:41> 'int' 16384
|-VarDecl 0x7fd74d9f3780 <line:252:5, col:56> col:27 referenced adjustfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7fd74d9f38c8 <col:41, col:56> 'unsigned int' '|'
|   |-BinaryOperator 0x7fd74d9f3860 <col:41, col:48> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7fd74d9f3830 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7fd74d9f37e0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fd74d9f2d80 'left' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7fd74d9f3848 <col:48> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7fd74d9f3808 <col:48> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fd74d9f2f80 'right' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7fd74d9f38b0 <col:56> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fd74d9f3888 <col:56> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fd74d9f2c80 'internal' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7fd74d9f3958 <line:253:5, col:53> col:27 referenced basefield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7fd74d9f3aa0 <col:41, col:53> 'unsigned int' '|'
|   |-BinaryOperator 0x7fd74d9f3a38 <col:41, col:47> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7fd74d9f3a08 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7fd74d9f39b8 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fd74d9f2980 'dec' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7fd74d9f3a20 <col:47> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7fd74d9f39e0 <col:47> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fd74d9f2e80 'oct' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7fd74d9f3a88 <col:53> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fd74d9f3a60 <col:53> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fd74d9f2b80 'hex' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7fd74d9f3b30 <line:254:5, col:54> col:27 referenced floatfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7fd74d9f3c10 <col:41, col:54> 'unsigned int' '|'
|   |-ImplicitCastExpr 0x7fd74d9f3be0 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | `-DeclRefExpr 0x7fd74d9f3b90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fd74d9f3080 'scientific' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7fd74d9f3bf8 <col:54> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fd74d9f3bb8 <col:54> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fd74d9f2a80 'fixed' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-TypedefDecl 0x7fd74d9f3ca8 <line:256:5, col:26> col:26 referenced iostate 'unsigned int'
| `-BuiltinType 0x7fd74a833660 'unsigned int'
|-VarDecl 0x7fd74d9f3d30 <line:257:5, col:36> col:26 referenced badbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f3db0 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f3d90 <col:36> 'int' 1
|-VarDecl 0x7fd74d9f3e30 <line:258:5, col:36> col:26 referenced eofbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f3eb0 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f3e90 <col:36> 'int' 2
|-VarDecl 0x7fd74d9f3f30 <line:259:5, col:36> col:26 referenced failbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f3fb0 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f3f90 <col:36> 'int' 4
|-VarDecl 0x7fd74d9f4030 <line:260:5, col:36> col:26 referenced goodbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f40b0 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f4090 <col:36> 'int' 0
|-TypedefDecl 0x7fd74d9f4138 <line:262:5, col:26> col:26 referenced openmode 'unsigned int'
| `-BuiltinType 0x7fd74a833660 'unsigned int'
|-VarDecl 0x7fd74d9f41c0 <line:263:5, col:36> col:27 referenced app 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f4240 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f4220 <col:36> 'int' 1
|-VarDecl 0x7fd74d9f42c0 <line:264:5, col:36> col:27 referenced ate 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f4340 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f4320 <col:36> 'int' 2
|-VarDecl 0x7fd74d9f43c0 <line:265:5, col:36> col:27 referenced binary 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f4440 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f4420 <col:36> 'int' 4
|-VarDecl 0x7fd74d9f44c0 <line:266:5, col:36> col:27 referenced in 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f4540 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f4520 <col:36> 'int' 8
|-VarDecl 0x7fd74d9f45c0 <line:267:5, col:36> col:27 referenced out 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f4640 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f4620 <col:36> 'int' 16
|-VarDecl 0x7fd74d9f46c0 <line:268:5, col:36> col:27 referenced trunc 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd74d9f4740 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd74d9f4720 <col:36> 'int' 32
|-EnumDecl 0x7fd74d9f47b0 <line:270:5, col:32> col:10 referenced seekdir
| |-EnumConstantDecl 0x7fd74d9f4870 <col:19> col:19 referenced beg 'enum std::__1::ios_base::seekdir'
| |-EnumConstantDecl 0x7fd74d9f48b8 <col:24> col:24 referenced cur 'enum std::__1::ios_base::seekdir'
| `-EnumConstantDecl 0x7fd74d9f4900 <col:29> col:29 referenced end 'enum std::__1::ios_base::seekdir'
|-TypedefDecl 0x7fd74d9f4958 <line:273:5, col:26> col:26 io_state 'std::__1::ios_base::iostate':'unsigned int'
| `-TypedefType 0x7fd74d9f3d00 'std::__1::ios_base::iostate' sugar
|   |-Typedef 0x7fd74d9f3ca8 'iostate'
|   `-BuiltinType 0x7fd74a833660 'unsigned int'
|-TypedefDecl 0x7fd74d9f49c0 <line:274:5, col:26> col:26 open_mode 'std::__1::ios_base::openmode':'unsigned int'
| `-TypedefType 0x7fd74d9f4190 'std::__1::ios_base::openmode' sugar
|   |-Typedef 0x7fd74d9f4138 'openmode'
|   `-BuiltinType 0x7fd74a833660 'unsigned int'
|-TypedefDecl 0x7fd74d9f4a28 <line:275:5, col:26> col:26 seek_dir 'enum std::__1::ios_base::seekdir'
| `-EnumType 0x7fd74d9f4850 'enum std::__1::ios_base::seekdir'
|   `-Enum 0x7fd74d9f47b0 'seekdir'
|-TypedefDecl 0x7fd74d9f4b40 <line:277:5, col:30> col:30 streamoff 'std::__1::streamoff':'long long'
| `-ElaboratedType 0x7fd74d9f4ad0 'std::__1::streamoff' sugar
|   `-TypedefType 0x7fd74ccba080 'std::__1::streamoff' sugar
|     |-Typedef 0x7fd74b070d58 'streamoff'
|     `-BuiltinType 0x7fd74a833600 'long long'
|-TypedefDecl 0x7fd74d9f4c20 <line:278:5, col:30> col:30 streampos 'std::__1::streampos':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fd74d9f4bb0 'std::__1::streampos' sugar
|   `-TypedefType 0x7fd74ccba110 'std::__1::streampos' sugar
|     |-Typedef 0x7fd74b0709b8 'streampos'
|     `-TemplateSpecializationType 0x7fd74b070910 'fpos<mbstate_t>' sugar fpos
|       |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|       `-RecordType 0x7fd74b0708f0 'class std::__1::fpos<__mbstate_t>'
|         `-ClassTemplateSpecialization 0x7fd74b070800 'fpos'
|-CXXRecordDecl 0x7fd74d9f4ca8 <line:281:5, col:28> col:28 class Init
| `-VisibilityAttr 0x7fd74d9f4d60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXMethodDecl 0x7fd74d9f4e90 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:284:48> col:40 flags 'std::__1::ios_base::fmtflags (void) const'
| |-AlwaysInlineAttr 0x7fd74d9f4f28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9f4f70 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74d9f50b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:285:62> col:40 flags 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fd74d9f4fc0 <col:46, col:55> col:55 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fd74d9f5150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9f5198 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74d9f5270 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:286:61> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fd74d9f51e8 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fd74d9f5310 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9f5358 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74d9f5530 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:287:78> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags, std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fd74d9f53a8 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-ParmVarDecl 0x7fd74d9f5418 <col:63, col:72> col:72 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fd74d9f55d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9f5620 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74d9f5730 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:288:58> col:36 used unsetf 'void (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fd74d9f5670 <col:43, col:52> col:52 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fd74d9f57d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9f5818 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74d9f58d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:290:54> col:42 precision 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7fd74d9f5968 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9f59b0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74d9f5ac0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:291:69> col:42 precision 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7fd74d9f5a00 <col:52, col:63> col:63 __prec 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7fd74d9f5b60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9f5ba8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74d9f5c08 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:292:50> col:42 width 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7fd74d9f5ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9f5ce8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74d9f5dc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:293:65> col:42 width 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7fd74d9f5d38 <col:48, col:59> col:59 __wide 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7fd74d9f5e60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9f5ea8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74d9f5f50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:296:5, col:37> col:12 referenced imbue 'class std::__1::locale (const class std::__1::locale &)'
| `-ParmVarDecl 0x7fd74d9f5ec8 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7fd74d9f6040 <line:297:5, col:21> col:12 referenced getloc 'class std::__1::locale (void) const'
|-CXXMethodDecl 0x7fd74d9f6100 <line:300:5, col:23> col:16 xalloc 'int (void)' static
|-CXXMethodDecl 0x7fd74d9f6240 <line:301:5, col:28> col:11 iword 'long &(int)'
| `-ParmVarDecl 0x7fd74d9f61b0 <col:17, col:21> col:21 __index 'int'
|-CXXMethodDecl 0x7fd74d9f63c8 <line:302:5, col:29> col:12 pword 'void *&(int)'
| `-ParmVarDecl 0x7fd74d9f62f8 <col:18, col:22> col:22 __index 'int'
|-CXXDestructorDecl 0x7fd74d9f64b8 <line:305:5, col:23> col:13 ~ios_base 'void (void) noexcept' virtual
|-EnumDecl 0x7fd74d9f6558 <line:308:5, col:58> col:10 referenced event
| |-EnumConstantDecl 0x7fd74d9f6610 <col:18> col:18 referenced erase_event 'enum std::__1::ios_base::event'
| |-EnumConstantDecl 0x7fd74d9f6658 <col:31> col:31 imbue_event 'enum std::__1::ios_base::event'
| `-EnumConstantDecl 0x7fd74d9f66a0 <col:44> col:44 referenced copyfmt_event 'enum std::__1::ios_base::event'
|-TypedefDecl 0x7fd74d9f6960 <line:309:5, col:65> col:20 referenced event_callback 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-PointerType 0x7fd74d9f68f0 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
|   `-ParenType 0x7fd74d9f6890 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' sugar
|     `-FunctionProtoType 0x7fd74d9f6840 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' cdecl
|       |-BuiltinType 0x7fd74a833520 'void'
|       |-EnumType 0x7fd74d9f65f0 'enum std::__1::ios_base::event'
|       | `-Enum 0x7fd74d9f6558 'event'
|       |-LValueReferenceType 0x7fd74c921ac0 'class std::__1::ios_base &'
|       | `-RecordType 0x7fd74b061fc0 'class std::__1::ios_base'
|       |   `-CXXRecord 0x7fd74d9f24a0 'ios_base'
|       `-BuiltinType 0x7fd74a8335c0 'int'
|-CXXMethodDecl 0x7fd74d9f6b80 <line:310:5, col:60> col:10 register_callback 'void (std::__1::ios_base::event_callback, int)'
| |-ParmVarDecl 0x7fd74d9f69f0 <col:28, col:43> col:43 __fn 'std::__1::ios_base::event_callback':'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-ParmVarDecl 0x7fd74d9f6a68 <col:49, col:53> col:53 __index 'int'
|-AccessSpecDecl 0x7fd74d9f6c28 <line:312:1, col:8> col:1 private
|-CXXConstructorDecl 0x7fd74d9f6d70 <line:313:5, col:29> col:5 ios_base 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fd74d9f6c88 <col:14, col:28> col:29 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7fd74d9f6ef0 <line:314:5, col:40> col:15 operator= 'class std::__1::ios_base &(const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fd74d9f6e30 <col:25, col:39> col:40 'const class std::__1::ios_base &'
|-AccessSpecDecl 0x7fd74d9f6f90 <line:316:1, col:7> col:1 public
|-CXXMethodDecl 0x7fd74d9f7090 <line:317:5, col:51> col:17 sync_with_stdio '_Bool (_Bool)' static
| `-ParmVarDecl 0x7fd74d9f6fc8 <col:33, col:47> col:38 __sync '_Bool' cinit
|   `-CXXBoolLiteralExpr 0x7fd74d9f9488 <col:47> '_Bool' true
|-CXXMethodDecl 0x7fd74d9f71b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:319:49> col:39 rdstate 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7fd74d9f7248 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9f7290 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74d9f7370 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:320:5, col:41> col:10 used clear 'void (std::__1::ios_base::iostate)'
| `-ParmVarDecl 0x7fd74d9f72b0 <col:16, col:34> col:24 __state 'std::__1::ios_base::iostate':'unsigned int' cinit
|   `-ImplicitCastExpr 0x7fd74d9f94c8 <col:34> 'std::__1::ios_base::iostate':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fd74d9f94a0 <col:34> 'const std::__1::ios_base::iostate':'const unsigned int' lvalue Var 0x7fd74d9f4030 'goodbit' 'const std::__1::ios_base::iostate':'const unsigned int'
|-CXXMethodDecl 0x7fd74d9f74d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:321:60> col:36 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fd74d9f7450 <col:45, col:53> col:53 __state 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7fd74d9f7578 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9f75c0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74d9f7620 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:323:43> col:36 good '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fd74d9f76b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9f7700 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74d9f7760 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:324:42> col:36 eof '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fd74d9f77f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9f7840 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74d9f78a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:325:43> col:36 fail '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fd74d9f7938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9f7980 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74d9f79e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:326:42> col:36 bad '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fd74d9f7a78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9f7ac0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74d9f7b20 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:328:52> col:39 exceptions 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7fd74d9f7bb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9f7c00 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74d9f7cd8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:329:64> col:36 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fd74d9f7c50 <col:47, col:55> col:55 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7fd74d9f7d78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9f7dc0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74d9f7df0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:331:5, col:44> col:10 __set_badbit_and_consider_rethrow 'void (void)'
|-CXXMethodDecl 0x7fd74d9f7ea8 <line:332:5, col:45> col:10 __set_failbit_and_consider_rethrow 'void (void)'
|-AccessSpecDecl 0x7fd74d9f7f40 <line:334:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fd74d9f7fb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:337:16> line:336:5 ios_base 'void (void)'
| |-CompoundStmt 0x7fd74d9f94e0 <col:16, line:337:16>
| |-AlwaysInlineAttr 0x7fd74d9f8060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9f80a8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74d9f8158 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:339:5, col:25> col:10 referenced init 'void (void *)'
| `-ParmVarDecl 0x7fd74d9f80d0 <col:15, col:21> col:21 __sb 'void *'
|-CXXMethodDecl 0x7fd74d9f8288 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:340:64> col:33 rdbuf 'void *(void) const'
| |-CompoundStmt 0x7fd74d9f9578 <col:47, col:64>
| | `-ReturnStmt 0x7fd74d9f9560 <col:48, col:55>
| |   `-ImplicitCastExpr 0x7fd74d9f9548 <col:55> 'void *' <LValueToRValue>
| |     `-MemberExpr 0x7fd74d9f9510 <col:55> 'void *const' lvalue ->__rdbuf_ 0x7fd74d9f8e98
| |       `-CXXThisExpr 0x7fd74d9f94f8 <col:55> 'const class std::__1::ios_base *' this
| |-AlwaysInlineAttr 0x7fd74d9f8320 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fd74d9f8368 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fd74d9f8448 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:347:5> line:343:10 rdbuf 'void (void *)'
| |-ParmVarDecl 0x7fd74d9f83c0 <col:16, col:22> col:22 used __sb 'void *'
| |-CompoundStmt 0x7fd74d9f96f8 <line:344:5, line:347:5>
| | |-BinaryOperator 0x7fd74d9f9628 <line:345:9, col:20> 'void *' lvalue '='
| | | |-MemberExpr 0x7fd74d9f95b0 <col:9> 'void *' lvalue ->__rdbuf_ 0x7fd74d9f8e98
| | | | `-CXXThisExpr 0x7fd74d9f9598 <col:9> 'class std::__1::ios_base *' this
| | | `-ImplicitCastExpr 0x7fd74d9f9610 <col:20> 'void *' <LValueToRValue>
| | |   `-DeclRefExpr 0x7fd74d9f95e8 <col:20> 'void *' lvalue ParmVar 0x7fd74d9f83c0 '__sb' 'void *'
| | `-CXXMemberCallExpr 0x7fd74d9f96a0 <line:346:9, col:15> 'void'
| |   |-MemberExpr 0x7fd74d9f9668 <col:9> '<bound member function type>' ->clear 0x7fd74d9f7370
| |   | `-CXXThisExpr 0x7fd74d9f9650 <col:9> 'class std::__1::ios_base *' this
| |   `-CXXDefaultArgExpr 0x7fd74d9f96d8 <<invalid sloc>> 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7fd74d9f84e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fd74d9f8530 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fd74d9f8610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:349:5, col:32> col:10 referenced __call_callbacks 'void (enum std::__1::ios_base::event)'
| `-ParmVarDecl 0x7fd74d9f8550 <col:27> col:32 'enum std::__1::ios_base::event'
|-CXXMethodDecl 0x7fd74d9f8748 <line:350:5, col:33> col:10 referenced copyfmt 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fd74d9f86c0 <col:18, col:32> col:33 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7fd74d9f88c0 <line:351:5, col:24> col:10 referenced move 'void (class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fd74d9f87f8 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7fd74d9f8a38 <line:352:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:352:10 referenced swap 'void (class std::__1::ios_base &) noexcept'
| `-ParmVarDecl 0x7fd74d9f8970 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7fd74d9f8ba8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:358:5> line:355:10 referenced set_rdbuf 'void (void *)'
| |-ParmVarDecl 0x7fd74d9f8b20 <col:20, col:26> col:26 used __sb 'void *'
| |-CompoundStmt 0x7fd74d9f97d8 <line:356:5, line:358:5>
| | `-BinaryOperator 0x7fd74d9f97b0 <line:357:9, col:20> 'void *' lvalue '='
| |   |-MemberExpr 0x7fd74d9f9738 <col:9> 'void *' lvalue ->__rdbuf_ 0x7fd74d9f8e98
| |   | `-CXXThisExpr 0x7fd74d9f9720 <col:9> 'class std::__1::ios_base *' this
| |   `-ImplicitCastExpr 0x7fd74d9f9798 <col:20> 'void *' <LValueToRValue>
| |     `-DeclRefExpr 0x7fd74d9f9770 <col:20> 'void *' lvalue ParmVar 0x7fd74d9f8b20 '__sb' 'void *'
| |-AlwaysInlineAttr 0x7fd74d9f8c48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fd74d9f8c90 <col:48, col:71> Hidden
|-AccessSpecDecl 0x7fd74d9f8ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:360:1, col:8> col:1 private
|-FieldDecl 0x7fd74d9f8cd8 <line:362:5, col:21> col:21 referenced __fmtflags_ 'std::__1::ios_base::fmtflags':'unsigned int'
|-FieldDecl 0x7fd74d9f8d30 <line:363:5, col:21> col:21 referenced __precision_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7fd74d9f8d88 <line:364:5, col:21> col:21 referenced __width_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7fd74d9f8de0 <line:365:5, col:21> col:21 referenced __rdstate_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7fd74d9f8e38 <line:366:5, col:21> col:21 referenced __exceptions_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7fd74d9f8e98 <line:367:5, col:21> col:21 referenced __rdbuf_ 'void *'
|-FieldDecl 0x7fd74d9f8ef8 <line:368:5, col:21> col:21 __loc_ 'void *'
|-FieldDecl 0x7fd74d9f8fa8 <line:369:5, col:21> col:21 __fn_ 'std::__1::ios_base::event_callback *'
|-FieldDecl 0x7fd74d9f9008 <line:370:5, col:21> col:21 __index_ 'int *'
|-FieldDecl 0x7fd74d9f9060 <line:371:5, col:21> col:21 __event_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7fd74d9f90b8 <line:372:5, col:21> col:21 __event_cap_ 'size_t':'unsigned long'
|-VarDecl 0x7fd74d9f91c8 <line:376:5, col:24> col:24 __xindex_ 'atomic<int>':'struct std::__1::atomic<int>' static
|-FieldDecl 0x7fd74d9f9240 <line:380:5, col:21> col:21 __iarray_ 'long *'
|-FieldDecl 0x7fd74d9f9298 <line:381:5, col:21> col:21 __iarray_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7fd74d9f92f0 <line:382:5, col:21> col:21 __iarray_cap_ 'size_t':'unsigned long'
|-FieldDecl 0x7fd74d9f9350 <line:383:5, col:21> col:21 __parray_ 'void **'
|-FieldDecl 0x7fd74d9f93a8 <line:384:5, col:21> col:21 __parray_size_ 'size_t':'unsigned long'
`-FieldDecl 0x7fd74d9f9400 <line:385:5, col:21> col:21 __parray_cap_ 'size_t':'unsigned long'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fd74b06abf8 parent 0x7fd74b061e88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:486:78> col:64 class basic_ios definition
|-public 'class std::__1::ios_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fd74da4b818 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fd74da4b908 prev 0x7fd74b06abf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:583:1, col:28> col:28 implicit class basic_ios
|-AccessSpecDecl 0x7fd74da4b9a0 <line:586:1, col:7> col:1 public
|-TypedefDecl 0x7fd74da4ba08 <line:588:5, col:20> col:20 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fd74da4b9d0 'char' sugar
|   |-TemplateTypeParmType 0x7fd74da0b010 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fd74da0afd0 '_CharT'
|   `-BuiltinType 0x7fd74a833560 'char'
|-TypedefDecl 0x7fd74da4ba98 <line:589:5, col:21> col:21 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fd74da4ba60 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fd74da0b080 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fd74da0b038 '_Traits'
|   `-RecordType 0x7fd74b06ab60 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fd74ccc2b48 'char_traits'
|-TypedefDecl 0x7fd74da4bba0 <line:591:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fd74da4bb50 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fd74ccc4690 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fd74ccc2ea8 'int_type'
|     `-BuiltinType 0x7fd74a8335c0 'int'
|-TypedefDecl 0x7fd74da4bc70 <line:592:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fd74da4bc20 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fd74da3c1a0 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fd74ccc2f78 'pos_type'
|     `-TypedefType 0x7fd74ccba110 'std::__1::streampos' sugar
|       |-Typedef 0x7fd74b0709b8 'streampos'
|       `-TemplateSpecializationType 0x7fd74b070910 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fd74b0708f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fd74b070800 'fpos'
|-TypedefDecl 0x7fd74da4bd40 <line:593:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fd74da4bcf0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fd74da3c290 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fd74ccc2f10 'off_type'
|     `-TypedefType 0x7fd74ccba080 'std::__1::streamoff' sugar
|       |-Typedef 0x7fd74b070d58 'streamoff'
|       `-BuiltinType 0x7fd74a833600 'long long'
|-CXXConversionDecl 0x7fd74da4bd98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:605:60> col:22 operator bool '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fd74da4be68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74da4beb8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:608:69> col:32 operator! '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fd74da4bf60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74da4bfa8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:609:81> col:35 rdstate 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7fd74da4c050 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74da4c120 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:610:91> col:32 clear 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fd74da4c098 <col:38, col:56> col:46 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7fd74da4c1d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74da4c2a0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:611:87> col:32 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fd74da4c218 <col:41, col:49> col:49 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7fd74da4c350 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74da4c398 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:612:70> col:32 good '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fd74da4c440 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74da4c488 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:613:69> col:32 eof '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fd74da4c530 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74da4c578 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:614:70> col:32 fail '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fd74da4c620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74da4c668 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:615:69> col:32 bad '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fd74da4c710 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74da4c758 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:617:85> col:35 exceptions 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7fd74da4c800 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74da4c8d0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:618:95> col:32 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fd74da4c848 <col:43, col:51> col:51 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7fd74da4c980 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXConstructorDecl 0x7fd74da4cc30 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:622:68> col:14 basic_ios 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fd74da4cae8 <col:24, col:64> col:64 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fd74da4ccf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fd74da4cd68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:623:5, col:24> col:13 used ~basic_ios 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7fd74da4cfc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:627:50> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7fd74da4d068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fd74da4d3a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:629:95> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fd74da4d258 <col:48, col:87> col:87 __tiestr 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fd74da4d450 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fd74da4d610 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:632:54> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7fd74da4d6b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fd74da4d9f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:634:97> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fd74da4d8a8 <col:52, col:93> col:93 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fd74da4daa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fd74da4dc20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:636:5, col:46> col:16 copyfmt 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)'
| `-ParmVarDecl 0x7fd74da4db58 <col:24, col:41> col:41 __rhs 'const class std::__1::basic_ios<char> &'
|-CXXMethodDecl 0x7fd74da4dd20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:639:22> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (void) const'
| `-AlwaysInlineAttr 0x7fd74da4ddc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fd74da4df20 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:641:34> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7fd74da4de20 <col:20, col:30> col:30 __ch 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7fd74da4dfd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fd74da4e0a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:644:37> col:12 imbue 'class std::__1::locale (const class std::__1::locale &)'
| |-ParmVarDecl 0x7fd74da4e018 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7fd74da4e150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fd74da4e2e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:647:47> col:10 narrow 'char (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, char) const'
| |-ParmVarDecl 0x7fd74da4e1a8 <col:17, col:27> col:27 __c 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| |-ParmVarDecl 0x7fd74da4e208 <col:32, col:37> col:37 __dfault 'char'
| `-AlwaysInlineAttr 0x7fd74da4e398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fd74da4e4a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:649:31> col:15 widen 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (char) const'
| |-ParmVarDecl 0x7fd74da4e3e0 <col:21, col:26> col:26 __c 'char'
| `-AlwaysInlineAttr 0x7fd74da4e550 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7fd74da4e598 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:651:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fd74da4e5e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:654:17> line:653:5 basic_ios 'void (void)'
| `-AlwaysInlineAttr 0x7fd74da4e698 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74da4e8a0 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:656:60> col:10 init 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fd74da4e7d8 <col:15, col:56> col:56 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fd74da4e950 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fd74da4ea70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:659:31> col:10 move 'void (class std::__1::basic_ios<char> &)'
| |-ParmVarDecl 0x7fd74da4e9a8 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7fd74da4eb20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fd74da4ec70 <line:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:662:47> col:10 move 'void (class std::__1::basic_ios<char> &&)'
| |-ParmVarDecl 0x7fd74da4eba8 <col:15, col:27> col:27 __rhs 'class std::__1::basic_ios<char> &&'
| `-AlwaysInlineAttr 0x7fd74da4ed20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74da4ee48 <line:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:665:10 swap 'void (class std::__1::basic_ios<char> &) noexcept'
| |-ParmVarDecl 0x7fd74da4ed78 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7fd74da4eef8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fd74da4f100 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:667:65> col:10 set_rdbuf 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fd74da4f038 <col:20, col:61> col:61 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fd74da4f1b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7fd74da4f1f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:668:1, col:8> col:1 private
|-FieldDecl 0x7fd74da4f318 <line:669:5, col:44> col:44 __tie_ 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
|-FieldDecl 0x7fd74da4f390 <line:670:6, col:23> col:23 __fill_ 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' mutable
|-CXXConstructorDecl 0x7fd74da4f418 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:486:64> col:64 implicit basic_ios 'void (const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7fd74da4f418
| `-ParmVarDecl 0x7fd74da4f540 <col:64> col:64 'const class std::__1::basic_ios<char> &'
`-CXXMethodDecl 0x7fd74da4f5a8 <col:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7fd74da4f5a8
  `-ParmVarDecl 0x7fd74da4f680 <col:64> col:64 'const class std::__1::basic_ios<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ios" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fd74b06b5c8 parent 0x7fd74b061e88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1681:82> col:64 class basic_istream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fd74d3f3668 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fd74d3f38a0 prev 0x7fd74b06b5c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:176:1, col:28> col:28 implicit class basic_istream
|-FieldDecl 0x7fd74d3f3938 <line:179:5, col:16> col:16 __gc_ 'std::__1::streamsize':'long'
|-AccessSpecDecl 0x7fd74d3f3980 <line:180:1, col:7> col:1 public
|-TypedefDecl 0x7fd74d3f39b8 <line:182:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fd74d3f3730 'char' sugar
|   |-TemplateTypeParmType 0x7fd74d39dd90 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fd74d39dd48 '_CharT'
|   `-BuiltinType 0x7fd74a833560 'char'
|-TypedefDecl 0x7fd74d3f3a20 <line:183:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fd74d3f3770 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fd74d39de00 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fd74d39ddb8 '_Traits'
|   `-RecordType 0x7fd74b06ab60 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fd74ccc2b48 'char_traits'
|-TypedefDecl 0x7fd74d3f3b30 <line:184:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fd74d3f3ae0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fd74ccc4690 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fd74ccc2ea8 'int_type'
|     `-BuiltinType 0x7fd74a8335c0 'int'
|-TypedefDecl 0x7fd74d3f3c00 <line:185:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fd74d3f3bb0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fd74da3c1a0 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fd74ccc2f78 'pos_type'
|     `-TypedefType 0x7fd74ccba110 'std::__1::streampos' sugar
|       |-Typedef 0x7fd74b0709b8 'streampos'
|       `-TemplateSpecializationType 0x7fd74b070910 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fd74b0708f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fd74b070800 'fpos'
|-TypedefDecl 0x7fd74d3f3cd0 <line:186:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fd74d3f3c80 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fd74da3c290 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fd74ccc2f10 'off_type'
|     `-TypedefType 0x7fd74ccba080 'std::__1::streamoff' sugar
|       |-Typedef 0x7fd74b070d58 'streamoff'
|       `-BuiltinType 0x7fd74a833600 'long long'
|-CXXConstructorDecl 0x7fd74d3f3f50 <line:189:5, line:191:25> line:190:14 basic_istream 'void (basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7fd74d3f3e48 <col:28, col:69> col:69 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fd74d3f4038 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXDestructorDecl 0x7fd74d3f40b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:192:5, col:28> col:13 ~basic_istream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fd74d3f4160 <line:193:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fd74d3f42b0 <line:195:5, line:196:40> col:5 basic_istream 'void (class std::__1::basic_istream<char> &&)' inline
| |-ParmVarDecl 0x7fd74d3f41c8 <col:19, col:35> col:35 __rhs 'class std::__1::basic_istream<char> &&'
| `-AlwaysInlineAttr 0x7fd74d3f4370 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fd74d3f44c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:199:5, line:200:51> col:20 operator= 'class std::__1::basic_istream<char> &(class std::__1::basic_istream<char> &&)' inline
| |-ParmVarDecl 0x7fd74d3f43f8 <col:30, col:46> col:46 __rhs 'class std::__1::basic_istream<char> &&'
| `-AlwaysInlineAttr 0x7fd74d3f4570 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fd74d3f4690 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:203:5, line:207:5> line:204:10 swap 'void (class std::__1::basic_istream<char> &)' inline
| |-ParmVarDecl 0x7fd74d3f45c8 <col:15, col:30> col:30 __rhs 'class std::__1::basic_istream<char> &'
| `-AlwaysInlineAttr 0x7fd74d3f4740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXConstructorDecl 0x7fd74d3f48b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:210:5, col:65> col:5 basic_istream 'void (const class std::__1::basic_istream<char> &)' delete
| `-ParmVarDecl 0x7fd74d3f47c8 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_istream<char> &'
|-CXXMethodDecl 0x7fd74d3f4a40 <line:211:5, col:65> col:20 operator= 'class std::__1::basic_istream<char> &(const class std::__1::basic_istream<char> &)' delete
| `-ParmVarDecl 0x7fd74d3f4980 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_istream<char> &'
|-AccessSpecDecl 0x7fd74d3f4af0 <line:213:1, col:7> col:1 public
|-CXXRecordDecl 0x7fd74d3f4b18 <line:216:5, col:32> col:32 class sentry definition
| |-CXXRecordDecl 0x7fd74d3f9080 prev 0x7fd74d3f4b18 <line:293:1, col:60> col:60 implicit class sentry
| |-FieldDecl 0x7fd74d3f9118 <line:295:5, col:10> col:10 __ok_ '_Bool'
| |-CXXConstructorDecl 0x7fd74d3f92a0 <line:297:5, col:25> col:5 sentry 'void (const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7fd74d3f9198 <col:12, col:24> col:25 'const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x7fd74d3f9460 <line:298:5, col:36> col:13 operator= 'class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7fd74d3f9398 <col:23, col:35> col:36 'const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x7fd74d3f9510 <line:300:1, col:7> col:1 public
| |-CXXConstructorDecl 0x7fd74d3f9830 <line:301:5, col:82> col:14 sentry 'void (basic_istream<char, struct std::__1::char_traits<char> > &, _Bool)'
| | |-ParmVarDecl 0x7fd74d3f9698 <col:21, col:53> col:53 __is 'basic_istream<char, struct std::__1::char_traits<char> > &'
| | `-ParmVarDecl 0x7fd74d3f96f8 <col:59, col:77> col:64 __noskipws '_Bool'
| `-CXXConversionDecl 0x7fd74d3f98f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:306:45> col:9 operator bool '_Bool (void) const'
|   `-AlwaysInlineAttr 0x7fd74d3f99c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fd74d3f4e50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:219:5, line:221:27> line:220:20 operator>> 'class std::__1::basic_istream<char> &(class std::__1::basic_istream<char> &(*)(class std::__1::basic_istream<char> &))' inline
| |-ParmVarDecl 0x7fd74d3f4d50 <col:31, col:68> col:48 __pf 'class std::__1::basic_istream<char> &(*)(class std::__1::basic_istream<char> &)'
| `-AlwaysInlineAttr 0x7fd74d3f4f00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74d3f5370 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:223:5, line:226:34> line:224:20 operator>> 'class std::__1::basic_istream<char> &(basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &))' inline
| |-ParmVarDecl 0x7fd74d3f5270 <col:31, line:225:73> col:33 __pf 'basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &)'
| `-AlwaysInlineAttr 0x7fd74d3f5420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74d3f5570 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:228:5, line:230:34> line:229:20 operator>> 'class std::__1::basic_istream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))' inline
| |-ParmVarDecl 0x7fd74d3f5468 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x7fd74d3f5620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74d3f5870 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:232:5, col:76> col:20 operator>> 'class std::__1::basic_istream<char> &(basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *)'
| `-ParmVarDecl 0x7fd74d3f5768 <col:31, col:72> col:72 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *'
|-CXXMethodDecl 0x7fd74d3f59e0 <line:233:5, col:40> col:20 operator>> 'class std::__1::basic_istream<char> &(_Bool &)'
| `-ParmVarDecl 0x7fd74d3f5920 <col:31, col:37> col:37 __n '_Bool &'
|-CXXMethodDecl 0x7fd74d3f5b50 <line:234:5, col:41> col:20 operator>> 'class std::__1::basic_istream<char> &(short &)'
| `-ParmVarDecl 0x7fd74d3f5a90 <col:31, col:38> col:38 __n 'short &'
|-CXXMethodDecl 0x7fd74d3f5cc0 <line:235:5, col:50> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned short &)'
| `-ParmVarDecl 0x7fd74d3f5c00 <col:31, col:47> col:47 __n 'unsigned short &'
|-CXXMethodDecl 0x7fd74d3f5e30 <line:236:5, col:39> col:20 operator>> 'class std::__1::basic_istream<char> &(int &)'
| `-ParmVarDecl 0x7fd74d3f5d70 <col:31, col:36> col:36 __n 'int &'
|-CXXMethodDecl 0x7fd74d3f5fa0 <line:237:5, col:48> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned int &)'
| `-ParmVarDecl 0x7fd74d3f5ee0 <col:31, col:45> col:45 __n 'unsigned int &'
|-CXXMethodDecl 0x7fd74d3f6110 <line:238:5, col:40> col:20 operator>> 'class std::__1::basic_istream<char> &(long &)'
| `-ParmVarDecl 0x7fd74d3f6050 <col:31, col:37> col:37 __n 'long &'
|-CXXMethodDecl 0x7fd74d3f6280 <line:239:5, col:49> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned long &)'
| `-ParmVarDecl 0x7fd74d3f61c0 <col:31, col:46> col:46 __n 'unsigned long &'
|-CXXMethodDecl 0x7fd74d3f63f0 <line:240:5, col:45> col:20 operator>> 'class std::__1::basic_istream<char> &(long long &)'
| `-ParmVarDecl 0x7fd74d3f6330 <col:31, col:42> col:42 __n 'long long &'
|-CXXMethodDecl 0x7fd74d3f6560 <line:241:5, col:54> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned long long &)'
| `-ParmVarDecl 0x7fd74d3f64a0 <col:31, col:51> col:51 __n 'unsigned long long &'
|-CXXMethodDecl 0x7fd74d3f66d0 <line:242:5, col:41> col:20 operator>> 'class std::__1::basic_istream<char> &(float &)'
| `-ParmVarDecl 0x7fd74d3f6610 <col:31, col:38> col:38 __f 'float &'
|-CXXMethodDecl 0x7fd74d3f6840 <line:243:5, col:42> col:20 operator>> 'class std::__1::basic_istream<char> &(double &)'
| `-ParmVarDecl 0x7fd74d3f6780 <col:31, col:39> col:39 __f 'double &'
|-CXXMethodDecl 0x7fd74d3f69b0 <line:244:5, col:47> col:20 operator>> 'class std::__1::basic_istream<char> &(long double &)'
| `-ParmVarDecl 0x7fd74d3f68f0 <col:31, col:44> col:44 __f 'long double &'
|-CXXMethodDecl 0x7fd74d3f6b20 <line:245:5, col:41> col:20 operator>> 'class std::__1::basic_istream<char> &(void *&)'
| `-ParmVarDecl 0x7fd74d3f6a60 <col:31, col:38> col:38 __p 'void *&'
|-CXXMethodDecl 0x7fd74d3f6bd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:249:45> col:16 gcount 'std::__1::streamsize (void) const'
| `-AlwaysInlineAttr 0x7fd74d3f6c78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fd74d3f6d30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:250:5, col:18> col:14 get 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type (void)'
|-CXXMethodDecl 0x7fd74d3f6f20 <line:252:5, line:258:5> line:253:20 get 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type &)' inline
| |-ParmVarDecl 0x7fd74d3f6e18 <col:24, col:35> col:35 __c 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type &'
| `-AlwaysInlineAttr 0x7fd74d3f6fd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74d3f71d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:260:5, line:262:48> line:261:20 get 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7fd74d3f7058 <col:24, col:35> col:35 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fd74d3f70b8 <col:40, col:51> col:51 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7fd74d3f7288 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74d3f74e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:264:5, col:71> col:20 get 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7fd74d3f72e0 <col:24, col:35> col:35 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fd74d3f7340 <col:40, col:51> col:51 __n 'std::__1::streamsize':'long'
| `-ParmVarDecl 0x7fd74d3f73b0 <col:56, col:66> col:66 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7fd74d3f77a0 <line:266:5, line:268:44> line:267:20 get 'class std::__1::basic_istream<char> &(basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &)' inline
| |-ParmVarDecl 0x7fd74d3f7698 <col:24, col:65> col:65 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &'
| `-AlwaysInlineAttr 0x7fd74d3f7850 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74d3f7b20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:270:5, col:86> col:20 get 'class std::__1::basic_istream<char> &(basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7fd74d3f7998 <col:24, col:65> col:65 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &'
| `-ParmVarDecl 0x7fd74d3f7a08 <col:71, col:81> col:81 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7fd74d3f7cd8 <line:272:5, line:274:52> line:273:20 getline 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7fd74d3f7be8 <col:28, col:39> col:39 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fd74d3f7c48 <col:44, col:55> col:55 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7fd74d3f7d90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74d3f7f50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:276:5, col:75> col:20 getline 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7fd74d3f7de8 <col:28, col:39> col:39 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fd74d3f7e48 <col:44, col:55> col:55 __n 'std::__1::streamsize':'long'
| `-ParmVarDecl 0x7fd74d3f7eb8 <col:60, col:70> col:70 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7fd74d3f8200 <line:278:5, col:82> col:20 ignore 'class std::__1::basic_istream<char> &(std::__1::streamsize, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type)'
| |-ParmVarDecl 0x7fd74d3f8010 <col:27, col:44> col:38 __n 'std::__1::streamsize':'long'
| `-ParmVarDecl 0x7fd74d3f8080 <col:47, col:81> col:56 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7fd74d3f82d8 <line:279:5, col:19> col:14 peek 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type (void)'
|-CXXMethodDecl 0x7fd74d3f8480 <line:280:5, col:56> col:20 read 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7fd74d3f8390 <col:26, col:37> col:37 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fd74d3f83f0 <col:42, col:53> col:53 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fd74d3f8680 <line:281:5, col:55> col:16 readsome 'std::__1::streamsize (std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7fd74d3f8548 <col:25, col:36> col:36 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fd74d3f85a8 <col:41, col:52> col:52 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fd74d3f8850 <line:283:5, col:41> col:20 putback 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| `-ParmVarDecl 0x7fd74d3f8748 <col:28, col:38> col:38 __c 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7fd74d3f8950 <line:284:5, col:26> col:20 unget 'class std::__1::basic_istream<char> &(void)'
|-CXXMethodDecl 0x7fd74d3f89f8 <line:285:5, col:14> col:9 sync 'int (void)'
|-CXXMethodDecl 0x7fd74d3f8b10 <line:287:5, col:20> col:14 tellg 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::pos_type (void)'
|-CXXMethodDecl 0x7fd74d3f8cd0 <line:288:5, col:40> col:20 seekg 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::pos_type)'
| `-ParmVarDecl 0x7fd74d3f8bc8 <col:26, col:35> col:35 __pos 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
`-CXXMethodDecl 0x7fd74d3f8f20 <line:289:5, col:65> col:20 seekg 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir)'
  |-ParmVarDecl 0x7fd74d3f8db0 <col:26, col:35> col:35 __off 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::off_type':'long long'
  `-ParmVarDecl 0x7fd74d3f8e10 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_istream" = type { i32 (...)**, i64, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_istream.base" = type { i32 (...)**, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fd74b06b8b8 parent 0x7fd74b061e88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:1084:82> col:64 class basic_ostream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fd74d393f18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fd74d394150 prev 0x7fd74b06b8b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:151:1, col:28> col:28 implicit class basic_ostream
|-AccessSpecDecl 0x7fd74d3941e8 <line:154:1, col:7> col:1 public
|-TypedefDecl 0x7fd74d394220 <line:156:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fd74d393fe0 'char' sugar
|   |-TemplateTypeParmType 0x7fd74d363bc0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fd74d363b78 '_CharT'
|   `-BuiltinType 0x7fd74a833560 'char'
|-TypedefDecl 0x7fd74d394288 <line:157:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fd74d394020 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fd74d363c30 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fd74d363be8 '_Traits'
|   `-RecordType 0x7fd74b06ab60 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fd74ccc2b48 'char_traits'
|-TypedefDecl 0x7fd74d394390 <line:158:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fd74d394340 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fd74ccc4690 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fd74ccc2ea8 'int_type'
|     `-BuiltinType 0x7fd74a8335c0 'int'
|-TypedefDecl 0x7fd74d394460 <line:159:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fd74d394410 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fd74da3c1a0 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fd74ccc2f78 'pos_type'
|     `-TypedefType 0x7fd74ccba110 'std::__1::streampos' sugar
|       |-Typedef 0x7fd74b0709b8 'streampos'
|       `-TemplateSpecializationType 0x7fd74b070910 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fd74b0708f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fd74b070800 'fpos'
|-TypedefDecl 0x7fd74d394530 <line:160:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fd74d3944e0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fd74da3c290 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fd74ccc2f10 'off_type'
|     `-TypedefType 0x7fd74ccba080 'std::__1::streamoff' sugar
|       |-Typedef 0x7fd74b070d58 'streamoff'
|       `-BuiltinType 0x7fd74a833600 'long long'
|-CXXConstructorDecl 0x7fd74d3947b0 <line:163:5, line:165:25> line:164:14 basic_ostream 'void (basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7fd74d3946a8 <col:28, col:69> col:69 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fd74d394870 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXDestructorDecl 0x7fd74d3948e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:166:5, col:28> col:13 ~basic_ostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fd74d394998 <line:167:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fd74d394ae0 <line:169:5, line:170:40> col:5 basic_ostream 'void (class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7fd74d3949f8 <col:19, col:35> col:35 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7fd74d394ba0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fd74d394cf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:173:5, line:174:51> col:20 operator= 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7fd74d394c28 <col:30, col:46> col:46 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7fd74d394da0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fd74d394ec0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:176:5, line:178:55> line:177:10 swap 'void (class std::__1::basic_ostream<char> &)' inline
| |-ParmVarDecl 0x7fd74d394df8 <col:15, col:30> col:30 __rhs 'class std::__1::basic_ostream<char> &'
| `-AlwaysInlineAttr 0x7fd74d394f70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXConstructorDecl 0x7fd74d3950e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:181:5, col:65> col:5 basic_ostream 'void (const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7fd74d394ff8 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-CXXMethodDecl 0x7fd74d395270 <line:182:5, col:65> col:20 operator= 'class std::__1::basic_ostream<char> &(const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7fd74d3951b0 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-AccessSpecDecl 0x7fd74d395320 <line:187:1, col:7> col:1 public
|-CXXRecordDecl 0x7fd74d395348 <line:190:5, col:32> col:32 class sentry definition
| |-CXXRecordDecl 0x7fd74d398200 prev 0x7fd74d395348 <line:240:1, col:60> col:60 implicit class sentry
| |-FieldDecl 0x7fd74d398298 <line:242:5, col:10> col:10 __ok_ '_Bool'
| |-FieldDecl 0x7fd74d398438 <line:243:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXConstructorDecl 0x7fd74d3985c0 <line:245:5, col:25> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7fd74d3984b8 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x7fd74d398780 <line:246:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7fd74d3986b8 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x7fd74d398830 <line:248:1, col:7> col:1 public
| |-CXXConstructorDecl 0x7fd74d398a40 <line:249:5, col:57> col:14 sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| | `-ParmVarDecl 0x7fd74d398958 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXDestructorDecl 0x7fd74d398b30 <line:250:5, col:13> col:5 ~sentry 'void (void)' noexcept-unevaluated 0x7fd74d398b30
| `-CXXConversionDecl 0x7fd74d398be0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:254:45> col:9 operator bool '_Bool (void) const'
|   `-AlwaysInlineAttr 0x7fd74d398cb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74d395680 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:193:5, line:195:27> line:194:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &))' inline
| |-ParmVarDecl 0x7fd74d395580 <col:31, col:68> col:48 __pf 'class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &)'
| `-AlwaysInlineAttr 0x7fd74d395730 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74d395c10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:197:5, line:200:34> line:198:20 operator<< 'class std::__1::basic_ostream<char> &(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &))' inline
| |-ParmVarDecl 0x7fd74d395b10 <col:31, line:199:72> col:33 __pf 'basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &)'
| `-AlwaysInlineAttr 0x7fd74d395cc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74d395e10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:202:5, line:204:34> line:203:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))' inline
| |-ParmVarDecl 0x7fd74d395d08 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x7fd74d395ec0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74d395fd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:206:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(_Bool)'
| `-ParmVarDecl 0x7fd74d395f08 <col:31, col:36> col:36 __n '_Bool'
|-CXXMethodDecl 0x7fd74d396140 <line:207:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(short)'
| `-ParmVarDecl 0x7fd74d396080 <col:31, col:37> col:37 __n 'short'
|-CXXMethodDecl 0x7fd74d3962b0 <line:208:5, col:49> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned short)'
| `-ParmVarDecl 0x7fd74d3961f0 <col:31, col:46> col:46 __n 'unsigned short'
|-CXXMethodDecl 0x7fd74d396420 <line:209:5, col:38> col:20 operator<< 'class std::__1::basic_ostream<char> &(int)'
| `-ParmVarDecl 0x7fd74d396360 <col:31, col:35> col:35 __n 'int'
|-CXXMethodDecl 0x7fd74d396590 <line:210:5, col:47> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned int)'
| `-ParmVarDecl 0x7fd74d3964d0 <col:31, col:44> col:44 __n 'unsigned int'
|-CXXMethodDecl 0x7fd74d396700 <line:211:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(long)'
| `-ParmVarDecl 0x7fd74d396640 <col:31, col:36> col:36 __n 'long'
|-CXXMethodDecl 0x7fd74d396870 <line:212:5, col:48> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long)'
| `-ParmVarDecl 0x7fd74d3967b0 <col:31, col:45> col:45 __n 'unsigned long'
|-CXXMethodDecl 0x7fd74d3969e0 <line:213:5, col:44> col:20 operator<< 'class std::__1::basic_ostream<char> &(long long)'
| `-ParmVarDecl 0x7fd74d396920 <col:31, col:41> col:41 __n 'long long'
|-CXXMethodDecl 0x7fd74d396b50 <line:214:5, col:53> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long long)'
| `-ParmVarDecl 0x7fd74d396a90 <col:31, col:50> col:50 __n 'unsigned long long'
|-CXXMethodDecl 0x7fd74d396cc0 <line:215:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(float)'
| `-ParmVarDecl 0x7fd74d396c00 <col:31, col:37> col:37 __f 'float'
|-CXXMethodDecl 0x7fd74d396e30 <line:216:5, col:41> col:20 operator<< 'class std::__1::basic_ostream<char> &(double)'
| `-ParmVarDecl 0x7fd74d396d70 <col:31, col:38> col:38 __f 'double'
|-CXXMethodDecl 0x7fd74d396fa0 <line:217:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(long double)'
| `-ParmVarDecl 0x7fd74d396ee0 <col:31, col:43> col:43 __f 'long double'
|-CXXMethodDecl 0x7fd74d397110 <line:218:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(const void *)'
| `-ParmVarDecl 0x7fd74d397050 <col:31, col:43> col:43 __p 'const void *'
|-CXXMethodDecl 0x7fd74d3973c0 <line:219:5, col:76> col:20 operator<< 'class std::__1::basic_ostream<char> &(basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)'
| `-ParmVarDecl 0x7fd74d3972b8 <col:31, col:72> col:72 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
|-CXXMethodDecl 0x7fd74d397580 <line:222:5, col:37> col:20 put 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type)'
| `-ParmVarDecl 0x7fd74d397480 <col:24, col:34> col:34 __c 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7fd74d3977e0 <line:223:5, col:62> col:20 write 'class std::__1::basic_ostream<char> &(const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7fd74d397668 <col:26, col:43> col:43 __s 'const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fd74d3976c8 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fd74d3978f0 <line:224:5, col:26> col:20 flush 'class std::__1::basic_ostream<char> &(void)'
|-CXXMethodDecl 0x7fd74d397a40 <line:227:5, line:228:20> col:14 tellp 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type (void)' inline
| `-AlwaysInlineAttr 0x7fd74d397ae8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> Inherited always_inline
|-CXXMethodDecl 0x7fd74d397c40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:229:5, line:230:40> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type)' inline
| |-ParmVarDecl 0x7fd74d397b40 <col:26, col:35> col:35 __pos 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-AlwaysInlineAttr 0x7fd74d397cf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> Inherited always_inline
|-CXXMethodDecl 0x7fd74d397ee0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:231:5, line:232:65> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir)' inline
| |-ParmVarDecl 0x7fd74d397d70 <col:26, col:35> col:35 __off 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7fd74d397dd0 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-AlwaysInlineAttr 0x7fd74d397f98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> Inherited always_inline
|-AccessSpecDecl 0x7fd74d397fe0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:234:1, col:10> col:1 protected
`-CXXConstructorDecl 0x7fd74d398028 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:236:22> col:5 basic_ostream 'void (void)'
  `-AlwaysInlineAttr 0x7fd74d3980e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream.base" = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fd74b06bba8 parent 0x7fd74b061e88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1683:83> col:64 class basic_iostream definition
|-public 'basic_istream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_istream<char>'
|-public 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fd74d400058 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fd74d400388 prev 0x7fd74b06bba8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1442:1, col:28> col:28 implicit class basic_iostream
|-AccessSpecDecl 0x7fd74d400420 <line:1446:1, col:7> col:1 public
|-TypedefDecl 0x7fd74d400458 <line:1448:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fd74d400120 'char' sugar
|   |-TemplateTypeParmType 0x7fd74d3e7a10 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fd74d3e79d0 '_CharT'
|   `-BuiltinType 0x7fd74a833560 'char'
|-TypedefDecl 0x7fd74d4004c0 <line:1449:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fd74d400160 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fd74d3e7a80 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fd74d3e7a38 '_Traits'
|   `-RecordType 0x7fd74b06ab60 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fd74ccc2b48 'char_traits'
|-TypedefDecl 0x7fd74d4005d0 <line:1450:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fd74d400580 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fd74ccc4690 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fd74ccc2ea8 'int_type'
|     `-BuiltinType 0x7fd74a8335c0 'int'
|-TypedefDecl 0x7fd74d4006a0 <line:1451:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fd74d400650 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fd74da3c1a0 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fd74ccc2f78 'pos_type'
|     `-TypedefType 0x7fd74ccba110 'std::__1::streampos' sugar
|       |-Typedef 0x7fd74b0709b8 'streampos'
|       `-TemplateSpecializationType 0x7fd74b070910 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fd74b0708f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fd74b070800 'fpos'
|-TypedefDecl 0x7fd74d400770 <line:1452:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fd74d400720 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fd74da3c290 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fd74ccc2f10 'off_type'
|     `-TypedefType 0x7fd74ccba080 'std::__1::streamoff' sugar
|       |-Typedef 0x7fd74b070d58 'streamoff'
|       `-BuiltinType 0x7fd74a833600 'long long'
|-CXXConstructorDecl 0x7fd74d4009f0 <line:1455:5, line:1458:6> line:1456:14 basic_iostream 'void (basic_streambuf<std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7fd74d4008e8 <col:29, col:70> col:70 __sb 'basic_streambuf<std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fd74d400ad8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXDestructorDecl 0x7fd74d400b50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1460:5, col:29> col:13 used ~basic_iostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fd74d400c00 <line:1461:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fd74d400d50 <line:1463:5, line:1464:42> col:5 basic_iostream 'void (class std::__1::basic_iostream<char> &&)' inline
| |-ParmVarDecl 0x7fd74d400c68 <col:20, col:37> col:37 __rhs 'class std::__1::basic_iostream<char> &&'
| `-AlwaysInlineAttr 0x7fd74d400e10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fd74d400f60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1467:5, line:1468:53> col:21 operator= 'class std::__1::basic_iostream<char> &(class std::__1::basic_iostream<char> &&)' inline
| |-ParmVarDecl 0x7fd74d400e98 <col:31, col:48> col:48 __rhs 'class std::__1::basic_iostream<char> &&'
| `-AlwaysInlineAttr 0x7fd74d401010 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fd74d401130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1470:5, line:1472:59> line:1471:10 swap 'void (class std::__1::basic_iostream<char> &)' inline
| |-ParmVarDecl 0x7fd74d401068 <col:15, col:31> col:31 __rhs 'class std::__1::basic_iostream<char> &'
| `-AlwaysInlineAttr 0x7fd74d4011e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-AccessSpecDecl 0x7fd74d401228 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1473:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fd74d4012b8 <line:1683:64> col:64 implicit basic_iostream 'void (const class std::__1::basic_iostream<char> &)' inline default_delete noexcept-unevaluated 0x7fd74d4012b8
| `-ParmVarDecl 0x7fd74d4013e0 <col:64> col:64 'const class std::__1::basic_iostream<char> &'
`-CXXMethodDecl 0x7fd74d401448 <col:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::basic_iostream<char> &(const class std::__1::basic_iostream<char> &)' inline default_delete noexcept-unevaluated 0x7fd74d401448
  `-ParmVarDecl 0x7fd74d401560 <col:64> col:64 'const class std::__1::basic_iostream<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_iostream" = type { %"class.std::__1::basic_istream.base", %"class.std::__1::basic_ostream.base", %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_iostream.base" = type { %"class.std::__1::basic_istream.base", %"class.std::__1::basic_ostream.base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd74d98c298 prev 0x7fd74d98bae8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:83:1, line:145:1> line:83:24 referenced class locale definition
|-VisibilityAttr 0x7fd74d98c398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fd74d98c3e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:83:1, col:24> col:24 implicit referenced class locale
|-AccessSpecDecl 0x7fd74d98c478 <line:85:1, col:7> col:1 public
|-CXXRecordDecl 0x7fd74d98c4d0 <line:87:5, col:28> col:28 referenced class facet
| `-VisibilityAttr 0x7fd74d98c590 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fd74d98c608 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:88:5, col:28> col:28 referenced class id
| `-VisibilityAttr 0x7fd74d98c6c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-TypedefDecl 0x7fd74d98c720 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:90:5, col:17> col:17 referenced category 'int'
| `-BuiltinType 0x7fd74a8335c0 'int'
|-VarDecl 0x7fd74d98c7d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:3, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:93:20> col:9 none 'const std::__1::locale::category':'const int' static cinit
| |-IntegerLiteral 0x7fd74d98c938 <col:20> 'int' 0
| |-AvailabilityAttr 0x7fd74d98c830 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1176:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fd74d98c8d0 <line:1175:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fd74d98c9c0 <col:3, /usr/include/xlocale.h:45:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:94:9 referenced collate 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7fd74d98cb90 </usr/include/xlocale.h:45:27, col:34> 'int'
| | `-BinaryOperator 0x7fd74d98cb68 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7fd74d98cb28 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7fd74d98cb48 <col:33> 'int' 0
| |-AvailabilityAttr 0x7fd74d98ca20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1176:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fd74d98cac0 <line:1175:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fd74d98cc18 <col:3, /usr/include/xlocale.h:46:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:95:9 referenced ctype 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7fd74d98cde8 </usr/include/xlocale.h:46:25, col:32> 'int'
| | `-BinaryOperator 0x7fd74d98cdc0 <col:26, col:31> 'int' '<<'
| |   |-IntegerLiteral 0x7fd74d98cd80 <col:26> 'int' 1
| |   `-IntegerLiteral 0x7fd74d98cda0 <col:31> 'int' 1
| |-AvailabilityAttr 0x7fd74d98cc78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1176:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fd74d98cd18 <line:1175:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fd74d98ce70 <col:3, /usr/include/xlocale.h:48:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:96:9 referenced monetary 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7fd74d98d040 </usr/include/xlocale.h:48:27, col:34> 'int'
| | `-BinaryOperator 0x7fd74d98d018 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7fd74d98cfd8 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7fd74d98cff8 <col:33> 'int' 3
| |-AvailabilityAttr 0x7fd74d98ced0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1176:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fd74d98cf70 <line:1175:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fd74d98d0c8 <col:3, /usr/include/xlocale.h:49:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:97:9 referenced numeric 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7fd74d98d298 </usr/include/xlocale.h:49:27, col:34> 'int'
| | `-BinaryOperator 0x7fd74d98d270 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7fd74d98d230 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7fd74d98d250 <col:33> 'int' 4
| |-AvailabilityAttr 0x7fd74d98d128 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1176:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fd74d98d1c8 <line:1175:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fd74d98d320 <col:3, /usr/include/xlocale.h:50:31> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:98:9 referenced time 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7fd74d98d4f0 </usr/include/xlocale.h:50:24, col:31> 'int'
| | `-BinaryOperator 0x7fd74d98d4c8 <col:25, col:30> 'int' '<<'
| |   |-IntegerLiteral 0x7fd74d98d488 <col:25> 'int' 1
| |   `-IntegerLiteral 0x7fd74d98d4a8 <col:30> 'int' 5
| |-AvailabilityAttr 0x7fd74d98d380 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1176:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fd74d98d420 <line:1175:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fd74d98d578 <col:3, /usr/include/xlocale.h:47:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:99:9 referenced messages 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7fd74d98d748 </usr/include/xlocale.h:47:27, col:34> 'int'
| | `-BinaryOperator 0x7fd74d98d720 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7fd74d98d6e0 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7fd74d98d700 <col:33> 'int' 2
| |-AvailabilityAttr 0x7fd74d98d5d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1176:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fd74d98d678 <line:1175:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fd74d98d7d0 <col:3, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:100:61> col:9 all 'const std::__1::locale::category':'const int' static cinit
| |-BinaryOperator 0x7fd74d98db58 <col:15, col:61> 'int' '|'
| | |-BinaryOperator 0x7fd74d98daf0 <col:15, col:54> 'int' '|'
| | | |-BinaryOperator 0x7fd74d98da88 <col:15, col:44> 'int' '|'
| | | | |-BinaryOperator 0x7fd74d98da20 <col:15, col:33> 'int' '|'
| | | | | |-BinaryOperator 0x7fd74d98d9b8 <col:15, col:25> 'int' '|'
| | | | | | |-ImplicitCastExpr 0x7fd74d98d988 <col:15> 'std::__1::locale::category':'int' <LValueToRValue>
| | | | | | | `-DeclRefExpr 0x7fd74d98d938 <col:15> 'const std::__1::locale::category':'const int' lvalue Var 0x7fd74d98c9c0 'collate' 'const std::__1::locale::category':'const int'
| | | | | | `-ImplicitCastExpr 0x7fd74d98d9a0 <col:25> 'std::__1::locale::category':'int' <LValueToRValue>
| | | | | |   `-DeclRefExpr 0x7fd74d98d960 <col:25> 'const std::__1::locale::category':'const int' lvalue Var 0x7fd74d98cc18 'ctype' 'const std::__1::locale::category':'const int'
| | | | | `-ImplicitCastExpr 0x7fd74d98da08 <col:33> 'std::__1::locale::category':'int' <LValueToRValue>
| | | | |   `-DeclRefExpr 0x7fd74d98d9e0 <col:33> 'const std::__1::locale::category':'const int' lvalue Var 0x7fd74d98ce70 'monetary' 'const std::__1::locale::category':'const int'
| | | | `-ImplicitCastExpr 0x7fd74d98da70 <col:44> 'std::__1::locale::category':'int' <LValueToRValue>
| | | |   `-DeclRefExpr 0x7fd74d98da48 <col:44> 'const std::__1::locale::category':'const int' lvalue Var 0x7fd74d98d0c8 'numeric' 'const std::__1::locale::category':'const int'
| | | `-ImplicitCastExpr 0x7fd74d98dad8 <col:54> 'std::__1::locale::category':'int' <LValueToRValue>
| | |   `-DeclRefExpr 0x7fd74d98dab0 <col:54> 'const std::__1::locale::category':'const int' lvalue Var 0x7fd74d98d320 'time' 'const std::__1::locale::category':'const int'
| | `-ImplicitCastExpr 0x7fd74d98db40 <col:61> 'std::__1::locale::category':'int' <LValueToRValue>
| |   `-DeclRefExpr 0x7fd74d98db18 <col:61> 'const std::__1::locale::category':'const int' lvalue Var 0x7fd74d98d578 'messages' 'const std::__1::locale::category':'const int'
| |-AvailabilityAttr 0x7fd74d98d830 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1176:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fd74d98d8d0 <line:1175:18, col:60> macos 10.9 0 0 "" Strict ""
|-CXXConstructorDecl 0x7fd74d98dc90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:103:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:103:5 locale 'void (void) noexcept'
|-CXXConstructorDecl 0x7fd74d98de58 <line:104:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:104:5 referenced locale 'void (const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7fd74d98dd48 <col:12, col:24> col:25 'const class std::__1::locale &'
|-CXXConstructorDecl 0x7fd74d98dfa8 <line:105:5, col:32> col:14 locale 'void (const char *)'
| `-ParmVarDecl 0x7fd74d98df20 <col:21, col:31> col:32 'const char *'
|-CXXConstructorDecl 0x7fd74d98e0f0 <line:106:5, col:34> col:14 locale 'void (const std::__1::string &)'
| `-ParmVarDecl 0x7fd74d98e068 <col:21, col:33> col:34 'const std::__1::string &'
|-CXXConstructorDecl 0x7fd74d98e3d0 <line:107:5, col:48> col:5 locale 'void (const class std::__1::locale &, const char *, std::__1::locale::category)'
| |-ParmVarDecl 0x7fd74d98e1b0 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7fd74d98e228 <col:27, col:37> col:38 'const char *'
| `-ParmVarDecl 0x7fd74d98e298 <col:40> col:48 'std::__1::locale::category':'int'
|-CXXConstructorDecl 0x7fd74d98e6b0 <line:108:5, col:50> col:5 locale 'void (const class std::__1::locale &, const std::__1::string &, std::__1::locale::category)'
| |-ParmVarDecl 0x7fd74d98e4a0 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7fd74d98e510 <col:27, col:39> col:40 'const std::__1::string &'
| `-ParmVarDecl 0x7fd74d98e580 <col:42> col:50 'std::__1::locale::category':'int'
|-FunctionTemplateDecl 0x7fd74d98ea88 <line:109:5, line:110:64> col:35 locale
| |-TemplateTypeParmDecl 0x7fd74d98e770 <line:109:15, col:21> col:21 referenced class depth 0 index 0 _Facet
| `-CXXConstructorDecl 0x7fd74d98e9e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:110:64> col:35 locale 'void (const class std::__1::locale &, _Facet *)'
|   |-ParmVarDecl 0x7fd74d98e830 <col:42, col:54> col:55 'const class std::__1::locale &'
|   |-ParmVarDecl 0x7fd74d98e8c8 <col:57, col:63> col:64 '_Facet *'
|   |-AlwaysInlineAttr 0x7fd74d98eae8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|   `-VisibilityAttr 0x7fd74d98eb30 <col:51, col:74> Hidden
|-CXXConstructorDecl 0x7fd74d98ed60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:111:5, col:50> col:5 locale 'void (const class std::__1::locale &, const class std::__1::locale &, std::__1::locale::category)'
| |-ParmVarDecl 0x7fd74d98eb50 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7fd74d98ebc0 <col:27, col:39> col:40 'const class std::__1::locale &'
| `-ParmVarDecl 0x7fd74d98ec30 <col:42> col:50 'std::__1::locale::category':'int'
|-CXXDestructorDecl 0x7fd74d98ee70 <line:113:5, col:13> col:5 referenced ~locale 'void (void) noexcept'
|-CXXMethodDecl 0x7fd74d98f028 <line:115:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:115:19 operator= 'const class std::__1::locale &(const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7fd74d98ef20 <col:29, col:41> col:42 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7fd74d98f318 <line:117:5, line:119:37> col:14 combine
| |-TemplateTypeParmDecl 0x7fd74d98f0c8 <line:117:15, col:21> col:21 class depth 0 index 0 _Facet
| `-CXXMethodDecl 0x7fd74d98f280 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:119:37> col:14 combine 'class std::__1::locale (const class std::__1::locale &) const' inline
|   |-ParmVarDecl 0x7fd74d98f190 <col:22, col:34> col:35 'const class std::__1::locale &'
|   `-VisibilityAttr 0x7fd74d98f370 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:644:40, col:63> Hidden
|-CXXMethodDecl 0x7fd74d98f3d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:122:5, col:19> col:12 name 'std::__1::string (void) const'
|-CXXMethodDecl 0x7fd74d98f540 <line:123:5, col:36> col:10 used operator== '_Bool (const class std::__1::locale &) const'
| `-ParmVarDecl 0x7fd74d98f480 <col:21, col:33> col:34 'const class std::__1::locale &'
|-CXXMethodDecl 0x7fd74d98f678 <line:124:5, col:70> col:10 operator!= '_Bool (const class std::__1::locale &) const'
| |-ParmVarDecl 0x7fd74d98f5f0 <col:21, col:35> col:35 used __y 'const class std::__1::locale &'
| `-CompoundStmt 0x7fd74d992390 <col:46, col:70>
|   `-ReturnStmt 0x7fd74d992378 <col:47, col:68>
|     `-UnaryOperator 0x7fd74d992358 <col:54, col:68> '_Bool' prefix '!'
|       `-ParenExpr 0x7fd74d992338 <col:55, col:68> '_Bool'
|         `-CXXOperatorCallExpr 0x7fd74d9922f0 <col:56, col:65> '_Bool'
|           |-ImplicitCastExpr 0x7fd74d9922d8 <col:62> '_Bool (*)(const class std::__1::locale &) const' <FunctionToPointerDecay>
|           | `-DeclRefExpr 0x7fd74d992280 <col:62> '_Bool (const class std::__1::locale &) const' lvalue CXXMethod 0x7fd74d98f540 'operator==' '_Bool (const class std::__1::locale &) const'
|           |-UnaryOperator 0x7fd74d990fb0 <col:56, col:57> 'const class std::__1::locale' lvalue prefix '*'
|           | `-CXXThisExpr 0x7fd74d990f98 <col:57> 'const class std::__1::locale *' this
|           `-DeclRefExpr 0x7fd74d990fd0 <col:65> 'const class std::__1::locale' lvalue ParmVar 0x7fd74d98f5f0 '__y' 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7fd74d98fe08 <line:125:5, line:128:73> line:127:12 operator()
| |-TemplateTypeParmDecl 0x7fd74d98f718 <line:125:15, col:21> col:21 referenced class depth 0 index 0 _CharT
| |-TemplateTypeParmDecl 0x7fd74d98f788 <col:29, col:35> col:35 referenced class depth 0 index 1 _Traits
| |-TemplateTypeParmDecl 0x7fd74d98f7f8 <col:44, col:50> col:50 referenced class depth 0 index 2 _Allocator
| `-CXXMethodDecl 0x7fd74d98fd70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:128:73> line:127:12 operator() '_Bool (const basic_string<_CharT, _Traits, _Allocator> &, const basic_string<_CharT, _Traits, _Allocator> &) const' inline
|   |-ParmVarDecl 0x7fd74d98fa60 <col:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   |-ParmVarDecl 0x7fd74d98fc60 <line:128:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   `-VisibilityAttr 0x7fd74d98fe68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:644:40, col:63> Hidden
|-CXXMethodDecl 0x7fd74d98ff80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:131:5, col:39> col:19 global 'class std::__1::locale (const class std::__1::locale &)' static
| `-ParmVarDecl 0x7fd74d98fec0 <col:26, col:38> col:39 'const class std::__1::locale &'
|-CXXMethodDecl 0x7fd74d990070 <line:132:5, col:34> col:26 classic 'const class std::__1::locale &(void)' static
|-AccessSpecDecl 0x7fd74d990108 <line:134:1, col:8> col:1 private
|-CXXRecordDecl 0x7fd74d990130 <line:135:5, col:11> col:11 referenced class __imp
|-FieldDecl 0x7fd74d990228 <line:136:5, col:12> col:12 __locale_ 'class std::__1::locale::__imp *'
|-CXXMethodDecl 0x7fd74d990470 <line:138:5, col:52> col:10 referenced __install_ctor 'void (const class std::__1::locale &, class std::__1::locale::facet *, long)'
| |-ParmVarDecl 0x7fd74d990280 <col:25, col:37> col:38 'const class std::__1::locale &'
| |-ParmVarDecl 0x7fd74d990318 <col:40, col:45> col:46 'class std::__1::locale::facet *'
| `-ParmVarDecl 0x7fd74d990390 <col:48> col:52 'long'
|-CXXMethodDecl 0x7fd74d9905a0 <line:139:5, col:29> col:20 __global 'class std::__1::locale &(void)' static
|-CXXMethodDecl 0x7fd74d990740 <line:140:5, col:25> col:10 referenced has_facet '_Bool (class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7fd74d990678 <col:20, col:22> col:23 'class std::__1::locale::id &'
|-CXXMethodDecl 0x7fd74d9908e0 <line:141:5, col:33> col:18 referenced use_facet 'const class std::__1::locale::facet *(class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7fd74d9907f0 <col:28, col:30> col:31 'class std::__1::locale::id &'
|-FriendDecl 0x7fd74d990c08 <line:143:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:143:41
| `-FunctionTemplateDecl 0x7fd74d990b48 parent 0x7fd74d98ba50 prev 0x7fd74d98be80 <col:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:143:41 has_facet
|   |-TemplateTypeParmDecl 0x7fd74d990980 <col:15, col:21> col:21 class depth 0 index 0 _Facet
|   `-FunctionDecl 0x7fd74d990aa0 parent 0x7fd74d98ba50 prev 0x7fd74d98bde8 <col:29, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:143:41 has_facet '_Bool (const class std::__1::locale &) noexcept'
|     |-ParmVarDecl 0x7fd74d990a10 <col:51, col:63> col:64 'const class std::__1::locale &'
|     |-AlwaysInlineAttr 0x7fd74d990be8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|     `-VisibilityAttr 0x7fd74d990bf8 <col:51, col:74> Inherited Hidden
`-FriendDecl 0x7fd74d990f28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:144:5, col:73> col:50
  `-FunctionTemplateDecl 0x7fd74d990e68 parent 0x7fd74d98ba50 prev 0x7fd74d98c1b8 <col:5, col:73> col:50 use_facet
    |-TemplateTypeParmDecl 0x7fd74d990c40 <col:15, col:21> col:21 referenced class depth 0 index 0 _Facet
    `-FunctionDecl 0x7fd74d990dc0 parent 0x7fd74d98ba50 prev 0x7fd74d98c120 <col:29, col:73> col:50 use_facet 'const _Facet &(const class std::__1::locale &)'
      |-ParmVarDecl 0x7fd74d990cd0 <col:60, col:72> col:73 'const class std::__1::locale &'
      |-AlwaysInlineAttr 0x7fd74d990f08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
      `-VisibilityAttr 0x7fd74d990f18 <col:51, col:74> Inherited Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  NonVirtualBaseLLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fd74b06b2d8 parent 0x7fd74b061e88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:483:84> col:64 class basic_streambuf definition
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fd74da3bdc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fd74da3be88 prev 0x7fd74b06b2d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:125:1, col:28> col:28 implicit class basic_streambuf
|-AccessSpecDecl 0x7fd74da3bf20 <line:127:1, col:7> col:1 public
|-TypedefDecl 0x7fd74da3bf88 <line:129:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fd74da3bf50 'char' sugar
|   |-TemplateTypeParmType 0x7fd74da216d0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fd74da21688 '_CharT'
|   `-BuiltinType 0x7fd74a833560 'char'
|-TypedefDecl 0x7fd74da3c018 <line:130:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fd74da3bfe0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fd74da21740 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fd74da216f8 '_Traits'
|   `-RecordType 0x7fd74b06ab60 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fd74ccc2b48 'char_traits'
|-TypedefDecl 0x7fd74da3c120 <line:131:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fd74da3c0d0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fd74ccc4690 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fd74ccc2ea8 'int_type'
|     `-BuiltinType 0x7fd74a8335c0 'int'
|-TypedefDecl 0x7fd74da3c210 <line:132:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fd74da3c1c0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fd74da3c1a0 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fd74ccc2f78 'pos_type'
|     `-TypedefType 0x7fd74ccba110 'std::__1::streampos' sugar
|       |-Typedef 0x7fd74b0709b8 'streampos'
|       `-TemplateSpecializationType 0x7fd74b070910 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fd74b0708f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fd74b070800 'fpos'
|-TypedefDecl 0x7fd74da3c300 <line:133:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fd74da3c2b0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fd74da3c290 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fd74ccc2f10 'off_type'
|     `-TypedefType 0x7fd74ccba080 'std::__1::streamoff' sugar
|       |-Typedef 0x7fd74b070d58 'streamoff'
|       `-BuiltinType 0x7fd74a833600 'long long'
|-CXXDestructorDecl 0x7fd74da3c388 <line:135:5, col:30> col:13 ~basic_streambuf 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7fd74da3c4c0 <line:138:5, line:144:5> line:139:12 pubimbue 'class std::__1::locale (const class std::__1::locale &)' inline
| |-ParmVarDecl 0x7fd74da3c438 <col:21, col:35> col:35 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7fd74da3c598 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74da3c5e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:146:5, line:147:44> col:12 getloc 'class std::__1::locale (void) const' inline
| `-AlwaysInlineAttr 0x7fd74da3c688 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74da3c8a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:150:5, line:152:32> line:151:22 pubsetbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7fd74da3c728 <col:32, col:43> col:43 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fd74da3c788 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7fd74da3c958 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74da43200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:154:5, line:157:46> line:155:14 referenced pubseekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7fd74da3c9f0 <col:25, col:34> col:34 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7fd74da3ca50 <col:41, col:59> col:59 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| |-ParmVarDecl 0x7fd74da3cab0 <line:156:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7fd74da432c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74da43490 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:159:5, line:162:38> line:160:14 referenced pubseekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7fd74da43318 <col:25, col:34> col:34 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| |-ParmVarDecl 0x7fd74da43378 <line:161:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7fd74da43548 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74da43590 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:164:5, line:165:36> col:9 referenced pubsync 'int (void)' inline
| `-AlwaysInlineAttr 0x7fd74da43638 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74da43680 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:169:5, line:174:5> line:170:16 in_avail 'std::__1::streamsize (void)' inline
| `-AlwaysInlineAttr 0x7fd74da43728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74da437e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:176:5, line:181:5> line:177:14 snextc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7fd74da43888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74da438f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:183:5, line:188:5> line:184:14 sbumpc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7fd74da43998 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74da43a00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:190:5, line:195:5> line:191:14 sgetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7fd74da43aa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74da43c70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:197:5, line:199:32> line:198:16 referenced sgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7fd74da43b00 <col:22, col:33> col:33 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fd74da43b60 <col:38, col:49> col:49 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7fd74da43d28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74da43e40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:202:5, line:207:5> line:203:14 sputbackc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7fd74da43d80 <col:24, col:34> col:34 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7fd74da43ef0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74da43f58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:209:5, line:214:5> line:210:14 sungetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7fd74da44000 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74da440e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:217:5, line:223:5> line:218:14 sputc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7fd74da44058 <col:20, col:30> col:30 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7fd74da44190 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74da44390 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:225:5, line:227:32> line:226:16 referenced sputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7fd74da44218 <col:22, col:39> col:39 __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fd74da44278 <col:44, col:55> col:55 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7fd74da44448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-AccessSpecDecl 0x7fd74da44490 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:229:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fd74da444f8 <line:230:5, col:21> col:5 basic_streambuf 'void (void)'
|-CXXConstructorDecl 0x7fd74da446d0 <line:231:5, col:49> col:5 basic_streambuf 'void (const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7fd74da445e8 <col:21, col:44> col:44 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7fd74da44890 <line:232:5, col:60> col:22 operator= 'class std::__1::basic_streambuf<char> &(const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7fd74da447c8 <col:32, col:55> col:55 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7fd74da44a10 <line:233:5, col:37> col:10 swap 'void (class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7fd74da44950 <col:15, col:32> col:32 __rhs 'class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7fd74da44b40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:236:68> col:38 eback 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fd74da44be8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74da44c50 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:237:68> col:38 gptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fd74da44cf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74da44d60 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:238:68> col:38 egptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fd74da44e08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74da44ed8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:240:5, line:241:43> col:10 gbump 'void (int)' inline
| |-ParmVarDecl 0x7fd74da44e50 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7fd74da44f88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74da451f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:243:5, line:248:5> line:244:10 setg 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7fd74da44fe0 <col:15, col:26> col:26 __gbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fd74da45050 <col:34, col:45> col:45 __gnext 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fd74da450c0 <col:54, col:65> col:65 __gend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7fd74da452b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74da45318 <line:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:251:68> col:38 pbase 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fd74da453c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74da45428 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:252:68> col:38 pptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fd74da454d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74da45538 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:253:68> col:38 epptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fd74da455e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fd74da456b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:255:5, line:256:43> col:10 pbump 'void (int)' inline
| |-ParmVarDecl 0x7fd74da45628 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7fd74da45760 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74da45940 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:258:5, line:262:5> line:259:10 setp 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7fd74da457b8 <col:15, col:26> col:26 __pbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fd74da45828 <col:34, col:45> col:45 __pend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7fd74da459f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fd74da45ac8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:266:5, col:43> col:18 imbue 'void (const class std::__1::locale &)' virtual
| `-ParmVarDecl 0x7fd74da45a40 <col:24, col:38> col:38 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7fd74da45c78 <line:269:5, col:67> col:30 setbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7fd74da45b88 <col:37, col:48> col:48 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fd74da45be8 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fd74da45e98 <line:270:5, line:271:87> line:270:22 seekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7fd74da45d40 <col:30, col:39> col:39 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7fd74da45da0 <col:46, col:64> col:64 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-ParmVarDecl 0x7fd74da45e00 <line:271:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fd74da46058 <line:272:5, line:273:87> line:272:22 seekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7fd74da45f68 <col:30, col:39> col:39 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ParmVarDecl 0x7fd74da45fc8 <line:273:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fd74da46110 <line:274:5, col:22> col:17 sync 'int (void)' virtual
|-CXXMethodDecl 0x7fd74da461b8 <line:277:5, col:34> col:24 showmanyc 'std::__1::streamsize (void)' virtual
|-CXXMethodDecl 0x7fd74da46360 <line:278:5, col:61> col:24 xsgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7fd74da46270 <col:31, col:42> col:42 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fd74da462d0 <col:47, col:58> col:58 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fd74da46438 <line:279:5, col:32> col:22 underflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7fd74da46500 <line:280:5, col:28> col:22 uflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7fd74da46680 <line:283:5, col:65> col:22 pbackfail 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7fd74da465b8 <col:32, col:64> col:41 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7fd74da46830 <line:286:5, col:67> col:24 xsputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7fd74da46740 <col:31, col:48> col:48 __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fd74da467a0 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fd74da46980 <line:287:5, col:64> col:22 overflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7fd74da468f8 <col:31, col:63> col:40 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-AccessSpecDecl 0x7fd74da46a30 <line:289:1, col:8> col:1 private
|-FieldDecl 0x7fd74da46a58 <line:290:5, col:12> col:12 __loc_ 'class std::__1::locale'
|-FieldDecl 0x7fd74da46ab0 <line:291:5, col:16> col:16 __binp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fd74da46b08 <line:292:5, col:16> col:16 __ninp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fd74da46b60 <line:293:5, col:16> col:16 __einp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fd74da46bb8 <line:294:5, col:16> col:16 __bout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fd74da46c10 <line:295:5, col:16> col:16 __nout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
`-FieldDecl 0x7fd74da46c68 <line:296:5, col:16> col:16 __eout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct __sbuf
         0 |   unsigned char * _base
         8 |   int _size
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __sFILE
         0 |   unsigned char * _p
         8 |   int _r
        12 |   int _w
        16 |   short _flags
        18 |   short _file
        24 |   struct __sbuf _bf
        24 |     unsigned char * _base
        32 |     int _size
        40 |   int _lbfsize
        48 |   void * _cookie
        56 |   int (* _Nullable)(void *) _close
        64 |   int (* _Nullable)(void *, char *, int) _read
        72 |   fpos_t (* _Nullable)(void *, fpos_t, int) _seek
        80 |   int (* _Nullable)(void *, const char *, int) _write
        88 |   struct __sbuf _ub
        88 |     unsigned char * _base
        96 |     int _size
       104 |   struct __sFILEX * _extra
       112 |   int _ur
       116 |   unsigned char [3] _ubuf
       119 |   unsigned char [1] _nbuf
       120 |   struct __sbuf _lb
       120 |     unsigned char * _base
       128 |     int _size
       136 |   int _blksize
       144 |   fpos_t _offset
           | [sizeof=152, dsize=152, align=8,
           |  nvsize=152, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd74a91eb58 </usr/include/stdio.h:88:1, line:91:1> line:88:8 struct __sbuf definition
|-CXXRecordDecl 0x7fd74a91ec78 <col:1, col:8> col:8 implicit struct __sbuf
|-FieldDecl 0x7fd74a91ed50 <line:89:2, col:17> col:17 _base 'unsigned char *'
`-FieldDecl 0x7fd74a91edb0 <line:90:2, col:7> col:7 _size 'int'

Layout: <CGRecordLayout
  LLVMType:%struct.__sbuf = type { i8*, i32 }
  NonVirtualBaseLLVMType:%struct.__sbuf = type { i8*, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd74a91eed0 </usr/include/stdio.h:122:9, line:153:1> line:122:16 struct __sFILE definition
|-CXXRecordDecl 0x7fd74a91eff8 <col:9, col:16> col:16 implicit struct __sFILE
|-FieldDecl 0x7fd74a91f0a8 <line:123:2, col:17> col:17 referenced _p 'unsigned char *'
|-FieldDecl 0x7fd74a91f108 <line:124:2, col:6> col:6 _r 'int'
|-FieldDecl 0x7fd74a91f168 <line:125:2, col:6> col:6 referenced _w 'int'
|-FieldDecl 0x7fd74a91f1c8 <line:126:2, col:8> col:8 _flags 'short'
|-FieldDecl 0x7fd74a91f228 <line:127:2, col:8> col:8 _file 'short'
|-FieldDecl 0x7fd74a91f2c0 <line:128:2, col:16> col:16 _bf 'struct __sbuf':'struct __sbuf'
|-FieldDecl 0x7fd74a91f320 <line:129:2, col:6> col:6 referenced _lbfsize 'int'
|-FieldDecl 0x7fd74a91f380 <line:132:2, col:8> col:8 _cookie 'void *'
|-FieldDecl 0x7fd74a921200 <line:133:2, col:19> col:19 _close 'int (* _Nullable)(void *)':'int (*)(void *)'
|-FieldDecl 0x7fd74a921528 <line:134:2, col:19> col:19 _read 'int (* _Nullable)(void *, char *, int)':'int (*)(void *, char *, int)'
|-FieldDecl 0x7fd74a9218b0 <line:135:2, col:22> col:22 _seek 'fpos_t (* _Nullable)(void *, fpos_t, int)':'fpos_t (*)(void *, fpos_t, int)'
|-FieldDecl 0x7fd74a921bd8 <line:136:2, col:19> col:19 _write 'int (* _Nullable)(void *, const char *, int)':'int (*)(void *, const char *, int)'
|-FieldDecl 0x7fd74a921c40 <line:139:2, col:16> col:16 _ub 'struct __sbuf':'struct __sbuf'
|-FieldDecl 0x7fd74a921d40 <line:140:2, col:19> col:19 _extra 'struct __sFILEX *'
|-FieldDecl 0x7fd74a921da0 <line:141:2, col:6> col:6 _ur 'int'
|-FieldDecl 0x7fd74a921e70 <line:144:2, col:23> col:16 _ubuf 'unsigned char [3]'
|-FieldDecl 0x7fd74a921f40 <line:145:2, col:23> col:16 _nbuf 'unsigned char [1]'
|-FieldDecl 0x7fd74a921fa8 <line:148:2, col:16> col:16 _lb 'struct __sbuf':'struct __sbuf'
|-FieldDecl 0x7fd74a922008 <line:151:2, col:6> col:6 _blksize 'int'
`-FieldDecl 0x7fd74a922060 <line:152:2, col:9> col:9 _offset 'fpos_t':'long long'

Layout: <CGRecordLayout
  LLVMType:%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
  NonVirtualBaseLLVMType:%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::__shared_count
         0 |   (__shared_count vtable pointer)
         8 |   long __shared_owners_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd74caf3180 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3410:1, line:3448:1> line:3410:24 referenced class __shared_count definition
|-VisibilityAttr 0x7fd74caf32a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fd74caf32f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3410:1, col:24> col:24 implicit referenced class __shared_count
|-CXXConstructorDecl 0x7fd74caf34e0 <line:3412:5, col:41> col:5 __shared_count 'void (const class std::__1::__shared_count &)'
| `-ParmVarDecl 0x7fd74caf33c8 <col:20, col:40> col:41 'const class std::__1::__shared_count &'
|-CXXMethodDecl 0x7fd74caf3690 <line:3413:5, col:52> col:21 operator= 'class std::__1::__shared_count &(const class std::__1::__shared_count &)'
| `-ParmVarDecl 0x7fd74caf35a0 <col:31, col:51> col:52 'const class std::__1::__shared_count &'
|-AccessSpecDecl 0x7fd74caf3730 <line:3415:1, col:10> col:1 protected
|-FieldDecl 0x7fd74caf3770 <line:3416:5, col:10> col:10 referenced __shared_owners_ 'long'
|-CXXDestructorDecl 0x7fd74caf3808 <line:3417:5, col:29> col:13 used ~__shared_count 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fd74caf38a8 <line:3418:1, col:8> col:1 private
|-CXXMethodDecl 0x7fd74caf38f8 <line:3419:5, col:49> col:18 referenced __on_zero_shared 'void (void) noexcept' virtual pure
|-AccessSpecDecl 0x7fd74caf3990 <line:3421:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fd74caf3ac8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3424:37> line:3423:14 used __shared_count 'void (long) noexcept'
| |-ParmVarDecl 0x7fd74caf3a00 <col:29, col:43> col:34 used __refs 'long' cinit
| | `-ImplicitCastExpr 0x7fd74caf4098 <col:43> 'long' <IntegralCast>
| |   `-IntegerLiteral 0x7fd74caf4078 <col:43> 'int' 0
| |-CXXCtorInitializer Field 0x7fd74caf3770 '__shared_owners_' 'long'
| | `-ImplicitCastExpr 0x7fd74caf4108 <line:3424:28> 'long' <LValueToRValue>
| |   `-DeclRefExpr 0x7fd74caf40b0 <col:28> 'long' lvalue ParmVar 0x7fd74caf3a00 '__refs' 'long'
| |-CompoundStmt 0x7fd74caf4150 <col:36, col:37>
| |-AlwaysInlineAttr 0x7fd74caf3b78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74caf3bc0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74caf3c28 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3434:5> line:3432:10 used __add_shared 'void (void) noexcept'
| |-CompoundStmt 0x7fd74caf46a0 <col:35, line:3434:5>
| | `-CallExpr 0x7fd74caf4670 <line:3433:7, col:58> 'long':'long'
| |   |-ImplicitCastExpr 0x7fd74caf4658 <col:7> 'long (*)(long &) noexcept' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7fd74caf45c8 <col:7> 'long (long &) noexcept' lvalue Function 0x7fd74caf4488 '__libcpp_atomic_refcount_increment' 'long (long &) noexcept' (FunctionTemplate 0x7fd74caf18d0 '__libcpp_atomic_refcount_increment')
| |   `-MemberExpr 0x7fd74caf41d8 <col:42> 'long' lvalue ->__shared_owners_ 0x7fd74caf3770
| |     `-CXXThisExpr 0x7fd74caf41c0 <col:42> 'class std::__1::__shared_count *' this
| |-AlwaysInlineAttr 0x7fd74caf3cc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74caf3d08 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd74caf3d70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3442:5> line:3436:10 used __release_shared '_Bool (void) noexcept'
| |-CompoundStmt 0x7fd74caf4d08 <col:39, line:3442:5>
| | |-IfStmt 0x7fd74caf4ca0 <line:3437:7, line:3440:7>
| | | |-<<<NULL>>>
| | | |-<<<NULL>>>
| | | |-BinaryOperator 0x7fd74caf4ba8 <line:3437:11, col:68> '_Bool' '=='
| | | | |-CallExpr 0x7fd74caf4b20 <col:11, col:62> 'long':'long'
| | | | | |-ImplicitCastExpr 0x7fd74caf4b08 <col:11> 'long (*)(long &) noexcept' <FunctionToPointerDecay>
| | | | | | `-DeclRefExpr 0x7fd74caf4aa8 <col:11> 'long (long &) noexcept' lvalue Function 0x7fd74caf4968 '__libcpp_atomic_refcount_decrement' 'long (long &) noexcept' (FunctionTemplate 0x7fd74caf1de0 '__libcpp_atomic_refcount_decrement')
| | | | | `-MemberExpr 0x7fd74caf4730 <col:46> 'long' lvalue ->__shared_owners_ 0x7fd74caf3770
| | | | |   `-CXXThisExpr 0x7fd74caf4718 <col:46> 'class std::__1::__shared_count *' this
| | | | `-ImplicitCastExpr 0x7fd74caf4b90 <col:67, col:68> 'long' <IntegralCast>
| | | |   `-UnaryOperator 0x7fd74caf4b70 <col:67, col:68> 'int' prefix '-'
| | | |     `-IntegerLiteral 0x7fd74caf4b50 <col:68> 'int' 1
| | | |-CompoundStmt 0x7fd74caf4c78 <col:71, line:3440:7>
| | | | |-CXXMemberCallExpr 0x7fd74caf4c20 <line:3438:9, col:26> 'void'
| | | | | `-MemberExpr 0x7fd74caf4be8 <col:9> '<bound member function type>' ->__on_zero_shared 0x7fd74caf38f8
| | | | |   `-CXXThisExpr 0x7fd74caf4bd0 <col:9> 'class std::__1::__shared_count *' this
| | | | `-ReturnStmt 0x7fd74caf4c60 <line:3439:9, col:16>
| | | |   `-CXXBoolLiteralExpr 0x7fd74caf4c48 <col:16> '_Bool' true
| | | `-<<<NULL>>>
| | `-ReturnStmt 0x7fd74caf4cf0 <line:3441:7, col:14>
| |   `-CXXBoolLiteralExpr 0x7fd74caf4cd8 <col:14> '_Bool' false
| |-AlwaysInlineAttr 0x7fd74caf3e08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74caf3e50 <col:51, col:74> Hidden
`-CXXMethodDecl 0x7fd74caf3f50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3447:5> line:3445:10 used use_count 'long (void) const noexcept'
  |-CompoundStmt 0x7fd74caf52b8 <col:38, line:3447:5>
  | `-ReturnStmt 0x7fd74caf52a0 <line:3446:9, col:59>
  |   `-BinaryOperator 0x7fd74caf5278 <col:16, col:59> 'long' '+'
  |     |-CallExpr 0x7fd74caf5210 <col:16, col:55> 'long':'long'
  |     | |-ImplicitCastExpr 0x7fd74caf51f8 <col:16> 'long (*)(const long *)' <FunctionToPointerDecay>
  |     | | `-DeclRefExpr 0x7fd74caf5170 <col:16> 'long (const long *)' lvalue Function 0x7fd74caf5030 '__libcpp_relaxed_load' 'long (const long *)' (FunctionTemplate 0x7fd74ca36908 '__libcpp_relaxed_load')
  |     | `-UnaryOperator 0x7fd74caf4dd8 <col:38, col:39> 'const long *' prefix '&'
  |     |   `-MemberExpr 0x7fd74caf4da0 <col:39> 'const long' lvalue ->__shared_owners_ 0x7fd74caf3770
  |     |     `-CXXThisExpr 0x7fd74caf4d88 <col:39> 'const class std::__1::__shared_count *' this
  |     `-ImplicitCastExpr 0x7fd74caf5260 <col:59> 'long' <IntegralCast>
  |       `-IntegerLiteral 0x7fd74caf5240 <col:59> 'int' 1
  |-AlwaysInlineAttr 0x7fd74caf3fe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
  `-VisibilityAttr 0x7fd74caf4030 <col:51, col:74> Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::locale::facet
         0 |   class std::__1::__shared_count (primary base)
         0 |     (__shared_count vtable pointer)
         8 |     long __shared_owners_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd74d992400 parent 0x7fd74d98c298 prev 0x7fd74d98c4d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:147:1, line:161:1> line:147:32 referenced class facet definition
|-public 'class std::__1::__shared_count'
|-VisibilityAttr 0x7fd74d992540 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fd74d9925c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:147:1, col:32> col:32 implicit referenced class facet
|-AccessSpecDecl 0x7fd74d992660 <line:150:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fd74d9927b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:153:56> line:152:14 used facet 'void (size_t)'
| |-ParmVarDecl 0x7fd74d9926c8 <col:20, col:36> col:27 used __refs 'size_t':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7fd74d992cc8 <col:36> 'size_t':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7fd74d992ca8 <col:36> 'int' 0
| |-CXXCtorInitializer 'class std::__1::__shared_count'
| | `-CXXConstructExpr 0x7fd74d992e20 <line:153:11, col:53> 'class std::__1::__shared_count' 'void (long) noexcept'
| |   `-BinaryOperator 0x7fd74d992db8 <col:26, col:52> 'long' '-'
| |     |-CXXStaticCastExpr 0x7fd74d992d50 <col:26, col:50> 'long' static_cast<long> <NoOp>
| |     | `-ImplicitCastExpr 0x7fd74d992d38 <col:44> 'long' <IntegralCast>
| |     |   `-ImplicitCastExpr 0x7fd74d992d20 <col:44> 'size_t':'unsigned long' <LValueToRValue>
| |     |     `-DeclRefExpr 0x7fd74d992ce0 <col:44> 'size_t':'unsigned long' lvalue ParmVar 0x7fd74d9926c8 '__refs' 'size_t':'unsigned long'
| |     `-ImplicitCastExpr 0x7fd74d992da0 <col:52> 'long' <IntegralCast>
| |       `-IntegerLiteral 0x7fd74d992d80 <col:52> 'int' 1
| |-CompoundStmt 0x7fd74d992e88 <col:55, col:56>
| |-AlwaysInlineAttr 0x7fd74d992860 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fd74d9928a8 <col:51, col:74> Hidden
|-CXXDestructorDecl 0x7fd74d992908 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:155:5, col:20> col:13 used ~facet 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fd74d9929a8 <line:159:1, col:8> col:1 private
|-CXXMethodDecl 0x7fd74d9929f8 <line:160:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:160:18 __on_zero_shared 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7fd74d992b28 <line:147:32, <invalid sloc>> col:32 implicit operator= 'class std::__1::locale::facet &(const class std::__1::locale::facet &)' inline default_delete noexcept-unevaluated 0x7fd74d992b28
| `-ParmVarDecl 0x7fd74d992c40 <col:32> col:32 'const class std::__1::locale::facet &'
`-CXXConstructorDecl 0x7fd74d997178 <col:32> col:32 implicit facet 'void (const class std::__1::locale::facet &)' inline default_delete noexcept-unevaluated 0x7fd74d997178
  `-ParmVarDecl 0x7fd74d9972a0 <col:32> col:32 'const class std::__1::locale::facet &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
  NonVirtualBaseLLVMType:%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::codecvt_base (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd74d9bf080 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:832:1, line:837:1> line:832:24 referenced class codecvt_base definition
|-VisibilityAttr 0x7fd74d9bf1a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fd74d9bf1f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:832:1, col:24> col:24 implicit referenced class codecvt_base
|-AccessSpecDecl 0x7fd74d9bf288 <line:834:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fd74d9bf348 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:835:43> col:27 used codecvt_base 'void (void)'
| |-CompoundStmt 0x7fd74d9bf640 <col:42, col:43>
| |-AlwaysInlineAttr 0x7fd74d9bf3f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fd74d9bf438 <col:48, col:71> Hidden
|-EnumDecl 0x7fd74d9bf448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:836:5, col:44> col:10 referenced result
| |-EnumConstantDecl 0x7fd74d9bf500 <col:18> col:18 referenced ok 'enum std::__1::codecvt_base::result'
| |-EnumConstantDecl 0x7fd74d9bf548 <col:22> col:22 referenced partial 'enum std::__1::codecvt_base::result'
| |-EnumConstantDecl 0x7fd74d9bf590 <col:31> col:31 referenced error 'enum std::__1::codecvt_base::result'
| `-EnumConstantDecl 0x7fd74d9bf5d8 <col:38> col:38 referenced noconv 'enum std::__1::codecvt_base::result'
|-CXXDestructorDecl 0x7fd74d9c4c58 <line:832:24> col:24 implicit ~codecvt_base 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fd74d9c4e68 <col:24> col:24 implicit constexpr codecvt_base 'void (const class std::__1::codecvt_base &)' inline default trivial noexcept-unevaluated 0x7fd74d9c4e68
| `-ParmVarDecl 0x7fd74d9c4f90 <col:24> col:24 'const class std::__1::codecvt_base &'
`-CXXConstructorDecl 0x7fd74d9c5028 <col:24> col:24 implicit constexpr codecvt_base 'void (class std::__1::codecvt_base &&)' inline default trivial noexcept-unevaluated 0x7fd74d9c5028
  `-ParmVarDecl 0x7fd74d9c5150 <col:24> col:24 'class std::__1::codecvt_base &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::codecvt_base" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::codecvt_base.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::codecvt<char, char, mbstate_t>
         0 |   class std::__1::locale::facet (primary base)
         0 |     class std::__1::__shared_count (primary base)
         0 |       (__shared_count vtable pointer)
         8 |       long __shared_owners_
         0 |   class std::__1::codecvt_base (base) (empty)
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fd74d9bfbc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:845:1, line:927:1> line:846:24 class codecvt definition
|-public 'class locale::facet':'class std::__1::locale::facet'
|-public 'class std::__1::codecvt_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'char'
|-TemplateArgument type '__mbstate_t'
|-VisibilityAttr 0x7fd74d9bfd28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fd74d9bff88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:846:1, col:24> col:24 implicit referenced class codecvt
|-AccessSpecDecl 0x7fd74d9c0020 <line:850:1, col:7> col:1 public
|-TypedefDecl 0x7fd74d9c0058 <line:851:5, col:23> col:23 referenced intern_type 'char'
| `-BuiltinType 0x7fd74a833560 'char'
|-TypedefDecl 0x7fd74d9c00c0 <line:852:5, col:23> col:23 referenced extern_type 'char'
| `-BuiltinType 0x7fd74a833560 'char'
|-TypedefDecl 0x7fd74d9c0128 <line:853:5, col:23> col:23 referenced state_type 'mbstate_t':'__mbstate_t'
| `-TypedefType 0x7fd74b051b80 'mbstate_t' sugar
|   |-Typedef 0x7fd74a8c91f0 'mbstate_t'
|   `-TypedefType 0x7fd74a8c91c0 '__darwin_mbstate_t' sugar
|     |-Typedef 0x7fd74a869550 '__darwin_mbstate_t'
|     `-TypedefType 0x7fd74a869520 '__mbstate_t' sugar
|       |-Typedef 0x7fd74a8694b0 '__mbstate_t'
|       `-ElaboratedType 0x7fd74a869460 'union __mbstate_t' sugar
|         `-RecordType 0x7fd74a869290 '__mbstate_t'
|           `-CXXRecord 0x7fd74a8691f8 ''
|-CXXConstructorDecl 0x7fd74d9c0290 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:857:34> line:856:14 codecvt 'void (size_t)'
| |-ParmVarDecl 0x7fd74d9c01c0 <col:22, col:38> col:29 used __refs 'size_t':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7fd74d9c4c08 <col:38> 'size_t':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7fd74d9c4be8 <col:38> 'int' 0
| |-CXXCtorInitializer 'class locale::facet':'class std::__1::locale::facet'
| | `-CXXConstructExpr 0x7fd74d9c4de0 <line:857:11, col:31> 'class locale::facet':'class std::__1::locale::facet' 'void (size_t)'
| |   `-ImplicitCastExpr 0x7fd74d9c4dc8 <col:25> 'size_t':'unsigned long' <LValueToRValue>
| |     `-DeclRefExpr 0x7fd74d9c4d40 <col:25> 'size_t':'unsigned long' lvalue ParmVar 0x7fd74d9c01c0 '__refs' 'size_t':'unsigned long'
| |-CXXCtorInitializer 'class std::__1::codecvt_base'
| | `-CXXConstructExpr 0x7fd74d9c51b8 <line:856:14> 'class std::__1::codecvt_base' 'void (void)'
| |-CompoundStmt 0x7fd74d9c5230 <line:857:33, col:34>
| |-AlwaysInlineAttr 0x7fd74d9c0340 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fd74d9c0388 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fd74d9c0a20 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:865:5> line:860:12 out 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const'
| |-ParmVarDecl 0x7fd74d9c0458 <col:16, col:28> col:28 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fd74d9c0518 <line:861:16, col:35> col:35 used __frm 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fd74d9c0588 <col:42, col:61> col:61 used __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fd74d9c0660 <col:72, col:92> col:92 used __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-ParmVarDecl 0x7fd74d9c0718 <line:862:16, col:29> col:29 used __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fd74d9c0788 <col:35, col:48> col:48 used __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fd74d9c0860 <col:58, col:72> col:72 used __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-CompoundStmt 0x7fd74d9c5488 <line:863:5, line:865:5>
| | `-ReturnStmt 0x7fd74d9c5470 <line:864:9, col:82>
| |   `-CXXMemberCallExpr 0x7fd74d9c53b0 <col:16, col:82> 'enum std::__1::codecvt_base::result'
| |     |-MemberExpr 0x7fd74d9c5260 <col:16> '<bound member function type>' ->do_out 0x7fd74d9c2490
| |     | `-CXXThisExpr 0x7fd74d9c5248 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7fd74d9c5298 <col:23> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7fd74d9c0458 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7fd74d9c5410 <col:29> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fd74d9c52c0 <col:29> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7fd74d9c0518 '__frm' 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     |-ImplicitCastExpr 0x7fd74d9c5428 <col:36> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fd74d9c52e8 <col:36> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7fd74d9c0588 '__frm_end' 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     |-DeclRefExpr 0x7fd74d9c5310 <col:47> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7fd74d9c0660 '__frm_nxt' 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |     |-ImplicitCastExpr 0x7fd74d9c5440 <col:58> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fd74d9c5338 <col:58> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fd74d9c0718 '__to' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7fd74d9c5458 <col:64> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fd74d9c5360 <col:64> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fd74d9c0788 '__to_end' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     `-DeclRefExpr 0x7fd74d9c5388 <col:74> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fd74d9c0860 '__to_nxt' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-AlwaysInlineAttr 0x7fd74d9c0af0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fd74d9c0b38 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fd74d9c0e20 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:872:5> line:868:12 unshift 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const'
| |-ParmVarDecl 0x7fd74d9c0b88 <col:20, col:32> col:32 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fd74d9c0bf8 <line:869:20, col:33> col:33 used __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fd74d9c0c68 <col:39, col:52> col:52 used __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fd74d9c0ce0 <col:62, col:76> col:76 used __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-CompoundStmt 0x7fd74d9c5628 <line:870:5, line:872:5>
| | `-ReturnStmt 0x7fd74d9c5610 <line:871:9, col:57>
| |   `-CXXMemberCallExpr 0x7fd74d9c5598 <col:16, col:57> 'enum std::__1::codecvt_base::result'
| |     |-MemberExpr 0x7fd74d9c54c0 <col:16> '<bound member function type>' ->do_unshift 0x7fd74d9c4400
| |     | `-CXXThisExpr 0x7fd74d9c54a8 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7fd74d9c54f8 <col:27> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7fd74d9c0b88 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7fd74d9c55e0 <col:33> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fd74d9c5520 <col:33> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fd74d9c0bf8 '__to' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7fd74d9c55f8 <col:39> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fd74d9c5548 <col:39> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fd74d9c0c68 '__to_end' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     `-DeclRefExpr 0x7fd74d9c5570 <col:49> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fd74d9c0ce0 '__to_nxt' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-AlwaysInlineAttr 0x7fd74d9c0ed8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fd74d9c0f20 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fd74d9c13f0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:880:5> line:875:12 in 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *&) const'
| |-ParmVarDecl 0x7fd74d9c0f70 <col:15, col:27> col:27 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fd74d9c1008 <line:876:15, col:34> col:34 used __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fd74d9c1078 <col:41, col:60> col:60 used __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fd74d9c1120 <col:71, col:91> col:91 used __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-ParmVarDecl 0x7fd74d9c11b8 <line:877:15, col:28> col:28 used __to 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fd74d9c1228 <col:34, col:47> col:47 used __to_end 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fd74d9c12d0 <col:57, col:71> col:71 used __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-CompoundStmt 0x7fd74d9c5888 <line:878:5, line:880:5>
| | `-ReturnStmt 0x7fd74d9c5870 <line:879:9, col:81>
| |   `-CXXMemberCallExpr 0x7fd74d9c57b0 <col:16, col:81> 'enum std::__1::codecvt_base::result'
| |     |-MemberExpr 0x7fd74d9c5660 <col:16> '<bound member function type>' ->do_in 0x7fd74d9c28d8
| |     | `-CXXThisExpr 0x7fd74d9c5648 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7fd74d9c5698 <col:22> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7fd74d9c0f70 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7fd74d9c5810 <col:28> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fd74d9c56c0 <col:28> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fd74d9c1008 '__frm' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7fd74d9c5828 <col:35> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fd74d9c56e8 <col:35> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fd74d9c1078 '__frm_end' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-DeclRefExpr 0x7fd74d9c5710 <col:46> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fd74d9c1120 '__frm_nxt' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |     |-ImplicitCastExpr 0x7fd74d9c5840 <col:57> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fd74d9c5738 <col:57> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7fd74d9c11b8 '__to' 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     |-ImplicitCastExpr 0x7fd74d9c5858 <col:63> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fd74d9c5760 <col:63> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7fd74d9c1228 '__to_end' 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     `-DeclRefExpr 0x7fd74d9c5788 <col:73> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7fd74d9c12d0 '__to_nxt' 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-AlwaysInlineAttr 0x7fd74d9c14c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fd74d9c1508 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fd74d9c1578 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:886:5> line:883:9 encoding 'int (void) const noexcept'
| |-CompoundStmt 0x7fd74d9c5938 <line:884:5, line:886:5>
| | `-ReturnStmt 0x7fd74d9c5920 <line:885:9, col:28>
| |   `-CXXMemberCallExpr 0x7fd74d9c58f8 <col:16, col:28> 'int'
| |     `-MemberExpr 0x7fd74d9c58c0 <col:16> '<bound member function type>' ->do_encoding 0x7fd74d9c44e8
| |       `-CXXThisExpr 0x7fd74d9c58a8 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |-AlwaysInlineAttr 0x7fd74d9c1610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fd74d9c1658 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fd74d9c16c0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:892:5> line:889:10 always_noconv '_Bool (void) const noexcept'
| |-CompoundStmt 0x7fd74d9c59e8 <line:890:5, line:892:5>
| | `-ReturnStmt 0x7fd74d9c59d0 <line:891:9, col:33>
| |   `-CXXMemberCallExpr 0x7fd74d9c59a8 <col:16, col:33> '_Bool'
| |     `-MemberExpr 0x7fd74d9c5970 <col:16> '<bound member function type>' ->do_always_noconv 0x7fd74d9c45a8
| |       `-CXXThisExpr 0x7fd74d9c5958 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |-AlwaysInlineAttr 0x7fd74d9c1758 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fd74d9c17a0 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fd74d9c1a88 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:898:5> line:895:9 length 'int (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, size_t) const'
| |-ParmVarDecl 0x7fd74d9c17f0 <col:16, col:28> col:28 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fd74d9c1860 <col:34, col:53> col:53 used __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fd74d9c18d0 <col:60, col:79> col:79 used __end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fd74d9c1940 <col:86, col:93> col:93 used __mx 'size_t':'unsigned long'
| |-CompoundStmt 0x7fd74d9c5ba0 <line:896:5, line:898:5>
| | `-ReturnStmt 0x7fd74d9c5b88 <line:897:9, col:50>
| |   `-CXXMemberCallExpr 0x7fd74d9c5af8 <col:16, col:50> 'int'
| |     |-MemberExpr 0x7fd74d9c5a20 <col:16> '<bound member function type>' ->do_length 0x7fd74d9c4848
| |     | `-CXXThisExpr 0x7fd74d9c5a08 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7fd74d9c5a58 <col:26> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7fd74d9c17f0 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7fd74d9c5b40 <col:32> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fd74d9c5a80 <col:32> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fd74d9c1860 '__frm' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7fd74d9c5b58 <col:39> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fd74d9c5aa8 <col:39> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fd74d9c18d0 '__end' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     `-ImplicitCastExpr 0x7fd74d9c5b70 <col:46> 'size_t':'unsigned long' <LValueToRValue>
| |       `-DeclRefExpr 0x7fd74d9c5ad0 <col:46> 'size_t':'unsigned long' lvalue ParmVar 0x7fd74d9c1940 '__mx' 'size_t':'unsigned long'
| |-AlwaysInlineAttr 0x7fd74d9c1b40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fd74d9c1b88 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fd74d9c1bf8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:904:5> line:901:9 max_length 'int (void) const noexcept'
| |-CompoundStmt 0x7fd74d9c5c50 <line:902:5, line:904:5>
| | `-ReturnStmt 0x7fd74d9c5c38 <line:903:9, col:30>
| |   `-CXXMemberCallExpr 0x7fd74d9c5c10 <col:16, col:30> 'int'
| |     `-MemberExpr 0x7fd74d9c5bd8 <col:16> '<bound member function type>' ->do_max_length 0x7fd74d9c4930
| |       `-CXXThisExpr 0x7fd74d9c5bc0 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |-AlwaysInlineAttr 0x7fd74d9c1c90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fd74d9c1cd8 <col:48, col:71> Hidden
|-VarDecl 0x7fd74d9c1d48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:906:5, col:23> col:23 id 'class locale::id':'class std::__1::locale::id' static
|-AccessSpecDecl 0x7fd74d9c1da8 <line:908:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fd74d9c1f18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:911:34> line:910:14 codecvt 'void (const char *, size_t)'
| |-ParmVarDecl 0x7fd74d9c1e18 <col:22, col:32> col:33 'const char *'
| |-ParmVarDecl 0x7fd74d9c1e88 <col:35, col:51> col:42 used __refs 'size_t':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7fd74d9c4c40 <col:51> 'size_t':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7fd74d9c4c20 <col:51> 'int' 0
| |-CXXCtorInitializer 'class locale::facet':'class std::__1::locale::facet'
| | `-CXXConstructExpr 0x7fd74d9c5d18 <line:911:11, col:31> 'class locale::facet':'class std::__1::locale::facet' 'void (size_t)'
| |   `-ImplicitCastExpr 0x7fd74d9c5d00 <col:25> 'size_t':'unsigned long' <LValueToRValue>
| |     `-DeclRefExpr 0x7fd74d9c5c78 <col:25> 'size_t':'unsigned long' lvalue ParmVar 0x7fd74d9c1e88 '__refs' 'size_t':'unsigned long'
| |-CXXCtorInitializer 'class std::__1::codecvt_base'
| | `-CXXConstructExpr 0x7fd74d9c5d78 <line:910:14> 'class std::__1::codecvt_base' 'void (void)'
| |-CompoundStmt 0x7fd74d9c5df0 <line:911:33, col:34>
| |-AlwaysInlineAttr 0x7fd74d9c1fd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fd74d9c2018 <col:48, col:71> Hidden
|-CXXDestructorDecl 0x7fd74d9c2078 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:913:5, col:14> col:5 ~codecvt 'void (void) noexcept'
|-CXXMethodDecl 0x7fd74d9c2490 <line:915:5, line:917:93> line:915:20 used do_out 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const' virtual
| |-ParmVarDecl 0x7fd74d9c2128 <col:27, col:39> col:39 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fd74d9c2198 <line:916:27, col:46> col:46 __frm 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fd74d9c2208 <col:53, col:72> col:72 __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fd74d9c2280 <col:83, col:103> col:103 __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-ParmVarDecl 0x7fd74d9c22f0 <line:917:27, col:40> col:40 __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fd74d9c2360 <col:46, col:59> col:59 __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| `-ParmVarDecl 0x7fd74d9c23d8 <col:69, col:83> col:83 __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
|-CXXMethodDecl 0x7fd74d9c28d8 <line:918:5, line:920:92> line:918:20 used do_in 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *&) const' virtual
| |-ParmVarDecl 0x7fd74d9c2570 <col:26, col:38> col:38 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fd74d9c25e0 <line:919:26, col:45> col:45 __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fd74d9c2650 <col:52, col:71> col:71 __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fd74d9c26c8 <col:82, col:102> col:102 __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-ParmVarDecl 0x7fd74d9c2738 <line:920:26, col:39> col:39 __to 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fd74d9c27a8 <col:45, col:58> col:58 __to_end 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| `-ParmVarDecl 0x7fd74d9c2820 <col:68, col:82> col:82 __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
|-CXXMethodDecl 0x7fd74d9c4400 <line:921:5, line:922:97> line:921:20 used do_unshift 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const' virtual
| |-ParmVarDecl 0x7fd74d9c29b8 <col:31, col:43> col:43 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fd74d9c2a28 <line:922:31, col:44> col:44 __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fd74d9c2a98 <col:50, col:63> col:63 __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| `-ParmVarDecl 0x7fd74d9c2b10 <col:73, col:87> col:87 __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
|-CXXMethodDecl 0x7fd74d9c44e8 <line:923:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:923:17 used do_encoding 'int (void) const noexcept' virtual
|-CXXMethodDecl 0x7fd74d9c45a8 <line:924:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:924:18 used do_always_noconv '_Bool (void) const noexcept' virtual
|-CXXMethodDecl 0x7fd74d9c4848 <line:925:5, col:110> col:17 used do_length 'int (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, size_t) const' virtual
| |-ParmVarDecl 0x7fd74d9c4650 <col:27, col:39> col:39 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fd74d9c46c0 <col:45, col:64> col:64 __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fd74d9c4730 <col:71, col:90> col:90 __end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| `-ParmVarDecl 0x7fd74d9c47a0 <col:97, col:104> col:104 __mx 'size_t':'unsigned long'
|-CXXMethodDecl 0x7fd74d9c4930 <line:926:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:926:17 used do_max_length 'int (void) const noexcept' virtual
`-CXXMethodDecl 0x7fd74d9c4a68 <line:846:24, <invalid sloc>> col:24 implicit operator= 'class std::__1::codecvt<char, char, mbstate_t> &(const class std::__1::codecvt<char, char, mbstate_t> &)' inline default_delete noexcept-unevaluated 0x7fd74d9c4a68
  `-ParmVarDecl 0x7fd74d9c4b80 <col:24> col:24 'const class std::__1::codecvt<char, char, mbstate_t> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::codecvt" = type { %"class.std::__1::locale::facet" }
  NonVirtualBaseLLVMType:%"class.std::__1::codecvt" = type { %"class.std::__1::locale::facet" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd74a8691f8 </usr/include/i386/_types.h:76:9, line:79:1> line:76:9 union definition
|-FieldDecl 0x7fd74a869398 <line:77:2, col:22> col:8 __mbstate8 'char [128]'
|-FieldDecl 0x7fd74a8693f8 <line:78:2, col:12> col:12 _mbstateL 'long long'
|-CXXConstructorDecl 0x7fd74d9dac70 <line:76:9> col:9 implicit used  'void (void) noexcept' inline default trivial
| `-CompoundStmt 0x7fd74d9db0d8 <col:9>
|-CXXConstructorDecl 0x7fd74d9dad88 <col:9> col:9 implicit constexpr  'void (const __mbstate_t &)' inline default trivial noexcept-unevaluated 0x7fd74d9dad88
| `-ParmVarDecl 0x7fd74d9daeb0 <col:9> col:9 'const __mbstate_t &'
|-CXXConstructorDecl 0x7fd74d9daf48 <col:9> col:9 implicit constexpr  'void (__mbstate_t &&)' inline default trivial noexcept-unevaluated 0x7fd74d9daf48
| `-ParmVarDecl 0x7fd74d9db070 <col:9> col:9 '__mbstate_t &&'
`-CXXDestructorDecl 0x7fd74b372e68 <col:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.__mbstate_t = type { i64, [120 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fd74b06ce28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:128:1, line:129:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:185:28 class basic_filebuf definition
|-public 'basic_streambuf<char, struct std::__1::char_traits<char> >':'class std::__1::basic_streambuf<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-CXXRecordDecl 0x7fd74b370438 prev 0x7fd74b06ce28 <col:1, col:28> col:28 implicit class basic_filebuf
|-AccessSpecDecl 0x7fd74b3704d0 <line:188:1, col:7> col:1 public
|-TypedefDecl 0x7fd74b370508 <line:189:5, col:46> col:46 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fd74b3702e0 'char' sugar
|   |-TemplateTypeParmType 0x7fd74d4016e0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fd74d401698 '_CharT'
|   `-BuiltinType 0x7fd74a833560 'char'
|-TypedefDecl 0x7fd74b370570 <line:190:5, col:46> col:46 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fd74b370320 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fd74d401750 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fd74d401708 '_Traits'
|   `-RecordType 0x7fd74b06ab60 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fd74ccc2b48 'char_traits'
|-TypedefDecl 0x7fd74b370680 <line:191:5, col:46> col:46 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fd74b370630 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fd74ccc4690 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fd74ccc2ea8 'int_type'
|     `-BuiltinType 0x7fd74a8335c0 'int'
|-TypedefDecl 0x7fd74b370750 <line:192:5, col:46> col:46 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fd74b370700 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fd74da3c1a0 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fd74ccc2f78 'pos_type'
|     `-TypedefType 0x7fd74ccba110 'std::__1::streampos' sugar
|       |-Typedef 0x7fd74b0709b8 'streampos'
|       `-TemplateSpecializationType 0x7fd74b070910 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fd74b0708f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fd74b070800 'fpos'
|-TypedefDecl 0x7fd74b370820 <line:193:5, col:46> col:46 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fd74b3707d0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fd74da3c290 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fd74ccc2f10 'off_type'
|     `-TypedefType 0x7fd74ccba080 'std::__1::streamoff' sugar
|       |-Typedef 0x7fd74b070d58 'streamoff'
|       `-BuiltinType 0x7fd74a833600 'long long'
|-TypedefDecl 0x7fd74b370910 <line:194:5, col:46> col:46 state_type 'typename traits_type::state_type':'__mbstate_t'
| `-ElaboratedType 0x7fd74b3708c0 'typename traits_type::state_type' sugar
|   `-TypedefType 0x7fd74b3708a0 'std::__1::char_traits<char>::state_type' sugar
|     |-Typedef 0x7fd74ccc2fe0 'state_type'
|     `-TypedefType 0x7fd74b051b80 'mbstate_t' sugar
|       |-Typedef 0x7fd74a8c91f0 'mbstate_t'
|       `-TypedefType 0x7fd74a8c91c0 '__darwin_mbstate_t' sugar
|         |-Typedef 0x7fd74a869550 '__darwin_mbstate_t'
|         `-TypedefType 0x7fd74a869520 '__mbstate_t' sugar
|           |-Typedef 0x7fd74a8694b0 '__mbstate_t'
|           `-ElaboratedType 0x7fd74a869460 'union __mbstate_t' sugar
|             `-RecordType 0x7fd74a869290 '__mbstate_t'
|               `-CXXRecord 0x7fd74a8691f8 ''
|-CXXConstructorDecl 0x7fd74b3709a8 <line:197:5, col:19> col:5 basic_filebuf 'void (void)'
|-CXXConstructorDecl 0x7fd74b370b80 <line:199:5, col:40> col:5 basic_filebuf 'void (class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&)'
| `-ParmVarDecl 0x7fd74b370a98 <col:19, col:35> col:35 __rhs 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&'
|-CXXDestructorDecl 0x7fd74b370c70 <line:201:5, col:28> col:13 used ~basic_filebuf 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7fd74b370e20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:206:51> col:20 operator= 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &(class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&)'
| |-ParmVarDecl 0x7fd74b370d58 <col:30, col:46> col:46 __rhs 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&'
| `-AlwaysInlineAttr 0x7fd74b370ed0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fd74b370ff0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:208:5, col:35> col:10 swap 'void (class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &)'
| `-ParmVarDecl 0x7fd74b370f28 <col:15, col:30> col:30 __rhs 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &'
|-CXXMethodDecl 0x7fd74b3710a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:212:20> col:10 is_open '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fd74b371148 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fd74b371300 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:214:5, col:67> col:20 open 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > *(const char *, class ios_base::openmode)'
| |-ParmVarDecl 0x7fd74b371190 <col:25, col:37> col:37 __s 'const char *'
| `-ParmVarDecl 0x7fd74b3711f0 <col:42, col:61> col:61 __mode 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fd74b371530 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:216:69> col:20 open 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > *(const std::__1::string &, class ios_base::openmode)'
| |-ParmVarDecl 0x7fd74b3713b8 <col:25, col:39> col:39 __s 'const std::__1::string &'
| |-ParmVarDecl 0x7fd74b371418 <col:44, col:63> col:63 __mode 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7fd74b3715e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fd74b371680 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:218:5, col:26> col:20 close 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > *(void)'
|-AccessSpecDecl 0x7fd74b371728 <line:220:1, col:10> col:1 protected
|-CXXMethodDecl 0x7fd74b3717c0 <line:222:5, col:32> col:22 underflow 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7fd74b371940 <line:223:5, col:65> col:22 pbackfail 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7fd74b371878 <col:32, col:64> col:41 __c 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7fd74b371a88 <line:224:5, col:65> col:22 overflow 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7fd74b371a00 <col:32, col:64> col:41 __c 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7fd74b371dc0 <line:225:5, col:91> col:54 setbuf 'basic_streambuf<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::traits_type> *(std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7fd74b371c48 <col:61, col:72> col:72 __s 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fd74b371ca8 <col:77, col:88> col:88 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fd74b372070 <line:226:5, line:227:85> line:226:22 seekoff 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7fd74b371ed0 <col:30, col:39> col:39 __off 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7fd74b371f30 <col:46, col:64> col:64 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-ParmVarDecl 0x7fd74b371f90 <line:227:30, col:82> col:49 __wch 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fd74b372270 <line:228:5, line:229:85> line:228:22 seekpos 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7fd74b372140 <col:30, col:39> col:39 __sp 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ParmVarDecl 0x7fd74b3721a0 <line:229:30, col:82> col:49 __wch 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fd74b372328 <line:230:5, col:22> col:17 sync 'int (void)' virtual
|-CXXMethodDecl 0x7fd74b372458 <line:231:5, col:43> col:18 imbue 'void (const class std::__1::locale &)' virtual
| `-ParmVarDecl 0x7fd74b3723d0 <col:24, col:38> col:38 __loc 'const class std::__1::locale &'
|-AccessSpecDecl 0x7fd74b372508 <line:233:1, col:8> col:1 private
|-FieldDecl 0x7fd74b372530 <line:234:5, col:17> col:17 __extbuf_ 'char *'
|-FieldDecl 0x7fd74b372578 <line:235:5, col:17> col:17 __extbufnext_ 'const char *'
|-FieldDecl 0x7fd74b3725c0 <line:236:5, col:17> col:17 __extbufend_ 'const char *'
|-FieldDecl 0x7fd74b372608 <line:237:5, col:25> col:10 __extbuf_min_ 'char [8]'
|-FieldDecl 0x7fd74b372650 <line:238:5, col:12> col:12 __ebs_ 'size_t':'unsigned long'
|-FieldDecl 0x7fd74b3726a8 <line:239:5, col:16> col:16 __intbuf_ 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fd74b3726f0 <line:240:5, col:12> col:12 __ibs_ 'size_t':'unsigned long'
|-FieldDecl 0x7fd74b372738 <line:241:5, col:11> col:11 __file_ 'FILE *'
|-FieldDecl 0x7fd74b3728d0 <line:242:5, col:49> col:49 __cv_ 'const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> *'
|-FieldDecl 0x7fd74b372928 <line:243:5, col:16> col:16 __st_ 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type':'__mbstate_t'
|-FieldDecl 0x7fd74b372980 <line:244:5, col:16> col:16 __st_last_ 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type':'__mbstate_t'
|-FieldDecl 0x7fd74b3729c8 <line:245:5, col:24> col:24 __om_ 'class ios_base::openmode':'unsigned int'
|-FieldDecl 0x7fd74b372a10 <line:246:5, col:24> col:24 __cm_ 'class ios_base::openmode':'unsigned int'
|-FieldDecl 0x7fd74b372a58 <line:247:5, col:10> col:10 __owns_eb_ '_Bool'
|-FieldDecl 0x7fd74b372aa0 <line:248:5, col:10> col:10 __owns_ib_ '_Bool'
|-FieldDecl 0x7fd74b372ae8 <line:249:5, col:10> col:10 __always_noconv_ '_Bool'
|-CXXMethodDecl 0x7fd74b372b30 <line:251:5, col:22> col:10 __read_mode '_Bool (void)'
|-CXXMethodDecl 0x7fd74b372bd8 <line:252:5, col:23> col:10 __write_mode 'void (void)'
`-CXXMethodDecl 0x7fd74b372ce8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:129:32, <invalid sloc>> col:32 implicit operator= 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &(const class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &)' inline default_delete noexcept-unevaluated 0x7fd74b372ce8
  `-ParmVarDecl 0x7fd74b372e00 <col:32> col:32 'const class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_filebuf" = type <{ %"class.std::__1::basic_streambuf", i8*, i8*, i8*, [8 x i8], i64, i8*, i64, %struct.__sFILE*, %"class.std::__1::codecvt"*, %union.__mbstate_t, %union.__mbstate_t, i32, i32, i8, i8, i8, [5 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_filebuf.base" = type <{ %"class.std::__1::basic_streambuf", i8*, i8*, i8*, [8 x i8], i64, i8*, i64, %struct.__sFILE*, %"class.std::__1::codecvt"*, %union.__mbstate_t, %union.__mbstate_t, i32, i32, i8, i8, i8 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fd74b06d718 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:134:1, line:135:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1323:28 class basic_fstream definition
|-public 'basic_iostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_iostream<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-CXXRecordDecl 0x7fd74b36e9c0 prev 0x7fd74b06d718 <col:1, col:28> col:28 implicit class basic_fstream
|-AccessSpecDecl 0x7fd74b36ea58 <line:1326:1, col:7> col:1 public
|-TypedefDecl 0x7fd74b36ea90 <line:1327:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fd74b36e850 'char' sugar
|   |-TemplateTypeParmType 0x7fd74b363cf0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fd74b363ca8 '_CharT'
|   `-BuiltinType 0x7fd74a833560 'char'
|-TypedefDecl 0x7fd74b36eaf8 <line:1328:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fd74b36e890 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fd74b363d60 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fd74b363d18 '_Traits'
|   `-RecordType 0x7fd74b06ab60 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fd74ccc2b48 'char_traits'
|-TypedefDecl 0x7fd74b36ec00 <line:1329:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fd74b36ebb0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fd74ccc4690 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fd74ccc2ea8 'int_type'
|     `-BuiltinType 0x7fd74a8335c0 'int'
|-TypedefDecl 0x7fd74b36ecd0 <line:1330:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fd74b36ec80 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fd74da3c1a0 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fd74ccc2f78 'pos_type'
|     `-TypedefType 0x7fd74ccba110 'std::__1::streampos' sugar
|       |-Typedef 0x7fd74b0709b8 'streampos'
|       `-TemplateSpecializationType 0x7fd74b070910 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fd74b0708f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fd74b070800 'fpos'
|-TypedefDecl 0x7fd74b36eda0 <line:1331:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fd74b36ed50 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fd74da3c290 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fd74ccc2f10 'off_type'
|     `-TypedefType 0x7fd74ccba080 'std::__1::streamoff' sugar
|       |-Typedef 0x7fd74b070d58 'streamoff'
|       `-BuiltinType 0x7fd74a833600 'long long'
|-CXXConstructorDecl 0x7fd74b36ee38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1334:19> col:5 used basic_fstream 'void (void)'
| `-AlwaysInlineAttr 0x7fd74b36ef18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fd74b36f070 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1337:101> col:14 used basic_fstream 'void (const char *, class ios_base::openmode)'
| |-ParmVarDecl 0x7fd74b36ef60 <col:28, col:40> col:40 __s 'const char *'
| |-ParmVarDecl 0x7fd74b36efc0 <col:45, col:98> col:64 __mode 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7fd74b36f138 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fd74b36f290 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1339:103> col:14 basic_fstream 'void (const std::__1::string &, class ios_base::openmode)'
| |-ParmVarDecl 0x7fd74b36f180 <col:28, col:42> col:42 __s 'const std::__1::string &'
| |-ParmVarDecl 0x7fd74b36f1e0 <col:47, col:100> col:66 __mode 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7fd74b36f358 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fd74b36f4c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1343:40> col:5 basic_fstream 'void (class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&)'
| |-ParmVarDecl 0x7fd74b36f3d8 <col:19, col:35> col:35 __rhs 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&'
| `-AlwaysInlineAttr 0x7fd74b36f580 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fd74b36f6d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1346:51> col:20 operator= 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &(class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&)'
| |-ParmVarDecl 0x7fd74b36f608 <col:30, col:46> col:46 __rhs 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&'
| `-AlwaysInlineAttr 0x7fd74b36f780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fd74b36f8a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1349:35> col:10 swap 'void (class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &)'
| |-ParmVarDecl 0x7fd74b36f7d8 <col:15, col:30> col:30 __rhs 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &'
| `-AlwaysInlineAttr 0x7fd74b36f950 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fd74b36fb60 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1352:52> col:44 rdbuf 'basic_filebuf<std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7fd74b36fc08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fd74b36fc50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1354:20> col:10 is_open '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fd74b36fcf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fd74b36fe30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1356:5, col:88> col:10 open 'void (const char *, class ios_base::openmode)'
| |-ParmVarDecl 0x7fd74b36fd40 <col:15, col:27> col:27 __s 'const char *'
| `-ParmVarDecl 0x7fd74b36fda0 <col:32, col:85> col:51 __mode 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fd74b36ffd8 <line:1357:5, col:90> col:10 open 'void (const std::__1::string &, class ios_base::openmode)'
| |-ParmVarDecl 0x7fd74b36fee8 <col:15, col:29> col:29 __s 'const std::__1::string &'
| `-ParmVarDecl 0x7fd74b36ff48 <col:34, col:87> col:53 __mode 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fd74b370090 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1360:16> col:10 close 'void (void)'
| `-AlwaysInlineAttr 0x7fd74b370138 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-AccessSpecDecl 0x7fd74b370180 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1362:1, col:8> col:1 private
|-FieldDecl 0x7fd74b372f48 <line:1363:5, col:43> col:43 __sb_ 'basic_filebuf<std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::traits_type>':'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >'
|-CXXConstructorDecl 0x7fd74b372fb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:135:32> col:32 implicit basic_fstream 'void (const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &)' inline default_delete noexcept-unevaluated 0x7fd74b372fb8
| `-ParmVarDecl 0x7fd74b3730e0 <col:32> col:32 'const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &'
|-CXXMethodDecl 0x7fd74b373148 <col:32, <invalid sloc>> col:32 implicit operator= 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &(const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &)' inline default_delete noexcept-unevaluated 0x7fd74b373148
| `-ParmVarDecl 0x7fd74b373260 <col:32> col:32 'const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &'
`-CXXDestructorDecl 0x7fd74b3732e8 <col:32> col:32 implicit used ~basic_fstream 'void (void) noexcept' inline default
  `-CompoundStmt 0x7fd74b375128 <col:32>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_fstream" = type { %"class.std::__1::basic_iostream.base", %"class.std::__1::basic_filebuf", %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_fstream.base" = type { %"class.std::__1::basic_iostream.base", %"class.std::__1::basic_filebuf" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd74b36d478 <object_model_refined/2_constructors/11_member_initialization_list.cpp:11:1, line:40:1> line:11:8 referenced struct C definition
|-public 'struct B'
|-CXXRecordDecl 0x7fd74b36d5d8 <col:1, col:8> col:8 implicit referenced struct C
|-FieldDecl 0x7fd74b36d688 <line:12:5, col:19> col:19 x 'unsigned char'
|-FieldDecl 0x7fd74b36d6e8 <line:13:5, col:19> col:19 referenced y 'unsigned char'
|-FieldDecl 0x7fd74b36d7b0 <line:14:5, col:16> col:16 referenced m 'std::mutex':'class std::__1::mutex'
|-FieldDecl 0x7fd74b36e6f8 <line:15:5, col:33> col:33 lg 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
|-FieldDecl 0x7fd74b3733c8 <line:16:5, col:18> col:18 f1 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
|-FieldDecl 0x7fd74b373460 <line:17:5, col:18> col:18 f2 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
|-CXXConstructorDecl 0x7fd74b373590 <line:19:5, line:25:21> line:19:5 used C 'void (int)'
| |-ParmVarDecl 0x7fd74b3734c0 <col:7, col:11> col:11 used x 'int'
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7fd74b374850 <col:16, col:21> 'struct B' 'void (int)'
| |   `-IntegerLiteral 0x7fd74b3747d8 <col:18> 'int' 123
| |-CXXCtorInitializer Field 0x7fd74b36d688 'x' 'unsigned char'
| | `-InitListExpr 0x7fd74b374998 <line:20:17, col:47> 'unsigned char'
| |   `-CXXStaticCastExpr 0x7fd74b374920 <col:18, col:46> 'unsigned char' static_cast<unsigned char> <NoOp>
| |     `-ImplicitCastExpr 0x7fd74b374908 <col:45> 'unsigned char' <IntegralCast>
| |       `-ImplicitCastExpr 0x7fd74b3748f0 <col:45> 'int' <LValueToRValue>
| |         `-DeclRefExpr 0x7fd74b3748b0 <col:45> 'int' lvalue ParmVar 0x7fd74b3734c0 'x' 'int'
| |-CXXCtorInitializer Field 0x7fd74b36d6e8 'y' 'unsigned char'
| | `-InitListExpr 0x7fd74b374a70 <line:21:17, col:19> 'unsigned char'
| |   `-ImplicitCastExpr 0x7fd74b374ab0 <col:18> 'unsigned char' <IntegralCast>
| |     `-IntegerLiteral 0x7fd74b374a08 <col:18> 'int' 0
| |-CXXCtorInitializer Field 0x7fd74b36d7b0 'm' 'std::mutex':'class std::__1::mutex'
| | `-CXXConstructExpr 0x7fd74b375098 <line:25:16, col:18> 'std::mutex':'class std::__1::mutex' 'void (void) noexcept' zeroing
| |-CXXCtorInitializer Field 0x7fd74b36e6f8 'lg' 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
| | `-CXXConstructExpr 0x7fd74b374f90 <line:24:16, col:20> 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>' 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |   `-MemberExpr 0x7fd74b374f28 <col:19> 'std::mutex':'class std::__1::mutex' lvalue ->m 0x7fd74b36d7b0
| |     `-CXXThisExpr 0x7fd74b374f10 <col:19> 'struct C *' this
| |-CXXCtorInitializer Field 0x7fd74b3733c8 'f1' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7fd74b374c68 <line:22:16, col:43> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (const char *, class ios_base::openmode)'
| |   |-ImplicitCastExpr 0x7fd74b374c38 <col:19> 'const char *' <ArrayToPointerDecay>
| |   | `-StringLiteral 0x7fd74b374af8 <col:19> 'const char [8]' lvalue "test.cc"
| |   `-ImplicitCastExpr 0x7fd74b374c50 <col:30, col:40> 'std::__1::ios_base::openmode':'unsigned int' <LValueToRValue>
| |     `-DeclRefExpr 0x7fd74b374bb0 <col:30, col:40> 'const std::__1::ios_base::openmode':'const unsigned int' lvalue Var 0x7fd74d9f41c0 'app' 'const std::__1::ios_base::openmode':'const unsigned int'
| |-CXXCtorInitializer Field 0x7fd74b373460 'f2' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7fd74b374ea8 <line:23:16, col:63> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (const char *, class ios_base::openmode)'
| |   |-ImplicitCastExpr 0x7fd74b374e90 <col:19> 'const char *' <ArrayToPointerDecay>
| |   | `-StringLiteral 0x7fd74b374cd0 <col:19> 'const char [9]' lvalue "test.bin"
| |   `-BinaryOperator 0x7fd74b374e30 <col:31, col:60> 'unsigned int' '|'
| |     |-ImplicitCastExpr 0x7fd74b374e00 <col:31, col:41> 'std::__1::ios_base::openmode':'unsigned int' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fd74b374d48 <col:31, col:41> 'const std::__1::ios_base::openmode':'const unsigned int' lvalue Var 0x7fd74d9f43c0 'binary' 'const std::__1::ios_base::openmode':'const unsigned int'
| |     `-ImplicitCastExpr 0x7fd74b374e18 <col:50, col:60> 'std::__1::ios_base::openmode':'unsigned int' <LValueToRValue>
| |       `-DeclRefExpr 0x7fd74b374dc8 <col:50, col:60> 'const std::__1::ios_base::openmode':'const unsigned int' lvalue Var 0x7fd74d9f41c0 'app' 'const std::__1::ios_base::openmode':'const unsigned int'
| `-CompoundStmt 0x7fd74b375140 <line:25:20, col:21>
|-CXXConstructorDecl 0x7fd74b373720 <line:27:5, line:31:22> line:27:5 used C 'void (double)'
| |-ParmVarDecl 0x7fd74b373658 <col:7, col:14> col:14 used a 'double'
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7fd74b3751d0 <line:28:15, col:18> 'struct B' 'void (int)'
| |   `-IntegerLiteral 0x7fd74b375158 <col:17> 'int' 0
| |-CXXCtorInitializer Field 0x7fd74b36d688 'x' 'unsigned char'
| | `-InitListExpr 0x7fd74b375480 <line:30:16, col:18> 'unsigned char'
| |   `-ImplicitCastExpr 0x7fd74b3754c0 <col:17> 'unsigned char' <LValueToRValue>
| |     `-MemberExpr 0x7fd74b375400 <col:17> 'unsigned char' lvalue ->y 0x7fd74b36d6e8
| |       `-CXXThisExpr 0x7fd74b3753e8 <col:17> 'struct C *' this
| |-CXXCtorInitializer Field 0x7fd74b36d6e8 'y' 'unsigned char'
| | `-InitListExpr 0x7fd74b375378 <line:29:16, col:50> 'unsigned char'
| |   `-CXXStaticCastExpr 0x7fd74b375300 <col:17, col:49> 'unsigned char' static_cast<unsigned char> <NoOp>
| |     `-ImplicitCastExpr 0x7fd74b3752e8 <col:44, col:48> 'unsigned char' <FloatingToIntegral>
| |       `-BinaryOperator 0x7fd74b3752a8 <col:44, col:48> 'double' '+'
| |         |-ImplicitCastExpr 0x7fd74b375278 <col:44> 'double' <LValueToRValue>
| |         | `-DeclRefExpr 0x7fd74b375230 <col:44> 'double' lvalue ParmVar 0x7fd74b373658 'a' 'double'
| |         `-ImplicitCastExpr 0x7fd74b375290 <col:48> 'double' <IntegralToFloating>
| |           `-IntegerLiteral 0x7fd74b375258 <col:48> 'int' 1
| |-CXXCtorInitializer Field 0x7fd74b36d7b0 'm' 'std::mutex':'class std::__1::mutex'
| | `-CXXConstructExpr 0x7fd74b375600 <line:27:5> 'std::mutex':'class std::__1::mutex' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7fd74b36e6f8 'lg' 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
| | `-CXXConstructExpr 0x7fd74b3755a0 <line:31:15, col:19> 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>' 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |   `-MemberExpr 0x7fd74b375520 <col:18> 'std::mutex':'class std::__1::mutex' lvalue ->m 0x7fd74b36d7b0
| |     `-CXXThisExpr 0x7fd74b375508 <col:18> 'struct C *' this
| |-CXXCtorInitializer Field 0x7fd74b3733c8 'f1' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7fd74b375658 <line:27:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| |-CXXCtorInitializer Field 0x7fd74b373460 'f2' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7fd74b3756b0 <col:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| `-CompoundStmt 0x7fd74b375740 <line:31:21, col:22>
|-CXXConstructorDecl 0x7fd74b3737f0 <line:33:5, line:39:18> line:33:5 used C 'void (void)'
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7fd74b3757d0 <line:35:15, col:20> 'struct B' 'void (int)'
| |   `-IntegerLiteral 0x7fd74b375758 <col:17> 'int' 789
| |-CXXCtorInitializer Field 0x7fd74b36d688 'x' 'unsigned char'
| | `-InitListExpr 0x7fd74b375898 <line:36:16, col:18> 'unsigned char'
| |   `-ImplicitCastExpr 0x7fd74b3758d8 <col:17> 'unsigned char' <IntegralCast>
| |     `-IntegerLiteral 0x7fd74b375830 <col:17> 'int' 0
| |-CXXCtorInitializer Field 0x7fd74b36d6e8 'y' 'unsigned char'
| | `-InitListExpr 0x7fd74b375988 <line:37:16, col:18> 'unsigned char'
| |   `-ImplicitCastExpr 0x7fd74b3759c8 <col:17> 'unsigned char' <IntegralCast>
| |     `-IntegerLiteral 0x7fd74b375920 <col:17> 'int' 0
| |-CXXCtorInitializer Field 0x7fd74b36d7b0 'm' 'std::mutex':'class std::__1::mutex'
| | `-CXXConstructExpr 0x7fd74b375b08 <line:33:5> 'std::mutex':'class std::__1::mutex' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7fd74b36e6f8 'lg' 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
| | `-CXXConstructExpr 0x7fd74b375aa8 <line:38:15, col:19> 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>' 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |   `-MemberExpr 0x7fd74b375a28 <col:18> 'std::mutex':'class std::__1::mutex' lvalue ->m 0x7fd74b36d7b0
| |     `-CXXThisExpr 0x7fd74b375a10 <col:18> 'struct C *' this
| |-CXXCtorInitializer Field 0x7fd74b3733c8 'f1' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7fd74b375b60 <line:33:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| |-CXXCtorInitializer Field 0x7fd74b373460 'f2' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7fd74b375bb8 <col:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| `-CXXTryStmt 0x7fd74b375c90 <line:34:5, line:39:18>
|   |-CompoundStmt 0x7fd74b375c48 <line:38:21, col:22>
|   `-CXXCatchStmt 0x7fd74b375c78 <line:39:5, col:18>
|     |-<<<NULL>>>
|     `-CompoundStmt 0x7fd74b375c60 <col:17, col:18>
|-CXXConstructorDecl 0x7fd74b373c48 <line:11:8> col:8 implicit C 'void (const struct C &)' inline default_delete noexcept-unevaluated 0x7fd74b373c48
| `-ParmVarDecl 0x7fd74b373d70 <col:8> col:8 'const struct C &'
|-CXXConstructorDecl 0x7fd74b373ee8 <col:8> col:8 implicit C 'void (struct C &&)' inline default_delete noexcept-unevaluated 0x7fd74b373ee8
| `-ParmVarDecl 0x7fd74b374010 <col:8> col:8 'struct C &&'
|-CXXMethodDecl 0x7fd74b3740a8 <col:8, <invalid sloc>> col:8 implicit operator= 'struct C &(const struct C &)' inline default_delete noexcept-unevaluated 0x7fd74b3740a8
| `-ParmVarDecl 0x7fd74b3741c0 <col:8> col:8 'const struct C &'
|-CXXMethodDecl 0x7fd74b374558 <col:8, <invalid sloc>> col:8 implicit operator= 'struct C &(struct C &&)' inline default_delete noexcept-unevaluated 0x7fd74b374558
| `-ParmVarDecl 0x7fd74b374670 <col:8> col:8 'struct C &&'
`-CXXDestructorDecl 0x7fd74b3746f8 <col:8> col:8 implicit used ~C 'void (void) noexcept' inline default
  `-CompoundStmt 0x7fd74b375e50 <col:8>

Layout: <CGRecordLayout
  LLVMType:%struct.C = type { %struct.B, i8, i8, %"class.std::__1::mutex", %"class.std::__1::lock_guard", %"class.std::__1::basic_fstream", %"class.std::__1::basic_fstream" }
  NonVirtualBaseLLVMType:%struct.C = type { %struct.B, i8, i8, %"class.std::__1::mutex", %"class.std::__1::lock_guard", %"class.std::__1::basic_fstream", %"class.std::__1::basic_fstream" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1225:9)
         0 |   struct std::__1::_PairT __t
         0 |     size_t first
         8 |     size_t second
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__murmur2_or_cityhash<unsigned long, 64> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1190:9)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1208:9)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |       union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw
