
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__scalar_hash<struct std::__1::_PairT, 2> (empty)
         0 |   struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1509:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<unsigned long, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1000000000, 1>, false, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_mutex_t
         0 |   long __sig
         8 |   char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_cond_t
         0 |   long __sig
         8 |   char [40] __opaque
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1, 1>, true, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::once_flag
         0 |   unsigned long __state_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale::id
         0 |   struct std::__1::once_flag __flag_
         0 |     unsigned long __state_
         8 |   int32_t __id_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__basic_string_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (empty)
         0 |   class std::__1::allocator<char> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<char>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |       class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false>
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<wchar_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (empty)
         0 |   class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> >
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false> (base)
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |           union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<wchar_t>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> > __r_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false> (base)
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |             union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (base) (empty)
         0 |       class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::money_base::pattern
         0 |   char [4] field
           | [sizeof=4, dsize=4, align=1,
           |  nvsize=4, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<long, long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >
         0 |   std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >::__storage_pointer __seg_
         8 |   std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >::__storage_type __mask_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__bitset<0, 0> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct B
         0 |   int n
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | class std::__1::mutex
         0 |   struct _opaque_pthread_mutex_t __m_
         0 |     long __sig
         8 |     char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::lock_guard<class std::__1::mutex>
         0 |   std::__1::lock_guard<class std::__1::mutex>::mutex_type & __m_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::ios_base
         0 |   (ios_base vtable pointer)
         8 |   std::__1::ios_base::fmtflags __fmtflags_
        16 |   std::__1::streamsize __precision_
        24 |   std::__1::streamsize __width_
        32 |   std::__1::ios_base::iostate __rdstate_
        36 |   std::__1::ios_base::iostate __exceptions_
        40 |   void * __rdbuf_
        48 |   void * __loc_
        56 |   std::__1::ios_base::event_callback * __fn_
        64 |   int * __index_
        72 |   size_t __event_size_
        80 |   size_t __event_cap_
        88 |   long * __iarray_
        96 |   size_t __iarray_size_
       104 |   size_t __iarray_cap_
       112 |   void ** __parray_
       120 |   size_t __parray_size_
       128 |   size_t __parray_cap_
           | [sizeof=136, dsize=136, align=8,
           |  nvsize=136, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ios<char>
         0 |   class std::__1::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     std::__1::ios_base::fmtflags __fmtflags_
        16 |     std::__1::streamsize __precision_
        24 |     std::__1::streamsize __width_
        32 |     std::__1::ios_base::iostate __rdstate_
        36 |     std::__1::ios_base::iostate __exceptions_
        40 |     void * __rdbuf_
        48 |     void * __loc_
        56 |     std::__1::ios_base::event_callback * __fn_
        64 |     int * __index_
        72 |     size_t __event_size_
        80 |     size_t __event_cap_
        88 |     long * __iarray_
        96 |     size_t __iarray_size_
       104 |     size_t __iarray_cap_
       112 |     void ** __parray_
       120 |     size_t __parray_size_
       128 |     size_t __parray_cap_
       136 |   basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       144 |   std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=152, dsize=148, align=8,
           |  nvsize=148, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_istream<char>
         0 |   (basic_istream vtable pointer)
         8 |   std::__1::streamsize __gc_
        16 |   class std::__1::basic_ios<char> (virtual base)
        16 |     class std::__1::ios_base (primary base)
        16 |       (ios_base vtable pointer)
        24 |       std::__1::ios_base::fmtflags __fmtflags_
        32 |       std::__1::streamsize __precision_
        40 |       std::__1::streamsize __width_
        48 |       std::__1::ios_base::iostate __rdstate_
        52 |       std::__1::ios_base::iostate __exceptions_
        56 |       void * __rdbuf_
        64 |       void * __loc_
        72 |       std::__1::ios_base::event_callback * __fn_
        80 |       int * __index_
        88 |       size_t __event_size_
        96 |       size_t __event_cap_
       104 |       long * __iarray_
       112 |       size_t __iarray_size_
       120 |       size_t __iarray_cap_
       128 |       void ** __parray_
       136 |       size_t __parray_size_
       144 |       size_t __parray_cap_
       152 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       160 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=168, dsize=164, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ostream<char>
         0 |   (basic_ostream vtable pointer)
         8 |   class std::__1::basic_ios<char> (virtual base)
         8 |     class std::__1::ios_base (primary base)
         8 |       (ios_base vtable pointer)
        16 |       std::__1::ios_base::fmtflags __fmtflags_
        24 |       std::__1::streamsize __precision_
        32 |       std::__1::streamsize __width_
        40 |       std::__1::ios_base::iostate __rdstate_
        44 |       std::__1::ios_base::iostate __exceptions_
        48 |       void * __rdbuf_
        56 |       void * __loc_
        64 |       std::__1::ios_base::event_callback * __fn_
        72 |       int * __index_
        80 |       size_t __event_size_
        88 |       size_t __event_cap_
        96 |       long * __iarray_
       104 |       size_t __iarray_size_
       112 |       size_t __iarray_cap_
       120 |       void ** __parray_
       128 |       size_t __parray_size_
       136 |       size_t __parray_cap_
       144 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       152 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=160, dsize=156, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_iostream<char>
         0 |   class std::__1::basic_istream<char> (primary base)
         0 |     (basic_istream vtable pointer)
         8 |     std::__1::streamsize __gc_
        16 |   class std::__1::basic_ostream<char> (base)
        16 |     (basic_ostream vtable pointer)
        24 |   class std::__1::basic_ios<char> (virtual base)
        24 |     class std::__1::ios_base (primary base)
        24 |       (ios_base vtable pointer)
        32 |       std::__1::ios_base::fmtflags __fmtflags_
        40 |       std::__1::streamsize __precision_
        48 |       std::__1::streamsize __width_
        56 |       std::__1::ios_base::iostate __rdstate_
        60 |       std::__1::ios_base::iostate __exceptions_
        64 |       void * __rdbuf_
        72 |       void * __loc_
        80 |       std::__1::ios_base::event_callback * __fn_
        88 |       int * __index_
        96 |       size_t __event_size_
       104 |       size_t __event_cap_
       112 |       long * __iarray_
       120 |       size_t __iarray_size_
       128 |       size_t __iarray_cap_
       136 |       void ** __parray_
       144 |       size_t __parray_size_
       152 |       size_t __parray_cap_
       160 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       168 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=176, dsize=172, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale
         0 |   class std::__1::locale::__imp * __locale_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_streambuf<char>
         0 |   (basic_streambuf vtable pointer)
         8 |   class std::__1::locale __loc_
         8 |     class std::__1::locale::__imp * __locale_
        16 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        24 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        32 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        40 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        48 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        56 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | __mbstate_t
         0 |   char [128] __mbstate8
         0 |   long long _mbstateL
           | [sizeof=128, dsize=128, align=8,
           |  nvsize=128, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >
         0 |   class std::__1::basic_streambuf<char> (primary base)
         0 |     (basic_streambuf vtable pointer)
         8 |     class std::__1::locale __loc_
         8 |       class std::__1::locale::__imp * __locale_
        16 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        24 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        32 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        40 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        48 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        56 |     std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
        64 |   char * __extbuf_
        72 |   const char * __extbufnext_
        80 |   const char * __extbufend_
        88 |   char [8] __extbuf_min_
        96 |   size_t __ebs_
       104 |   std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       112 |   size_t __ibs_
       120 |   FILE * __file_
       128 |   const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       136 |   __mbstate_t __st_
       136 |     char [128] __mbstate8
       136 |     long long _mbstateL
       264 |   __mbstate_t __st_last_
       264 |     char [128] __mbstate8
       264 |     long long _mbstateL
       392 |   class ios_base::openmode __om_
       396 |   class ios_base::openmode __cm_
       400 |   _Bool __owns_eb_
       401 |   _Bool __owns_ib_
       402 |   _Bool __always_noconv_
           | [sizeof=408, dsize=403, align=8,
           |  nvsize=403, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >
         0 |   class std::__1::basic_iostream<char> (primary base)
         0 |     class std::__1::basic_istream<char> (primary base)
         0 |       (basic_istream vtable pointer)
         8 |       std::__1::streamsize __gc_
        16 |     class std::__1::basic_ostream<char> (base)
        16 |       (basic_ostream vtable pointer)
        24 |   class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > __sb_
        24 |     class std::__1::basic_streambuf<char> (primary base)
        24 |       (basic_streambuf vtable pointer)
        32 |       class std::__1::locale __loc_
        32 |         class std::__1::locale::__imp * __locale_
        40 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        48 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        56 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        64 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        72 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        80 |       std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
        88 |     char * __extbuf_
        96 |     const char * __extbufnext_
       104 |     const char * __extbufend_
       112 |     char [8] __extbuf_min_
       120 |     size_t __ebs_
       128 |     std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       136 |     size_t __ibs_
       144 |     FILE * __file_
       152 |     const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       160 |     __mbstate_t __st_
       160 |       char [128] __mbstate8
       160 |       long long _mbstateL
       288 |     __mbstate_t __st_last_
       288 |       char [128] __mbstate8
       288 |       long long _mbstateL
       416 |     class ios_base::openmode __om_
       420 |     class ios_base::openmode __cm_
       424 |     _Bool __owns_eb_
       425 |     _Bool __owns_ib_
       426 |     _Bool __always_noconv_
       432 |   class std::__1::basic_ios<char> (virtual base)
       432 |     class std::__1::ios_base (primary base)
       432 |       (ios_base vtable pointer)
       440 |       std::__1::ios_base::fmtflags __fmtflags_
       448 |       std::__1::streamsize __precision_
       456 |       std::__1::streamsize __width_
       464 |       std::__1::ios_base::iostate __rdstate_
       468 |       std::__1::ios_base::iostate __exceptions_
       472 |       void * __rdbuf_
       480 |       void * __loc_
       488 |       std::__1::ios_base::event_callback * __fn_
       496 |       int * __index_
       504 |       size_t __event_size_
       512 |       size_t __event_cap_
       520 |       long * __iarray_
       528 |       size_t __iarray_size_
       536 |       size_t __iarray_cap_
       544 |       void ** __parray_
       552 |       size_t __parray_size_
       560 |       size_t __parray_cap_
       568 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       576 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=584, dsize=580, align=8,
           |  nvsize=432, nvalign=8]

*** Dumping AST Record Layout
         0 | struct C
         0 |   struct B (base)
         0 |     int n
         4 |   unsigned char x
         5 |   unsigned char y
         8 |   class std::__1::mutex m
         8 |     struct _opaque_pthread_mutex_t __m_
         8 |       long __sig
        16 |       char [56] __opaque
        72 |   class std::__1::lock_guard<class std::__1::mutex> lg
        72 |     std::__1::lock_guard<class std::__1::mutex>::mutex_type & __m_
        80 |   class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > f1
        80 |     class std::__1::basic_iostream<char> (primary base)
        80 |       class std::__1::basic_istream<char> (primary base)
        80 |         (basic_istream vtable pointer)
        88 |         std::__1::streamsize __gc_
        96 |       class std::__1::basic_ostream<char> (base)
        96 |         (basic_ostream vtable pointer)
       104 |     class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > __sb_
       104 |       class std::__1::basic_streambuf<char> (primary base)
       104 |         (basic_streambuf vtable pointer)
       112 |         class std::__1::locale __loc_
       112 |           class std::__1::locale::__imp * __locale_
       120 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
       128 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
       136 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
       144 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
       152 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
       160 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
       168 |       char * __extbuf_
       176 |       const char * __extbufnext_
       184 |       const char * __extbufend_
       192 |       char [8] __extbuf_min_
       200 |       size_t __ebs_
       208 |       std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       216 |       size_t __ibs_
       224 |       FILE * __file_
       232 |       const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       240 |       __mbstate_t __st_
       240 |         char [128] __mbstate8
       240 |         long long _mbstateL
       368 |       __mbstate_t __st_last_
       368 |         char [128] __mbstate8
       368 |         long long _mbstateL
       496 |       class ios_base::openmode __om_
       500 |       class ios_base::openmode __cm_
       504 |       _Bool __owns_eb_
       505 |       _Bool __owns_ib_
       506 |       _Bool __always_noconv_
       512 |     class std::__1::basic_ios<char> (virtual base)
       512 |       class std::__1::ios_base (primary base)
       512 |         (ios_base vtable pointer)
       520 |         std::__1::ios_base::fmtflags __fmtflags_
       528 |         std::__1::streamsize __precision_
       536 |         std::__1::streamsize __width_
       544 |         std::__1::ios_base::iostate __rdstate_
       548 |         std::__1::ios_base::iostate __exceptions_
       552 |         void * __rdbuf_
       560 |         void * __loc_
       568 |         std::__1::ios_base::event_callback * __fn_
       576 |         int * __index_
       584 |         size_t __event_size_
       592 |         size_t __event_cap_
       600 |         long * __iarray_
       608 |         size_t __iarray_size_
       616 |         size_t __iarray_cap_
       624 |         void ** __parray_
       632 |         size_t __parray_size_
       640 |         size_t __parray_cap_
       648 |       basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       656 |       std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
       664 |   class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > f2
       664 |     class std::__1::basic_iostream<char> (primary base)
       664 |       class std::__1::basic_istream<char> (primary base)
       664 |         (basic_istream vtable pointer)
       672 |         std::__1::streamsize __gc_
       680 |       class std::__1::basic_ostream<char> (base)
       680 |         (basic_ostream vtable pointer)
       688 |     class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > __sb_
       688 |       class std::__1::basic_streambuf<char> (primary base)
       688 |         (basic_streambuf vtable pointer)
       696 |         class std::__1::locale __loc_
       696 |           class std::__1::locale::__imp * __locale_
       704 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
       712 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
       720 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
       728 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
       736 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
       744 |         std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
       752 |       char * __extbuf_
       760 |       const char * __extbufnext_
       768 |       const char * __extbufend_
       776 |       char [8] __extbuf_min_
       784 |       size_t __ebs_
       792 |       std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type * __intbuf_
       800 |       size_t __ibs_
       808 |       FILE * __file_
       816 |       const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> * __cv_
       824 |       __mbstate_t __st_
       824 |         char [128] __mbstate8
       824 |         long long _mbstateL
       952 |       __mbstate_t __st_last_
       952 |         char [128] __mbstate8
       952 |         long long _mbstateL
      1080 |       class ios_base::openmode __om_
      1084 |       class ios_base::openmode __cm_
      1088 |       _Bool __owns_eb_
      1089 |       _Bool __owns_ib_
      1090 |       _Bool __always_noconv_
      1096 |     class std::__1::basic_ios<char> (virtual base)
      1096 |       class std::__1::ios_base (primary base)
      1096 |         (ios_base vtable pointer)
      1104 |         std::__1::ios_base::fmtflags __fmtflags_
      1112 |         std::__1::streamsize __precision_
      1120 |         std::__1::streamsize __width_
      1128 |         std::__1::ios_base::iostate __rdstate_
      1132 |         std::__1::ios_base::iostate __exceptions_
      1136 |         void * __rdbuf_
      1144 |         void * __loc_
      1152 |         std::__1::ios_base::event_callback * __fn_
      1160 |         int * __index_
      1168 |         size_t __event_size_
      1176 |         size_t __event_cap_
      1184 |         long * __iarray_
      1192 |         size_t __iarray_size_
      1200 |         size_t __iarray_cap_
      1208 |         void ** __parray_
      1216 |         size_t __parray_size_
      1224 |         size_t __parray_cap_
      1232 |       basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
      1240 |       std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=1248, dsize=1248, align=8,
           |  nvsize=1248, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc81dd58bc8 </Users/tskull/Documents/Programming/Cpp/object_model_refined/2_constructors/11_member_initialization_list.cpp:5:1, line:9:1> line:5:8 referenced struct B definition
|-CXXRecordDecl 0x7fc81dd58ce8 <col:1, col:8> col:8 implicit referenced struct B
|-FieldDecl 0x7fc81dd58d98 <line:6:5, col:9> col:9 n 'int'
|-CXXConstructorDecl 0x7fc81dd58ed0 <line:8:5, col:22> col:5 used B 'void (int)'
| |-ParmVarDecl 0x7fc81dd58df8 <col:7, col:11> col:11 used n 'int'
| |-CXXCtorInitializer Field 0x7fc81dd58d98 'n' 'int'
| | `-ImplicitCastExpr 0x7fc81dd58ff8 <col:18> 'int' <LValueToRValue>
| |   `-DeclRefExpr 0x7fc81dd58fa0 <col:18> 'int' lvalue ParmVar 0x7fc81dd58df8 'n' 'int'
| `-CompoundStmt 0x7fc81dd59040 <col:21, col:22>
|-CXXConstructorDecl 0x7fc81dd5f4d8 <line:5:8> col:8 implicit constexpr B 'void (const struct B &)' inline default trivial noexcept-unevaluated 0x7fc81dd5f4d8
| `-ParmVarDecl 0x7fc81dd5f600 <col:8> col:8 'const struct B &'
|-CXXConstructorDecl 0x7fc81dd5f698 <col:8> col:8 implicit constexpr B 'void (struct B &&)' inline default trivial noexcept-unevaluated 0x7fc81dd5f698
| `-ParmVarDecl 0x7fc81dd5f7c0 <col:8> col:8 'struct B &&'
|-CXXDestructorDecl 0x7fc81dd5f9b8 <col:8> col:8 implicit ~B 'void (void) noexcept' inline default trivial
|-CXXMethodDecl 0x7fc81dd5fe38 <col:8, <invalid sloc>> col:8 implicit operator= 'struct B &(const struct B &)' inline default trivial noexcept-unevaluated 0x7fc81dd5fe38
| `-ParmVarDecl 0x7fc81dd5ff50 <col:8> col:8 'const struct B &'
`-CXXMethodDecl 0x7fc81dd5ffb8 <col:8, <invalid sloc>> col:8 implicit operator= 'struct B &(struct B &&)' inline default trivial noexcept-unevaluated 0x7fc81dd5ffb8
  `-ParmVarDecl 0x7fc81dd600d0 <col:8> col:8 'struct B &&'

Layout: <CGRecordLayout
  LLVMType:%struct.B = type { i32 }
  NonVirtualBaseLLVMType:%struct.B = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc81e80dac0 </usr/include/sys/_pthread/_pthread_types.h:78:1, line:81:1> line:78:8 struct _opaque_pthread_mutex_t definition
|-CXXRecordDecl 0x7fc81e80dbe8 <col:1, col:8> col:8 implicit struct _opaque_pthread_mutex_t
|-FieldDecl 0x7fc81e80dc98 <line:79:2, col:7> col:7 __sig 'long'
|-FieldDecl 0x7fc81e80dd20 <line:80:2, col:38> col:7 __opaque 'char [56]'
`-CXXDestructorDecl 0x7fc81eba24f8 <line:78:8> col:8 implicit ~_opaque_pthread_mutex_t 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%struct._opaque_pthread_mutex_t = type { i64, [56 x i8] }
  NonVirtualBaseLLVMType:%struct._opaque_pthread_mutex_t = type { i64, [56 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc81eba1768 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:40:1, line:68:1> line:40:78 referenced class mutex definition
|-VisibilityAttr 0x7fc81eba1888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fc81eba18d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:40:1, col:78> col:78 implicit referenced class mutex
|-FieldDecl 0x7fc81eba1978 <line:43:5, /usr/include/pthread.h:182:64> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:43:22 referenced __m_ 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
| `-InitListExpr 0x7fc81eba26b0 </usr/include/pthread.h:182:35, col:64> 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
|   |-ImplicitCastExpr 0x7fc81eba2700 </usr/include/pthread_impl.h:41:34> 'long' <IntegralCast>
|   | `-IntegerLiteral 0x7fc81eba25d8 <col:34> 'int' 850045863
|   `-InitListExpr 0x7fc81eba2718 </usr/include/pthread.h:182:61, col:63> 'char [56]'
|     |-array filler
|     | `-ImplicitValueInitExpr 0x7fc81eba2778 <<invalid sloc>> 'char'
|     `-ImplicitCastExpr 0x7fc81eba2758 <col:62> 'char' <IntegralCast>
|       `-IntegerLiteral 0x7fc81eba25f8 <col:62> 'int' 0
|-AccessSpecDecl 0x7fc81eba19c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:48:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fc81eba1a88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:51:31> col:15 used constexpr mutex 'void (void) noexcept' default
| |-CXXCtorInitializer Field 0x7fc81eba1978 '__m_' 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
| | `-CXXDefaultInitExpr 0x7fc81dd60c10 <col:15> 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t'
| |-CompoundStmt 0x7fc81dd60c60 <col:31>
| |-AlwaysInlineAttr 0x7fc81eba1b30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81eba1b78 <col:51, col:74> Hidden
|-CXXDestructorDecl 0x7fc81eba1bd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:55:5, col:12> col:5 used ~mutex 'void (void) noexcept'
|-AccessSpecDecl 0x7fc81eba1c78 <line:57:1, col:8> col:1 private
|-CXXConstructorDecl 0x7fc81eba1da0 <line:58:5, col:23> col:5 mutex 'void (const class std::__1::mutex &)'
| `-ParmVarDecl 0x7fc81eba1cd8 <col:11, col:22> col:23 'const class std::__1::mutex &'
|-CXXMethodDecl 0x7fc81eba1f50 <line:59:5, col:34> col:12 operator= 'class std::__1::mutex &(const class std::__1::mutex &)'
| `-ParmVarDecl 0x7fc81eba1e60 <col:22, col:33> col:34 'const class std::__1::mutex &'
|-AccessSpecDecl 0x7fc81eba1ff0 <line:61:1, col:7> col:1 public
|-CXXMethodDecl 0x7fc81eba2038 <line:62:5, col:15> col:10 lock 'void (void)'
|-CXXMethodDecl 0x7fc81eba20f8 <line:63:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:63:10 try_lock '_Bool (void) noexcept'
|-CXXMethodDecl 0x7fc81eba21b8 <line:64:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:64:10 unlock 'void (void) noexcept'
|-TypedefDecl 0x7fc81eba2260 <line:66:5, col:31> col:31 referenced native_handle_type 'std::__1::__libcpp_mutex_t *'
| `-PointerType 0x7fc81dc86160 'std::__1::__libcpp_mutex_t *'
|   `-TypedefType 0x7fc81dc86140 'std::__1::__libcpp_mutex_t' sugar
|     |-Typedef 0x7fc81dc85458 '__libcpp_mutex_t'
|     `-TypedefType 0x7fc81e2780d0 'pthread_mutex_t' sugar
|       |-Typedef 0x7fc81e2703b0 'pthread_mutex_t'
|       `-TypedefType 0x7fc81e270380 '__darwin_pthread_mutex_t' sugar
|         |-Typedef 0x7fc81e810780 '__darwin_pthread_mutex_t'
|         `-ElaboratedType 0x7fc81e810730 'struct _opaque_pthread_mutex_t' sugar
|           `-RecordType 0x7fc81e80db60 'struct _opaque_pthread_mutex_t'
|             `-CXXRecord 0x7fc81e80dac0 '_opaque_pthread_mutex_t'
`-CXXMethodDecl 0x7fc81eba2390 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:67:80> col:50 native_handle 'std::__1::mutex::native_handle_type (void)'
  |-CompoundStmt 0x7fc81eba28d8 <col:66, col:80>
  | `-ReturnStmt 0x7fc81eba28c0 <col:67, col:75>
  |   `-UnaryOperator 0x7fc81eba28a0 <col:74, col:75> 'std::__1::__libcpp_mutex_t *' prefix '&'
  |     `-MemberExpr 0x7fc81eba2868 <col:75> 'std::__1::__libcpp_mutex_t':'struct _opaque_pthread_mutex_t' lvalue ->__m_ 0x7fc81eba1978
  |       `-CXXThisExpr 0x7fc81eba2850 <col:75> 'class std::__1::mutex *' this
  |-AlwaysInlineAttr 0x7fc81eba2428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
  `-VisibilityAttr 0x7fc81eba2470 <col:51, col:74> Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::mutex" = type { %struct._opaque_pthread_mutex_t }
  NonVirtualBaseLLVMType:%"class.std::__1::mutex" = type { %struct._opaque_pthread_mutex_t }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc81dd59448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:91:1, line:114:1> line:93:1 class lock_guard definition
|-TemplateArgument type 'class std::__1::mutex'
|-CXXRecordDecl 0x7fc81dd596c0 prev 0x7fc81dd59448 <line:92:1, line:93:1> col:1 implicit class lock_guard
|-AccessSpecDecl 0x7fc81dd59758 <line:95:1, col:7> col:1 public
|-TypedefDecl 0x7fc81dd597b8 <line:96:5, col:20> col:20 mutex_type 'class std::__1::mutex':'class std::__1::mutex'
| `-SubstTemplateTypeParmType 0x7fc81dd59780 'class std::__1::mutex' sugar
|   |-TemplateTypeParmType 0x7fc81eba5eb0 '_Mutex' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fc81eba5e70 '_Mutex'
|   `-RecordType 0x7fc81eba1800 'class std::__1::mutex'
|     `-CXXRecord 0x7fc81eba1768 'mutex'
|-AccessSpecDecl 0x7fc81dd59810 <line:98:1, col:8> col:1 private
|-FieldDecl 0x7fc81dd59898 <line:99:5, col:17> col:17 __m_ 'std::__1::lock_guard<class std::__1::mutex>::mutex_type &'
|-AccessSpecDecl 0x7fc81dd598e0 <line:100:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fc81dd59a20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:104:34> line:103:14 used lock_guard 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |-ParmVarDecl 0x7fc81dd59918 <col:25, col:37> col:37 __m 'std::__1::lock_guard<class std::__1::mutex>::mutex_type &'
| `-AlwaysInlineAttr 0x7fc81dd59b08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc81dd59cb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:107:22> line:106:5 lock_guard 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &, struct std::__1::adopt_lock_t)'
| |-ParmVarDecl 0x7fc81dd59b60 <col:16, col:28> col:28 __m 'std::__1::lock_guard<class std::__1::mutex>::mutex_type &'
| |-ParmVarDecl 0x7fc81dd59bc0 <col:33> col:45 'struct std::__1::adopt_lock_t'
| `-AlwaysInlineAttr 0x7fc81dd59d78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fc81dd59df0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:109:89> col:5 used ~lock_guard 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fc81dd59ea0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7fc81dd59ee8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:111:1, col:8> col:1 private
|-CXXConstructorDecl 0x7fc81dd5a030 <line:112:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:824:37> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:112:5 lock_guard 'void (const class std::__1::lock_guard<class std::__1::mutex> &)' delete trivial
| `-ParmVarDecl 0x7fc81dd59f48 <col:16, col:32> col:33 'const class std::__1::lock_guard<class std::__1::mutex> &'
`-CXXMethodDecl 0x7fc81dd5a1f0 <line:113:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:824:37> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__mutex_base:113:17 operator= 'class std::__1::lock_guard<class std::__1::mutex> &(const class std::__1::lock_guard<class std::__1::mutex> &)' delete trivial
  `-ParmVarDecl 0x7fc81dd5a128 <col:27, col:43> col:44 'const class std::__1::lock_guard<class std::__1::mutex> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::lock_guard" = type { %"class.std::__1::mutex"* }
  NonVirtualBaseLLVMType:%"class.std::__1::lock_guard" = type { %"class.std::__1::mutex"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc81ec7d530 prev 0x7fc81f05cd20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, line:386:1> line:231:24 referenced class ios_base definition
|-VisibilityAttr 0x7fc81ec7d630 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fc81ec7d678 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, col:24> col:24 implicit referenced class ios_base
|-AccessSpecDecl 0x7fc81ec7d710 <line:233:1, col:7> col:1 public
|-CXXRecordDecl 0x7fc81ec7d768 <line:234:5, col:33> col:33 class failure
| `-VisibilityAttr 0x7fc81ec7d820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:701:47, col:71> Default
|-TypedefDecl 0x7fc81ec7d880 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:236:5, col:26> col:26 referenced fmtflags 'unsigned int'
| `-BuiltinType 0x7fc81d833c60 'unsigned int'
|-VarDecl 0x7fc81ec7d910 <line:237:5, col:41> col:27 referenced boolalpha 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7d990 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7d970 <col:41> 'int' 1
|-VarDecl 0x7fc81ec7da10 <line:238:5, col:41> col:27 referenced dec 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7da90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7da70 <col:41> 'int' 2
|-VarDecl 0x7fc81ec7db10 <line:239:5, col:41> col:27 referenced fixed 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7db90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7db70 <col:41> 'int' 4
|-VarDecl 0x7fc81ec7dc10 <line:240:5, col:41> col:27 referenced hex 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7dc90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7dc70 <col:41> 'int' 8
|-VarDecl 0x7fc81ec7dd10 <line:241:5, col:41> col:27 referenced internal 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7dd90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7dd70 <col:41> 'int' 16
|-VarDecl 0x7fc81ec7de10 <line:242:5, col:41> col:27 referenced left 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7de90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7de70 <col:41> 'int' 32
|-VarDecl 0x7fc81ec7df10 <line:243:5, col:41> col:27 referenced oct 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7df90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7df70 <col:41> 'int' 64
|-VarDecl 0x7fc81ec7e010 <line:244:5, col:41> col:27 referenced right 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7e090 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7e070 <col:41> 'int' 128
|-VarDecl 0x7fc81ec7e110 <line:245:5, col:41> col:27 referenced scientific 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7e190 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7e170 <col:41> 'int' 256
|-VarDecl 0x7fc81ec7e210 <line:246:5, col:41> col:27 referenced showbase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7e290 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7e270 <col:41> 'int' 512
|-VarDecl 0x7fc81ec7e310 <line:247:5, col:41> col:27 referenced showpoint 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7e390 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7e370 <col:41> 'int' 1024
|-VarDecl 0x7fc81ec7e410 <line:248:5, col:41> col:27 referenced showpos 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7e490 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7e470 <col:41> 'int' 2048
|-VarDecl 0x7fc81ec7e510 <line:249:5, col:41> col:27 referenced skipws 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7e590 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7e570 <col:41> 'int' 4096
|-VarDecl 0x7fc81ec7e610 <line:250:5, col:41> col:27 referenced unitbuf 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7e690 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7e670 <col:41> 'int' 8192
|-VarDecl 0x7fc81ec7e710 <line:251:5, col:41> col:27 referenced uppercase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7e790 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7e770 <col:41> 'int' 16384
|-VarDecl 0x7fc81ec7e810 <line:252:5, col:56> col:27 referenced adjustfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7fc81ec7e958 <col:41, col:56> 'unsigned int' '|'
|   |-BinaryOperator 0x7fc81ec7e8f0 <col:41, col:48> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7fc81ec7e8c0 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7fc81ec7e870 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fc81ec7de10 'left' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7fc81ec7e8d8 <col:48> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7fc81ec7e898 <col:48> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fc81ec7e010 'right' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7fc81ec7e940 <col:56> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fc81ec7e918 <col:56> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fc81ec7dd10 'internal' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7fc81ec7e9e8 <line:253:5, col:53> col:27 referenced basefield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7fc81ec7eb30 <col:41, col:53> 'unsigned int' '|'
|   |-BinaryOperator 0x7fc81ec7eac8 <col:41, col:47> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7fc81ec7ea98 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7fc81ec7ea48 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fc81ec7da10 'dec' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7fc81ec7eab0 <col:47> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7fc81ec7ea70 <col:47> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fc81ec7df10 'oct' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7fc81ec7eb18 <col:53> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fc81ec7eaf0 <col:53> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fc81ec7dc10 'hex' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7fc81ec7ebc0 <line:254:5, col:54> col:27 referenced floatfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7fc81ec7eca0 <col:41, col:54> 'unsigned int' '|'
|   |-ImplicitCastExpr 0x7fc81ec7ec70 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | `-DeclRefExpr 0x7fc81ec7ec20 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fc81ec7e110 'scientific' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7fc81ec7ec88 <col:54> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fc81ec7ec48 <col:54> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fc81ec7db10 'fixed' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-TypedefDecl 0x7fc81ec7ed38 <line:256:5, col:26> col:26 referenced iostate 'unsigned int'
| `-BuiltinType 0x7fc81d833c60 'unsigned int'
|-VarDecl 0x7fc81ec7edc0 <line:257:5, col:36> col:26 referenced badbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7ee40 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7ee20 <col:36> 'int' 1
|-VarDecl 0x7fc81ec7eec0 <line:258:5, col:36> col:26 referenced eofbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7ef40 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7ef20 <col:36> 'int' 2
|-VarDecl 0x7fc81ec7efc0 <line:259:5, col:36> col:26 referenced failbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7f040 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7f020 <col:36> 'int' 4
|-VarDecl 0x7fc81ec7f0c0 <line:260:5, col:36> col:26 referenced goodbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7f140 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7f120 <col:36> 'int' 0
|-TypedefDecl 0x7fc81ec7f1c8 <line:262:5, col:26> col:26 referenced openmode 'unsigned int'
| `-BuiltinType 0x7fc81d833c60 'unsigned int'
|-VarDecl 0x7fc81ec7f250 <line:263:5, col:36> col:27 referenced app 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7f2d0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7f2b0 <col:36> 'int' 1
|-VarDecl 0x7fc81ec7f350 <line:264:5, col:36> col:27 referenced ate 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7f3d0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7f3b0 <col:36> 'int' 2
|-VarDecl 0x7fc81ec7f450 <line:265:5, col:36> col:27 referenced binary 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7f4d0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7f4b0 <col:36> 'int' 4
|-VarDecl 0x7fc81ec7f550 <line:266:5, col:36> col:27 referenced in 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7f5d0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7f5b0 <col:36> 'int' 8
|-VarDecl 0x7fc81ec7f650 <line:267:5, col:36> col:27 referenced out 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7f6d0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7f6b0 <col:36> 'int' 16
|-VarDecl 0x7fc81ec7f750 <line:268:5, col:36> col:27 referenced trunc 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fc81ec7f7d0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fc81ec7f7b0 <col:36> 'int' 32
|-EnumDecl 0x7fc81ec7f840 <line:270:5, col:32> col:10 referenced seekdir
| |-EnumConstantDecl 0x7fc81ec7f900 <col:19> col:19 referenced beg 'enum std::__1::ios_base::seekdir'
| |-EnumConstantDecl 0x7fc81ec7f948 <col:24> col:24 referenced cur 'enum std::__1::ios_base::seekdir'
| `-EnumConstantDecl 0x7fc81ec7f990 <col:29> col:29 referenced end 'enum std::__1::ios_base::seekdir'
|-TypedefDecl 0x7fc81ec7f9e8 <line:273:5, col:26> col:26 io_state 'std::__1::ios_base::iostate':'unsigned int'
| `-TypedefType 0x7fc81ec7ed90 'std::__1::ios_base::iostate' sugar
|   |-Typedef 0x7fc81ec7ed38 'iostate'
|   `-BuiltinType 0x7fc81d833c60 'unsigned int'
|-TypedefDecl 0x7fc81ec7fa50 <line:274:5, col:26> col:26 open_mode 'std::__1::ios_base::openmode':'unsigned int'
| `-TypedefType 0x7fc81ec7f220 'std::__1::ios_base::openmode' sugar
|   |-Typedef 0x7fc81ec7f1c8 'openmode'
|   `-BuiltinType 0x7fc81d833c60 'unsigned int'
|-TypedefDecl 0x7fc81ec7fab8 <line:275:5, col:26> col:26 seek_dir 'enum std::__1::ios_base::seekdir'
| `-EnumType 0x7fc81ec7f8e0 'enum std::__1::ios_base::seekdir'
|   `-Enum 0x7fc81ec7f840 'seekdir'
|-TypedefDecl 0x7fc81ec7fbd0 <line:277:5, col:30> col:30 streamoff 'std::__1::streamoff':'long long'
| `-ElaboratedType 0x7fc81ec7fb60 'std::__1::streamoff' sugar
|   `-TypedefType 0x7fc81f21f680 'std::__1::streamoff' sugar
|     |-Typedef 0x7fc81e82d958 'streamoff'
|     `-BuiltinType 0x7fc81d833c00 'long long'
|-TypedefDecl 0x7fc81ec7fcb0 <line:278:5, col:30> col:30 streampos 'std::__1::streampos':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fc81ec7fc40 'std::__1::streampos' sugar
|   `-TypedefType 0x7fc81f21f710 'std::__1::streampos' sugar
|     |-Typedef 0x7fc81e82d5b8 'streampos'
|     `-TemplateSpecializationType 0x7fc81e82d510 'fpos<mbstate_t>' sugar fpos
|       |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|       `-RecordType 0x7fc81e82d4f0 'class std::__1::fpos<__mbstate_t>'
|         `-ClassTemplateSpecialization 0x7fc81e82d400 'fpos'
|-CXXRecordDecl 0x7fc81ec7fd38 <line:281:5, col:28> col:28 class Init
| `-VisibilityAttr 0x7fc81ec7fdf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXMethodDecl 0x7fc81ec7ff20 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:284:48> col:40 flags 'std::__1::ios_base::fmtflags (void) const'
| |-AlwaysInlineAttr 0x7fc81ec7ffb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81ec80000 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81ec80140 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:285:62> col:40 flags 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fc81ec80050 <col:46, col:55> col:55 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fc81ec801e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81ec80228 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81ec80300 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:286:61> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fc81ec80278 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fc81ec803a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81ec803e8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81ec805c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:287:78> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags, std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fc81ec80438 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-ParmVarDecl 0x7fc81ec804a8 <col:63, col:72> col:72 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fc81ec80668 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81ec806b0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81ec807c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:288:58> col:36 used unsetf 'void (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fc81ec80700 <col:43, col:52> col:52 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fc81ec80860 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81ec808a8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81ec80960 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:290:54> col:42 precision 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7fc81ec809f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81ec80a40 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81ec80b50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:291:69> col:42 precision 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7fc81ec80a90 <col:52, col:63> col:63 __prec 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7fc81ec80bf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81ec80c38 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81ec80c98 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:292:50> col:42 width 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7fc81ec80d30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81ec80d78 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81ec80e50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:293:65> col:42 width 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7fc81ec80dc8 <col:48, col:59> col:59 __wide 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7fc81ec80ef0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81ec80f38 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81ec80fe0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:296:5, col:37> col:12 referenced imbue 'class std::__1::locale (const class std::__1::locale &)'
| `-ParmVarDecl 0x7fc81ec80f58 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7fc81ec810d0 <line:297:5, col:21> col:12 referenced getloc 'class std::__1::locale (void) const'
|-CXXMethodDecl 0x7fc81ec81190 <line:300:5, col:23> col:16 xalloc 'int (void)' static
|-CXXMethodDecl 0x7fc81ec812d0 <line:301:5, col:28> col:11 iword 'long &(int)'
| `-ParmVarDecl 0x7fc81ec81240 <col:17, col:21> col:21 __index 'int'
|-CXXMethodDecl 0x7fc81ec81458 <line:302:5, col:29> col:12 pword 'void *&(int)'
| `-ParmVarDecl 0x7fc81ec81388 <col:18, col:22> col:22 __index 'int'
|-CXXDestructorDecl 0x7fc81ec81548 <line:305:5, col:23> col:13 ~ios_base 'void (void) noexcept' virtual
|-EnumDecl 0x7fc81ec815e8 <line:308:5, col:58> col:10 referenced event
| |-EnumConstantDecl 0x7fc81ec816a0 <col:18> col:18 referenced erase_event 'enum std::__1::ios_base::event'
| |-EnumConstantDecl 0x7fc81ec816e8 <col:31> col:31 imbue_event 'enum std::__1::ios_base::event'
| `-EnumConstantDecl 0x7fc81ec81730 <col:44> col:44 referenced copyfmt_event 'enum std::__1::ios_base::event'
|-TypedefDecl 0x7fc81ec819f0 <line:309:5, col:65> col:20 referenced event_callback 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-PointerType 0x7fc81ec81980 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
|   `-ParenType 0x7fc81ec81920 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' sugar
|     `-FunctionProtoType 0x7fc81ec818d0 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' cdecl
|       |-BuiltinType 0x7fc81d833b20 'void'
|       |-EnumType 0x7fc81ec81680 'enum std::__1::ios_base::event'
|       | `-Enum 0x7fc81ec815e8 'event'
|       |-LValueReferenceType 0x7fc81da128c0 'class std::__1::ios_base &'
|       | `-RecordType 0x7fc81f05cdc0 'class std::__1::ios_base'
|       |   `-CXXRecord 0x7fc81ec7d530 'ios_base'
|       `-BuiltinType 0x7fc81d833bc0 'int'
|-CXXMethodDecl 0x7fc81ec81c10 <line:310:5, col:60> col:10 register_callback 'void (std::__1::ios_base::event_callback, int)'
| |-ParmVarDecl 0x7fc81ec81a80 <col:28, col:43> col:43 __fn 'std::__1::ios_base::event_callback':'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-ParmVarDecl 0x7fc81ec81af8 <col:49, col:53> col:53 __index 'int'
|-AccessSpecDecl 0x7fc81ec81cb8 <line:312:1, col:8> col:1 private
|-CXXConstructorDecl 0x7fc81ec81e00 <line:313:5, col:29> col:5 ios_base 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fc81ec81d18 <col:14, col:28> col:29 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7fc81ec81f80 <line:314:5, col:40> col:15 operator= 'class std::__1::ios_base &(const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fc81ec81ec0 <col:25, col:39> col:40 'const class std::__1::ios_base &'
|-AccessSpecDecl 0x7fc81ec82020 <line:316:1, col:7> col:1 public
|-CXXMethodDecl 0x7fc81ec82120 <line:317:5, col:51> col:17 sync_with_stdio '_Bool (_Bool)' static
| `-ParmVarDecl 0x7fc81ec82058 <col:33, col:47> col:38 __sync '_Bool' cinit
|   `-CXXBoolLiteralExpr 0x7fc81ec84518 <col:47> '_Bool' true
|-CXXMethodDecl 0x7fc81ec82240 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:319:49> col:39 rdstate 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7fc81ec822d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81ec82320 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81ec82400 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:320:5, col:41> col:10 used clear 'void (std::__1::ios_base::iostate)'
| `-ParmVarDecl 0x7fc81ec82340 <col:16, col:34> col:24 __state 'std::__1::ios_base::iostate':'unsigned int' cinit
|   `-ImplicitCastExpr 0x7fc81ec84558 <col:34> 'std::__1::ios_base::iostate':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fc81ec84530 <col:34> 'const std::__1::ios_base::iostate':'const unsigned int' lvalue Var 0x7fc81ec7f0c0 'goodbit' 'const std::__1::ios_base::iostate':'const unsigned int'
|-CXXMethodDecl 0x7fc81ec82568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:321:60> col:36 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fc81ec824e0 <col:45, col:53> col:53 __state 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7fc81ec82608 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81ec82650 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81ec826b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:323:43> col:36 good '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fc81ec82748 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81ec82790 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81ec827f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:324:42> col:36 eof '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fc81ec82888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81ec828d0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81ec82930 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:325:43> col:36 fail '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fc81ec829c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81ec82a10 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81ec82a70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:326:42> col:36 bad '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fc81ec82b08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81ec82b50 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81ec82bb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:328:52> col:39 exceptions 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7fc81ec82c48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81ec82c90 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81ec82d68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:329:64> col:36 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fc81ec82ce0 <col:47, col:55> col:55 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7fc81ec82e08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81ec82e50 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81ec82e80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:331:5, col:44> col:10 __set_badbit_and_consider_rethrow 'void (void)'
|-CXXMethodDecl 0x7fc81ec82f38 <line:332:5, col:45> col:10 __set_failbit_and_consider_rethrow 'void (void)'
|-AccessSpecDecl 0x7fc81ec82fd0 <line:334:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fc81ec83048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:337:16> line:336:5 ios_base 'void (void)'
| |-CompoundStmt 0x7fc81ec84570 <col:16, line:337:16>
| |-AlwaysInlineAttr 0x7fc81ec830f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81ec83138 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81ec831e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:339:5, col:25> col:10 referenced init 'void (void *)'
| `-ParmVarDecl 0x7fc81ec83160 <col:15, col:21> col:21 __sb 'void *'
|-CXXMethodDecl 0x7fc81ec83318 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:340:64> col:33 rdbuf 'void *(void) const'
| |-CompoundStmt 0x7fc81ec84608 <col:47, col:64>
| | `-ReturnStmt 0x7fc81ec845f0 <col:48, col:55>
| |   `-ImplicitCastExpr 0x7fc81ec845d8 <col:55> 'void *' <LValueToRValue>
| |     `-MemberExpr 0x7fc81ec845a0 <col:55> 'void *const' lvalue ->__rdbuf_ 0x7fc81ec83f28
| |       `-CXXThisExpr 0x7fc81ec84588 <col:55> 'const class std::__1::ios_base *' this
| |-AlwaysInlineAttr 0x7fc81ec833b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fc81ec833f8 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fc81ec834d8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:347:5> line:343:10 rdbuf 'void (void *)'
| |-ParmVarDecl 0x7fc81ec83450 <col:16, col:22> col:22 used __sb 'void *'
| |-CompoundStmt 0x7fc81ec84788 <line:344:5, line:347:5>
| | |-BinaryOperator 0x7fc81ec846b8 <line:345:9, col:20> 'void *' lvalue '='
| | | |-MemberExpr 0x7fc81ec84640 <col:9> 'void *' lvalue ->__rdbuf_ 0x7fc81ec83f28
| | | | `-CXXThisExpr 0x7fc81ec84628 <col:9> 'class std::__1::ios_base *' this
| | | `-ImplicitCastExpr 0x7fc81ec846a0 <col:20> 'void *' <LValueToRValue>
| | |   `-DeclRefExpr 0x7fc81ec84678 <col:20> 'void *' lvalue ParmVar 0x7fc81ec83450 '__sb' 'void *'
| | `-CXXMemberCallExpr 0x7fc81ec84730 <line:346:9, col:15> 'void'
| |   |-MemberExpr 0x7fc81ec846f8 <col:9> '<bound member function type>' ->clear 0x7fc81ec82400
| |   | `-CXXThisExpr 0x7fc81ec846e0 <col:9> 'class std::__1::ios_base *' this
| |   `-CXXDefaultArgExpr 0x7fc81ec84768 <<invalid sloc>> 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7fc81ec83578 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fc81ec835c0 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fc81ec836a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:349:5, col:32> col:10 referenced __call_callbacks 'void (enum std::__1::ios_base::event)'
| `-ParmVarDecl 0x7fc81ec835e0 <col:27> col:32 'enum std::__1::ios_base::event'
|-CXXMethodDecl 0x7fc81ec837d8 <line:350:5, col:33> col:10 referenced copyfmt 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fc81ec83750 <col:18, col:32> col:33 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7fc81ec83950 <line:351:5, col:24> col:10 referenced move 'void (class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fc81ec83888 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7fc81ec83ac8 <line:352:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:352:10 referenced swap 'void (class std::__1::ios_base &) noexcept'
| `-ParmVarDecl 0x7fc81ec83a00 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7fc81ec83c38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:358:5> line:355:10 referenced set_rdbuf 'void (void *)'
| |-ParmVarDecl 0x7fc81ec83bb0 <col:20, col:26> col:26 used __sb 'void *'
| |-CompoundStmt 0x7fc81ec84868 <line:356:5, line:358:5>
| | `-BinaryOperator 0x7fc81ec84840 <line:357:9, col:20> 'void *' lvalue '='
| |   |-MemberExpr 0x7fc81ec847c8 <col:9> 'void *' lvalue ->__rdbuf_ 0x7fc81ec83f28
| |   | `-CXXThisExpr 0x7fc81ec847b0 <col:9> 'class std::__1::ios_base *' this
| |   `-ImplicitCastExpr 0x7fc81ec84828 <col:20> 'void *' <LValueToRValue>
| |     `-DeclRefExpr 0x7fc81ec84800 <col:20> 'void *' lvalue ParmVar 0x7fc81ec83bb0 '__sb' 'void *'
| |-AlwaysInlineAttr 0x7fc81ec83cd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fc81ec83d20 <col:48, col:71> Hidden
|-AccessSpecDecl 0x7fc81ec83d30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:360:1, col:8> col:1 private
|-FieldDecl 0x7fc81ec83d68 <line:362:5, col:21> col:21 referenced __fmtflags_ 'std::__1::ios_base::fmtflags':'unsigned int'
|-FieldDecl 0x7fc81ec83dc0 <line:363:5, col:21> col:21 referenced __precision_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7fc81ec83e18 <line:364:5, col:21> col:21 referenced __width_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7fc81ec83e70 <line:365:5, col:21> col:21 referenced __rdstate_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7fc81ec83ec8 <line:366:5, col:21> col:21 referenced __exceptions_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7fc81ec83f28 <line:367:5, col:21> col:21 referenced __rdbuf_ 'void *'
|-FieldDecl 0x7fc81ec83f88 <line:368:5, col:21> col:21 __loc_ 'void *'
|-FieldDecl 0x7fc81ec84038 <line:369:5, col:21> col:21 __fn_ 'std::__1::ios_base::event_callback *'
|-FieldDecl 0x7fc81ec84098 <line:370:5, col:21> col:21 __index_ 'int *'
|-FieldDecl 0x7fc81ec840f0 <line:371:5, col:21> col:21 __event_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7fc81ec84148 <line:372:5, col:21> col:21 __event_cap_ 'size_t':'unsigned long'
|-VarDecl 0x7fc81ec84258 <line:376:5, col:24> col:24 __xindex_ 'atomic<int>':'struct std::__1::atomic<int>' static
|-FieldDecl 0x7fc81ec842d0 <line:380:5, col:21> col:21 __iarray_ 'long *'
|-FieldDecl 0x7fc81ec84328 <line:381:5, col:21> col:21 __iarray_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7fc81ec84380 <line:382:5, col:21> col:21 __iarray_cap_ 'size_t':'unsigned long'
|-FieldDecl 0x7fc81ec843e0 <line:383:5, col:21> col:21 __parray_ 'void **'
|-FieldDecl 0x7fc81ec84438 <line:384:5, col:21> col:21 __parray_size_ 'size_t':'unsigned long'
`-FieldDecl 0x7fc81ec84490 <line:385:5, col:21> col:21 __parray_cap_ 'size_t':'unsigned long'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc81e8277f8 parent 0x7fc81f05cc88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:486:78> col:64 class basic_ios definition
|-public 'class std::__1::ios_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fc81ec9ee58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fc81ec9ef48 prev 0x7fc81e8277f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:583:1, col:28> col:28 implicit class basic_ios
|-AccessSpecDecl 0x7fc81ec9efe0 <line:586:1, col:7> col:1 public
|-TypedefDecl 0x7fc81ec9f048 <line:588:5, col:20> col:20 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fc81ec9f010 'char' sugar
|   |-TemplateTypeParmType 0x7fc81e31f690 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fc81e31f650 '_CharT'
|   `-BuiltinType 0x7fc81d833b60 'char'
|-TypedefDecl 0x7fc81ec9f0d8 <line:589:5, col:21> col:21 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fc81ec9f0a0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fc81e31f700 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fc81e31f6b8 '_Traits'
|   `-RecordType 0x7fc81e827760 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fc81f229148 'char_traits'
|-TypedefDecl 0x7fc81ec9f1e0 <line:591:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fc81ec9f190 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fc81f22ac90 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fc81f2294a8 'int_type'
|     `-BuiltinType 0x7fc81d833bc0 'int'
|-TypedefDecl 0x7fc81ec9f2b0 <line:592:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fc81ec9f260 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fc81ec94e00 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fc81f229578 'pos_type'
|     `-TypedefType 0x7fc81f21f710 'std::__1::streampos' sugar
|       |-Typedef 0x7fc81e82d5b8 'streampos'
|       `-TemplateSpecializationType 0x7fc81e82d510 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fc81e82d4f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fc81e82d400 'fpos'
|-TypedefDecl 0x7fc81ec9f380 <line:593:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fc81ec9f330 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fc81ec94ef0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fc81f229510 'off_type'
|     `-TypedefType 0x7fc81f21f680 'std::__1::streamoff' sugar
|       |-Typedef 0x7fc81e82d958 'streamoff'
|       `-BuiltinType 0x7fc81d833c00 'long long'
|-CXXConversionDecl 0x7fc81ec9f3d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:605:60> col:22 operator bool '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fc81ec9f4a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81ec9f4f8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:608:69> col:32 operator! '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fc81ec9f5a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81ec9f5e8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:609:81> col:35 rdstate 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7fc81ec9f690 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81ec9f760 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:610:91> col:32 clear 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fc81ec9f6d8 <col:38, col:56> col:46 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7fc81ec9f810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81ec9f8e0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:611:87> col:32 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fc81ec9f858 <col:41, col:49> col:49 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7fc81ec9f990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81ec9f9d8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:612:70> col:32 good '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fc81ec9fa80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81ec9fac8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:613:69> col:32 eof '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fc81ec9fb70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81ec9fbb8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:614:70> col:32 fail '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fc81ec9fc60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81ec9fca8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:615:69> col:32 bad '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fc81ec9fd50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81ec9fd98 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:617:85> col:35 exceptions 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7fc81ec9fe40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81ec9ff10 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:618:95> col:32 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fc81ec9fe88 <col:43, col:51> col:51 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7fc81ec9ffc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXConstructorDecl 0x7fc81eca0270 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:622:68> col:14 basic_ios 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fc81eca0128 <col:24, col:64> col:64 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fc81eca0330 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fc81eca03a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:623:5, col:24> col:13 used ~basic_ios 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7fc81eca0600 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:627:50> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7fc81eca06a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc81eca09e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:629:95> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fc81eca0898 <col:48, col:87> col:87 __tiestr 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fc81eca0a90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc81eca0c50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:632:54> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7fc81eca0cf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc81eca1030 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:634:97> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fc81eca0ee8 <col:52, col:93> col:93 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fc81eca10e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc81eca1260 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:636:5, col:46> col:16 copyfmt 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)'
| `-ParmVarDecl 0x7fc81eca1198 <col:24, col:41> col:41 __rhs 'const class std::__1::basic_ios<char> &'
|-CXXMethodDecl 0x7fc81eca1360 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:639:22> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (void) const'
| `-AlwaysInlineAttr 0x7fc81eca1408 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc81eca1560 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:641:34> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7fc81eca1460 <col:20, col:30> col:30 __ch 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7fc81eca1610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc81eca16e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:644:37> col:12 imbue 'class std::__1::locale (const class std::__1::locale &)'
| |-ParmVarDecl 0x7fc81eca1658 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7fc81eca1790 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc81eca1920 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:647:47> col:10 narrow 'char (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, char) const'
| |-ParmVarDecl 0x7fc81eca17e8 <col:17, col:27> col:27 __c 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| |-ParmVarDecl 0x7fc81eca1848 <col:32, col:37> col:37 __dfault 'char'
| `-AlwaysInlineAttr 0x7fc81eca19d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc81eca1ae0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:649:31> col:15 widen 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (char) const'
| |-ParmVarDecl 0x7fc81eca1a20 <col:21, col:26> col:26 __c 'char'
| `-AlwaysInlineAttr 0x7fc81eca1b90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7fc81eca1bd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:651:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fc81eca1c20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:654:17> line:653:5 basic_ios 'void (void)'
| `-AlwaysInlineAttr 0x7fc81eca1cd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81eca1ee0 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:656:60> col:10 init 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fc81eca1e18 <col:15, col:56> col:56 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fc81eca1f90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc81eca20b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:659:31> col:10 move 'void (class std::__1::basic_ios<char> &)'
| |-ParmVarDecl 0x7fc81eca1fe8 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7fc81eca2160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc81eca22b0 <line:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:662:47> col:10 move 'void (class std::__1::basic_ios<char> &&)'
| |-ParmVarDecl 0x7fc81eca21e8 <col:15, col:27> col:27 __rhs 'class std::__1::basic_ios<char> &&'
| `-AlwaysInlineAttr 0x7fc81eca2360 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81eca2488 <line:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:665:10 swap 'void (class std::__1::basic_ios<char> &) noexcept'
| |-ParmVarDecl 0x7fc81eca23b8 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7fc81eca2538 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc81eca2740 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:667:65> col:10 set_rdbuf 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fc81eca2678 <col:20, col:61> col:61 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fc81eca27f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7fc81eca2838 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:668:1, col:8> col:1 private
|-FieldDecl 0x7fc81eca2958 <line:669:5, col:44> col:44 __tie_ 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
|-FieldDecl 0x7fc81eca29d0 <line:670:6, col:23> col:23 __fill_ 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' mutable
|-CXXConstructorDecl 0x7fc81eca2a58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:486:64> col:64 implicit basic_ios 'void (const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7fc81eca2a58
| `-ParmVarDecl 0x7fc81eca2b80 <col:64> col:64 'const class std::__1::basic_ios<char> &'
`-CXXMethodDecl 0x7fc81eca2be8 <col:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7fc81eca2be8
  `-ParmVarDecl 0x7fc81eca2cc0 <col:64> col:64 'const class std::__1::basic_ios<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ios" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc81e8281c8 parent 0x7fc81f05cc88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1681:82> col:64 class basic_istream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fc81ee151e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fc81ee15420 prev 0x7fc81e8281c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:176:1, col:28> col:28 implicit class basic_istream
|-FieldDecl 0x7fc81ee154b8 <line:179:5, col:16> col:16 __gc_ 'std::__1::streamsize':'long'
|-AccessSpecDecl 0x7fc81ee15500 <line:180:1, col:7> col:1 public
|-TypedefDecl 0x7fc81ee15538 <line:182:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fc81ee152b0 'char' sugar
|   |-TemplateTypeParmType 0x7fc81edba330 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fc81edba2e8 '_CharT'
|   `-BuiltinType 0x7fc81d833b60 'char'
|-TypedefDecl 0x7fc81ee155a0 <line:183:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fc81ee152f0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fc81edba3a0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fc81edba358 '_Traits'
|   `-RecordType 0x7fc81e827760 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fc81f229148 'char_traits'
|-TypedefDecl 0x7fc81ee156b0 <line:184:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fc81ee15660 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fc81f22ac90 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fc81f2294a8 'int_type'
|     `-BuiltinType 0x7fc81d833bc0 'int'
|-TypedefDecl 0x7fc81ee15780 <line:185:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fc81ee15730 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fc81ec94e00 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fc81f229578 'pos_type'
|     `-TypedefType 0x7fc81f21f710 'std::__1::streampos' sugar
|       |-Typedef 0x7fc81e82d5b8 'streampos'
|       `-TemplateSpecializationType 0x7fc81e82d510 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fc81e82d4f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fc81e82d400 'fpos'
|-TypedefDecl 0x7fc81ee15850 <line:186:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fc81ee15800 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fc81ec94ef0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fc81f229510 'off_type'
|     `-TypedefType 0x7fc81f21f680 'std::__1::streamoff' sugar
|       |-Typedef 0x7fc81e82d958 'streamoff'
|       `-BuiltinType 0x7fc81d833c00 'long long'
|-CXXConstructorDecl 0x7fc81ee15ad0 <line:189:5, line:191:25> line:190:14 basic_istream 'void (basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7fc81ee159c8 <col:28, col:69> col:69 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fc81ee15bb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXDestructorDecl 0x7fc81ee15c30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:192:5, col:28> col:13 ~basic_istream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fc81ee15ce0 <line:193:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fc81ee15e30 <line:195:5, line:196:40> col:5 basic_istream 'void (class std::__1::basic_istream<char> &&)' inline
| |-ParmVarDecl 0x7fc81ee15d48 <col:19, col:35> col:35 __rhs 'class std::__1::basic_istream<char> &&'
| `-AlwaysInlineAttr 0x7fc81ee15ef0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fc81ee16040 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:199:5, line:200:51> col:20 operator= 'class std::__1::basic_istream<char> &(class std::__1::basic_istream<char> &&)' inline
| |-ParmVarDecl 0x7fc81ee15f78 <col:30, col:46> col:46 __rhs 'class std::__1::basic_istream<char> &&'
| `-AlwaysInlineAttr 0x7fc81ee160f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fc81ee16210 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:203:5, line:207:5> line:204:10 swap 'void (class std::__1::basic_istream<char> &)' inline
| |-ParmVarDecl 0x7fc81ee16148 <col:15, col:30> col:30 __rhs 'class std::__1::basic_istream<char> &'
| `-AlwaysInlineAttr 0x7fc81ee162c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXConstructorDecl 0x7fc81ee16430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:210:5, col:65> col:5 basic_istream 'void (const class std::__1::basic_istream<char> &)' delete
| `-ParmVarDecl 0x7fc81ee16348 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_istream<char> &'
|-CXXMethodDecl 0x7fc81ee165c0 <line:211:5, col:65> col:20 operator= 'class std::__1::basic_istream<char> &(const class std::__1::basic_istream<char> &)' delete
| `-ParmVarDecl 0x7fc81ee16500 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_istream<char> &'
|-AccessSpecDecl 0x7fc81ee16670 <line:213:1, col:7> col:1 public
|-CXXRecordDecl 0x7fc81ee16698 <line:216:5, col:32> col:32 class sentry definition
| |-CXXRecordDecl 0x7fc81ee1abd0 prev 0x7fc81ee16698 <line:293:1, col:60> col:60 implicit class sentry
| |-FieldDecl 0x7fc81ee1ac68 <line:295:5, col:10> col:10 __ok_ '_Bool'
| |-CXXConstructorDecl 0x7fc81ee1adf0 <line:297:5, col:25> col:5 sentry 'void (const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7fc81ee1ace8 <col:12, col:24> col:25 'const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x7fc81ee1afb0 <line:298:5, col:36> col:13 operator= 'class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7fc81ee1aee8 <col:23, col:35> col:36 'const class std::__1::basic_istream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x7fc81ee1b060 <line:300:1, col:7> col:1 public
| |-CXXConstructorDecl 0x7fc81ee1b380 <line:301:5, col:82> col:14 sentry 'void (basic_istream<char, struct std::__1::char_traits<char> > &, _Bool)'
| | |-ParmVarDecl 0x7fc81ee1b1e8 <col:21, col:53> col:53 __is 'basic_istream<char, struct std::__1::char_traits<char> > &'
| | `-ParmVarDecl 0x7fc81ee1b248 <col:59, col:77> col:64 __noskipws '_Bool'
| `-CXXConversionDecl 0x7fc81ee1b448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:306:45> col:9 operator bool '_Bool (void) const'
|   `-AlwaysInlineAttr 0x7fc81ee1b518 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc81ee169d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:219:5, line:221:27> line:220:20 operator>> 'class std::__1::basic_istream<char> &(class std::__1::basic_istream<char> &(*)(class std::__1::basic_istream<char> &))' inline
| |-ParmVarDecl 0x7fc81ee168d0 <col:31, col:68> col:48 __pf 'class std::__1::basic_istream<char> &(*)(class std::__1::basic_istream<char> &)'
| `-AlwaysInlineAttr 0x7fc81ee16a80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ee16ef0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:223:5, line:226:34> line:224:20 operator>> 'class std::__1::basic_istream<char> &(basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &))' inline
| |-ParmVarDecl 0x7fc81ee16df0 <col:31, line:225:73> col:33 __pf 'basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &)'
| `-AlwaysInlineAttr 0x7fc81ee16fa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ee170f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:228:5, line:230:34> line:229:20 operator>> 'class std::__1::basic_istream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))' inline
| |-ParmVarDecl 0x7fc81ee16fe8 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x7fc81ee171a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ee173f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:232:5, col:76> col:20 operator>> 'class std::__1::basic_istream<char> &(basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *)'
| `-ParmVarDecl 0x7fc81ee172e8 <col:31, col:72> col:72 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> *'
|-CXXMethodDecl 0x7fc81ee17560 <line:233:5, col:40> col:20 operator>> 'class std::__1::basic_istream<char> &(_Bool &)'
| `-ParmVarDecl 0x7fc81ee174a0 <col:31, col:37> col:37 __n '_Bool &'
|-CXXMethodDecl 0x7fc81ee176d0 <line:234:5, col:41> col:20 operator>> 'class std::__1::basic_istream<char> &(short &)'
| `-ParmVarDecl 0x7fc81ee17610 <col:31, col:38> col:38 __n 'short &'
|-CXXMethodDecl 0x7fc81ee17840 <line:235:5, col:50> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned short &)'
| `-ParmVarDecl 0x7fc81ee17780 <col:31, col:47> col:47 __n 'unsigned short &'
|-CXXMethodDecl 0x7fc81ee179b0 <line:236:5, col:39> col:20 operator>> 'class std::__1::basic_istream<char> &(int &)'
| `-ParmVarDecl 0x7fc81ee178f0 <col:31, col:36> col:36 __n 'int &'
|-CXXMethodDecl 0x7fc81ee17b20 <line:237:5, col:48> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned int &)'
| `-ParmVarDecl 0x7fc81ee17a60 <col:31, col:45> col:45 __n 'unsigned int &'
|-CXXMethodDecl 0x7fc81ee17c90 <line:238:5, col:40> col:20 operator>> 'class std::__1::basic_istream<char> &(long &)'
| `-ParmVarDecl 0x7fc81ee17bd0 <col:31, col:37> col:37 __n 'long &'
|-CXXMethodDecl 0x7fc81ee17e00 <line:239:5, col:49> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned long &)'
| `-ParmVarDecl 0x7fc81ee17d40 <col:31, col:46> col:46 __n 'unsigned long &'
|-CXXMethodDecl 0x7fc81ee17f70 <line:240:5, col:45> col:20 operator>> 'class std::__1::basic_istream<char> &(long long &)'
| `-ParmVarDecl 0x7fc81ee17eb0 <col:31, col:42> col:42 __n 'long long &'
|-CXXMethodDecl 0x7fc81ee180e0 <line:241:5, col:54> col:20 operator>> 'class std::__1::basic_istream<char> &(unsigned long long &)'
| `-ParmVarDecl 0x7fc81ee18020 <col:31, col:51> col:51 __n 'unsigned long long &'
|-CXXMethodDecl 0x7fc81ee18250 <line:242:5, col:41> col:20 operator>> 'class std::__1::basic_istream<char> &(float &)'
| `-ParmVarDecl 0x7fc81ee18190 <col:31, col:38> col:38 __f 'float &'
|-CXXMethodDecl 0x7fc81ee183c0 <line:243:5, col:42> col:20 operator>> 'class std::__1::basic_istream<char> &(double &)'
| `-ParmVarDecl 0x7fc81ee18300 <col:31, col:39> col:39 __f 'double &'
|-CXXMethodDecl 0x7fc81ee18530 <line:244:5, col:47> col:20 operator>> 'class std::__1::basic_istream<char> &(long double &)'
| `-ParmVarDecl 0x7fc81ee18470 <col:31, col:44> col:44 __f 'long double &'
|-CXXMethodDecl 0x7fc81ee186a0 <line:245:5, col:41> col:20 operator>> 'class std::__1::basic_istream<char> &(void *&)'
| `-ParmVarDecl 0x7fc81ee185e0 <col:31, col:38> col:38 __p 'void *&'
|-CXXMethodDecl 0x7fc81ee18750 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:249:45> col:16 gcount 'std::__1::streamsize (void) const'
| `-AlwaysInlineAttr 0x7fc81ee187f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc81ee188b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:250:5, col:18> col:14 get 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type (void)'
|-CXXMethodDecl 0x7fc81ee18aa0 <line:252:5, line:258:5> line:253:20 get 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type &)' inline
| |-ParmVarDecl 0x7fc81ee18998 <col:24, col:35> col:35 __c 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type &'
| `-AlwaysInlineAttr 0x7fc81ee18b50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ee18d50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:260:5, line:262:48> line:261:20 get 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7fc81ee18bd8 <col:24, col:35> col:35 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fc81ee18c38 <col:40, col:51> col:51 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7fc81ee18e08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ee19060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:264:5, col:71> col:20 get 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7fc81ee18e60 <col:24, col:35> col:35 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fc81ee18ec0 <col:40, col:51> col:51 __n 'std::__1::streamsize':'long'
| `-ParmVarDecl 0x7fc81ee18f30 <col:56, col:66> col:66 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7fc81ee19320 <line:266:5, line:268:44> line:267:20 get 'class std::__1::basic_istream<char> &(basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &)' inline
| |-ParmVarDecl 0x7fc81ee19218 <col:24, col:65> col:65 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &'
| `-AlwaysInlineAttr 0x7fc81ee193d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ee196a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:270:5, col:86> col:20 get 'class std::__1::basic_istream<char> &(basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7fc81ee19518 <col:24, col:65> col:65 __sb 'basic_streambuf<std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::traits_type> &'
| `-ParmVarDecl 0x7fc81ee19588 <col:71, col:81> col:81 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7fc81ee19858 <line:272:5, line:274:52> line:273:20 getline 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7fc81ee19768 <col:28, col:39> col:39 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fc81ee197c8 <col:44, col:55> col:55 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7fc81ee19910 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ee19b08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:276:5, col:75> col:20 getline 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7fc81ee19968 <col:28, col:39> col:39 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fc81ee19a00 <col:44, col:55> col:55 __n 'std::__1::streamsize':'long'
| `-ParmVarDecl 0x7fc81ee19a70 <col:60, col:70> col:70 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7fc81ee19d50 <line:278:5, col:82> col:20 ignore 'class std::__1::basic_istream<char> &(std::__1::streamsize, std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type)'
| |-ParmVarDecl 0x7fc81ee19bc8 <col:27, col:44> col:38 __n 'std::__1::streamsize':'long'
| `-ParmVarDecl 0x7fc81ee19c38 <col:47, col:81> col:56 __dlm 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7fc81ee19e28 <line:279:5, col:19> col:14 peek 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::int_type (void)'
|-CXXMethodDecl 0x7fc81ee19fd0 <line:280:5, col:56> col:20 read 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7fc81ee19ee0 <col:26, col:37> col:37 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fc81ee19f40 <col:42, col:53> col:53 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fc81ee1a1d0 <line:281:5, col:55> col:16 readsome 'std::__1::streamsize (std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7fc81ee1a098 <col:25, col:36> col:36 __s 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fc81ee1a0f8 <col:41, col:52> col:52 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fc81ee1a3a0 <line:283:5, col:41> col:20 putback 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type)'
| `-ParmVarDecl 0x7fc81ee1a298 <col:28, col:38> col:38 __c 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7fc81ee1a4a0 <line:284:5, col:26> col:20 unget 'class std::__1::basic_istream<char> &(void)'
|-CXXMethodDecl 0x7fc81ee1a548 <line:285:5, col:14> col:9 sync 'int (void)'
|-CXXMethodDecl 0x7fc81ee1a660 <line:287:5, col:20> col:14 tellg 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::pos_type (void)'
|-CXXMethodDecl 0x7fc81ee1a820 <line:288:5, col:40> col:20 seekg 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::pos_type)'
| `-ParmVarDecl 0x7fc81ee1a718 <col:26, col:35> col:35 __pos 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
`-CXXMethodDecl 0x7fc81ee1aa70 <line:289:5, col:65> col:20 seekg 'class std::__1::basic_istream<char> &(std::__1::basic_istream<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir)'
  |-ParmVarDecl 0x7fc81ee1a900 <col:26, col:35> col:35 __off 'std::__1::basic_istream<char, struct std::__1::char_traits<char> >::off_type':'long long'
  `-ParmVarDecl 0x7fc81ee1a960 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_istream" = type { i32 (...)**, i64, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_istream.base" = type { i32 (...)**, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc81e8284b8 parent 0x7fc81f05cc88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:1084:82> col:64 class basic_ostream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fc81edb04c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fc81edb0700 prev 0x7fc81e8284b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:151:1, col:28> col:28 implicit class basic_ostream
|-AccessSpecDecl 0x7fc81edb0798 <line:154:1, col:7> col:1 public
|-TypedefDecl 0x7fc81edb07d0 <line:156:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fc81edb0590 'char' sugar
|   |-TemplateTypeParmType 0x7fc81eda0190 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fc81eda0148 '_CharT'
|   `-BuiltinType 0x7fc81d833b60 'char'
|-TypedefDecl 0x7fc81edb0838 <line:157:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fc81edb05d0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fc81eda0200 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fc81eda01b8 '_Traits'
|   `-RecordType 0x7fc81e827760 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fc81f229148 'char_traits'
|-TypedefDecl 0x7fc81edb0940 <line:158:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fc81edb08f0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fc81f22ac90 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fc81f2294a8 'int_type'
|     `-BuiltinType 0x7fc81d833bc0 'int'
|-TypedefDecl 0x7fc81edb0a10 <line:159:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fc81edb09c0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fc81ec94e00 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fc81f229578 'pos_type'
|     `-TypedefType 0x7fc81f21f710 'std::__1::streampos' sugar
|       |-Typedef 0x7fc81e82d5b8 'streampos'
|       `-TemplateSpecializationType 0x7fc81e82d510 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fc81e82d4f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fc81e82d400 'fpos'
|-TypedefDecl 0x7fc81edb0ae0 <line:160:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fc81edb0a90 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fc81ec94ef0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fc81f229510 'off_type'
|     `-TypedefType 0x7fc81f21f680 'std::__1::streamoff' sugar
|       |-Typedef 0x7fc81e82d958 'streamoff'
|       `-BuiltinType 0x7fc81d833c00 'long long'
|-CXXConstructorDecl 0x7fc81edb0d60 <line:163:5, line:165:25> line:164:14 basic_ostream 'void (basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7fc81edb0c58 <col:28, col:69> col:69 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fc81edb0e20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXDestructorDecl 0x7fc81edb0e98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:166:5, col:28> col:13 ~basic_ostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fc81edb0f48 <line:167:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fc81edb1090 <line:169:5, line:170:40> col:5 basic_ostream 'void (class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7fc81edb0fa8 <col:19, col:35> col:35 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7fc81edb1150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fc81edb12a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:173:5, line:174:51> col:20 operator= 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7fc81edb11d8 <col:30, col:46> col:46 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7fc81edb1350 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fc81edb1470 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:176:5, line:178:55> line:177:10 swap 'void (class std::__1::basic_ostream<char> &)' inline
| |-ParmVarDecl 0x7fc81edb13a8 <col:15, col:30> col:30 __rhs 'class std::__1::basic_ostream<char> &'
| `-AlwaysInlineAttr 0x7fc81edb1520 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXConstructorDecl 0x7fc81edb1690 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:181:5, col:65> col:5 basic_ostream 'void (const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7fc81edb15a8 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-CXXMethodDecl 0x7fc81edb1820 <line:182:5, col:65> col:20 operator= 'class std::__1::basic_ostream<char> &(const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7fc81edb1760 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-AccessSpecDecl 0x7fc81edb18d0 <line:187:1, col:7> col:1 public
|-CXXRecordDecl 0x7fc81edb18f8 <line:190:5, col:32> col:32 class sentry definition
| |-CXXRecordDecl 0x7fc81edb47a0 prev 0x7fc81edb18f8 <line:240:1, col:60> col:60 implicit class sentry
| |-FieldDecl 0x7fc81edb4838 <line:242:5, col:10> col:10 __ok_ '_Bool'
| |-FieldDecl 0x7fc81edb49d8 <line:243:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXConstructorDecl 0x7fc81edb4b60 <line:245:5, col:25> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7fc81edb4a58 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x7fc81edb4d20 <line:246:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7fc81edb4c58 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x7fc81edb4dd0 <line:248:1, col:7> col:1 public
| |-CXXConstructorDecl 0x7fc81edb4fe0 <line:249:5, col:57> col:14 sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| | `-ParmVarDecl 0x7fc81edb4ef8 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXDestructorDecl 0x7fc81edb50d0 <line:250:5, col:13> col:5 ~sentry 'void (void)' noexcept-unevaluated 0x7fc81edb50d0
| `-CXXConversionDecl 0x7fc81edb5180 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:254:45> col:9 operator bool '_Bool (void) const'
|   `-AlwaysInlineAttr 0x7fc81edb5258 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81edb1c30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:193:5, line:195:27> line:194:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &))' inline
| |-ParmVarDecl 0x7fc81edb1b30 <col:31, col:68> col:48 __pf 'class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &)'
| `-AlwaysInlineAttr 0x7fc81edb1ce0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81edb21c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:197:5, line:200:34> line:198:20 operator<< 'class std::__1::basic_ostream<char> &(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &))' inline
| |-ParmVarDecl 0x7fc81edb20c0 <col:31, line:199:72> col:33 __pf 'basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &)'
| `-AlwaysInlineAttr 0x7fc81edb2270 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81edb23c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:202:5, line:204:34> line:203:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))' inline
| |-ParmVarDecl 0x7fc81edb22b8 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x7fc81edb2470 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81edb2580 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:206:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(_Bool)'
| `-ParmVarDecl 0x7fc81edb24b8 <col:31, col:36> col:36 __n '_Bool'
|-CXXMethodDecl 0x7fc81edb26f0 <line:207:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(short)'
| `-ParmVarDecl 0x7fc81edb2630 <col:31, col:37> col:37 __n 'short'
|-CXXMethodDecl 0x7fc81edb2860 <line:208:5, col:49> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned short)'
| `-ParmVarDecl 0x7fc81edb27a0 <col:31, col:46> col:46 __n 'unsigned short'
|-CXXMethodDecl 0x7fc81edb29d0 <line:209:5, col:38> col:20 operator<< 'class std::__1::basic_ostream<char> &(int)'
| `-ParmVarDecl 0x7fc81edb2910 <col:31, col:35> col:35 __n 'int'
|-CXXMethodDecl 0x7fc81edb2b40 <line:210:5, col:47> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned int)'
| `-ParmVarDecl 0x7fc81edb2a80 <col:31, col:44> col:44 __n 'unsigned int'
|-CXXMethodDecl 0x7fc81edb2cb0 <line:211:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(long)'
| `-ParmVarDecl 0x7fc81edb2bf0 <col:31, col:36> col:36 __n 'long'
|-CXXMethodDecl 0x7fc81edb2e20 <line:212:5, col:48> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long)'
| `-ParmVarDecl 0x7fc81edb2d60 <col:31, col:45> col:45 __n 'unsigned long'
|-CXXMethodDecl 0x7fc81edb2f90 <line:213:5, col:44> col:20 operator<< 'class std::__1::basic_ostream<char> &(long long)'
| `-ParmVarDecl 0x7fc81edb2ed0 <col:31, col:41> col:41 __n 'long long'
|-CXXMethodDecl 0x7fc81edb3100 <line:214:5, col:53> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long long)'
| `-ParmVarDecl 0x7fc81edb3040 <col:31, col:50> col:50 __n 'unsigned long long'
|-CXXMethodDecl 0x7fc81edb3270 <line:215:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(float)'
| `-ParmVarDecl 0x7fc81edb31b0 <col:31, col:37> col:37 __f 'float'
|-CXXMethodDecl 0x7fc81edb33e0 <line:216:5, col:41> col:20 operator<< 'class std::__1::basic_ostream<char> &(double)'
| `-ParmVarDecl 0x7fc81edb3320 <col:31, col:38> col:38 __f 'double'
|-CXXMethodDecl 0x7fc81edb3550 <line:217:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(long double)'
| `-ParmVarDecl 0x7fc81edb3490 <col:31, col:43> col:43 __f 'long double'
|-CXXMethodDecl 0x7fc81edb36c0 <line:218:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(const void *)'
| `-ParmVarDecl 0x7fc81edb3600 <col:31, col:43> col:43 __p 'const void *'
|-CXXMethodDecl 0x7fc81edb3970 <line:219:5, col:76> col:20 operator<< 'class std::__1::basic_ostream<char> &(basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)'
| `-ParmVarDecl 0x7fc81edb3868 <col:31, col:72> col:72 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
|-CXXMethodDecl 0x7fc81edb3b30 <line:222:5, col:37> col:20 put 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type)'
| `-ParmVarDecl 0x7fc81edb3a30 <col:24, col:34> col:34 __c 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7fc81edb3d90 <line:223:5, col:62> col:20 write 'class std::__1::basic_ostream<char> &(const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7fc81edb3c18 <col:26, col:43> col:43 __s 'const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fc81edb3c78 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fc81edb3ea0 <line:224:5, col:26> col:20 flush 'class std::__1::basic_ostream<char> &(void)'
|-CXXMethodDecl 0x7fc81edb3ff0 <line:227:5, line:228:20> col:14 tellp 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type (void)' inline
| `-AlwaysInlineAttr 0x7fc81edb4098 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> Inherited always_inline
|-CXXMethodDecl 0x7fc81edb41f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:229:5, line:230:40> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type)' inline
| |-ParmVarDecl 0x7fc81edb40f0 <col:26, col:35> col:35 __pos 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-AlwaysInlineAttr 0x7fc81edb42a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> Inherited always_inline
|-CXXMethodDecl 0x7fc81edb44b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:231:5, line:232:65> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir)' inline
| |-ParmVarDecl 0x7fc81edb4320 <col:26, col:35> col:35 __off 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7fc81edb4380 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-AlwaysInlineAttr 0x7fc81edb4568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> Inherited always_inline
|-AccessSpecDecl 0x7fc81edb45b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:234:1, col:10> col:1 protected
`-CXXConstructorDecl 0x7fc81edb45f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:236:22> col:5 basic_ostream 'void (void)'
  `-AlwaysInlineAttr 0x7fc81edb46b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream.base" = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc81e8287a8 parent 0x7fc81f05cc88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1683:83> col:64 class basic_iostream definition
|-public 'basic_istream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_istream<char>'
|-public 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fc81ee21ba8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fc81ee21ed8 prev 0x7fc81e8287a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1442:1, col:28> col:28 implicit class basic_iostream
|-AccessSpecDecl 0x7fc81ee21f70 <line:1446:1, col:7> col:1 public
|-TypedefDecl 0x7fc81ee21fa8 <line:1448:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fc81ee21c70 'char' sugar
|   |-TemplateTypeParmType 0x7fc81ee095d0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fc81ee09590 '_CharT'
|   `-BuiltinType 0x7fc81d833b60 'char'
|-TypedefDecl 0x7fc81ee22010 <line:1449:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fc81ee21cb0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fc81ee09640 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fc81ee095f8 '_Traits'
|   `-RecordType 0x7fc81e827760 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fc81f229148 'char_traits'
|-TypedefDecl 0x7fc81ee22120 <line:1450:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fc81ee220d0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fc81f22ac90 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fc81f2294a8 'int_type'
|     `-BuiltinType 0x7fc81d833bc0 'int'
|-TypedefDecl 0x7fc81ee221f0 <line:1451:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fc81ee221a0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fc81ec94e00 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fc81f229578 'pos_type'
|     `-TypedefType 0x7fc81f21f710 'std::__1::streampos' sugar
|       |-Typedef 0x7fc81e82d5b8 'streampos'
|       `-TemplateSpecializationType 0x7fc81e82d510 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fc81e82d4f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fc81e82d400 'fpos'
|-TypedefDecl 0x7fc81ee222c0 <line:1452:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fc81ee22270 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fc81ec94ef0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fc81f229510 'off_type'
|     `-TypedefType 0x7fc81f21f680 'std::__1::streamoff' sugar
|       |-Typedef 0x7fc81e82d958 'streamoff'
|       `-BuiltinType 0x7fc81d833c00 'long long'
|-CXXConstructorDecl 0x7fc81ee22540 <line:1455:5, line:1458:6> line:1456:14 basic_iostream 'void (basic_streambuf<std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7fc81ee22438 <col:29, col:70> col:70 __sb 'basic_streambuf<std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_iostream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fc81ee22628 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXDestructorDecl 0x7fc81ee226a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1460:5, col:29> col:13 used ~basic_iostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fc81ee22750 <line:1461:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fc81ee228a0 <line:1463:5, line:1464:42> col:5 basic_iostream 'void (class std::__1::basic_iostream<char> &&)' inline
| |-ParmVarDecl 0x7fc81ee227b8 <col:20, col:37> col:37 __rhs 'class std::__1::basic_iostream<char> &&'
| `-AlwaysInlineAttr 0x7fc81ee22960 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fc81ee22ab0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1467:5, line:1468:53> col:21 operator= 'class std::__1::basic_iostream<char> &(class std::__1::basic_iostream<char> &&)' inline
| |-ParmVarDecl 0x7fc81ee229e8 <col:31, col:48> col:48 __rhs 'class std::__1::basic_iostream<char> &&'
| `-AlwaysInlineAttr 0x7fc81ee22b60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fc81ee22c80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1470:5, line:1472:59> line:1471:10 swap 'void (class std::__1::basic_iostream<char> &)' inline
| |-ParmVarDecl 0x7fc81ee22bb8 <col:15, col:31> col:31 __rhs 'class std::__1::basic_iostream<char> &'
| `-AlwaysInlineAttr 0x7fc81ee22d30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-AccessSpecDecl 0x7fc81ee22d78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/istream:1473:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fc81ee22e08 <line:1683:64> col:64 implicit basic_iostream 'void (const class std::__1::basic_iostream<char> &)' inline default_delete noexcept-unevaluated 0x7fc81ee22e08
| `-ParmVarDecl 0x7fc81ee22f30 <col:64> col:64 'const class std::__1::basic_iostream<char> &'
`-CXXMethodDecl 0x7fc81ee22f98 <col:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::basic_iostream<char> &(const class std::__1::basic_iostream<char> &)' inline default_delete noexcept-unevaluated 0x7fc81ee22f98
  `-ParmVarDecl 0x7fc81ee230b0 <col:64> col:64 'const class std::__1::basic_iostream<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_iostream" = type { %"class.std::__1::basic_istream.base", %"class.std::__1::basic_ostream.base", %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_iostream.base" = type { %"class.std::__1::basic_istream.base", %"class.std::__1::basic_ostream.base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc81dc8b328 prev 0x7fc81dc8ab78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:83:1, line:145:1> line:83:24 referenced class locale definition
|-VisibilityAttr 0x7fc81dc8b428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fc81dc8b470 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:83:1, col:24> col:24 implicit referenced class locale
|-AccessSpecDecl 0x7fc81dc8b508 <line:85:1, col:7> col:1 public
|-CXXRecordDecl 0x7fc81dc8b560 <line:87:5, col:28> col:28 referenced class facet
| `-VisibilityAttr 0x7fc81dc8b620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fc81dc8b698 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:88:5, col:28> col:28 referenced class id
| `-VisibilityAttr 0x7fc81dc8b750 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-TypedefDecl 0x7fc81dc8b7b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:90:5, col:17> col:17 referenced category 'int'
| `-BuiltinType 0x7fc81d833bc0 'int'
|-VarDecl 0x7fc81dc8b860 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1174:3, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:93:20> col:9 none 'const std::__1::locale::category':'const int' static cinit
| |-IntegerLiteral 0x7fc81dc8b9c8 <col:20> 'int' 0
| |-AvailabilityAttr 0x7fc81dc8b8c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fc81dc8b960 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fc81dc8ba50 <col:3, /usr/include/xlocale.h:45:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:94:9 referenced collate 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7fc81dc8bc20 </usr/include/xlocale.h:45:27, col:34> 'int'
| | `-BinaryOperator 0x7fc81dc8bbf8 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7fc81dc8bbb8 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7fc81dc8bbd8 <col:33> 'int' 0
| |-AvailabilityAttr 0x7fc81dc8bab0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fc81dc8bb50 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fc81dc8bca8 <col:3, /usr/include/xlocale.h:46:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:95:9 referenced ctype 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7fc81dc8be78 </usr/include/xlocale.h:46:25, col:32> 'int'
| | `-BinaryOperator 0x7fc81dc8be50 <col:26, col:31> 'int' '<<'
| |   |-IntegerLiteral 0x7fc81dc8be10 <col:26> 'int' 1
| |   `-IntegerLiteral 0x7fc81dc8be30 <col:31> 'int' 1
| |-AvailabilityAttr 0x7fc81dc8bd08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fc81dc8bda8 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fc81dc8bf00 <col:3, /usr/include/xlocale.h:48:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:96:9 referenced monetary 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7fc81dc8c0d0 </usr/include/xlocale.h:48:27, col:34> 'int'
| | `-BinaryOperator 0x7fc81dc8c0a8 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7fc81dc8c068 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7fc81dc8c088 <col:33> 'int' 3
| |-AvailabilityAttr 0x7fc81dc8bf60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fc81dc8c000 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fc81dc8c158 <col:3, /usr/include/xlocale.h:49:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:97:9 referenced numeric 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7fc81dc8c328 </usr/include/xlocale.h:49:27, col:34> 'int'
| | `-BinaryOperator 0x7fc81dc8c300 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7fc81dc8c2c0 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7fc81dc8c2e0 <col:33> 'int' 4
| |-AvailabilityAttr 0x7fc81dc8c1b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fc81dc8c258 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fc81dc8c3b0 <col:3, /usr/include/xlocale.h:50:31> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:98:9 referenced time 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7fc81dc8c580 </usr/include/xlocale.h:50:24, col:31> 'int'
| | `-BinaryOperator 0x7fc81dc8c558 <col:25, col:30> 'int' '<<'
| |   |-IntegerLiteral 0x7fc81dc8c518 <col:25> 'int' 1
| |   `-IntegerLiteral 0x7fc81dc8c538 <col:30> 'int' 5
| |-AvailabilityAttr 0x7fc81dc8c410 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fc81dc8c4b0 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fc81dc8c608 <col:3, /usr/include/xlocale.h:47:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:99:9 referenced messages 'const std::__1::locale::category':'const int' static cinit
| |-ParenExpr 0x7fc81dc8c7d8 </usr/include/xlocale.h:47:27, col:34> 'int'
| | `-BinaryOperator 0x7fc81dc8c7b0 <col:28, col:33> 'int' '<<'
| |   |-IntegerLiteral 0x7fc81dc8c770 <col:28> 'int' 1
| |   `-IntegerLiteral 0x7fc81dc8c790 <col:33> 'int' 2
| |-AvailabilityAttr 0x7fc81dc8c668 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fc81dc8c708 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-VarDecl 0x7fc81dc8c860 <col:3, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:100:61> col:9 all 'const std::__1::locale::category':'const int' static cinit
| |-BinaryOperator 0x7fc81dc8cbe8 <col:15, col:61> 'int' '|'
| | |-BinaryOperator 0x7fc81dc8cb80 <col:15, col:54> 'int' '|'
| | | |-BinaryOperator 0x7fc81dc8cb18 <col:15, col:44> 'int' '|'
| | | | |-BinaryOperator 0x7fc81dc8cab0 <col:15, col:33> 'int' '|'
| | | | | |-BinaryOperator 0x7fc81dc8ca48 <col:15, col:25> 'int' '|'
| | | | | | |-ImplicitCastExpr 0x7fc81dc8ca18 <col:15> 'std::__1::locale::category':'int' <LValueToRValue>
| | | | | | | `-DeclRefExpr 0x7fc81dc8c9c8 <col:15> 'const std::__1::locale::category':'const int' lvalue Var 0x7fc81dc8ba50 'collate' 'const std::__1::locale::category':'const int'
| | | | | | `-ImplicitCastExpr 0x7fc81dc8ca30 <col:25> 'std::__1::locale::category':'int' <LValueToRValue>
| | | | | |   `-DeclRefExpr 0x7fc81dc8c9f0 <col:25> 'const std::__1::locale::category':'const int' lvalue Var 0x7fc81dc8bca8 'ctype' 'const std::__1::locale::category':'const int'
| | | | | `-ImplicitCastExpr 0x7fc81dc8ca98 <col:33> 'std::__1::locale::category':'int' <LValueToRValue>
| | | | |   `-DeclRefExpr 0x7fc81dc8ca70 <col:33> 'const std::__1::locale::category':'const int' lvalue Var 0x7fc81dc8bf00 'monetary' 'const std::__1::locale::category':'const int'
| | | | `-ImplicitCastExpr 0x7fc81dc8cb00 <col:44> 'std::__1::locale::category':'int' <LValueToRValue>
| | | |   `-DeclRefExpr 0x7fc81dc8cad8 <col:44> 'const std::__1::locale::category':'const int' lvalue Var 0x7fc81dc8c158 'numeric' 'const std::__1::locale::category':'const int'
| | | `-ImplicitCastExpr 0x7fc81dc8cb68 <col:54> 'std::__1::locale::category':'int' <LValueToRValue>
| | |   `-DeclRefExpr 0x7fc81dc8cb40 <col:54> 'const std::__1::locale::category':'const int' lvalue Var 0x7fc81dc8c3b0 'time' 'const std::__1::locale::category':'const int'
| | `-ImplicitCastExpr 0x7fc81dc8cbd0 <col:61> 'std::__1::locale::category':'int' <LValueToRValue>
| |   `-DeclRefExpr 0x7fc81dc8cba8 <col:61> 'const std::__1::locale::category':'const int' lvalue Var 0x7fc81dc8c608 'messages' 'const std::__1::locale::category':'const int'
| |-AvailabilityAttr 0x7fc81dc8c8c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:1175:18, col:56> ios 7.0 0 0 "" Strict ""
| `-AvailabilityAttr 0x7fc81dc8c960 <line:1174:18, col:60> macos 10.9 0 0 "" Strict ""
|-CXXConstructorDecl 0x7fc81dc8cd20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:103:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:103:5 locale 'void (void) noexcept'
|-CXXConstructorDecl 0x7fc81dc8cee8 <line:104:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:104:5 referenced locale 'void (const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7fc81dc8cdd8 <col:12, col:24> col:25 'const class std::__1::locale &'
|-CXXConstructorDecl 0x7fc81dc8d038 <line:105:5, col:32> col:14 locale 'void (const char *)'
| `-ParmVarDecl 0x7fc81dc8cfb0 <col:21, col:31> col:32 'const char *'
|-CXXConstructorDecl 0x7fc81dc8d180 <line:106:5, col:34> col:14 locale 'void (const std::__1::string &)'
| `-ParmVarDecl 0x7fc81dc8d0f8 <col:21, col:33> col:34 'const std::__1::string &'
|-CXXConstructorDecl 0x7fc81dc8d460 <line:107:5, col:48> col:5 locale 'void (const class std::__1::locale &, const char *, std::__1::locale::category)'
| |-ParmVarDecl 0x7fc81dc8d240 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7fc81dc8d2b8 <col:27, col:37> col:38 'const char *'
| `-ParmVarDecl 0x7fc81dc8d328 <col:40> col:48 'std::__1::locale::category':'int'
|-CXXConstructorDecl 0x7fc81dc8d740 <line:108:5, col:50> col:5 locale 'void (const class std::__1::locale &, const std::__1::string &, std::__1::locale::category)'
| |-ParmVarDecl 0x7fc81dc8d530 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7fc81dc8d5a0 <col:27, col:39> col:40 'const std::__1::string &'
| `-ParmVarDecl 0x7fc81dc8d610 <col:42> col:50 'std::__1::locale::category':'int'
|-FunctionTemplateDecl 0x7fc81dc8db18 <line:109:5, line:110:64> col:35 locale
| |-TemplateTypeParmDecl 0x7fc81dc8d800 <line:109:15, col:21> col:21 referenced class depth 0 index 0 _Facet
| `-CXXConstructorDecl 0x7fc81dc8da70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:110:64> col:35 locale 'void (const class std::__1::locale &, _Facet *)'
|   |-ParmVarDecl 0x7fc81dc8d8c0 <col:42, col:54> col:55 'const class std::__1::locale &'
|   |-ParmVarDecl 0x7fc81dc8d958 <col:57, col:63> col:64 '_Facet *'
|   |-AlwaysInlineAttr 0x7fc81dc8db78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|   `-VisibilityAttr 0x7fc81dc8dbc0 <col:51, col:74> Hidden
|-CXXConstructorDecl 0x7fc81dc8ddf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:111:5, col:50> col:5 locale 'void (const class std::__1::locale &, const class std::__1::locale &, std::__1::locale::category)'
| |-ParmVarDecl 0x7fc81dc8dbe0 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7fc81dc8dc50 <col:27, col:39> col:40 'const class std::__1::locale &'
| `-ParmVarDecl 0x7fc81dc8dcc0 <col:42> col:50 'std::__1::locale::category':'int'
|-CXXDestructorDecl 0x7fc81dc8df00 <line:113:5, col:13> col:5 referenced ~locale 'void (void) noexcept'
|-CXXMethodDecl 0x7fc81dc8e0b8 <line:115:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:115:19 operator= 'const class std::__1::locale &(const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7fc81dc8dfb0 <col:29, col:41> col:42 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7fc81dc8e3a8 <line:117:5, line:119:37> col:14 combine
| |-TemplateTypeParmDecl 0x7fc81dc8e158 <line:117:15, col:21> col:21 class depth 0 index 0 _Facet
| `-CXXMethodDecl 0x7fc81dc8e310 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:119:37> col:14 combine 'class std::__1::locale (const class std::__1::locale &) const' inline
|   |-ParmVarDecl 0x7fc81dc8e220 <col:22, col:34> col:35 'const class std::__1::locale &'
|   `-VisibilityAttr 0x7fc81dc8e400 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:644:40, col:63> Hidden
|-CXXMethodDecl 0x7fc81dc8e468 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:122:5, col:19> col:12 name 'std::__1::string (void) const'
|-CXXMethodDecl 0x7fc81dc8e5d0 <line:123:5, col:36> col:10 used operator== '_Bool (const class std::__1::locale &) const'
| `-ParmVarDecl 0x7fc81dc8e510 <col:21, col:33> col:34 'const class std::__1::locale &'
|-CXXMethodDecl 0x7fc81dc8e708 <line:124:5, col:70> col:10 operator!= '_Bool (const class std::__1::locale &) const'
| |-ParmVarDecl 0x7fc81dc8e680 <col:21, col:35> col:35 used __y 'const class std::__1::locale &'
| `-CompoundStmt 0x7fc81dc91420 <col:46, col:70>
|   `-ReturnStmt 0x7fc81dc91408 <col:47, col:68>
|     `-UnaryOperator 0x7fc81dc913e8 <col:54, col:68> '_Bool' prefix '!'
|       `-ParenExpr 0x7fc81dc913c8 <col:55, col:68> '_Bool'
|         `-CXXOperatorCallExpr 0x7fc81dc91380 <col:56, col:65> '_Bool'
|           |-ImplicitCastExpr 0x7fc81dc91368 <col:62> '_Bool (*)(const class std::__1::locale &) const' <FunctionToPointerDecay>
|           | `-DeclRefExpr 0x7fc81dc91310 <col:62> '_Bool (const class std::__1::locale &) const' lvalue CXXMethod 0x7fc81dc8e5d0 'operator==' '_Bool (const class std::__1::locale &) const'
|           |-UnaryOperator 0x7fc81dc90040 <col:56, col:57> 'const class std::__1::locale' lvalue prefix '*'
|           | `-CXXThisExpr 0x7fc81dc90028 <col:57> 'const class std::__1::locale *' this
|           `-DeclRefExpr 0x7fc81dc90060 <col:65> 'const class std::__1::locale' lvalue ParmVar 0x7fc81dc8e680 '__y' 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7fc81dc8ee98 <line:125:5, line:128:73> line:127:12 operator()
| |-TemplateTypeParmDecl 0x7fc81dc8e7a8 <line:125:15, col:21> col:21 referenced class depth 0 index 0 _CharT
| |-TemplateTypeParmDecl 0x7fc81dc8e818 <col:29, col:35> col:35 referenced class depth 0 index 1 _Traits
| |-TemplateTypeParmDecl 0x7fc81dc8e888 <col:44, col:50> col:50 referenced class depth 0 index 2 _Allocator
| `-CXXMethodDecl 0x7fc81dc8ee00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:128:73> line:127:12 operator() '_Bool (const basic_string<_CharT, _Traits, _Allocator> &, const basic_string<_CharT, _Traits, _Allocator> &) const' inline
|   |-ParmVarDecl 0x7fc81dc8eaf0 <col:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   |-ParmVarDecl 0x7fc81dc8ecf0 <line:128:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   `-VisibilityAttr 0x7fc81dc8eef8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:644:40, col:63> Hidden
|-CXXMethodDecl 0x7fc81dc8f010 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:131:5, col:39> col:19 global 'class std::__1::locale (const class std::__1::locale &)' static
| `-ParmVarDecl 0x7fc81dc8ef50 <col:26, col:38> col:39 'const class std::__1::locale &'
|-CXXMethodDecl 0x7fc81dc8f100 <line:132:5, col:34> col:26 classic 'const class std::__1::locale &(void)' static
|-AccessSpecDecl 0x7fc81dc8f198 <line:134:1, col:8> col:1 private
|-CXXRecordDecl 0x7fc81dc8f1c0 <line:135:5, col:11> col:11 referenced class __imp
|-FieldDecl 0x7fc81dc8f2b8 <line:136:5, col:12> col:12 __locale_ 'class std::__1::locale::__imp *'
|-CXXMethodDecl 0x7fc81dc8f500 <line:138:5, col:52> col:10 referenced __install_ctor 'void (const class std::__1::locale &, class std::__1::locale::facet *, long)'
| |-ParmVarDecl 0x7fc81dc8f310 <col:25, col:37> col:38 'const class std::__1::locale &'
| |-ParmVarDecl 0x7fc81dc8f3a8 <col:40, col:45> col:46 'class std::__1::locale::facet *'
| `-ParmVarDecl 0x7fc81dc8f420 <col:48> col:52 'long'
|-CXXMethodDecl 0x7fc81dc8f630 <line:139:5, col:29> col:20 __global 'class std::__1::locale &(void)' static
|-CXXMethodDecl 0x7fc81dc8f7d0 <line:140:5, col:25> col:10 referenced has_facet '_Bool (class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7fc81dc8f708 <col:20, col:22> col:23 'class std::__1::locale::id &'
|-CXXMethodDecl 0x7fc81dc8f970 <line:141:5, col:33> col:18 referenced use_facet 'const class std::__1::locale::facet *(class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7fc81dc8f880 <col:28, col:30> col:31 'class std::__1::locale::id &'
|-FriendDecl 0x7fc81dc8fc98 <line:143:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:143:41
| `-FunctionTemplateDecl 0x7fc81dc8fbd8 parent 0x7fc81dc8aae0 prev 0x7fc81dc8af10 <col:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:143:41 has_facet
|   |-TemplateTypeParmDecl 0x7fc81dc8fa10 <col:15, col:21> col:21 class depth 0 index 0 _Facet
|   `-FunctionDecl 0x7fc81dc8fb30 parent 0x7fc81dc8aae0 prev 0x7fc81dc8ae78 <col:29, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:143:41 has_facet '_Bool (const class std::__1::locale &) noexcept'
|     |-ParmVarDecl 0x7fc81dc8faa0 <col:51, col:63> col:64 'const class std::__1::locale &'
|     |-AlwaysInlineAttr 0x7fc81dc8fc78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|     `-VisibilityAttr 0x7fc81dc8fc88 <col:51, col:74> Inherited Hidden
`-FriendDecl 0x7fc81dc8ffb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:144:5, col:73> col:50
  `-FunctionTemplateDecl 0x7fc81dc8fef8 parent 0x7fc81dc8aae0 prev 0x7fc81dc8b248 <col:5, col:73> col:50 use_facet
    |-TemplateTypeParmDecl 0x7fc81dc8fcd0 <col:15, col:21> col:21 referenced class depth 0 index 0 _Facet
    `-FunctionDecl 0x7fc81dc8fe50 parent 0x7fc81dc8aae0 prev 0x7fc81dc8b1b0 <col:29, col:73> col:50 use_facet 'const _Facet &(const class std::__1::locale &)'
      |-ParmVarDecl 0x7fc81dc8fd60 <col:60, col:72> col:73 'const class std::__1::locale &'
      |-AlwaysInlineAttr 0x7fc81dc8ff98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
      `-VisibilityAttr 0x7fc81dc8ffa8 <col:51, col:74> Inherited Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  NonVirtualBaseLLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc81e827ed8 parent 0x7fc81f05cc88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:483:84> col:64 class basic_streambuf definition
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fc81ec94a28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fc81ec94ae8 prev 0x7fc81e827ed8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:125:1, col:28> col:28 implicit class basic_streambuf
|-AccessSpecDecl 0x7fc81ec94b80 <line:127:1, col:7> col:1 public
|-TypedefDecl 0x7fc81ec94be8 <line:129:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fc81ec94bb0 'char' sugar
|   |-TemplateTypeParmType 0x7fc81e336560 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fc81e336518 '_CharT'
|   `-BuiltinType 0x7fc81d833b60 'char'
|-TypedefDecl 0x7fc81ec94c78 <line:130:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fc81ec94c40 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fc81e3365d0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fc81e336588 '_Traits'
|   `-RecordType 0x7fc81e827760 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fc81f229148 'char_traits'
|-TypedefDecl 0x7fc81ec94d80 <line:131:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fc81ec94d30 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fc81f22ac90 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fc81f2294a8 'int_type'
|     `-BuiltinType 0x7fc81d833bc0 'int'
|-TypedefDecl 0x7fc81ec94e70 <line:132:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fc81ec94e20 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fc81ec94e00 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fc81f229578 'pos_type'
|     `-TypedefType 0x7fc81f21f710 'std::__1::streampos' sugar
|       |-Typedef 0x7fc81e82d5b8 'streampos'
|       `-TemplateSpecializationType 0x7fc81e82d510 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fc81e82d4f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fc81e82d400 'fpos'
|-TypedefDecl 0x7fc81ec94f60 <line:133:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fc81ec94f10 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fc81ec94ef0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fc81f229510 'off_type'
|     `-TypedefType 0x7fc81f21f680 'std::__1::streamoff' sugar
|       |-Typedef 0x7fc81e82d958 'streamoff'
|       `-BuiltinType 0x7fc81d833c00 'long long'
|-CXXDestructorDecl 0x7fc81ec94fe8 <line:135:5, col:30> col:13 ~basic_streambuf 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7fc81ec95120 <line:138:5, line:144:5> line:139:12 pubimbue 'class std::__1::locale (const class std::__1::locale &)' inline
| |-ParmVarDecl 0x7fc81ec95098 <col:21, col:35> col:35 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7fc81ec951f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ec95240 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:146:5, line:147:44> col:12 getloc 'class std::__1::locale (void) const' inline
| `-AlwaysInlineAttr 0x7fc81ec952e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ec95500 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:150:5, line:152:32> line:151:22 pubsetbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7fc81ec95388 <col:32, col:43> col:43 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fc81ec953e8 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7fc81ec955b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ec96840 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:154:5, line:157:46> line:155:14 referenced pubseekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7fc81ec96650 <col:25, col:34> col:34 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7fc81ec966b0 <col:41, col:59> col:59 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| |-ParmVarDecl 0x7fc81ec96710 <line:156:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7fc81ec96900 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ec96ad0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:159:5, line:162:38> line:160:14 referenced pubseekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7fc81ec96958 <col:25, col:34> col:34 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| |-ParmVarDecl 0x7fc81ec969b8 <line:161:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7fc81ec96b88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ec96bd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:164:5, line:165:36> col:9 referenced pubsync 'int (void)' inline
| `-AlwaysInlineAttr 0x7fc81ec96c78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ec96cc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:169:5, line:174:5> line:170:16 in_avail 'std::__1::streamsize (void)' inline
| `-AlwaysInlineAttr 0x7fc81ec96d68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ec96e20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:176:5, line:181:5> line:177:14 snextc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7fc81ec96ec8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ec96f30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:183:5, line:188:5> line:184:14 sbumpc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7fc81ec96fd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ec97040 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:190:5, line:195:5> line:191:14 sgetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7fc81ec970e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ec972b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:197:5, line:199:32> line:198:16 referenced sgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7fc81ec97140 <col:22, col:33> col:33 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fc81ec971a0 <col:38, col:49> col:49 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7fc81ec97368 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ec97480 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:202:5, line:207:5> line:203:14 sputbackc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7fc81ec973c0 <col:24, col:34> col:34 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7fc81ec97530 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ec97598 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:209:5, line:214:5> line:210:14 sungetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7fc81ec97640 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ec97720 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:217:5, line:223:5> line:218:14 sputc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7fc81ec97698 <col:20, col:30> col:30 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7fc81ec977d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ec979d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:225:5, line:227:32> line:226:16 referenced sputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7fc81ec97858 <col:22, col:39> col:39 __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fc81ec978b8 <col:44, col:55> col:55 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7fc81ec97a88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-AccessSpecDecl 0x7fc81ec97ad0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:229:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fc81ec97b38 <line:230:5, col:21> col:5 basic_streambuf 'void (void)'
|-CXXConstructorDecl 0x7fc81ec97d10 <line:231:5, col:49> col:5 basic_streambuf 'void (const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7fc81ec97c28 <col:21, col:44> col:44 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7fc81ec97ed0 <line:232:5, col:60> col:22 operator= 'class std::__1::basic_streambuf<char> &(const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7fc81ec97e08 <col:32, col:55> col:55 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7fc81ec98050 <line:233:5, col:37> col:10 swap 'void (class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7fc81ec97f90 <col:15, col:32> col:32 __rhs 'class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7fc81ec98180 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:236:68> col:38 eback 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fc81ec98228 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81ec98290 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:237:68> col:38 gptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fc81ec98338 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81ec983a0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:238:68> col:38 egptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fc81ec98448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81ec98518 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:240:5, line:241:43> col:10 gbump 'void (int)' inline
| |-ParmVarDecl 0x7fc81ec98490 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7fc81ec985c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ec98830 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:243:5, line:248:5> line:244:10 setg 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7fc81ec98620 <col:15, col:26> col:26 __gbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fc81ec98690 <col:34, col:45> col:45 __gnext 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fc81ec98700 <col:54, col:65> col:65 __gend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7fc81ec988f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ec98958 <line:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:251:68> col:38 pbase 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fc81ec98a00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81ec98a68 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:252:68> col:38 pptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fc81ec98b10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81ec98b78 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:253:68> col:38 epptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fc81ec98c20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fc81ec98cf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:255:5, line:256:43> col:10 pbump 'void (int)' inline
| |-ParmVarDecl 0x7fc81ec98c68 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7fc81ec98da0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ec98f80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:258:5, line:262:5> line:259:10 setp 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7fc81ec98df8 <col:15, col:26> col:26 __pbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fc81ec98e68 <col:34, col:45> col:45 __pend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7fc81ec99038 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:745:95> always_inline
|-CXXMethodDecl 0x7fc81ec99108 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:266:5, col:43> col:18 imbue 'void (const class std::__1::locale &)' virtual
| `-ParmVarDecl 0x7fc81ec99080 <col:24, col:38> col:38 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7fc81ec992b8 <line:269:5, col:67> col:30 setbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7fc81ec991c8 <col:37, col:48> col:48 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fc81ec99228 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fc81ec994d8 <line:270:5, line:271:87> line:270:22 seekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7fc81ec99380 <col:30, col:39> col:39 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7fc81ec993e0 <col:46, col:64> col:64 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-ParmVarDecl 0x7fc81ec99440 <line:271:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fc81ec99698 <line:272:5, line:273:87> line:272:22 seekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7fc81ec995a8 <col:30, col:39> col:39 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ParmVarDecl 0x7fc81ec99608 <line:273:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fc81ec99750 <line:274:5, col:22> col:17 sync 'int (void)' virtual
|-CXXMethodDecl 0x7fc81ec997f8 <line:277:5, col:34> col:24 showmanyc 'std::__1::streamsize (void)' virtual
|-CXXMethodDecl 0x7fc81ec999a0 <line:278:5, col:61> col:24 xsgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7fc81ec998b0 <col:31, col:42> col:42 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fc81ec99910 <col:47, col:58> col:58 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fc81ec99a78 <line:279:5, col:32> col:22 underflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7fc81ec99b40 <line:280:5, col:28> col:22 uflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7fc81ec99cc0 <line:283:5, col:65> col:22 pbackfail 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7fc81ec99bf8 <col:32, col:64> col:41 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7fc81ec99e70 <line:286:5, col:67> col:24 xsputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7fc81ec99d80 <col:31, col:48> col:48 __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fc81ec99de0 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fc81ec99fc0 <line:287:5, col:64> col:22 overflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7fc81ec99f38 <col:31, col:63> col:40 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-AccessSpecDecl 0x7fc81ec9a070 <line:289:1, col:8> col:1 private
|-FieldDecl 0x7fc81ec9a098 <line:290:5, col:12> col:12 __loc_ 'class std::__1::locale'
|-FieldDecl 0x7fc81ec9a0f0 <line:291:5, col:16> col:16 __binp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fc81ec9a148 <line:292:5, col:16> col:16 __ninp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fc81ec9a1a0 <line:293:5, col:16> col:16 __einp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fc81ec9a1f8 <line:294:5, col:16> col:16 __bout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fc81ec9a250 <line:295:5, col:16> col:16 __nout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
`-FieldDecl 0x7fc81ec9a2a8 <line:296:5, col:16> col:16 __eout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct __sbuf
         0 |   unsigned char * _base
         8 |   int _size
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __sFILE
         0 |   unsigned char * _p
         8 |   int _r
        12 |   int _w
        16 |   short _flags
        18 |   short _file
        24 |   struct __sbuf _bf
        24 |     unsigned char * _base
        32 |     int _size
        40 |   int _lbfsize
        48 |   void * _cookie
        56 |   int (* _Nullable)(void *) _close
        64 |   int (* _Nullable)(void *, char *, int) _read
        72 |   fpos_t (* _Nullable)(void *, fpos_t, int) _seek
        80 |   int (* _Nullable)(void *, const char *, int) _write
        88 |   struct __sbuf _ub
        88 |     unsigned char * _base
        96 |     int _size
       104 |   struct __sFILEX * _extra
       112 |   int _ur
       116 |   unsigned char [3] _ubuf
       119 |   unsigned char [1] _nbuf
       120 |   struct __sbuf _lb
       120 |     unsigned char * _base
       128 |     int _size
       136 |   int _blksize
       144 |   fpos_t _offset
           | [sizeof=152, dsize=152, align=8,
           |  nvsize=152, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc81f04eb58 </usr/include/stdio.h:88:1, line:91:1> line:88:8 struct __sbuf definition
|-CXXRecordDecl 0x7fc81f04ec78 <col:1, col:8> col:8 implicit struct __sbuf
|-FieldDecl 0x7fc81f04ed50 <line:89:2, col:17> col:17 _base 'unsigned char *'
`-FieldDecl 0x7fc81f04edb0 <line:90:2, col:7> col:7 _size 'int'

Layout: <CGRecordLayout
  LLVMType:%struct.__sbuf = type { i8*, i32 }
  NonVirtualBaseLLVMType:%struct.__sbuf = type { i8*, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc81f04eed0 </usr/include/stdio.h:122:9, line:153:1> line:122:16 struct __sFILE definition
|-CXXRecordDecl 0x7fc81f04eff8 <col:9, col:16> col:16 implicit struct __sFILE
|-FieldDecl 0x7fc81f04f0a8 <line:123:2, col:17> col:17 referenced _p 'unsigned char *'
|-FieldDecl 0x7fc81f04f108 <line:124:2, col:6> col:6 _r 'int'
|-FieldDecl 0x7fc81f04f168 <line:125:2, col:6> col:6 referenced _w 'int'
|-FieldDecl 0x7fc81f04f1c8 <line:126:2, col:8> col:8 _flags 'short'
|-FieldDecl 0x7fc81f04f228 <line:127:2, col:8> col:8 _file 'short'
|-FieldDecl 0x7fc81f04f2c0 <line:128:2, col:16> col:16 _bf 'struct __sbuf':'struct __sbuf'
|-FieldDecl 0x7fc81f04f320 <line:129:2, col:6> col:6 referenced _lbfsize 'int'
|-FieldDecl 0x7fc81f04f380 <line:132:2, col:8> col:8 _cookie 'void *'
|-FieldDecl 0x7fc81f051200 <line:133:2, col:19> col:19 _close 'int (* _Nullable)(void *)':'int (*)(void *)'
|-FieldDecl 0x7fc81f051528 <line:134:2, col:19> col:19 _read 'int (* _Nullable)(void *, char *, int)':'int (*)(void *, char *, int)'
|-FieldDecl 0x7fc81f0518b0 <line:135:2, col:22> col:22 _seek 'fpos_t (* _Nullable)(void *, fpos_t, int)':'fpos_t (*)(void *, fpos_t, int)'
|-FieldDecl 0x7fc81f051bd8 <line:136:2, col:19> col:19 _write 'int (* _Nullable)(void *, const char *, int)':'int (*)(void *, const char *, int)'
|-FieldDecl 0x7fc81f051c40 <line:139:2, col:16> col:16 _ub 'struct __sbuf':'struct __sbuf'
|-FieldDecl 0x7fc81f051d40 <line:140:2, col:19> col:19 _extra 'struct __sFILEX *'
|-FieldDecl 0x7fc81f051da0 <line:141:2, col:6> col:6 _ur 'int'
|-FieldDecl 0x7fc81f051e70 <line:144:2, col:23> col:16 _ubuf 'unsigned char [3]'
|-FieldDecl 0x7fc81f051f40 <line:145:2, col:23> col:16 _nbuf 'unsigned char [1]'
|-FieldDecl 0x7fc81f051fa8 <line:148:2, col:16> col:16 _lb 'struct __sbuf':'struct __sbuf'
|-FieldDecl 0x7fc81f052008 <line:151:2, col:6> col:6 _blksize 'int'
`-FieldDecl 0x7fc81f052060 <line:152:2, col:9> col:9 _offset 'fpos_t':'long long'

Layout: <CGRecordLayout
  LLVMType:%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
  NonVirtualBaseLLVMType:%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::__shared_count
         0 |   (__shared_count vtable pointer)
         8 |   long __shared_owners_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc81e9e5380 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3410:1, line:3448:1> line:3410:24 referenced class __shared_count definition
|-VisibilityAttr 0x7fc81e9e54a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fc81e9e54f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3410:1, col:24> col:24 implicit referenced class __shared_count
|-CXXConstructorDecl 0x7fc81e9e56e0 <line:3412:5, col:41> col:5 __shared_count 'void (const class std::__1::__shared_count &)'
| `-ParmVarDecl 0x7fc81e9e55c8 <col:20, col:40> col:41 'const class std::__1::__shared_count &'
|-CXXMethodDecl 0x7fc81e9e5890 <line:3413:5, col:52> col:21 operator= 'class std::__1::__shared_count &(const class std::__1::__shared_count &)'
| `-ParmVarDecl 0x7fc81e9e57a0 <col:31, col:51> col:52 'const class std::__1::__shared_count &'
|-AccessSpecDecl 0x7fc81e9e5930 <line:3415:1, col:10> col:1 protected
|-FieldDecl 0x7fc81e9e5970 <line:3416:5, col:10> col:10 referenced __shared_owners_ 'long'
|-CXXDestructorDecl 0x7fc81e9e5a08 <line:3417:5, col:29> col:13 used ~__shared_count 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fc81e9e5aa8 <line:3418:1, col:8> col:1 private
|-CXXMethodDecl 0x7fc81e9e5af8 <line:3419:5, col:49> col:18 referenced __on_zero_shared 'void (void) noexcept' virtual pure
|-AccessSpecDecl 0x7fc81e9e5b90 <line:3421:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fc81e9e5cc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3424:37> line:3423:14 used __shared_count 'void (long) noexcept'
| |-ParmVarDecl 0x7fc81e9e5c00 <col:29, col:43> col:34 used __refs 'long' cinit
| | `-ImplicitCastExpr 0x7fc81e9e6298 <col:43> 'long' <IntegralCast>
| |   `-IntegerLiteral 0x7fc81e9e6278 <col:43> 'int' 0
| |-CXXCtorInitializer Field 0x7fc81e9e5970 '__shared_owners_' 'long'
| | `-ImplicitCastExpr 0x7fc81e9e6308 <line:3424:28> 'long' <LValueToRValue>
| |   `-DeclRefExpr 0x7fc81e9e62b0 <col:28> 'long' lvalue ParmVar 0x7fc81e9e5c00 '__refs' 'long'
| |-CompoundStmt 0x7fc81e9e6350 <col:36, col:37>
| |-AlwaysInlineAttr 0x7fc81e9e5d78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81e9e5dc0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81e9e5e28 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3434:5> line:3432:10 used __add_shared 'void (void) noexcept'
| |-CompoundStmt 0x7fc81e9e68a0 <col:35, line:3434:5>
| | `-CallExpr 0x7fc81e9e6870 <line:3433:7, col:58> 'long':'long'
| |   |-ImplicitCastExpr 0x7fc81e9e6858 <col:7> 'long (*)(long &) noexcept' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7fc81e9e67c8 <col:7> 'long (long &) noexcept' lvalue Function 0x7fc81e9e6688 '__libcpp_atomic_refcount_increment' 'long (long &) noexcept' (FunctionTemplate 0x7fc81e9e3ad0 '__libcpp_atomic_refcount_increment')
| |   `-MemberExpr 0x7fc81e9e63d8 <col:42> 'long' lvalue ->__shared_owners_ 0x7fc81e9e5970
| |     `-CXXThisExpr 0x7fc81e9e63c0 <col:42> 'class std::__1::__shared_count *' this
| |-AlwaysInlineAttr 0x7fc81e9e5ec0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81e9e5f08 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fc81e9e5f70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3442:5> line:3436:10 used __release_shared '_Bool (void) noexcept'
| |-CompoundStmt 0x7fc81e9e6f08 <col:39, line:3442:5>
| | |-IfStmt 0x7fc81e9e6ea0 <line:3437:7, line:3440:7>
| | | |-<<<NULL>>>
| | | |-<<<NULL>>>
| | | |-BinaryOperator 0x7fc81e9e6da8 <line:3437:11, col:68> '_Bool' '=='
| | | | |-CallExpr 0x7fc81e9e6d20 <col:11, col:62> 'long':'long'
| | | | | |-ImplicitCastExpr 0x7fc81e9e6d08 <col:11> 'long (*)(long &) noexcept' <FunctionToPointerDecay>
| | | | | | `-DeclRefExpr 0x7fc81e9e6ca8 <col:11> 'long (long &) noexcept' lvalue Function 0x7fc81e9e6b68 '__libcpp_atomic_refcount_decrement' 'long (long &) noexcept' (FunctionTemplate 0x7fc81e9e3fe0 '__libcpp_atomic_refcount_decrement')
| | | | | `-MemberExpr 0x7fc81e9e6930 <col:46> 'long' lvalue ->__shared_owners_ 0x7fc81e9e5970
| | | | |   `-CXXThisExpr 0x7fc81e9e6918 <col:46> 'class std::__1::__shared_count *' this
| | | | `-ImplicitCastExpr 0x7fc81e9e6d90 <col:67, col:68> 'long' <IntegralCast>
| | | |   `-UnaryOperator 0x7fc81e9e6d70 <col:67, col:68> 'int' prefix '-'
| | | |     `-IntegerLiteral 0x7fc81e9e6d50 <col:68> 'int' 1
| | | |-CompoundStmt 0x7fc81e9e6e78 <col:71, line:3440:7>
| | | | |-CXXMemberCallExpr 0x7fc81e9e6e20 <line:3438:9, col:26> 'void'
| | | | | `-MemberExpr 0x7fc81e9e6de8 <col:9> '<bound member function type>' ->__on_zero_shared 0x7fc81e9e5af8
| | | | |   `-CXXThisExpr 0x7fc81e9e6dd0 <col:9> 'class std::__1::__shared_count *' this
| | | | `-ReturnStmt 0x7fc81e9e6e60 <line:3439:9, col:16>
| | | |   `-CXXBoolLiteralExpr 0x7fc81e9e6e48 <col:16> '_Bool' true
| | | `-<<<NULL>>>
| | `-ReturnStmt 0x7fc81e9e6ef0 <line:3441:7, col:14>
| |   `-CXXBoolLiteralExpr 0x7fc81e9e6ed8 <col:14> '_Bool' false
| |-AlwaysInlineAttr 0x7fc81e9e6008 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81e9e6050 <col:51, col:74> Hidden
`-CXXMethodDecl 0x7fc81e9e6150 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3447:5> line:3445:10 used use_count 'long (void) const noexcept'
  |-CompoundStmt 0x7fc81e9e74b8 <col:38, line:3447:5>
  | `-ReturnStmt 0x7fc81e9e74a0 <line:3446:9, col:59>
  |   `-BinaryOperator 0x7fc81e9e7478 <col:16, col:59> 'long' '+'
  |     |-CallExpr 0x7fc81e9e7410 <col:16, col:55> 'long':'long'
  |     | |-ImplicitCastExpr 0x7fc81e9e73f8 <col:16> 'long (*)(const long *)' <FunctionToPointerDecay>
  |     | | `-DeclRefExpr 0x7fc81e9e7370 <col:16> 'long (const long *)' lvalue Function 0x7fc81e9e7230 '__libcpp_relaxed_load' 'long (const long *)' (FunctionTemplate 0x7fc81e963108 '__libcpp_relaxed_load')
  |     | `-UnaryOperator 0x7fc81e9e6fd8 <col:38, col:39> 'const long *' prefix '&'
  |     |   `-MemberExpr 0x7fc81e9e6fa0 <col:39> 'const long' lvalue ->__shared_owners_ 0x7fc81e9e5970
  |     |     `-CXXThisExpr 0x7fc81e9e6f88 <col:39> 'const class std::__1::__shared_count *' this
  |     `-ImplicitCastExpr 0x7fc81e9e7460 <col:59> 'long' <IntegralCast>
  |       `-IntegerLiteral 0x7fc81e9e7440 <col:59> 'int' 1
  |-AlwaysInlineAttr 0x7fc81e9e61e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
  `-VisibilityAttr 0x7fc81e9e6230 <col:51, col:74> Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::locale::facet
         0 |   class std::__1::__shared_count (primary base)
         0 |     (__shared_count vtable pointer)
         8 |     long __shared_owners_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc81dc91490 parent 0x7fc81dc8b328 prev 0x7fc81dc8b560 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:147:1, line:161:1> line:147:32 referenced class facet definition
|-public 'class std::__1::__shared_count'
|-VisibilityAttr 0x7fc81dc915d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fc81dc91658 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:147:1, col:32> col:32 implicit referenced class facet
|-AccessSpecDecl 0x7fc81dc916f0 <line:150:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fc81dc91840 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:153:56> line:152:14 used facet 'void (size_t)'
| |-ParmVarDecl 0x7fc81dc91758 <col:20, col:36> col:27 used __refs 'size_t':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7fc81dc91d58 <col:36> 'size_t':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7fc81dc91d38 <col:36> 'int' 0
| |-CXXCtorInitializer 'class std::__1::__shared_count'
| | `-CXXConstructExpr 0x7fc81dc91eb0 <line:153:11, col:53> 'class std::__1::__shared_count' 'void (long) noexcept'
| |   `-BinaryOperator 0x7fc81dc91e48 <col:26, col:52> 'long' '-'
| |     |-CXXStaticCastExpr 0x7fc81dc91de0 <col:26, col:50> 'long' static_cast<long> <NoOp>
| |     | `-ImplicitCastExpr 0x7fc81dc91dc8 <col:44> 'long' <IntegralCast>
| |     |   `-ImplicitCastExpr 0x7fc81dc91db0 <col:44> 'size_t':'unsigned long' <LValueToRValue>
| |     |     `-DeclRefExpr 0x7fc81dc91d70 <col:44> 'size_t':'unsigned long' lvalue ParmVar 0x7fc81dc91758 '__refs' 'size_t':'unsigned long'
| |     `-ImplicitCastExpr 0x7fc81dc91e30 <col:52> 'long' <IntegralCast>
| |       `-IntegerLiteral 0x7fc81dc91e10 <col:52> 'int' 1
| |-CompoundStmt 0x7fc81dc91f18 <col:55, col:56>
| |-AlwaysInlineAttr 0x7fc81dc918f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fc81dc91938 <col:51, col:74> Hidden
|-CXXDestructorDecl 0x7fc81dc91998 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:155:5, col:20> col:13 used ~facet 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fc81dc91a38 <line:159:1, col:8> col:1 private
|-CXXMethodDecl 0x7fc81dc91a88 <line:160:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:160:18 __on_zero_shared 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7fc81dc91bb8 <line:147:32, <invalid sloc>> col:32 implicit operator= 'class std::__1::locale::facet &(const class std::__1::locale::facet &)' inline default_delete noexcept-unevaluated 0x7fc81dc91bb8
| `-ParmVarDecl 0x7fc81dc91cd0 <col:32> col:32 'const class std::__1::locale::facet &'
`-CXXConstructorDecl 0x7fc81dc96218 <col:32> col:32 implicit facet 'void (const class std::__1::locale::facet &)' inline default_delete noexcept-unevaluated 0x7fc81dc96218
  `-ParmVarDecl 0x7fc81dc96340 <col:32> col:32 'const class std::__1::locale::facet &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
  NonVirtualBaseLLVMType:%"class.std::__1::locale::facet" = type { %"class.std::__1::__shared_count" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::codecvt_base (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc81ec50170 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:832:1, line:837:1> line:832:24 referenced class codecvt_base definition
|-VisibilityAttr 0x7fc81ec50298 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fc81ec502e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:832:1, col:24> col:24 implicit referenced class codecvt_base
|-AccessSpecDecl 0x7fc81ec50378 <line:834:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fc81ec50438 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:835:43> col:27 used codecvt_base 'void (void)'
| |-CompoundStmt 0x7fc81ec50730 <col:42, col:43>
| |-AlwaysInlineAttr 0x7fc81ec504e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fc81ec50528 <col:48, col:71> Hidden
|-EnumDecl 0x7fc81ec50538 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:836:5, col:44> col:10 referenced result
| |-EnumConstantDecl 0x7fc81ec505f0 <col:18> col:18 referenced ok 'enum std::__1::codecvt_base::result'
| |-EnumConstantDecl 0x7fc81ec50638 <col:22> col:22 referenced partial 'enum std::__1::codecvt_base::result'
| |-EnumConstantDecl 0x7fc81ec50680 <col:31> col:31 referenced error 'enum std::__1::codecvt_base::result'
| `-EnumConstantDecl 0x7fc81ec506c8 <col:38> col:38 referenced noconv 'enum std::__1::codecvt_base::result'
|-CXXDestructorDecl 0x7fc81ec54528 <line:832:24> col:24 implicit ~codecvt_base 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fc81ec54738 <col:24> col:24 implicit constexpr codecvt_base 'void (const class std::__1::codecvt_base &)' inline default trivial noexcept-unevaluated 0x7fc81ec54738
| `-ParmVarDecl 0x7fc81ec54860 <col:24> col:24 'const class std::__1::codecvt_base &'
`-CXXConstructorDecl 0x7fc81ec548f8 <col:24> col:24 implicit constexpr codecvt_base 'void (class std::__1::codecvt_base &&)' inline default trivial noexcept-unevaluated 0x7fc81ec548f8
  `-ParmVarDecl 0x7fc81ec54a20 <col:24> col:24 'class std::__1::codecvt_base &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::codecvt_base" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::codecvt_base.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::codecvt<char, char, mbstate_t>
         0 |   class std::__1::locale::facet (primary base)
         0 |     class std::__1::__shared_count (primary base)
         0 |       (__shared_count vtable pointer)
         8 |       long __shared_owners_
         0 |   class std::__1::codecvt_base (base) (empty)
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc81ec50cb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:845:1, line:927:1> line:846:24 class codecvt definition
|-public 'class locale::facet':'class std::__1::locale::facet'
|-public 'class std::__1::codecvt_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'char'
|-TemplateArgument type '__mbstate_t'
|-VisibilityAttr 0x7fc81ec50e18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fc81ec51078 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:846:1, col:24> col:24 implicit referenced class codecvt
|-AccessSpecDecl 0x7fc81ec51110 <line:850:1, col:7> col:1 public
|-TypedefDecl 0x7fc81ec51148 <line:851:5, col:23> col:23 referenced intern_type 'char'
| `-BuiltinType 0x7fc81d833b60 'char'
|-TypedefDecl 0x7fc81ec511b0 <line:852:5, col:23> col:23 referenced extern_type 'char'
| `-BuiltinType 0x7fc81d833b60 'char'
|-TypedefDecl 0x7fc81ec51218 <line:853:5, col:23> col:23 referenced state_type 'mbstate_t':'__mbstate_t'
| `-TypedefType 0x7fc81d880580 'mbstate_t' sugar
|   |-Typedef 0x7fc81e8129f0 'mbstate_t'
|   `-TypedefType 0x7fc81e8129c0 '__darwin_mbstate_t' sugar
|     |-Typedef 0x7fc81d869f50 '__darwin_mbstate_t'
|     `-TypedefType 0x7fc81d869f20 '__mbstate_t' sugar
|       |-Typedef 0x7fc81d869eb0 '__mbstate_t'
|       `-ElaboratedType 0x7fc81d869e60 'union __mbstate_t' sugar
|         `-RecordType 0x7fc81d869c90 '__mbstate_t'
|           `-CXXRecord 0x7fc81d869bf8 ''
|-CXXConstructorDecl 0x7fc81ec51380 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:857:34> line:856:14 codecvt 'void (size_t)'
| |-ParmVarDecl 0x7fc81ec512b0 <col:22, col:38> col:29 used __refs 'size_t':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7fc81ec544d8 <col:38> 'size_t':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7fc81ec544b8 <col:38> 'int' 0
| |-CXXCtorInitializer 'class locale::facet':'class std::__1::locale::facet'
| | `-CXXConstructExpr 0x7fc81ec546b0 <line:857:11, col:31> 'class locale::facet':'class std::__1::locale::facet' 'void (size_t)'
| |   `-ImplicitCastExpr 0x7fc81ec54698 <col:25> 'size_t':'unsigned long' <LValueToRValue>
| |     `-DeclRefExpr 0x7fc81ec54610 <col:25> 'size_t':'unsigned long' lvalue ParmVar 0x7fc81ec512b0 '__refs' 'size_t':'unsigned long'
| |-CXXCtorInitializer 'class std::__1::codecvt_base'
| | `-CXXConstructExpr 0x7fc81ec54a88 <line:856:14> 'class std::__1::codecvt_base' 'void (void)'
| |-CompoundStmt 0x7fc81ec54b00 <line:857:33, col:34>
| |-AlwaysInlineAttr 0x7fc81ec51430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fc81ec51478 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fc81ec51b10 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:865:5> line:860:12 out 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const'
| |-ParmVarDecl 0x7fc81ec51548 <col:16, col:28> col:28 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fc81ec51608 <line:861:16, col:35> col:35 used __frm 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fc81ec51678 <col:42, col:61> col:61 used __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fc81ec51750 <col:72, col:92> col:92 used __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-ParmVarDecl 0x7fc81ec51808 <line:862:16, col:29> col:29 used __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fc81ec51878 <col:35, col:48> col:48 used __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fc81ec51950 <col:58, col:72> col:72 used __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-CompoundStmt 0x7fc81ec54d58 <line:863:5, line:865:5>
| | `-ReturnStmt 0x7fc81ec54d40 <line:864:9, col:82>
| |   `-CXXMemberCallExpr 0x7fc81ec54c80 <col:16, col:82> 'enum std::__1::codecvt_base::result'
| |     |-MemberExpr 0x7fc81ec54b30 <col:16> '<bound member function type>' ->do_out 0x7fc81ec53580
| |     | `-CXXThisExpr 0x7fc81ec54b18 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7fc81ec54b68 <col:23> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7fc81ec51548 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7fc81ec54ce0 <col:29> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fc81ec54b90 <col:29> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7fc81ec51608 '__frm' 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     |-ImplicitCastExpr 0x7fc81ec54cf8 <col:36> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fc81ec54bb8 <col:36> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7fc81ec51678 '__frm_end' 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     |-DeclRefExpr 0x7fc81ec54be0 <col:47> 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7fc81ec51750 '__frm_nxt' 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |     |-ImplicitCastExpr 0x7fc81ec54d10 <col:58> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fc81ec54c08 <col:58> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fc81ec51808 '__to' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7fc81ec54d28 <col:64> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fc81ec54c30 <col:64> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fc81ec51878 '__to_end' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     `-DeclRefExpr 0x7fc81ec54c58 <col:74> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fc81ec51950 '__to_nxt' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-AlwaysInlineAttr 0x7fc81ec51be0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fc81ec51c28 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fc81ec51f10 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:872:5> line:868:12 unshift 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const'
| |-ParmVarDecl 0x7fc81ec51c78 <col:20, col:32> col:32 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fc81ec51ce8 <line:869:20, col:33> col:33 used __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fc81ec51d58 <col:39, col:52> col:52 used __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fc81ec51dd0 <col:62, col:76> col:76 used __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-CompoundStmt 0x7fc81ec54ef8 <line:870:5, line:872:5>
| | `-ReturnStmt 0x7fc81ec54ee0 <line:871:9, col:57>
| |   `-CXXMemberCallExpr 0x7fc81ec54e68 <col:16, col:57> 'enum std::__1::codecvt_base::result'
| |     |-MemberExpr 0x7fc81ec54d90 <col:16> '<bound member function type>' ->do_unshift 0x7fc81ec53cd8
| |     | `-CXXThisExpr 0x7fc81ec54d78 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7fc81ec54dc8 <col:27> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7fc81ec51c78 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7fc81ec54eb0 <col:33> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fc81ec54df0 <col:33> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fc81ec51ce8 '__to' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7fc81ec54ec8 <col:39> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fc81ec54e18 <col:39> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fc81ec51d58 '__to_end' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     `-DeclRefExpr 0x7fc81ec54e40 <col:49> 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fc81ec51dd0 '__to_nxt' 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-AlwaysInlineAttr 0x7fc81ec51fc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fc81ec52010 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fc81ec524e0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:880:5> line:875:12 in 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *&) const'
| |-ParmVarDecl 0x7fc81ec52060 <col:15, col:27> col:27 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fc81ec520f8 <line:876:15, col:34> col:34 used __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fc81ec52168 <col:41, col:60> col:60 used __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fc81ec52210 <col:71, col:91> col:91 used __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-ParmVarDecl 0x7fc81ec522a8 <line:877:15, col:28> col:28 used __to 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fc81ec52318 <col:34, col:47> col:47 used __to_end 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fc81ec523c0 <col:57, col:71> col:71 used __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-CompoundStmt 0x7fc81ec55158 <line:878:5, line:880:5>
| | `-ReturnStmt 0x7fc81ec55140 <line:879:9, col:81>
| |   `-CXXMemberCallExpr 0x7fc81ec55080 <col:16, col:81> 'enum std::__1::codecvt_base::result'
| |     |-MemberExpr 0x7fc81ec54f30 <col:16> '<bound member function type>' ->do_in 0x7fc81ec53a00
| |     | `-CXXThisExpr 0x7fc81ec54f18 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7fc81ec54f68 <col:22> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7fc81ec52060 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7fc81ec550e0 <col:28> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fc81ec54f90 <col:28> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fc81ec520f8 '__frm' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7fc81ec550f8 <col:35> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fc81ec54fb8 <col:35> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fc81ec52168 '__frm_end' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-DeclRefExpr 0x7fc81ec54fe0 <col:46> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fc81ec52210 '__frm_nxt' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |     |-ImplicitCastExpr 0x7fc81ec55110 <col:57> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fc81ec55008 <col:57> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7fc81ec522a8 '__to' 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     |-ImplicitCastExpr 0x7fc81ec55128 <col:63> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fc81ec55030 <col:63> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7fc81ec52318 '__to_end' 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |     `-DeclRefExpr 0x7fc81ec55058 <col:73> 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *' lvalue ParmVar 0x7fc81ec523c0 '__to_nxt' 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-AlwaysInlineAttr 0x7fc81ec525b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fc81ec525f8 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fc81ec52668 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:886:5> line:883:9 encoding 'int (void) const noexcept'
| |-CompoundStmt 0x7fc81ec55208 <line:884:5, line:886:5>
| | `-ReturnStmt 0x7fc81ec551f0 <line:885:9, col:28>
| |   `-CXXMemberCallExpr 0x7fc81ec551c8 <col:16, col:28> 'int'
| |     `-MemberExpr 0x7fc81ec55190 <col:16> '<bound member function type>' ->do_encoding 0x7fc81ec53dc0
| |       `-CXXThisExpr 0x7fc81ec55178 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |-AlwaysInlineAttr 0x7fc81ec52700 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fc81ec52748 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fc81ec527b0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:892:5> line:889:10 always_noconv '_Bool (void) const noexcept'
| |-CompoundStmt 0x7fc81ec552b8 <line:890:5, line:892:5>
| | `-ReturnStmt 0x7fc81ec552a0 <line:891:9, col:33>
| |   `-CXXMemberCallExpr 0x7fc81ec55278 <col:16, col:33> '_Bool'
| |     `-MemberExpr 0x7fc81ec55240 <col:16> '<bound member function type>' ->do_always_noconv 0x7fc81ec53e80
| |       `-CXXThisExpr 0x7fc81ec55228 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |-AlwaysInlineAttr 0x7fc81ec52848 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fc81ec52890 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fc81ec52b78 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:898:5> line:895:9 length 'int (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, size_t) const'
| |-ParmVarDecl 0x7fc81ec528e0 <col:16, col:28> col:28 used __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fc81ec52950 <col:34, col:53> col:53 used __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fc81ec529c0 <col:60, col:79> col:79 used __end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fc81ec52a30 <col:86, col:93> col:93 used __mx 'size_t':'unsigned long'
| |-CompoundStmt 0x7fc81ec55470 <line:896:5, line:898:5>
| | `-ReturnStmt 0x7fc81ec55458 <line:897:9, col:50>
| |   `-CXXMemberCallExpr 0x7fc81ec553c8 <col:16, col:50> 'int'
| |     |-MemberExpr 0x7fc81ec552f0 <col:16> '<bound member function type>' ->do_length 0x7fc81ec54120
| |     | `-CXXThisExpr 0x7fc81ec552d8 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |     |-DeclRefExpr 0x7fc81ec55328 <col:26> 'std::__1::codecvt<char, char, __mbstate_t>::state_type':'__mbstate_t' lvalue ParmVar 0x7fc81ec528e0 '__st' 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |     |-ImplicitCastExpr 0x7fc81ec55410 <col:32> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fc81ec55350 <col:32> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fc81ec52950 '__frm' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     |-ImplicitCastExpr 0x7fc81ec55428 <col:39> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fc81ec55378 <col:39> 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *' lvalue ParmVar 0x7fc81ec529c0 '__end' 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |     `-ImplicitCastExpr 0x7fc81ec55440 <col:46> 'size_t':'unsigned long' <LValueToRValue>
| |       `-DeclRefExpr 0x7fc81ec553a0 <col:46> 'size_t':'unsigned long' lvalue ParmVar 0x7fc81ec52a30 '__mx' 'size_t':'unsigned long'
| |-AlwaysInlineAttr 0x7fc81ec52c30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fc81ec52c78 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fc81ec52ce8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:904:5> line:901:9 max_length 'int (void) const noexcept'
| |-CompoundStmt 0x7fc81ec55520 <line:902:5, line:904:5>
| | `-ReturnStmt 0x7fc81ec55508 <line:903:9, col:30>
| |   `-CXXMemberCallExpr 0x7fc81ec554e0 <col:16, col:30> 'int'
| |     `-MemberExpr 0x7fc81ec554a8 <col:16> '<bound member function type>' ->do_max_length 0x7fc81ec54208
| |       `-CXXThisExpr 0x7fc81ec55490 <col:16> 'const class std::__1::codecvt<char, char, mbstate_t> *' this
| |-AlwaysInlineAttr 0x7fc81ec52d80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fc81ec52dc8 <col:48, col:71> Hidden
|-VarDecl 0x7fc81ec52e38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:906:5, col:23> col:23 id 'class locale::id':'class std::__1::locale::id' static
|-AccessSpecDecl 0x7fc81ec52e98 <line:908:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fc81ec53008 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:911:34> line:910:14 codecvt 'void (const char *, size_t)'
| |-ParmVarDecl 0x7fc81ec52f08 <col:22, col:32> col:33 'const char *'
| |-ParmVarDecl 0x7fc81ec52f78 <col:35, col:51> col:42 used __refs 'size_t':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7fc81ec54510 <col:51> 'size_t':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7fc81ec544f0 <col:51> 'int' 0
| |-CXXCtorInitializer 'class locale::facet':'class std::__1::locale::facet'
| | `-CXXConstructExpr 0x7fc81ec555e8 <line:911:11, col:31> 'class locale::facet':'class std::__1::locale::facet' 'void (size_t)'
| |   `-ImplicitCastExpr 0x7fc81ec555d0 <col:25> 'size_t':'unsigned long' <LValueToRValue>
| |     `-DeclRefExpr 0x7fc81ec55548 <col:25> 'size_t':'unsigned long' lvalue ParmVar 0x7fc81ec52f78 '__refs' 'size_t':'unsigned long'
| |-CXXCtorInitializer 'class std::__1::codecvt_base'
| | `-CXXConstructExpr 0x7fc81ec55648 <line:910:14> 'class std::__1::codecvt_base' 'void (void)'
| |-CompoundStmt 0x7fc81ec556c0 <line:911:33, col:34>
| |-AlwaysInlineAttr 0x7fc81ec530c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
| `-VisibilityAttr 0x7fc81ec53108 <col:48, col:71> Hidden
|-CXXDestructorDecl 0x7fc81ec53168 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:913:5, col:14> col:5 ~codecvt 'void (void) noexcept'
|-CXXMethodDecl 0x7fc81ec53580 <line:915:5, line:917:93> line:915:20 used do_out 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *, const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const' virtual
| |-ParmVarDecl 0x7fc81ec53218 <col:27, col:39> col:39 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fc81ec53288 <line:916:27, col:46> col:46 __frm 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fc81ec532f8 <col:53, col:72> col:72 __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fc81ec53370 <col:83, col:103> col:103 __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
| |-ParmVarDecl 0x7fc81ec533e0 <line:917:27, col:40> col:40 __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fc81ec53450 <col:46, col:59> col:59 __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| `-ParmVarDecl 0x7fc81ec534c8 <col:69, col:83> col:83 __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
|-CXXMethodDecl 0x7fc81ec53a00 <line:918:5, line:920:92> line:918:20 used do_in 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *, std::__1::codecvt<char, char, __mbstate_t>::intern_type *&) const' virtual
| |-ParmVarDecl 0x7fc81ec53660 <col:26, col:38> col:38 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fc81ec536d0 <line:919:26, col:45> col:45 __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fc81ec53740 <col:52, col:71> col:71 __frm_end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fc81ec537b8 <col:82, col:102> col:102 __frm_nxt 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
| |-ParmVarDecl 0x7fc81ec53828 <line:920:26, col:39> col:39 __to 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| |-ParmVarDecl 0x7fc81ec53898 <col:45, col:58> col:58 __to_end 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *'
| `-ParmVarDecl 0x7fc81ec53910 <col:68, col:82> col:82 __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::intern_type *&'
|-CXXMethodDecl 0x7fc81ec53cd8 <line:921:5, line:922:97> line:921:20 used do_unshift 'enum std::__1::codecvt_base::result (std::__1::codecvt<char, char, __mbstate_t>::state_type &, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *, std::__1::codecvt<char, char, __mbstate_t>::extern_type *&) const' virtual
| |-ParmVarDecl 0x7fc81ec53ae0 <col:31, col:43> col:43 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fc81ec53b50 <line:922:31, col:44> col:44 __to 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fc81ec53bc0 <col:50, col:63> col:63 __to_end 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| `-ParmVarDecl 0x7fc81ec53c38 <col:73, col:87> col:87 __to_nxt 'std::__1::codecvt<char, char, __mbstate_t>::extern_type *&'
|-CXXMethodDecl 0x7fc81ec53dc0 <line:923:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:923:17 used do_encoding 'int (void) const noexcept' virtual
|-CXXMethodDecl 0x7fc81ec53e80 <line:924:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:924:18 used do_always_noconv '_Bool (void) const noexcept' virtual
|-CXXMethodDecl 0x7fc81ec54120 <line:925:5, col:110> col:17 used do_length 'int (std::__1::codecvt<char, char, __mbstate_t>::state_type &, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, const std::__1::codecvt<char, char, __mbstate_t>::extern_type *, size_t) const' virtual
| |-ParmVarDecl 0x7fc81ec53f28 <col:27, col:39> col:39 __st 'std::__1::codecvt<char, char, __mbstate_t>::state_type &'
| |-ParmVarDecl 0x7fc81ec53f98 <col:45, col:64> col:64 __frm 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| |-ParmVarDecl 0x7fc81ec54008 <col:71, col:90> col:90 __end 'const std::__1::codecvt<char, char, __mbstate_t>::extern_type *'
| `-ParmVarDecl 0x7fc81ec54078 <col:97, col:104> col:104 __mx 'size_t':'unsigned long'
|-CXXMethodDecl 0x7fc81ec54208 <line:926:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:926:17 used do_max_length 'int (void) const noexcept' virtual
`-CXXMethodDecl 0x7fc81ec54338 <line:846:24, <invalid sloc>> col:24 implicit operator= 'class std::__1::codecvt<char, char, mbstate_t> &(const class std::__1::codecvt<char, char, mbstate_t> &)' inline default_delete noexcept-unevaluated 0x7fc81ec54338
  `-ParmVarDecl 0x7fc81ec54450 <col:24> col:24 'const class std::__1::codecvt<char, char, mbstate_t> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::codecvt" = type { %"class.std::__1::locale::facet" }
  NonVirtualBaseLLVMType:%"class.std::__1::codecvt" = type { %"class.std::__1::locale::facet" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc81d869bf8 </usr/include/i386/_types.h:76:9, line:79:1> line:76:9 union definition
|-FieldDecl 0x7fc81d869d98 <line:77:2, col:22> col:8 __mbstate8 'char [128]'
|-FieldDecl 0x7fc81d869df8 <line:78:2, col:12> col:12 _mbstateL 'long long'
|-CXXConstructorDecl 0x7fc81ec69900 <line:76:9> col:9 implicit used  'void (void) noexcept' inline default trivial
| `-CompoundStmt 0x7fc81ec69d68 <col:9>
|-CXXConstructorDecl 0x7fc81ec69a18 <col:9> col:9 implicit constexpr  'void (const __mbstate_t &)' inline default trivial noexcept-unevaluated 0x7fc81ec69a18
| `-ParmVarDecl 0x7fc81ec69b40 <col:9> col:9 'const __mbstate_t &'
|-CXXConstructorDecl 0x7fc81ec69bd8 <col:9> col:9 implicit constexpr  'void (__mbstate_t &&)' inline default trivial noexcept-unevaluated 0x7fc81ec69bd8
| `-ParmVarDecl 0x7fc81ec69d00 <col:9> col:9 '__mbstate_t &&'
`-CXXDestructorDecl 0x7fc81dd5ea48 <col:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.__mbstate_t = type { i64, [120 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc81e829a28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:128:1, line:129:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:185:28 class basic_filebuf definition
|-public 'basic_streambuf<char, struct std::__1::char_traits<char> >':'class std::__1::basic_streambuf<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-CXXRecordDecl 0x7fc81dd5c018 prev 0x7fc81e829a28 <col:1, col:28> col:28 implicit class basic_filebuf
|-AccessSpecDecl 0x7fc81dd5c0b0 <line:188:1, col:7> col:1 public
|-TypedefDecl 0x7fc81dd5c0e8 <line:189:5, col:46> col:46 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fc81dd5bec0 'char' sugar
|   |-TemplateTypeParmType 0x7fc81ee23230 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fc81ee231e8 '_CharT'
|   `-BuiltinType 0x7fc81d833b60 'char'
|-TypedefDecl 0x7fc81dd5c150 <line:190:5, col:46> col:46 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fc81dd5bf00 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fc81ee232a0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fc81ee23258 '_Traits'
|   `-RecordType 0x7fc81e827760 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fc81f229148 'char_traits'
|-TypedefDecl 0x7fc81dd5c260 <line:191:5, col:46> col:46 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fc81dd5c210 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fc81f22ac90 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fc81f2294a8 'int_type'
|     `-BuiltinType 0x7fc81d833bc0 'int'
|-TypedefDecl 0x7fc81dd5c330 <line:192:5, col:46> col:46 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fc81dd5c2e0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fc81ec94e00 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fc81f229578 'pos_type'
|     `-TypedefType 0x7fc81f21f710 'std::__1::streampos' sugar
|       |-Typedef 0x7fc81e82d5b8 'streampos'
|       `-TemplateSpecializationType 0x7fc81e82d510 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fc81e82d4f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fc81e82d400 'fpos'
|-TypedefDecl 0x7fc81dd5c400 <line:193:5, col:46> col:46 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fc81dd5c3b0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fc81ec94ef0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fc81f229510 'off_type'
|     `-TypedefType 0x7fc81f21f680 'std::__1::streamoff' sugar
|       |-Typedef 0x7fc81e82d958 'streamoff'
|       `-BuiltinType 0x7fc81d833c00 'long long'
|-TypedefDecl 0x7fc81dd5c4f0 <line:194:5, col:46> col:46 state_type 'typename traits_type::state_type':'__mbstate_t'
| `-ElaboratedType 0x7fc81dd5c4a0 'typename traits_type::state_type' sugar
|   `-TypedefType 0x7fc81dd5c480 'std::__1::char_traits<char>::state_type' sugar
|     |-Typedef 0x7fc81f2295e0 'state_type'
|     `-TypedefType 0x7fc81d880580 'mbstate_t' sugar
|       |-Typedef 0x7fc81e8129f0 'mbstate_t'
|       `-TypedefType 0x7fc81e8129c0 '__darwin_mbstate_t' sugar
|         |-Typedef 0x7fc81d869f50 '__darwin_mbstate_t'
|         `-TypedefType 0x7fc81d869f20 '__mbstate_t' sugar
|           |-Typedef 0x7fc81d869eb0 '__mbstate_t'
|           `-ElaboratedType 0x7fc81d869e60 'union __mbstate_t' sugar
|             `-RecordType 0x7fc81d869c90 '__mbstate_t'
|               `-CXXRecord 0x7fc81d869bf8 ''
|-CXXConstructorDecl 0x7fc81dd5c588 <line:197:5, col:19> col:5 basic_filebuf 'void (void)'
|-CXXConstructorDecl 0x7fc81dd5c760 <line:199:5, col:40> col:5 basic_filebuf 'void (class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&)'
| `-ParmVarDecl 0x7fc81dd5c678 <col:19, col:35> col:35 __rhs 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&'
|-CXXDestructorDecl 0x7fc81dd5c850 <line:201:5, col:28> col:13 used ~basic_filebuf 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7fc81dd5ca00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:206:51> col:20 operator= 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &(class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&)'
| |-ParmVarDecl 0x7fc81dd5c938 <col:30, col:46> col:46 __rhs 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &&'
| `-AlwaysInlineAttr 0x7fc81dd5cab0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fc81dd5cbd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:208:5, col:35> col:10 swap 'void (class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &)'
| `-ParmVarDecl 0x7fc81dd5cb08 <col:15, col:30> col:30 __rhs 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &'
|-CXXMethodDecl 0x7fc81dd5cc80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:212:20> col:10 is_open '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fc81dd5cd28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fc81dd5cee0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:214:5, col:67> col:20 open 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > *(const char *, class ios_base::openmode)'
| |-ParmVarDecl 0x7fc81dd5cd70 <col:25, col:37> col:37 __s 'const char *'
| `-ParmVarDecl 0x7fc81dd5cdd0 <col:42, col:61> col:61 __mode 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fc81dd5d110 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:216:69> col:20 open 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > *(const std::__1::string &, class ios_base::openmode)'
| |-ParmVarDecl 0x7fc81dd5cf98 <col:25, col:39> col:39 __s 'const std::__1::string &'
| |-ParmVarDecl 0x7fc81dd5cff8 <col:44, col:63> col:63 __mode 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7fc81dd5d1c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fc81dd5d260 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:218:5, col:26> col:20 close 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > *(void)'
|-AccessSpecDecl 0x7fc81dd5d308 <line:220:1, col:10> col:1 protected
|-CXXMethodDecl 0x7fc81dd5d3a0 <line:222:5, col:32> col:22 underflow 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7fc81dd5d520 <line:223:5, col:65> col:22 pbackfail 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7fc81dd5d458 <col:32, col:64> col:41 __c 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7fc81dd5d668 <line:224:5, col:65> col:22 overflow 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7fc81dd5d5e0 <col:32, col:64> col:41 __c 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7fc81dd5d9a0 <line:225:5, col:91> col:54 setbuf 'basic_streambuf<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::traits_type> *(std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7fc81dd5d828 <col:61, col:72> col:72 __s 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fc81dd5d888 <col:77, col:88> col:88 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fc81dd5dc50 <line:226:5, line:227:85> line:226:22 seekoff 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7fc81dd5dab0 <col:30, col:39> col:39 __off 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7fc81dd5db10 <col:46, col:64> col:64 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-ParmVarDecl 0x7fc81dd5db70 <line:227:30, col:82> col:49 __wch 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fc81dd5de50 <line:228:5, line:229:85> line:228:22 seekpos 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7fc81dd5dd20 <col:30, col:39> col:39 __sp 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ParmVarDecl 0x7fc81dd5dd80 <line:229:30, col:82> col:49 __wch 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fc81dd5df08 <line:230:5, col:22> col:17 sync 'int (void)' virtual
|-CXXMethodDecl 0x7fc81dd5e038 <line:231:5, col:43> col:18 imbue 'void (const class std::__1::locale &)' virtual
| `-ParmVarDecl 0x7fc81dd5dfb0 <col:24, col:38> col:38 __loc 'const class std::__1::locale &'
|-AccessSpecDecl 0x7fc81dd5e0e8 <line:233:1, col:8> col:1 private
|-FieldDecl 0x7fc81dd5e110 <line:234:5, col:17> col:17 __extbuf_ 'char *'
|-FieldDecl 0x7fc81dd5e158 <line:235:5, col:17> col:17 __extbufnext_ 'const char *'
|-FieldDecl 0x7fc81dd5e1a0 <line:236:5, col:17> col:17 __extbufend_ 'const char *'
|-FieldDecl 0x7fc81dd5e1e8 <line:237:5, col:25> col:10 __extbuf_min_ 'char [8]'
|-FieldDecl 0x7fc81dd5e230 <line:238:5, col:12> col:12 __ebs_ 'size_t':'unsigned long'
|-FieldDecl 0x7fc81dd5e288 <line:239:5, col:16> col:16 __intbuf_ 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fc81dd5e2d0 <line:240:5, col:12> col:12 __ibs_ 'size_t':'unsigned long'
|-FieldDecl 0x7fc81dd5e318 <line:241:5, col:11> col:11 __file_ 'FILE *'
|-FieldDecl 0x7fc81dd5e4b0 <line:242:5, col:49> col:49 __cv_ 'const codecvt<std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::char_type, char, std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type> *'
|-FieldDecl 0x7fc81dd5e508 <line:243:5, col:16> col:16 __st_ 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type':'__mbstate_t'
|-FieldDecl 0x7fc81dd5e560 <line:244:5, col:16> col:16 __st_last_ 'std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >::state_type':'__mbstate_t'
|-FieldDecl 0x7fc81dd5e5a8 <line:245:5, col:24> col:24 __om_ 'class ios_base::openmode':'unsigned int'
|-FieldDecl 0x7fc81dd5e5f0 <line:246:5, col:24> col:24 __cm_ 'class ios_base::openmode':'unsigned int'
|-FieldDecl 0x7fc81dd5e638 <line:247:5, col:10> col:10 __owns_eb_ '_Bool'
|-FieldDecl 0x7fc81dd5e680 <line:248:5, col:10> col:10 __owns_ib_ '_Bool'
|-FieldDecl 0x7fc81dd5e6c8 <line:249:5, col:10> col:10 __always_noconv_ '_Bool'
|-CXXMethodDecl 0x7fc81dd5e710 <line:251:5, col:22> col:10 __read_mode '_Bool (void)'
|-CXXMethodDecl 0x7fc81dd5e7b8 <line:252:5, col:23> col:10 __write_mode 'void (void)'
`-CXXMethodDecl 0x7fc81dd5e8c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:129:32, <invalid sloc>> col:32 implicit operator= 'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &(const class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &)' inline default_delete noexcept-unevaluated 0x7fc81dd5e8c8
  `-ParmVarDecl 0x7fc81dd5e9e0 <col:32> col:32 'const class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> > &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_filebuf" = type <{ %"class.std::__1::basic_streambuf", i8*, i8*, i8*, [8 x i8], i64, i8*, i64, %struct.__sFILE*, %"class.std::__1::codecvt"*, %union.__mbstate_t, %union.__mbstate_t, i32, i32, i8, i8, i8, [5 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_filebuf.base" = type <{ %"class.std::__1::basic_streambuf", i8*, i8*, i8*, [8 x i8], i64, i8*, i64, %struct.__sFILE*, %"class.std::__1::codecvt"*, %union.__mbstate_t, %union.__mbstate_t, i32, i32, i8, i8, i8 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc81e82a318 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:134:1, line:135:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1323:28 class basic_fstream definition
|-public 'basic_iostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_iostream<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-CXXRecordDecl 0x7fc81dd5a5a0 prev 0x7fc81e82a318 <col:1, col:28> col:28 implicit class basic_fstream
|-AccessSpecDecl 0x7fc81dd5a638 <line:1326:1, col:7> col:1 public
|-TypedefDecl 0x7fc81dd5a670 <line:1327:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fc81dd5a430 'char' sugar
|   |-TemplateTypeParmType 0x7fc81dd398d0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fc81dd39888 '_CharT'
|   `-BuiltinType 0x7fc81d833b60 'char'
|-TypedefDecl 0x7fc81dd5a6d8 <line:1328:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fc81dd5a470 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fc81dd39940 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fc81dd398f8 '_Traits'
|   `-RecordType 0x7fc81e827760 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fc81f229148 'char_traits'
|-TypedefDecl 0x7fc81dd5a7e0 <line:1329:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fc81dd5a790 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fc81f22ac90 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fc81f2294a8 'int_type'
|     `-BuiltinType 0x7fc81d833bc0 'int'
|-TypedefDecl 0x7fc81dd5a8b0 <line:1330:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fc81dd5a860 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fc81ec94e00 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fc81f229578 'pos_type'
|     `-TypedefType 0x7fc81f21f710 'std::__1::streampos' sugar
|       |-Typedef 0x7fc81e82d5b8 'streampos'
|       `-TemplateSpecializationType 0x7fc81e82d510 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fc81e82d4f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fc81e82d400 'fpos'
|-TypedefDecl 0x7fc81dd5a980 <line:1331:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fc81dd5a930 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fc81ec94ef0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fc81f229510 'off_type'
|     `-TypedefType 0x7fc81f21f680 'std::__1::streamoff' sugar
|       |-Typedef 0x7fc81e82d958 'streamoff'
|       `-BuiltinType 0x7fc81d833c00 'long long'
|-CXXConstructorDecl 0x7fc81dd5aa18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1334:19> col:5 used basic_fstream 'void (void)'
| `-AlwaysInlineAttr 0x7fc81dd5aaf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fc81dd5ac50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1337:101> col:14 used basic_fstream 'void (const char *, class ios_base::openmode)'
| |-ParmVarDecl 0x7fc81dd5ab40 <col:28, col:40> col:40 __s 'const char *'
| |-ParmVarDecl 0x7fc81dd5aba0 <col:45, col:98> col:64 __mode 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7fc81dd5ad18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fc81dd5ae70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1339:103> col:14 basic_fstream 'void (const std::__1::string &, class ios_base::openmode)'
| |-ParmVarDecl 0x7fc81dd5ad60 <col:28, col:42> col:42 __s 'const std::__1::string &'
| |-ParmVarDecl 0x7fc81dd5adc0 <col:47, col:100> col:66 __mode 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7fc81dd5af38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fc81dd5b0a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1343:40> col:5 basic_fstream 'void (class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&)'
| |-ParmVarDecl 0x7fc81dd5afb8 <col:19, col:35> col:35 __rhs 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&'
| `-AlwaysInlineAttr 0x7fc81dd5b160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fc81dd5b2b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1346:51> col:20 operator= 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &(class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&)'
| |-ParmVarDecl 0x7fc81dd5b1e8 <col:30, col:46> col:46 __rhs 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &&'
| `-AlwaysInlineAttr 0x7fc81dd5b360 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fc81dd5b480 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1349:35> col:10 swap 'void (class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &)'
| |-ParmVarDecl 0x7fc81dd5b3b8 <col:15, col:30> col:30 __rhs 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &'
| `-AlwaysInlineAttr 0x7fc81dd5b530 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fc81dd5b740 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1352:52> col:44 rdbuf 'basic_filebuf<std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7fc81dd5b7e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fc81dd5b830 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1354:20> col:10 is_open '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fc81dd5b8d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fc81dd5ba10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1356:5, col:88> col:10 open 'void (const char *, class ios_base::openmode)'
| |-ParmVarDecl 0x7fc81dd5b920 <col:15, col:27> col:27 __s 'const char *'
| `-ParmVarDecl 0x7fc81dd5b980 <col:32, col:85> col:51 __mode 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fc81dd5bbb8 <line:1357:5, col:90> col:10 open 'void (const std::__1::string &, class ios_base::openmode)'
| |-ParmVarDecl 0x7fc81dd5bac8 <col:15, col:29> col:29 __s 'const std::__1::string &'
| `-ParmVarDecl 0x7fc81dd5bb28 <col:34, col:87> col:53 __mode 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fc81dd5bc70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1360:16> col:10 close 'void (void)'
| `-AlwaysInlineAttr 0x7fc81dd5bd18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-AccessSpecDecl 0x7fc81dd5bd60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/fstream:1362:1, col:8> col:1 private
|-FieldDecl 0x7fc81dd5eb28 <line:1363:5, col:43> col:43 __sb_ 'basic_filebuf<std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_fstream<char, struct std::__1::char_traits<char> >::traits_type>':'class std::__1::basic_filebuf<char, struct std::__1::char_traits<char> >'
|-CXXConstructorDecl 0x7fc81dd5eb98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:135:32> col:32 implicit basic_fstream 'void (const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &)' inline default_delete noexcept-unevaluated 0x7fc81dd5eb98
| `-ParmVarDecl 0x7fc81dd5ecc0 <col:32> col:32 'const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &'
|-CXXMethodDecl 0x7fc81dd5ed28 <col:32, <invalid sloc>> col:32 implicit operator= 'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &(const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &)' inline default_delete noexcept-unevaluated 0x7fc81dd5ed28
| `-ParmVarDecl 0x7fc81dd5ee40 <col:32> col:32 'const class std::__1::basic_fstream<char, struct std::__1::char_traits<char> > &'
`-CXXDestructorDecl 0x7fc81dd5eec8 <col:32> col:32 implicit used ~basic_fstream 'void (void) noexcept' inline default
  `-CompoundStmt 0x7fc81dd60d08 <col:32>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_fstream" = type { %"class.std::__1::basic_iostream.base", %"class.std::__1::basic_filebuf", %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_fstream.base" = type { %"class.std::__1::basic_iostream.base", %"class.std::__1::basic_filebuf" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc81dd59058 </Users/tskull/Documents/Programming/Cpp/object_model_refined/2_constructors/11_member_initialization_list.cpp:11:1, line:40:1> line:11:8 referenced struct C definition
|-public 'struct B'
|-CXXRecordDecl 0x7fc81dd591b8 <col:1, col:8> col:8 implicit referenced struct C
|-FieldDecl 0x7fc81dd59268 <line:12:5, col:19> col:19 x 'unsigned char'
|-FieldDecl 0x7fc81dd592c8 <line:13:5, col:19> col:19 referenced y 'unsigned char'
|-FieldDecl 0x7fc81dd59390 <line:14:5, col:16> col:16 referenced m 'std::mutex':'class std::__1::mutex'
|-FieldDecl 0x7fc81dd5a2d8 <line:15:5, col:33> col:33 lg 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
|-FieldDecl 0x7fc81dd5efa8 <line:16:5, col:18> col:18 f1 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
|-FieldDecl 0x7fc81dd5f040 <line:17:5, col:18> col:18 f2 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
|-CXXConstructorDecl 0x7fc81dd5f170 <line:19:5, line:25:21> line:19:5 used C 'void (int)'
| |-ParmVarDecl 0x7fc81dd5f0a0 <col:7, col:11> col:11 used x 'int'
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7fc81dd60430 <col:16, col:21> 'struct B' 'void (int)'
| |   `-IntegerLiteral 0x7fc81dd603b8 <col:18> 'int' 123
| |-CXXCtorInitializer Field 0x7fc81dd59268 'x' 'unsigned char'
| | `-InitListExpr 0x7fc81dd60578 <line:20:17, col:47> 'unsigned char'
| |   `-CXXStaticCastExpr 0x7fc81dd60500 <col:18, col:46> 'unsigned char' static_cast<unsigned char> <NoOp>
| |     `-ImplicitCastExpr 0x7fc81dd604e8 <col:45> 'unsigned char' <IntegralCast>
| |       `-ImplicitCastExpr 0x7fc81dd604d0 <col:45> 'int' <LValueToRValue>
| |         `-DeclRefExpr 0x7fc81dd60490 <col:45> 'int' lvalue ParmVar 0x7fc81dd5f0a0 'x' 'int'
| |-CXXCtorInitializer Field 0x7fc81dd592c8 'y' 'unsigned char'
| | `-InitListExpr 0x7fc81dd60650 <line:21:17, col:19> 'unsigned char'
| |   `-ImplicitCastExpr 0x7fc81dd60690 <col:18> 'unsigned char' <IntegralCast>
| |     `-IntegerLiteral 0x7fc81dd605e8 <col:18> 'int' 0
| |-CXXCtorInitializer Field 0x7fc81dd59390 'm' 'std::mutex':'class std::__1::mutex'
| | `-CXXConstructExpr 0x7fc81dd60c78 <line:25:16, col:18> 'std::mutex':'class std::__1::mutex' 'void (void) noexcept' zeroing
| |-CXXCtorInitializer Field 0x7fc81dd5a2d8 'lg' 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
| | `-CXXConstructExpr 0x7fc81dd60b70 <line:24:16, col:20> 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>' 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |   `-MemberExpr 0x7fc81dd60b08 <col:19> 'std::mutex':'class std::__1::mutex' lvalue ->m 0x7fc81dd59390
| |     `-CXXThisExpr 0x7fc81dd60af0 <col:19> 'struct C *' this
| |-CXXCtorInitializer Field 0x7fc81dd5efa8 'f1' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7fc81dd60848 <line:22:16, col:43> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (const char *, class ios_base::openmode)'
| |   |-ImplicitCastExpr 0x7fc81dd60818 <col:19> 'const char *' <ArrayToPointerDecay>
| |   | `-StringLiteral 0x7fc81dd606d8 <col:19> 'const char [8]' lvalue "test.cc"
| |   `-ImplicitCastExpr 0x7fc81dd60830 <col:30, col:40> 'std::__1::ios_base::openmode':'unsigned int' <LValueToRValue>
| |     `-DeclRefExpr 0x7fc81dd60790 <col:30, col:40> 'const std::__1::ios_base::openmode':'const unsigned int' lvalue Var 0x7fc81ec7f250 'app' 'const std::__1::ios_base::openmode':'const unsigned int'
| |-CXXCtorInitializer Field 0x7fc81dd5f040 'f2' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7fc81dd60a88 <line:23:16, col:63> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (const char *, class ios_base::openmode)'
| |   |-ImplicitCastExpr 0x7fc81dd60a70 <col:19> 'const char *' <ArrayToPointerDecay>
| |   | `-StringLiteral 0x7fc81dd608b0 <col:19> 'const char [9]' lvalue "test.bin"
| |   `-BinaryOperator 0x7fc81dd60a10 <col:31, col:60> 'unsigned int' '|'
| |     |-ImplicitCastExpr 0x7fc81dd609e0 <col:31, col:41> 'std::__1::ios_base::openmode':'unsigned int' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fc81dd60928 <col:31, col:41> 'const std::__1::ios_base::openmode':'const unsigned int' lvalue Var 0x7fc81ec7f450 'binary' 'const std::__1::ios_base::openmode':'const unsigned int'
| |     `-ImplicitCastExpr 0x7fc81dd609f8 <col:50, col:60> 'std::__1::ios_base::openmode':'unsigned int' <LValueToRValue>
| |       `-DeclRefExpr 0x7fc81dd609a8 <col:50, col:60> 'const std::__1::ios_base::openmode':'const unsigned int' lvalue Var 0x7fc81ec7f250 'app' 'const std::__1::ios_base::openmode':'const unsigned int'
| `-CompoundStmt 0x7fc81dd60d20 <line:25:20, col:21>
|-CXXConstructorDecl 0x7fc81dd5f300 <line:27:5, line:31:22> line:27:5 used C 'void (double)'
| |-ParmVarDecl 0x7fc81dd5f238 <col:7, col:14> col:14 used a 'double'
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7fc81dd60db0 <line:28:15, col:18> 'struct B' 'void (int)'
| |   `-IntegerLiteral 0x7fc81dd60d38 <col:17> 'int' 0
| |-CXXCtorInitializer Field 0x7fc81dd59268 'x' 'unsigned char'
| | `-InitListExpr 0x7fc81dd61060 <line:30:16, col:18> 'unsigned char'
| |   `-ImplicitCastExpr 0x7fc81dd610a0 <col:17> 'unsigned char' <LValueToRValue>
| |     `-MemberExpr 0x7fc81dd60fe0 <col:17> 'unsigned char' lvalue ->y 0x7fc81dd592c8
| |       `-CXXThisExpr 0x7fc81dd60fc8 <col:17> 'struct C *' this
| |-CXXCtorInitializer Field 0x7fc81dd592c8 'y' 'unsigned char'
| | `-InitListExpr 0x7fc81dd60f58 <line:29:16, col:50> 'unsigned char'
| |   `-CXXStaticCastExpr 0x7fc81dd60ee0 <col:17, col:49> 'unsigned char' static_cast<unsigned char> <NoOp>
| |     `-ImplicitCastExpr 0x7fc81dd60ec8 <col:44, col:48> 'unsigned char' <FloatingToIntegral>
| |       `-BinaryOperator 0x7fc81dd60e88 <col:44, col:48> 'double' '+'
| |         |-ImplicitCastExpr 0x7fc81dd60e58 <col:44> 'double' <LValueToRValue>
| |         | `-DeclRefExpr 0x7fc81dd60e10 <col:44> 'double' lvalue ParmVar 0x7fc81dd5f238 'a' 'double'
| |         `-ImplicitCastExpr 0x7fc81dd60e70 <col:48> 'double' <IntegralToFloating>
| |           `-IntegerLiteral 0x7fc81dd60e38 <col:48> 'int' 1
| |-CXXCtorInitializer Field 0x7fc81dd59390 'm' 'std::mutex':'class std::__1::mutex'
| | `-CXXConstructExpr 0x7fc81dd611e0 <line:27:5> 'std::mutex':'class std::__1::mutex' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7fc81dd5a2d8 'lg' 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
| | `-CXXConstructExpr 0x7fc81dd61180 <line:31:15, col:19> 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>' 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |   `-MemberExpr 0x7fc81dd61100 <col:18> 'std::mutex':'class std::__1::mutex' lvalue ->m 0x7fc81dd59390
| |     `-CXXThisExpr 0x7fc81dd610e8 <col:18> 'struct C *' this
| |-CXXCtorInitializer Field 0x7fc81dd5efa8 'f1' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7fc81dd61238 <line:27:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| |-CXXCtorInitializer Field 0x7fc81dd5f040 'f2' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7fc81dd61290 <col:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| `-CompoundStmt 0x7fc81dd61320 <line:31:21, col:22>
|-CXXConstructorDecl 0x7fc81dd5f3d0 <line:33:5, line:39:18> line:33:5 used C 'void (void)'
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7fc81dd613b0 <line:35:15, col:20> 'struct B' 'void (int)'
| |   `-IntegerLiteral 0x7fc81dd61338 <col:17> 'int' 789
| |-CXXCtorInitializer Field 0x7fc81dd59268 'x' 'unsigned char'
| | `-InitListExpr 0x7fc81dd61478 <line:36:16, col:18> 'unsigned char'
| |   `-ImplicitCastExpr 0x7fc81dd614b8 <col:17> 'unsigned char' <IntegralCast>
| |     `-IntegerLiteral 0x7fc81dd61410 <col:17> 'int' 0
| |-CXXCtorInitializer Field 0x7fc81dd592c8 'y' 'unsigned char'
| | `-InitListExpr 0x7fc81dd61568 <line:37:16, col:18> 'unsigned char'
| |   `-ImplicitCastExpr 0x7fc81dd615a8 <col:17> 'unsigned char' <IntegralCast>
| |     `-IntegerLiteral 0x7fc81dd61500 <col:17> 'int' 0
| |-CXXCtorInitializer Field 0x7fc81dd59390 'm' 'std::mutex':'class std::__1::mutex'
| | `-CXXConstructExpr 0x7fc81dd616e8 <line:33:5> 'std::mutex':'class std::__1::mutex' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7fc81dd5a2d8 'lg' 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>'
| | `-CXXConstructExpr 0x7fc81dd61688 <line:38:15, col:19> 'std::lock_guard<std::mutex>':'class std::__1::lock_guard<class std::__1::mutex>' 'void (std::__1::lock_guard<class std::__1::mutex>::mutex_type &)'
| |   `-MemberExpr 0x7fc81dd61608 <col:18> 'std::mutex':'class std::__1::mutex' lvalue ->m 0x7fc81dd59390
| |     `-CXXThisExpr 0x7fc81dd615f0 <col:18> 'struct C *' this
| |-CXXCtorInitializer Field 0x7fc81dd5efa8 'f1' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7fc81dd61740 <line:33:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| |-CXXCtorInitializer Field 0x7fc81dd5f040 'f2' 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >'
| | `-CXXConstructExpr 0x7fc81dd61798 <col:5> 'std::fstream':'class std::__1::basic_fstream<char, struct std::__1::char_traits<char> >' 'void (void)'
| `-CXXTryStmt 0x7fc81dd61870 <line:34:5, line:39:18>
|   |-CompoundStmt 0x7fc81dd61828 <line:38:21, col:22>
|   `-CXXCatchStmt 0x7fc81dd61858 <line:39:5, col:18>
|     |-<<<NULL>>>
|     `-CompoundStmt 0x7fc81dd61840 <col:17, col:18>
|-CXXConstructorDecl 0x7fc81dd5f828 <line:11:8> col:8 implicit C 'void (const struct C &)' inline default_delete noexcept-unevaluated 0x7fc81dd5f828
| `-ParmVarDecl 0x7fc81dd5f950 <col:8> col:8 'const struct C &'
|-CXXConstructorDecl 0x7fc81dd5fac8 <col:8> col:8 implicit C 'void (struct C &&)' inline default_delete noexcept-unevaluated 0x7fc81dd5fac8
| `-ParmVarDecl 0x7fc81dd5fbf0 <col:8> col:8 'struct C &&'
|-CXXMethodDecl 0x7fc81dd5fc88 <col:8, <invalid sloc>> col:8 implicit operator= 'struct C &(const struct C &)' inline default_delete noexcept-unevaluated 0x7fc81dd5fc88
| `-ParmVarDecl 0x7fc81dd5fda0 <col:8> col:8 'const struct C &'
|-CXXMethodDecl 0x7fc81dd60138 <col:8, <invalid sloc>> col:8 implicit operator= 'struct C &(struct C &&)' inline default_delete noexcept-unevaluated 0x7fc81dd60138
| `-ParmVarDecl 0x7fc81dd60250 <col:8> col:8 'struct C &&'
`-CXXDestructorDecl 0x7fc81dd602d8 <col:8> col:8 implicit used ~C 'void (void) noexcept' inline default
  `-CompoundStmt 0x7fc81dd61a30 <col:8>

Layout: <CGRecordLayout
  LLVMType:%struct.C = type { %struct.B, i8, i8, %"class.std::__1::mutex", %"class.std::__1::lock_guard", %"class.std::__1::basic_fstream", %"class.std::__1::basic_fstream" }
  NonVirtualBaseLLVMType:%struct.C = type { %struct.B, i8, i8, %"class.std::__1::mutex", %"class.std::__1::lock_guard", %"class.std::__1::basic_fstream", %"class.std::__1::basic_fstream" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1225:9)
         0 |   struct std::__1::_PairT __t
         0 |     size_t first
         8 |     size_t second
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__murmur2_or_cityhash<unsigned long, 64> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1190:9)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1208:9)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |       union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw
