
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1507:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1504:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1507:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::once_flag
         0 |   unsigned long __state_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale::id
         0 |   struct std::__1::once_flag __flag_
         0 |     unsigned long __state_
         8 |   int32_t __id_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__basic_string_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>
         0 |   class std::__1::allocator<char> (base) (empty)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
         0 |   class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
         0 |     class std::__1::allocator<char> (base) (empty)
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<char>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |     class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
         0 |       class std::__1::allocator<char> (base) (empty)
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<wchar_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2>
         0 |   class std::__1::allocator<wchar_t> (base) (empty)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> >
         0 |   class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2> (base)
         0 |     class std::__1::allocator<wchar_t> (base) (empty)
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |           union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<wchar_t>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> > __r_
         0 |     class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2> (base)
         0 |       class std::__1::allocator<wchar_t> (base) (empty)
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |             union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::money_base::pattern
         0 |   char [4] field
           | [sizeof=4, dsize=4, align=1,
           |  nvsize=4, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__bitset<0, 0> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class P3
         0 |   float _x
         4 |   float _y
         8 |   float _z
           | [sizeof=12, dsize=12, align=4,
           |  nvsize=12, nvalign=4]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f8b29d95c08 <object_model_refined/4_functions/03_static_member_functions.cpp:4:1, line:18:1> line:4:7 referenced class P3 definition
|-CXXRecordDecl 0x7f8b29d95d28 <col:1, col:7> col:7 implicit referenced class P3
|-AccessSpecDecl 0x7f8b29d95dc0 <line:5:1, col:7> col:1 public
|-CXXConstructorDecl 0x7f8b29d95e58 <line:6:5, line:9:5> line:6:5 used P3 'void (void)'
| |-CXXCtorInitializer Field 0x7f8b29d960b8 '_x' 'float'
| | `-InitListExpr 0x7f8b29d962f8 <col:14, col:18> 'float'
| |   `-ImplicitCastExpr 0x7f8b29d96338 <col:15> 'float' <FloatingCast>
| |     `-FloatingLiteral 0x7f8b29d96290 <col:15> 'double' 0.000000e+00
| |-CXXCtorInitializer Field 0x7f8b29d96118 '_y' 'float'
| | `-InitListExpr 0x7f8b29d963e8 <col:23, col:27> 'float'
| |   `-ImplicitCastExpr 0x7f8b29d96428 <col:24> 'float' <FloatingCast>
| |     `-FloatingLiteral 0x7f8b29d96380 <col:24> 'double' 0.000000e+00
| |-CXXCtorInitializer Field 0x7f8b29d96178 '_z' 'float'
| | `-InitListExpr 0x7f8b29d964d8 <col:32, col:36> 'float'
| |   `-ImplicitCastExpr 0x7f8b29d96518 <col:33> 'float' <FloatingCast>
| |     `-FloatingLiteral 0x7f8b29d96470 <col:33> 'double' 0.000000e+00
| `-CompoundStmt 0x7f8b29d965c0 <line:7:5, line:9:5>
|   `-UnaryOperator 0x7f8b29d965a0 <line:8:9, col:11> 'std::size_t':'unsigned long' lvalue prefix '++'
|     `-DeclRefExpr 0x7f8b29d96578 <col:11> 'std::size_t':'unsigned long' lvalue Var 0x7f8b29d96210 '_object_count' 'std::size_t':'unsigned long'
|-CXXMethodDecl 0x7f8b29d95fe0 <line:11:5, col:37> col:24 used object_count 'std::size_t (void)' static
|-AccessSpecDecl 0x7f8b29d96078 <line:13:1, col:8> col:1 private
|-FieldDecl 0x7f8b29d960b8 <line:14:5, col:11> col:11 _x 'float'
|-FieldDecl 0x7f8b29d96118 <line:15:5, col:11> col:11 _y 'float'
|-FieldDecl 0x7f8b29d96178 <line:16:5, col:11> col:11 _z 'float'
|-VarDecl 0x7f8b29d96210 <line:17:5, col:24> col:24 used _object_count 'std::size_t':'unsigned long' static
|-CXXConstructorDecl 0x7f8b29d96ae8 <line:4:7> col:7 implicit constexpr P3 'void (const class P3 &)' inline default trivial noexcept-unevaluated 0x7f8b29d96ae8
| `-ParmVarDecl 0x7f8b29d96c10 <col:7> col:7 'const class P3 &'
`-CXXConstructorDecl 0x7f8b29d96ca8 <col:7> col:7 implicit constexpr P3 'void (class P3 &&)' inline default trivial noexcept-unevaluated 0x7f8b29d96ca8
  `-ParmVarDecl 0x7f8b29d96dd0 <col:7> col:7 'class P3 &&'

Layout: <CGRecordLayout
  LLVMType:%class.P3 = type { float, float, float }
  NonVirtualBaseLLVMType:%class.P3 = type { float, float, float }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::ios_base
         0 |   (ios_base vtable pointer)
         8 |   std::__1::ios_base::fmtflags __fmtflags_
        16 |   std::__1::streamsize __precision_
        24 |   std::__1::streamsize __width_
        32 |   std::__1::ios_base::iostate __rdstate_
        36 |   std::__1::ios_base::iostate __exceptions_
        40 |   void * __rdbuf_
        48 |   void * __loc_
        56 |   std::__1::ios_base::event_callback * __fn_
        64 |   int * __index_
        72 |   size_t __event_size_
        80 |   size_t __event_cap_
        88 |   long * __iarray_
        96 |   size_t __iarray_size_
       104 |   size_t __iarray_cap_
       112 |   void ** __parray_
       120 |   size_t __parray_size_
       128 |   size_t __parray_cap_
           | [sizeof=136, dsize=136, align=8,
           |  nvsize=136, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ios<char>
         0 |   class std::__1::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     std::__1::ios_base::fmtflags __fmtflags_
        16 |     std::__1::streamsize __precision_
        24 |     std::__1::streamsize __width_
        32 |     std::__1::ios_base::iostate __rdstate_
        36 |     std::__1::ios_base::iostate __exceptions_
        40 |     void * __rdbuf_
        48 |     void * __loc_
        56 |     std::__1::ios_base::event_callback * __fn_
        64 |     int * __index_
        72 |     size_t __event_size_
        80 |     size_t __event_cap_
        88 |     long * __iarray_
        96 |     size_t __iarray_size_
       104 |     size_t __iarray_cap_
       112 |     void ** __parray_
       120 |     size_t __parray_size_
       128 |     size_t __parray_cap_
       136 |   basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       144 |   std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=152, dsize=148, align=8,
           |  nvsize=148, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ostream<char>
         0 |   (basic_ostream vtable pointer)
         8 |   class std::__1::basic_ios<char> (virtual base)
         8 |     class std::__1::ios_base (primary base)
         8 |       (ios_base vtable pointer)
        16 |       std::__1::ios_base::fmtflags __fmtflags_
        24 |       std::__1::streamsize __precision_
        32 |       std::__1::streamsize __width_
        40 |       std::__1::ios_base::iostate __rdstate_
        44 |       std::__1::ios_base::iostate __exceptions_
        48 |       void * __rdbuf_
        56 |       void * __loc_
        64 |       std::__1::ios_base::event_callback * __fn_
        72 |       int * __index_
        80 |       size_t __event_size_
        88 |       size_t __event_cap_
        96 |       long * __iarray_
       104 |       size_t __iarray_size_
       112 |       size_t __iarray_cap_
       120 |       void ** __parray_
       128 |       size_t __parray_size_
       136 |       size_t __parray_cap_
       144 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       152 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=160, dsize=156, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f8b29bb8760 prev 0x7f8b29893080 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, line:386:1> line:231:24 referenced class ios_base definition
|-VisibilityAttr 0x7f8b29bb8860 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7f8b29bb88a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, col:24> col:24 implicit referenced class ios_base
|-AccessSpecDecl 0x7f8b29bb8940 <line:233:1, col:7> col:1 public
|-CXXRecordDecl 0x7f8b29bb8998 <line:234:5, col:33> col:33 class failure
| `-VisibilityAttr 0x7f8b29bb8a50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:681:47, col:71> Default
|-TypedefDecl 0x7f8b29bb8ab0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:236:5, col:26> col:26 referenced fmtflags 'unsigned int'
| `-BuiltinType 0x7f8b28832c60 'unsigned int'
|-VarDecl 0x7f8b29bb8b40 <line:237:5, col:41> col:27 referenced boolalpha 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bb8bc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bb8ba0 <col:41> 'int' 1
|-VarDecl 0x7f8b29bb8c40 <line:238:5, col:41> col:27 referenced dec 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bb8cc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bb8ca0 <col:41> 'int' 2
|-VarDecl 0x7f8b29bb8d40 <line:239:5, col:41> col:27 referenced fixed 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bb8dc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bb8da0 <col:41> 'int' 4
|-VarDecl 0x7f8b29bb8e40 <line:240:5, col:41> col:27 referenced hex 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bb8ec0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bb8ea0 <col:41> 'int' 8
|-VarDecl 0x7f8b29bb8f40 <line:241:5, col:41> col:27 referenced internal 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bb8fc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bb8fa0 <col:41> 'int' 16
|-VarDecl 0x7f8b29bb9040 <line:242:5, col:41> col:27 referenced left 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bb90c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bb90a0 <col:41> 'int' 32
|-VarDecl 0x7f8b29bb9140 <line:243:5, col:41> col:27 referenced oct 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bb91c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bb91a0 <col:41> 'int' 64
|-VarDecl 0x7f8b29bb9240 <line:244:5, col:41> col:27 referenced right 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bb92c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bb92a0 <col:41> 'int' 128
|-VarDecl 0x7f8b29bb9340 <line:245:5, col:41> col:27 referenced scientific 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bb93c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bb93a0 <col:41> 'int' 256
|-VarDecl 0x7f8b29bb9440 <line:246:5, col:41> col:27 referenced showbase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bb94c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bb94a0 <col:41> 'int' 512
|-VarDecl 0x7f8b29bb9540 <line:247:5, col:41> col:27 referenced showpoint 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bb95c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bb95a0 <col:41> 'int' 1024
|-VarDecl 0x7f8b29bb9640 <line:248:5, col:41> col:27 referenced showpos 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bb96c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bb96a0 <col:41> 'int' 2048
|-VarDecl 0x7f8b29bb9740 <line:249:5, col:41> col:27 referenced skipws 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bb97c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bb97a0 <col:41> 'int' 4096
|-VarDecl 0x7f8b29bb9840 <line:250:5, col:41> col:27 referenced unitbuf 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bb98c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bb98a0 <col:41> 'int' 8192
|-VarDecl 0x7f8b29bb9940 <line:251:5, col:41> col:27 referenced uppercase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bb99c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bb99a0 <col:41> 'int' 16384
|-VarDecl 0x7f8b29bb9a40 <line:252:5, col:56> col:27 referenced adjustfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7f8b29bb9b88 <col:41, col:56> 'unsigned int' '|'
|   |-BinaryOperator 0x7f8b29bb9b20 <col:41, col:48> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7f8b29bb9af0 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7f8b29bb9aa0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f8b29bb9040 'left' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7f8b29bb9b08 <col:48> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7f8b29bb9ac8 <col:48> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f8b29bb9240 'right' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7f8b29bb9b70 <col:56> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f8b29bb9b48 <col:56> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f8b29bb8f40 'internal' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7f8b29bb9c18 <line:253:5, col:53> col:27 referenced basefield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7f8b29bb9d60 <col:41, col:53> 'unsigned int' '|'
|   |-BinaryOperator 0x7f8b29bb9cf8 <col:41, col:47> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7f8b29bb9cc8 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7f8b29bb9c78 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f8b29bb8c40 'dec' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7f8b29bb9ce0 <col:47> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7f8b29bb9ca0 <col:47> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f8b29bb9140 'oct' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7f8b29bb9d48 <col:53> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f8b29bb9d20 <col:53> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f8b29bb8e40 'hex' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7f8b29bb9df0 <line:254:5, col:54> col:27 referenced floatfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7f8b29bb9ed0 <col:41, col:54> 'unsigned int' '|'
|   |-ImplicitCastExpr 0x7f8b29bb9ea0 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | `-DeclRefExpr 0x7f8b29bb9e50 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f8b29bb9340 'scientific' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7f8b29bb9eb8 <col:54> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f8b29bb9e78 <col:54> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f8b29bb8d40 'fixed' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-TypedefDecl 0x7f8b29bb9f68 <line:256:5, col:26> col:26 referenced iostate 'unsigned int'
| `-BuiltinType 0x7f8b28832c60 'unsigned int'
|-VarDecl 0x7f8b29bb9ff0 <line:257:5, col:36> col:26 referenced badbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bba070 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bba050 <col:36> 'int' 1
|-VarDecl 0x7f8b29bba0f0 <line:258:5, col:36> col:26 referenced eofbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bba170 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bba150 <col:36> 'int' 2
|-VarDecl 0x7f8b29bba1f0 <line:259:5, col:36> col:26 referenced failbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bba270 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bba250 <col:36> 'int' 4
|-VarDecl 0x7f8b29bba2f0 <line:260:5, col:36> col:26 referenced goodbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bba370 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bba350 <col:36> 'int' 0
|-TypedefDecl 0x7f8b29bba3f8 <line:262:5, col:26> col:26 referenced openmode 'unsigned int'
| `-BuiltinType 0x7f8b28832c60 'unsigned int'
|-VarDecl 0x7f8b29bba480 <line:263:5, col:36> col:27 app 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bba500 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bba4e0 <col:36> 'int' 1
|-VarDecl 0x7f8b29bba580 <line:264:5, col:36> col:27 ate 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bba600 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bba5e0 <col:36> 'int' 2
|-VarDecl 0x7f8b29bba680 <line:265:5, col:36> col:27 binary 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bba700 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bba6e0 <col:36> 'int' 4
|-VarDecl 0x7f8b29bba780 <line:266:5, col:36> col:27 referenced in 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bba800 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bba7e0 <col:36> 'int' 8
|-VarDecl 0x7f8b29bba880 <line:267:5, col:36> col:27 referenced out 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bba900 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bba8e0 <col:36> 'int' 16
|-VarDecl 0x7f8b29bba980 <line:268:5, col:36> col:27 trunc 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f8b29bbaa00 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f8b29bba9e0 <col:36> 'int' 32
|-EnumDecl 0x7f8b29bbaa70 <line:270:5, col:32> col:10 referenced seekdir
| |-EnumConstantDecl 0x7f8b29bbab30 <col:19> col:19 referenced beg 'enum std::__1::ios_base::seekdir'
| |-EnumConstantDecl 0x7f8b29bbab80 <col:24> col:24 referenced cur 'enum std::__1::ios_base::seekdir'
| `-EnumConstantDecl 0x7f8b29bbabd0 <col:29> col:29 referenced end 'enum std::__1::ios_base::seekdir'
|-TypedefDecl 0x7f8b29bbac30 <line:273:5, col:26> col:26 io_state 'std::__1::ios_base::iostate':'unsigned int'
| `-TypedefType 0x7f8b29bb9fc0 'std::__1::ios_base::iostate' sugar
|   |-Typedef 0x7f8b29bb9f68 'iostate'
|   `-BuiltinType 0x7f8b28832c60 'unsigned int'
|-TypedefDecl 0x7f8b29bbac98 <line:274:5, col:26> col:26 open_mode 'std::__1::ios_base::openmode':'unsigned int'
| `-TypedefType 0x7f8b29bba450 'std::__1::ios_base::openmode' sugar
|   |-Typedef 0x7f8b29bba3f8 'openmode'
|   `-BuiltinType 0x7f8b28832c60 'unsigned int'
|-TypedefDecl 0x7f8b29bbad00 <line:275:5, col:26> col:26 seek_dir 'enum std::__1::ios_base::seekdir'
| `-EnumType 0x7f8b29bbab10 'enum std::__1::ios_base::seekdir'
|   `-Enum 0x7f8b29bbaa70 'seekdir'
|-TypedefDecl 0x7f8b29bbae10 <line:277:5, col:30> col:30 streamoff 'std::__1::streamoff':'long long'
| `-ElaboratedType 0x7f8b29bbada0 'std::__1::streamoff' sugar
|   `-TypedefType 0x7f8b299edfb0 'std::__1::streamoff' sugar
|     |-Typedef 0x7f8b298a1258 'streamoff'
|     `-BuiltinType 0x7f8b28832c00 'long long'
|-TypedefDecl 0x7f8b29bbaef0 <line:278:5, col:30> col:30 streampos 'std::__1::streampos':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f8b29bbae80 'std::__1::streampos' sugar
|   `-TypedefType 0x7f8b299ee040 'std::__1::streampos' sugar
|     |-Typedef 0x7f8b298a0eb8 'streampos'
|     `-TemplateSpecializationType 0x7f8b298a0e10 'fpos<mbstate_t>' sugar fpos
|       |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|       `-RecordType 0x7f8b298a0df0 'class std::__1::fpos<__mbstate_t>'
|         `-ClassTemplateSpecialization 0x7f8b298a0d00 'fpos'
|-CXXRecordDecl 0x7f8b29bbaf78 <line:281:5, col:28> col:28 class Init
| `-VisibilityAttr 0x7f8b29bbb030 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXMethodDecl 0x7f8b29bbb160 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:284:48> col:40 flags 'std::__1::ios_base::fmtflags (void) const'
| |-AlwaysInlineAttr 0x7f8b29bbb1f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f8b29bbb240 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f8b29bbb380 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:285:62> col:40 flags 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f8b29bbb290 <col:46, col:55> col:55 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f8b29bbb420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f8b29bbb468 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f8b29bbb540 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:286:61> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f8b29bbb4b8 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f8b29bbb5e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f8b29bbb628 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f8b29bbb800 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:287:78> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags, std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f8b29bbb678 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-ParmVarDecl 0x7f8b29bbb6e8 <col:63, col:72> col:72 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f8b29bbb8a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f8b29bbb8f0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f8b29bbba00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:288:58> col:36 used unsetf 'void (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f8b29bbb940 <col:43, col:52> col:52 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f8b29bbbaa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f8b29bbbae8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f8b29bbbba0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:290:54> col:42 precision 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7f8b29bbbc38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f8b29bbbc80 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f8b29bbbd90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:291:69> col:42 precision 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7f8b29bbbcd0 <col:52, col:63> col:63 __prec 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7f8b29bbbe30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f8b29bbbe78 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f8b29bbbed8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:292:50> col:42 width 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7f8b29bbbf70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f8b29bbbfb8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f8b29bbc090 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:293:65> col:42 width 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7f8b29bbc008 <col:48, col:59> col:59 __wide 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7f8b29bbc130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f8b29bbc178 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f8b29bbc220 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:296:5, col:37> col:12 referenced imbue 'class std::__1::locale (const class std::__1::locale &)'
| `-ParmVarDecl 0x7f8b29bbc198 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f8b29bbc310 <line:297:5, col:21> col:12 referenced getloc 'class std::__1::locale (void) const'
|-CXXMethodDecl 0x7f8b29bbc3d0 <line:300:5, col:23> col:16 xalloc 'int (void)' static
|-CXXMethodDecl 0x7f8b29bbc510 <line:301:5, col:28> col:11 iword 'long &(int)'
| `-ParmVarDecl 0x7f8b29bbc480 <col:17, col:21> col:21 __index 'int'
|-CXXMethodDecl 0x7f8b29bbc698 <line:302:5, col:29> col:12 pword 'void *&(int)'
| `-ParmVarDecl 0x7f8b29bbc5c8 <col:18, col:22> col:22 __index 'int'
|-CXXDestructorDecl 0x7f8b29bbc788 <line:305:5, col:23> col:13 ~ios_base 'void (void) noexcept' virtual
|-EnumDecl 0x7f8b29bbc828 <line:308:5, col:58> col:10 referenced event
| |-EnumConstantDecl 0x7f8b29bbc8e0 <col:18> col:18 referenced erase_event 'enum std::__1::ios_base::event'
| |-EnumConstantDecl 0x7f8b29bbc930 <col:31> col:31 imbue_event 'enum std::__1::ios_base::event'
| `-EnumConstantDecl 0x7f8b29bbc980 <col:44> col:44 referenced copyfmt_event 'enum std::__1::ios_base::event'
|-TypedefDecl 0x7f8b29bbcc50 <line:309:5, col:65> col:20 referenced event_callback 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-PointerType 0x7f8b29bbcbe0 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
|   `-ParenType 0x7f8b29bbcb80 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' sugar
|     `-FunctionProtoType 0x7f8b29bbcb30 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' cdecl
|       |-BuiltinType 0x7f8b28832b20 'void'
|       |-EnumType 0x7f8b29bbc8c0 'enum std::__1::ios_base::event'
|       | `-Enum 0x7f8b29bbc828 'event'
|       |-LValueReferenceType 0x7f8b289e63f0 'class std::__1::ios_base &'
|       | `-RecordType 0x7f8b29893120 'class std::__1::ios_base'
|       |   `-CXXRecord 0x7f8b29bb8760 'ios_base'
|       `-BuiltinType 0x7f8b28832bc0 'int'
|-CXXMethodDecl 0x7f8b29bbce70 <line:310:5, col:60> col:10 register_callback 'void (std::__1::ios_base::event_callback, int)'
| |-ParmVarDecl 0x7f8b29bbcce0 <col:28, col:43> col:43 __fn 'std::__1::ios_base::event_callback':'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-ParmVarDecl 0x7f8b29bbcd58 <col:49, col:53> col:53 __index 'int'
|-AccessSpecDecl 0x7f8b29bbcf18 <line:312:1, col:8> col:1 private
|-CXXConstructorDecl 0x7f8b29bbd060 <line:313:5, col:29> col:5 ios_base 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f8b29bbcf78 <col:14, col:28> col:29 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7f8b29bbd1e0 <line:314:5, col:40> col:15 operator= 'class std::__1::ios_base &(const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f8b29bbd120 <col:25, col:39> col:40 'const class std::__1::ios_base &'
|-AccessSpecDecl 0x7f8b29bbd280 <line:316:1, col:7> col:1 public
|-CXXMethodDecl 0x7f8b29bbd380 <line:317:5, col:51> col:17 sync_with_stdio '_Bool (_Bool)' static
| `-ParmVarDecl 0x7f8b29bbd2b8 <col:33, col:47> col:38 __sync '_Bool' cinit
|   `-CXXBoolLiteralExpr 0x7f8b29bbf778 <col:47> '_Bool' true
|-CXXMethodDecl 0x7f8b29bbd4a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:319:49> col:39 rdstate 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7f8b29bbd538 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f8b29bbd580 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f8b29bbd660 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:320:5, col:41> col:10 used clear 'void (std::__1::ios_base::iostate)'
| `-ParmVarDecl 0x7f8b29bbd5a0 <col:16, col:34> col:24 __state 'std::__1::ios_base::iostate':'unsigned int' cinit
|   `-ImplicitCastExpr 0x7f8b29bbf7b8 <col:34> 'std::__1::ios_base::iostate':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f8b29bbf790 <col:34> 'const std::__1::ios_base::iostate':'const unsigned int' lvalue Var 0x7f8b29bba2f0 'goodbit' 'const std::__1::ios_base::iostate':'const unsigned int'
|-CXXMethodDecl 0x7f8b29bbd7c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:321:60> col:36 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f8b29bbd740 <col:45, col:53> col:53 __state 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7f8b29bbd868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f8b29bbd8b0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f8b29bbd910 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:323:43> col:36 good '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f8b29bbd9a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f8b29bbd9f0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f8b29bbda50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:324:42> col:36 eof '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f8b29bbdae8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f8b29bbdb30 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f8b29bbdb90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:325:43> col:36 fail '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f8b29bbdc28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f8b29bbdc70 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f8b29bbdcd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:326:42> col:36 bad '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f8b29bbdd68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f8b29bbddb0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f8b29bbde10 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:328:52> col:39 exceptions 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7f8b29bbdea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f8b29bbdef0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f8b29bbdfc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:329:64> col:36 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f8b29bbdf40 <col:47, col:55> col:55 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7f8b29bbe068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f8b29bbe0b0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f8b29bbe0e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:331:5, col:44> col:10 __set_badbit_and_consider_rethrow 'void (void)'
|-CXXMethodDecl 0x7f8b29bbe198 <line:332:5, col:45> col:10 __set_failbit_and_consider_rethrow 'void (void)'
|-AccessSpecDecl 0x7f8b29bbe230 <line:334:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f8b29bbe2a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:337:16> line:336:5 ios_base 'void (void)'
| |-CompoundStmt 0x7f8b29bbf7d0 <col:16, line:337:16>
| |-AlwaysInlineAttr 0x7f8b29bbe350 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f8b29bbe398 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f8b29bbe448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:339:5, col:25> col:10 referenced init 'void (void *)'
| `-ParmVarDecl 0x7f8b29bbe3c0 <col:15, col:21> col:21 __sb 'void *'
|-CXXMethodDecl 0x7f8b29bbe578 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:340:64> col:33 rdbuf 'void *(void) const'
| |-CompoundStmt 0x7f8b29bbf868 <col:47, col:64>
| | `-ReturnStmt 0x7f8b29bbf850 <col:48, col:55>
| |   `-ImplicitCastExpr 0x7f8b29bbf838 <col:55> 'void *' <LValueToRValue>
| |     `-MemberExpr 0x7f8b29bbf800 <col:55> 'void *const' lvalue ->__rdbuf_ 0x7f8b29bbf188
| |       `-CXXThisExpr 0x7f8b29bbf7e8 <col:55> 'const class std::__1::ios_base *' this
| |-AlwaysInlineAttr 0x7f8b29bbe610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7f8b29bbe658 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f8b29bbe738 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:347:5> line:343:10 rdbuf 'void (void *)'
| |-ParmVarDecl 0x7f8b29bbe6b0 <col:16, col:22> col:22 used __sb 'void *'
| |-CompoundStmt 0x7f8b29bbf9e8 <line:344:5, line:347:5>
| | |-BinaryOperator 0x7f8b29bbf918 <line:345:9, col:20> 'void *' lvalue '='
| | | |-MemberExpr 0x7f8b29bbf8a0 <col:9> 'void *' lvalue ->__rdbuf_ 0x7f8b29bbf188
| | | | `-CXXThisExpr 0x7f8b29bbf888 <col:9> 'class std::__1::ios_base *' this
| | | `-ImplicitCastExpr 0x7f8b29bbf900 <col:20> 'void *' <LValueToRValue>
| | |   `-DeclRefExpr 0x7f8b29bbf8d8 <col:20> 'void *' lvalue ParmVar 0x7f8b29bbe6b0 '__sb' 'void *'
| | `-CXXMemberCallExpr 0x7f8b29bbf990 <line:346:9, col:15> 'void'
| |   |-MemberExpr 0x7f8b29bbf958 <col:9> '<bound member function type>' ->clear 0x7f8b29bbd660
| |   | `-CXXThisExpr 0x7f8b29bbf940 <col:9> 'class std::__1::ios_base *' this
| |   `-CXXDefaultArgExpr 0x7f8b29bbf9c8 <<invalid sloc>> 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7f8b29bbe7d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7f8b29bbe820 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f8b29bbe900 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:349:5, col:32> col:10 referenced __call_callbacks 'void (enum std::__1::ios_base::event)'
| `-ParmVarDecl 0x7f8b29bbe840 <col:27> col:32 'enum std::__1::ios_base::event'
|-CXXMethodDecl 0x7f8b29bbea38 <line:350:5, col:33> col:10 referenced copyfmt 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f8b29bbe9b0 <col:18, col:32> col:33 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7f8b29bbebb0 <line:351:5, col:24> col:10 referenced move 'void (class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f8b29bbeae8 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7f8b29bbed28 <line:352:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:352:10 referenced swap 'void (class std::__1::ios_base &) noexcept'
| `-ParmVarDecl 0x7f8b29bbec60 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7f8b29bbee98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:358:5> line:355:10 referenced set_rdbuf 'void (void *)'
| |-ParmVarDecl 0x7f8b29bbee10 <col:20, col:26> col:26 used __sb 'void *'
| |-CompoundStmt 0x7f8b29bbfac8 <line:356:5, line:358:5>
| | `-BinaryOperator 0x7f8b29bbfaa0 <line:357:9, col:20> 'void *' lvalue '='
| |   |-MemberExpr 0x7f8b29bbfa28 <col:9> 'void *' lvalue ->__rdbuf_ 0x7f8b29bbf188
| |   | `-CXXThisExpr 0x7f8b29bbfa10 <col:9> 'class std::__1::ios_base *' this
| |   `-ImplicitCastExpr 0x7f8b29bbfa88 <col:20> 'void *' <LValueToRValue>
| |     `-DeclRefExpr 0x7f8b29bbfa60 <col:20> 'void *' lvalue ParmVar 0x7f8b29bbee10 '__sb' 'void *'
| |-AlwaysInlineAttr 0x7f8b29bbef38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7f8b29bbef80 <col:48, col:71> Hidden
|-AccessSpecDecl 0x7f8b29bbef90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:360:1, col:8> col:1 private
|-FieldDecl 0x7f8b29bbefc8 <line:362:5, col:21> col:21 referenced __fmtflags_ 'std::__1::ios_base::fmtflags':'unsigned int'
|-FieldDecl 0x7f8b29bbf020 <line:363:5, col:21> col:21 referenced __precision_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7f8b29bbf078 <line:364:5, col:21> col:21 referenced __width_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7f8b29bbf0d0 <line:365:5, col:21> col:21 referenced __rdstate_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7f8b29bbf128 <line:366:5, col:21> col:21 referenced __exceptions_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7f8b29bbf188 <line:367:5, col:21> col:21 referenced __rdbuf_ 'void *'
|-FieldDecl 0x7f8b29bbf1e8 <line:368:5, col:21> col:21 __loc_ 'void *'
|-FieldDecl 0x7f8b29bbf298 <line:369:5, col:21> col:21 __fn_ 'std::__1::ios_base::event_callback *'
|-FieldDecl 0x7f8b29bbf2f8 <line:370:5, col:21> col:21 __index_ 'int *'
|-FieldDecl 0x7f8b29bbf350 <line:371:5, col:21> col:21 __event_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7f8b29bbf3a8 <line:372:5, col:21> col:21 __event_cap_ 'size_t':'unsigned long'
|-VarDecl 0x7f8b29bbf4b8 <line:376:5, col:24> col:24 __xindex_ 'atomic<int>':'struct std::__1::atomic<int>' static
|-FieldDecl 0x7f8b29bbf530 <line:380:5, col:21> col:21 __iarray_ 'long *'
|-FieldDecl 0x7f8b29bbf588 <line:381:5, col:21> col:21 __iarray_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7f8b29bbf5e0 <line:382:5, col:21> col:21 __iarray_cap_ 'size_t':'unsigned long'
|-FieldDecl 0x7f8b29bbf640 <line:383:5, col:21> col:21 __parray_ 'void **'
|-FieldDecl 0x7f8b29bbf698 <line:384:5, col:21> col:21 __parray_size_ 'size_t':'unsigned long'
`-FieldDecl 0x7f8b29bbf6f0 <line:385:5, col:21> col:21 __parray_cap_ 'size_t':'unsigned long'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f8b2989ac58 parent 0x7f8b29892fe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:482:78> col:64 class basic_ios definition
|-public 'class std::__1::ios_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f8b29c0c4e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7f8b29c0c5d8 prev 0x7f8b2989ac58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:583:1, col:28> col:28 implicit class basic_ios
|-AccessSpecDecl 0x7f8b29c0c670 <line:586:1, col:7> col:1 public
|-TypedefDecl 0x7f8b29c0c6d8 <line:588:5, col:20> col:20 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f8b29c0c6a0 'char' sugar
|   |-TemplateTypeParmType 0x7f8b29bc9b00 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f8b29bc9ac0 '_CharT'
|   `-BuiltinType 0x7f8b28832b60 'char'
|-TypedefDecl 0x7f8b29c0c768 <line:589:5, col:21> col:21 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f8b29c0c730 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f8b29bc9b70 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f8b29bc9b28 '_Traits'
|   `-RecordType 0x7f8b2989abc0 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f8b299f4688 'char_traits'
|-TypedefDecl 0x7f8b29c0c870 <line:591:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f8b29c0c820 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f8b299f61d0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f8b299f49e8 'int_type'
|     `-BuiltinType 0x7f8b28832bc0 'int'
|-TypedefDecl 0x7f8b29c0c940 <line:592:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f8b29c0c8f0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f8b29c03490 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f8b299f4ab8 'pos_type'
|     `-TypedefType 0x7f8b299ee040 'std::__1::streampos' sugar
|       |-Typedef 0x7f8b298a0eb8 'streampos'
|       `-TemplateSpecializationType 0x7f8b298a0e10 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f8b298a0df0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f8b298a0d00 'fpos'
|-TypedefDecl 0x7f8b29c0ca10 <line:593:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f8b29c0c9c0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f8b29c03580 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f8b299f4a50 'off_type'
|     `-TypedefType 0x7f8b299edfb0 'std::__1::streamoff' sugar
|       |-Typedef 0x7f8b298a1258 'streamoff'
|       `-BuiltinType 0x7f8b28832c00 'long long'
|-CXXConversionDecl 0x7f8b29c0ca68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:605:60> col:22 operator bool '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f8b29c0cb38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29c0cb88 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:608:69> col:32 operator! '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f8b29c0cc30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29c0cc78 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:609:81> col:35 rdstate 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7f8b29c0cd20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29c0cdf0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:610:91> col:32 clear 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f8b29c0cd68 <col:38, col:56> col:46 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7f8b29c0cea0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29c0cf70 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:611:87> col:32 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f8b29c0cee8 <col:41, col:49> col:49 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7f8b29c0d020 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29c0d068 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:612:70> col:32 good '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f8b29c0d110 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29c0d158 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:613:69> col:32 eof '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f8b29c0d200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29c0d248 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:614:70> col:32 fail '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f8b29c0d2f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29c0d338 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:615:69> col:32 bad '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f8b29c0d3e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29c0d428 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:617:85> col:35 exceptions 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7f8b29c0d4d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29c0d5a0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:618:95> col:32 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f8b29c0d518 <col:43, col:51> col:51 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7f8b29c0d650 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXConstructorDecl 0x7f8b29c0d900 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:622:68> col:14 basic_ios 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f8b29c0d7b8 <col:24, col:64> col:64 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f8b29c0d9c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7f8b29c0da38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:623:5, col:24> col:13 ~basic_ios 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7f8b29c0dc90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:627:50> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7f8b29c0dd38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b29c0e070 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:629:95> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f8b29c0df28 <col:48, col:87> col:87 __tiestr 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f8b29c0e120 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b29c0e2e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:632:54> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7f8b29c0e388 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b29c0e6c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:634:97> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f8b29c0e578 <col:52, col:93> col:93 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f8b29c0e770 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b29c0e8f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:636:5, col:46> col:16 copyfmt 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)'
| `-ParmVarDecl 0x7f8b29c0e828 <col:24, col:41> col:41 __rhs 'const class std::__1::basic_ios<char> &'
|-CXXMethodDecl 0x7f8b29c0e9f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:639:22> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (void) const'
| `-AlwaysInlineAttr 0x7f8b29c0ea98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b29c0ebf0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:641:34> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7f8b29c0eaf0 <col:20, col:30> col:30 __ch 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7f8b29c0eca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b29c0ed70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:644:37> col:12 imbue 'class std::__1::locale (const class std::__1::locale &)'
| |-ParmVarDecl 0x7f8b29c0ece8 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7f8b29c0ee20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b29c0efb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:647:47> col:10 narrow 'char (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, char) const'
| |-ParmVarDecl 0x7f8b29c0ee78 <col:17, col:27> col:27 __c 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| |-ParmVarDecl 0x7f8b29c0eed8 <col:32, col:37> col:37 __dfault 'char'
| `-AlwaysInlineAttr 0x7f8b29c0f068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b29c0f170 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:649:31> col:15 widen 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (char) const'
| |-ParmVarDecl 0x7f8b29c0f0b0 <col:21, col:26> col:26 __c 'char'
| `-AlwaysInlineAttr 0x7f8b29c0f220 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-AccessSpecDecl 0x7f8b29c0f268 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:651:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f8b29c0f2b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:654:17> line:653:5 basic_ios 'void (void)'
| `-AlwaysInlineAttr 0x7f8b29c0f368 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29c0f570 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:656:60> col:10 init 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f8b29c0f4a8 <col:15, col:56> col:56 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f8b29c0f620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b29c0f740 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:659:31> col:10 move 'void (class std::__1::basic_ios<char> &)'
| |-ParmVarDecl 0x7f8b29c0f678 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7f8b29c0f7f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b29c0f940 <line:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:662:47> col:10 move 'void (class std::__1::basic_ios<char> &&)'
| |-ParmVarDecl 0x7f8b29c0f878 <col:15, col:27> col:27 __rhs 'class std::__1::basic_ios<char> &&'
| `-AlwaysInlineAttr 0x7f8b29c0f9f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29c0fb18 <line:709:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:665:10 swap 'void (class std::__1::basic_ios<char> &) noexcept'
| |-ParmVarDecl 0x7f8b29c0fa48 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7f8b29c0fbc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b29c0fdd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:667:65> col:10 set_rdbuf 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f8b29c0fd08 <col:20, col:61> col:61 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f8b29c0fe80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-AccessSpecDecl 0x7f8b29c0fec8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:668:1, col:8> col:1 private
|-FieldDecl 0x7f8b29c0ffe8 <line:669:5, col:44> col:44 __tie_ 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
|-FieldDecl 0x7f8b29c10060 <line:670:6, col:23> col:23 __fill_ 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' mutable
|-CXXConstructorDecl 0x7f8b29c100e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:482:64> col:64 implicit basic_ios 'void (const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7f8b29c100e8
| `-ParmVarDecl 0x7f8b29c10210 <col:64> col:64 'const class std::__1::basic_ios<char> &'
`-CXXMethodDecl 0x7f8b29c10278 <col:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7f8b29c10278
  `-ParmVarDecl 0x7f8b29c10350 <col:64> col:64 'const class std::__1::basic_ios<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ios" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f8b2989b938 parent 0x7f8b29892fe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:1085:82> col:64 class basic_ostream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f8b29d1dad8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7f8b29d1dd10 prev 0x7f8b2989b938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:151:1, col:28> col:28 implicit class basic_ostream
|-AccessSpecDecl 0x7f8b29d1dda8 <line:154:1, col:7> col:1 public
|-TypedefDecl 0x7f8b29d1dde0 <line:156:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f8b29d1dba0 'char' sugar
|   |-TemplateTypeParmType 0x7f8b28dcfb30 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f8b28dcfae8 '_CharT'
|   `-BuiltinType 0x7f8b28832b60 'char'
|-TypedefDecl 0x7f8b29d1de48 <line:157:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f8b29d1dbe0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f8b28dcfba0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f8b28dcfb58 '_Traits'
|   `-RecordType 0x7f8b2989abc0 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f8b299f4688 'char_traits'
|-TypedefDecl 0x7f8b29d1df50 <line:158:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f8b29d1df00 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f8b299f61d0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f8b299f49e8 'int_type'
|     `-BuiltinType 0x7f8b28832bc0 'int'
|-TypedefDecl 0x7f8b29d1e020 <line:159:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f8b29d1dfd0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f8b29c03490 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f8b299f4ab8 'pos_type'
|     `-TypedefType 0x7f8b299ee040 'std::__1::streampos' sugar
|       |-Typedef 0x7f8b298a0eb8 'streampos'
|       `-TemplateSpecializationType 0x7f8b298a0e10 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f8b298a0df0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f8b298a0d00 'fpos'
|-TypedefDecl 0x7f8b29d1e0f0 <line:160:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f8b29d1e0a0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f8b29c03580 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f8b299f4a50 'off_type'
|     `-TypedefType 0x7f8b299edfb0 'std::__1::streamoff' sugar
|       |-Typedef 0x7f8b298a1258 'streamoff'
|       `-BuiltinType 0x7f8b28832c00 'long long'
|-CXXConstructorDecl 0x7f8b29d1e370 <line:163:5, line:165:25> line:164:14 basic_ostream 'void (basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7f8b29d1e268 <col:28, col:69> col:69 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f8b29d1e430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXDestructorDecl 0x7f8b29d1e4a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:166:5, col:28> col:13 ~basic_ostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7f8b29d1e558 <line:167:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f8b29d1e6a0 <line:169:5, line:170:40> col:5 basic_ostream 'void (class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7f8b29d1e5b8 <col:19, col:35> col:35 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7f8b29d1e760 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7f8b29d1e8b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:175:5, line:176:51> col:20 operator= 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7f8b29d1e7e8 <col:30, col:46> col:46 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7f8b29d1e960 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7f8b29d1ea80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:178:5, line:180:55> line:179:10 swap 'void (class std::__1::basic_ostream<char> &)' inline
| |-ParmVarDecl 0x7f8b29d1e9b8 <col:15, col:30> col:30 __rhs 'class std::__1::basic_ostream<char> &'
| `-AlwaysInlineAttr 0x7f8b29d1eb30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXConstructorDecl 0x7f8b29d1eca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:183:5, col:65> col:5 basic_ostream 'void (const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7f8b29d1ebb8 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-CXXMethodDecl 0x7f8b29d1ee30 <line:184:5, col:65> col:20 operator= 'class std::__1::basic_ostream<char> &(const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7f8b29d1ed70 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-AccessSpecDecl 0x7f8b29d1eee0 <line:189:1, col:7> col:1 public
|-CXXRecordDecl 0x7f8b29d1ef08 <line:192:5, col:32> col:32 class sentry definition
| |-CXXRecordDecl 0x7f8b29d21d90 prev 0x7f8b29d1ef08 <line:242:1, col:60> col:60 implicit class sentry
| |-FieldDecl 0x7f8b29d21e28 <line:244:5, col:10> col:10 __ok_ '_Bool'
| |-FieldDecl 0x7f8b29d21fc8 <line:245:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXConstructorDecl 0x7f8b29d22150 <line:247:5, col:25> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7f8b29d22048 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x7f8b29d22310 <line:248:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7f8b29d22248 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x7f8b29d223c0 <line:250:1, col:7> col:1 public
| |-CXXConstructorDecl 0x7f8b29d225d0 <line:251:5, col:57> col:14 sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| | `-ParmVarDecl 0x7f8b29d224e8 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXDestructorDecl 0x7f8b29d226c0 <line:252:5, col:13> col:5 ~sentry 'void (void)' noexcept-unevaluated 0x7f8b29d226c0
| `-CXXConversionDecl 0x7f8b29d22770 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:256:45> col:9 operator bool '_Bool (void) const'
|   `-AlwaysInlineAttr 0x7f8b29d22848 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29d1f240 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:195:5, line:197:27> line:196:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &))' inline
| |-ParmVarDecl 0x7f8b29d1f140 <col:31, col:68> col:48 __pf 'class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &)'
| `-AlwaysInlineAttr 0x7f8b29d1f2f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29d1f7d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:199:5, line:202:34> line:200:20 operator<< 'class std::__1::basic_ostream<char> &(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &))' inline
| |-ParmVarDecl 0x7f8b29d1f6d0 <col:31, line:201:72> col:33 __pf 'basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &)'
| `-AlwaysInlineAttr 0x7f8b29d1f880 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29d1f9d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:204:5, line:206:34> line:205:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))' inline
| |-ParmVarDecl 0x7f8b29d1f8c8 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x7f8b29d1fa80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29d1fb90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:208:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(_Bool)'
| `-ParmVarDecl 0x7f8b29d1fac8 <col:31, col:36> col:36 __n '_Bool'
|-CXXMethodDecl 0x7f8b29d1fd00 <line:209:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(short)'
| `-ParmVarDecl 0x7f8b29d1fc40 <col:31, col:37> col:37 __n 'short'
|-CXXMethodDecl 0x7f8b29d1fe70 <line:210:5, col:49> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned short)'
| `-ParmVarDecl 0x7f8b29d1fdb0 <col:31, col:46> col:46 __n 'unsigned short'
|-CXXMethodDecl 0x7f8b29d1ffe0 <line:211:5, col:38> col:20 operator<< 'class std::__1::basic_ostream<char> &(int)'
| `-ParmVarDecl 0x7f8b29d1ff20 <col:31, col:35> col:35 __n 'int'
|-CXXMethodDecl 0x7f8b29d20150 <line:212:5, col:47> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned int)'
| `-ParmVarDecl 0x7f8b29d20090 <col:31, col:44> col:44 __n 'unsigned int'
|-CXXMethodDecl 0x7f8b29d202c0 <line:213:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(long)'
| `-ParmVarDecl 0x7f8b29d20200 <col:31, col:36> col:36 __n 'long'
|-CXXMethodDecl 0x7f8b29d20430 <line:214:5, col:48> col:20 used operator<< 'class std::__1::basic_ostream<char> &(unsigned long)'
| `-ParmVarDecl 0x7f8b29d20370 <col:31, col:45> col:45 __n 'unsigned long'
|-CXXMethodDecl 0x7f8b29d205a0 <line:215:5, col:44> col:20 operator<< 'class std::__1::basic_ostream<char> &(long long)'
| `-ParmVarDecl 0x7f8b29d204e0 <col:31, col:41> col:41 __n 'long long'
|-CXXMethodDecl 0x7f8b29d20710 <line:216:5, col:53> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long long)'
| `-ParmVarDecl 0x7f8b29d20650 <col:31, col:50> col:50 __n 'unsigned long long'
|-CXXMethodDecl 0x7f8b29d20880 <line:217:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(float)'
| `-ParmVarDecl 0x7f8b29d207c0 <col:31, col:37> col:37 __f 'float'
|-CXXMethodDecl 0x7f8b29d209f0 <line:218:5, col:41> col:20 operator<< 'class std::__1::basic_ostream<char> &(double)'
| `-ParmVarDecl 0x7f8b29d20930 <col:31, col:38> col:38 __f 'double'
|-CXXMethodDecl 0x7f8b29d20b60 <line:219:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(long double)'
| `-ParmVarDecl 0x7f8b29d20aa0 <col:31, col:43> col:43 __f 'long double'
|-CXXMethodDecl 0x7f8b29d20cd0 <line:220:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(const void *)'
| `-ParmVarDecl 0x7f8b29d20c10 <col:31, col:43> col:43 __p 'const void *'
|-CXXMethodDecl 0x7f8b29d20f80 <line:221:5, col:76> col:20 operator<< 'class std::__1::basic_ostream<char> &(basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)'
| `-ParmVarDecl 0x7f8b29d20e78 <col:31, col:72> col:72 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
|-CXXMethodDecl 0x7f8b29d21140 <line:224:5, col:37> col:20 put 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type)'
| `-ParmVarDecl 0x7f8b29d21040 <col:24, col:34> col:34 __c 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7f8b29d213a0 <line:225:5, col:62> col:20 write 'class std::__1::basic_ostream<char> &(const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7f8b29d21228 <col:26, col:43> col:43 __s 'const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f8b29d21288 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f8b29d214b0 <line:226:5, col:26> col:20 flush 'class std::__1::basic_ostream<char> &(void)'
|-CXXMethodDecl 0x7f8b29d21600 <line:229:5, line:230:20> col:14 tellp 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type (void)' inline
| `-AlwaysInlineAttr 0x7f8b29d216a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-CXXMethodDecl 0x7f8b29d21800 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:231:5, line:232:40> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type)' inline
| |-ParmVarDecl 0x7f8b29d21700 <col:26, col:35> col:35 __pos 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-AlwaysInlineAttr 0x7f8b29d218b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-CXXMethodDecl 0x7f8b29d21aa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:233:5, line:234:65> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir)' inline
| |-ParmVarDecl 0x7f8b29d21930 <col:26, col:35> col:35 __off 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7f8b29d21990 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-AlwaysInlineAttr 0x7f8b29d21b58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-AccessSpecDecl 0x7f8b29d21ba0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:236:1, col:10> col:1 protected
`-CXXConstructorDecl 0x7f8b29d21be8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:238:22> col:5 basic_ostream 'void (void)'
  `-AlwaysInlineAttr 0x7f8b29d21ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream.base" = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1185:9)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1203:9)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >
         0 |   struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> (base) (empty)
         0 |   std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type * __sbuf_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry
         0 |   _Bool __ok_
         8 |   basic_ostream<char, struct std::__1::char_traits<char> > & __os_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f8b29d1ef08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:192:5, col:32> col:32 referenced class sentry definition
|-CXXRecordDecl 0x7f8b29d21d90 prev 0x7f8b29d1ef08 <line:242:1, col:60> col:60 implicit class sentry
|-FieldDecl 0x7f8b29d21e28 <line:244:5, col:10> col:10 referenced __ok_ '_Bool'
|-FieldDecl 0x7f8b29d21fc8 <line:245:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
|-CXXConstructorDecl 0x7f8b29d22150 <line:247:5, col:25> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| `-ParmVarDecl 0x7f8b29d22048 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
|-CXXMethodDecl 0x7f8b29d22310 <line:248:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| `-ParmVarDecl 0x7f8b29d22248 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
|-AccessSpecDecl 0x7f8b29d223c0 <line:250:1, col:7> col:1 public
|-CXXConstructorDecl 0x7f8b29d225d0 <line:251:5, col:57> col:14 used sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| `-ParmVarDecl 0x7f8b29d224e8 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
|-CXXDestructorDecl 0x7f8b29d226c0 <line:252:5, col:13> col:5 used ~sentry 'void (void) noexcept'
`-CXXConversionDecl 0x7f8b29d22770 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:256:45> col:9 used operator bool '_Bool (void) const'
  |-CompoundStmt 0x7f8b292ef6f0 <col:31, col:45>
  | `-ReturnStmt 0x7f8b292ef6d8 <col:32, col:39>
  |   `-ImplicitCastExpr 0x7f8b292ef6c0 <col:39> '_Bool' <LValueToRValue>
  |     `-MemberExpr 0x7f8b292ef688 <col:39> 'const _Bool' lvalue ->__ok_ 0x7f8b29d21e28
  |       `-CXXThisExpr 0x7f8b292ef670 <col:39> 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry *' this
  `-AlwaysInlineAttr 0x7f8b29d22848 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream<char, std::__1::char_traits<char> >::sentry" = type { i8, %"class.std::__1::basic_ostream"* }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream<char, std::__1::char_traits<char> >::sentry" = type { i8, %"class.std::__1::basic_ostream"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f8b289cfa08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:520:1, line:529:1> line:522:29 struct iterator definition
|-TemplateArgument type 'struct std::__1::output_iterator_tag'
|-TemplateArgument type 'void'
|-TemplateArgument type 'void'
|-TemplateArgument type 'void'
|-TemplateArgument type 'void'
|-CXXRecordDecl 0x7f8b289cfd10 prev 0x7f8b289cfa08 <col:1, col:29> col:29 implicit struct iterator
|-TypedefDecl 0x7f8b289cfde8 <line:524:5, col:24> col:24 value_type 'void':'void'
| `-SubstTemplateTypeParmType 0x7f8b289cfdb0 'void' sugar
|   |-TemplateTypeParmType 0x7f8b289bd040 '_Tp' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f8b289bd000 '_Tp'
|   `-BuiltinType 0x7f8b28832b20 'void'
|-TypedefDecl 0x7f8b289cfe78 <line:525:5, col:24> col:24 difference_type 'void':'void'
| `-SubstTemplateTypeParmType 0x7f8b289cfe40 'void' sugar
|   |-TemplateTypeParmType 0x7f8b289bd0c0 '_Distance' dependent depth 0 index 2
|   | `-TemplateTypeParm 0x7f8b289bd078 '_Distance'
|   `-BuiltinType 0x7f8b28832b20 'void'
|-TypedefDecl 0x7f8b289cff08 <line:526:5, col:24> col:24 pointer 'void':'void'
| `-SubstTemplateTypeParmType 0x7f8b289cfed0 'void' sugar
|   |-TemplateTypeParmType 0x7f8b289bd170 '_Pointer' dependent depth 0 index 3
|   | `-TemplateTypeParm 0x7f8b289bd128 '_Pointer'
|   `-BuiltinType 0x7f8b28832b20 'void'
|-TypedefDecl 0x7f8b289cff98 <line:527:5, col:24> col:24 reference 'void':'void'
| `-SubstTemplateTypeParmType 0x7f8b289cff60 'void' sugar
|   |-TemplateTypeParmType 0x7f8b289bd220 '_Reference' dependent depth 0 index 4
|   | `-TemplateTypeParm 0x7f8b289bd1d8 '_Reference'
|   `-BuiltinType 0x7f8b28832b20 'void'
|-TypedefDecl 0x7f8b289d0028 <line:528:5, col:24> col:24 iterator_category 'struct std::__1::output_iterator_tag':'struct std::__1::output_iterator_tag'
| `-SubstTemplateTypeParmType 0x7f8b289cfff0 'struct std::__1::output_iterator_tag' sugar
|   |-TemplateTypeParmType 0x7f8b289bcfa0 '_Category' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f8b289bcf60 '_Category'
|   `-RecordType 0x7f8b289ae370 'struct std::__1::output_iterator_tag'
|     `-CXXRecord 0x7f8b289ae2d8 'output_iterator_tag'
|-CXXDestructorDecl 0x7f8b2a4138e8 <line:522:29> col:29 implicit ~iterator 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f8b292ecf48 <col:29> col:29 implicit constexpr iterator 'void (const struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &)' inline default trivial noexcept-unevaluated 0x7f8b292ecf48
| `-ParmVarDecl 0x7f8b292ed070 <col:29> col:29 'const struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &'
|-CXXConstructorDecl 0x7f8b292ed108 <col:29> col:29 implicit used constexpr iterator 'void (struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7f8b292ed230 <col:29> col:29 'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &&'
| `-CompoundStmt 0x7f8b292eef78 <col:29>
`-CXXConstructorDecl 0x7f8b292eee90 <col:29> col:29 implicit used constexpr iterator 'void (void) noexcept' inline default trivial
  `-CompoundStmt 0x7f8b292ef880 <col:29>

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::iterator" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::iterator" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::locale
         0 |   class std::__1::locale::__imp * __locale_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_streambuf<char>
         0 |   (basic_streambuf vtable pointer)
         8 |   class std::__1::locale __loc_
         8 |     class std::__1::locale::__imp * __locale_
        16 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        24 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        32 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        40 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        48 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        56 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f8b2a36b5c8 prev 0x7f8b2a36ae18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:62:1, line:123:1> line:62:24 referenced class locale definition
|-VisibilityAttr 0x7f8b2a36b6c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7f8b2a36b710 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:62:1, col:24> col:24 implicit referenced class locale
|-AccessSpecDecl 0x7f8b2a36b7a8 <line:64:1, col:7> col:1 public
|-CXXRecordDecl 0x7f8b2a36b800 <line:66:5, col:28> col:28 referenced class facet
| `-VisibilityAttr 0x7f8b2a36b8c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7f8b2a36b938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:67:5, col:28> col:28 referenced class id
| `-VisibilityAttr 0x7f8b2a36b9f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-TypedefDecl 0x7f8b2a36ba50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:69:5, col:17> col:17 referenced category 'int'
| `-BuiltinType 0x7f8b28832bc0 'int'
|-VarDecl 0x7f8b2a36bae0 <line:70:5, line:71:20> col:9 none 'const std::__1::locale::category':'const int' static cinit
| `-IntegerLiteral 0x7f8b2a36bb40 <col:20> 'int' 0
|-VarDecl 0x7f8b2a36bbc8 <line:70:5, /usr/include/xlocale.h:45:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:72:9 referenced collate 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7f8b2a36bc90 </usr/include/xlocale.h:45:27, col:34> 'int'
|   `-BinaryOperator 0x7f8b2a36bc68 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7f8b2a36bc28 <col:28> 'int' 1
|     `-IntegerLiteral 0x7f8b2a36bc48 <col:33> 'int' 0
|-VarDecl 0x7f8b2a36bd18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:46:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:73:9 referenced ctype 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7f8b2a36bde0 </usr/include/xlocale.h:46:25, col:32> 'int'
|   `-BinaryOperator 0x7f8b2a36bdb8 <col:26, col:31> 'int' '<<'
|     |-IntegerLiteral 0x7f8b2a36bd78 <col:26> 'int' 1
|     `-IntegerLiteral 0x7f8b2a36bd98 <col:31> 'int' 1
|-VarDecl 0x7f8b2a36be68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:48:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:74:9 referenced monetary 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7f8b2a36bf30 </usr/include/xlocale.h:48:27, col:34> 'int'
|   `-BinaryOperator 0x7f8b2a36bf08 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7f8b2a36bec8 <col:28> 'int' 1
|     `-IntegerLiteral 0x7f8b2a36bee8 <col:33> 'int' 3
|-VarDecl 0x7f8b2a36bfb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:49:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:75:9 referenced numeric 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7f8b2a36c080 </usr/include/xlocale.h:49:27, col:34> 'int'
|   `-BinaryOperator 0x7f8b2a36c058 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7f8b2a36c018 <col:28> 'int' 1
|     `-IntegerLiteral 0x7f8b2a36c038 <col:33> 'int' 4
|-VarDecl 0x7f8b2a36c108 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:50:31> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:76:9 referenced time 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7f8b2a36c1d0 </usr/include/xlocale.h:50:24, col:31> 'int'
|   `-BinaryOperator 0x7f8b2a36c1a8 <col:25, col:30> 'int' '<<'
|     |-IntegerLiteral 0x7f8b2a36c168 <col:25> 'int' 1
|     `-IntegerLiteral 0x7f8b2a36c188 <col:30> 'int' 5
|-VarDecl 0x7f8b2a36c258 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:47:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:77:9 referenced messages 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7f8b2a36c320 </usr/include/xlocale.h:47:27, col:34> 'int'
|   `-BinaryOperator 0x7f8b2a36c2f8 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7f8b2a36c2b8 <col:28> 'int' 1
|     `-IntegerLiteral 0x7f8b2a36c2d8 <col:33> 'int' 2
|-VarDecl 0x7f8b2a36c3a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, line:78:61> col:9 all 'const std::__1::locale::category':'const int' static cinit
| `-BinaryOperator 0x7f8b2a36c628 <col:15, col:61> 'int' '|'
|   |-BinaryOperator 0x7f8b2a36c5c0 <col:15, col:54> 'int' '|'
|   | |-BinaryOperator 0x7f8b2a36c558 <col:15, col:44> 'int' '|'
|   | | |-BinaryOperator 0x7f8b2a36c4f0 <col:15, col:33> 'int' '|'
|   | | | |-BinaryOperator 0x7f8b2a36c488 <col:15, col:25> 'int' '|'
|   | | | | |-ImplicitCastExpr 0x7f8b2a36c458 <col:15> 'std::__1::locale::category':'int' <LValueToRValue>
|   | | | | | `-DeclRefExpr 0x7f8b2a36c408 <col:15> 'const std::__1::locale::category':'const int' lvalue Var 0x7f8b2a36bbc8 'collate' 'const std::__1::locale::category':'const int'
|   | | | | `-ImplicitCastExpr 0x7f8b2a36c470 <col:25> 'std::__1::locale::category':'int' <LValueToRValue>
|   | | | |   `-DeclRefExpr 0x7f8b2a36c430 <col:25> 'const std::__1::locale::category':'const int' lvalue Var 0x7f8b2a36bd18 'ctype' 'const std::__1::locale::category':'const int'
|   | | | `-ImplicitCastExpr 0x7f8b2a36c4d8 <col:33> 'std::__1::locale::category':'int' <LValueToRValue>
|   | | |   `-DeclRefExpr 0x7f8b2a36c4b0 <col:33> 'const std::__1::locale::category':'const int' lvalue Var 0x7f8b2a36be68 'monetary' 'const std::__1::locale::category':'const int'
|   | | `-ImplicitCastExpr 0x7f8b2a36c540 <col:44> 'std::__1::locale::category':'int' <LValueToRValue>
|   | |   `-DeclRefExpr 0x7f8b2a36c518 <col:44> 'const std::__1::locale::category':'const int' lvalue Var 0x7f8b2a36bfb8 'numeric' 'const std::__1::locale::category':'const int'
|   | `-ImplicitCastExpr 0x7f8b2a36c5a8 <col:54> 'std::__1::locale::category':'int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7f8b2a36c580 <col:54> 'const std::__1::locale::category':'const int' lvalue Var 0x7f8b2a36c108 'time' 'const std::__1::locale::category':'const int'
|   `-ImplicitCastExpr 0x7f8b2a36c610 <col:61> 'std::__1::locale::category':'int' <LValueToRValue>
|     `-DeclRefExpr 0x7f8b2a36c5e8 <col:61> 'const std::__1::locale::category':'const int' lvalue Var 0x7f8b2a36c258 'messages' 'const std::__1::locale::category':'const int'
|-CXXConstructorDecl 0x7f8b2a36c760 <line:81:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:81:5 locale 'void (void) noexcept'
|-CXXConstructorDecl 0x7f8b2a36c928 <line:82:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:82:5 referenced locale 'void (const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7f8b2a36c818 <col:12, col:24> col:25 'const class std::__1::locale &'
|-CXXConstructorDecl 0x7f8b2a36ca78 <line:83:5, col:32> col:14 locale 'void (const char *)'
| `-ParmVarDecl 0x7f8b2a36c9f0 <col:21, col:31> col:32 'const char *'
|-CXXConstructorDecl 0x7f8b2a36cbc0 <line:84:5, col:34> col:14 locale 'void (const std::__1::string &)'
| `-ParmVarDecl 0x7f8b2a36cb38 <col:21, col:33> col:34 'const std::__1::string &'
|-CXXConstructorDecl 0x7f8b2a36cea0 <line:85:5, col:48> col:5 locale 'void (const class std::__1::locale &, const char *, std::__1::locale::category)'
| |-ParmVarDecl 0x7f8b2a36cc80 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f8b2a36ccf8 <col:27, col:37> col:38 'const char *'
| `-ParmVarDecl 0x7f8b2a36cd68 <col:40> col:48 'std::__1::locale::category':'int'
|-CXXConstructorDecl 0x7f8b2a36d180 <line:86:5, col:50> col:5 locale 'void (const class std::__1::locale &, const std::__1::string &, std::__1::locale::category)'
| |-ParmVarDecl 0x7f8b2a36cf70 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f8b2a36cfe0 <col:27, col:39> col:40 'const std::__1::string &'
| `-ParmVarDecl 0x7f8b2a36d050 <col:42> col:50 'std::__1::locale::category':'int'
|-FunctionTemplateDecl 0x7f8b2a36d558 <line:87:5, line:88:64> col:35 locale
| |-TemplateTypeParmDecl 0x7f8b2a36d240 <line:87:15, col:21> col:21 referenced class depth 0 index 0 _Facet
| `-CXXConstructorDecl 0x7f8b2a36d4b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:88:64> col:35 locale 'void (const class std::__1::locale &, _Facet *)'
|   |-ParmVarDecl 0x7f8b2a36d300 <col:42, col:54> col:55 'const class std::__1::locale &'
|   |-ParmVarDecl 0x7f8b2a36d398 <col:57, col:63> col:64 '_Facet *'
|   |-AlwaysInlineAttr 0x7f8b2a36d5b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|   `-VisibilityAttr 0x7f8b2a36d600 <col:51, col:74> Hidden
|-CXXConstructorDecl 0x7f8b2a36d830 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:89:5, col:50> col:5 locale 'void (const class std::__1::locale &, const class std::__1::locale &, std::__1::locale::category)'
| |-ParmVarDecl 0x7f8b2a36d620 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f8b2a36d690 <col:27, col:39> col:40 'const class std::__1::locale &'
| `-ParmVarDecl 0x7f8b2a36d700 <col:42> col:50 'std::__1::locale::category':'int'
|-CXXDestructorDecl 0x7f8b2a36d940 <line:91:5, col:13> col:5 used ~locale 'void (void) noexcept'
|-CXXMethodDecl 0x7f8b2a36daf8 <line:93:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:93:19 operator= 'const class std::__1::locale &(const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7f8b2a36d9f0 <col:29, col:41> col:42 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7f8b2a36dde8 <line:95:5, line:97:37> col:14 combine
| |-TemplateTypeParmDecl 0x7f8b2a36db98 <line:95:15, col:21> col:21 class depth 0 index 0 _Facet
| `-CXXMethodDecl 0x7f8b2a36dd50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:97:37> col:14 combine 'class std::__1::locale (const class std::__1::locale &) const' inline
|   |-ParmVarDecl 0x7f8b2a36dc60 <col:22, col:34> col:35 'const class std::__1::locale &'
|   `-VisibilityAttr 0x7f8b2a36de40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:624:40, col:63> Hidden
|-CXXMethodDecl 0x7f8b2a36dea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:100:5, col:19> col:12 name 'std::__1::string (void) const'
|-CXXMethodDecl 0x7f8b2a36e010 <line:101:5, col:36> col:10 used operator== '_Bool (const class std::__1::locale &) const'
| `-ParmVarDecl 0x7f8b2a36df50 <col:21, col:33> col:34 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f8b2a36e148 <line:102:5, col:70> col:10 operator!= '_Bool (const class std::__1::locale &) const'
| |-ParmVarDecl 0x7f8b2a36e0c0 <col:21, col:35> col:35 used __y 'const class std::__1::locale &'
| `-CompoundStmt 0x7f8b2a375a60 <col:46, col:70>
|   `-ReturnStmt 0x7f8b2a375a48 <col:47, col:68>
|     `-UnaryOperator 0x7f8b2a375a28 <col:54, col:68> '_Bool' prefix '!'
|       `-ParenExpr 0x7f8b2a375a08 <col:55, col:68> '_Bool'
|         `-CXXOperatorCallExpr 0x7f8b2a3759c0 <col:56, col:65> '_Bool'
|           |-ImplicitCastExpr 0x7f8b2a3759a8 <col:62> '_Bool (*)(const class std::__1::locale &) const' <FunctionToPointerDecay>
|           | `-DeclRefExpr 0x7f8b2a375950 <col:62> '_Bool (const class std::__1::locale &) const' lvalue CXXMethod 0x7f8b2a36e010 'operator==' '_Bool (const class std::__1::locale &) const'
|           |-UnaryOperator 0x7f8b2a374680 <col:56, col:57> 'const class std::__1::locale' lvalue prefix '*'
|           | `-CXXThisExpr 0x7f8b2a374668 <col:57> 'const class std::__1::locale *' this
|           `-DeclRefExpr 0x7f8b2a3746a0 <col:65> 'const class std::__1::locale' lvalue ParmVar 0x7f8b2a36e0c0 '__y' 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7f8b2a36e8d8 <line:103:5, line:106:73> line:105:12 operator()
| |-TemplateTypeParmDecl 0x7f8b2a36e1e8 <line:103:15, col:21> col:21 referenced class depth 0 index 0 _CharT
| |-TemplateTypeParmDecl 0x7f8b2a36e258 <col:29, col:35> col:35 referenced class depth 0 index 1 _Traits
| |-TemplateTypeParmDecl 0x7f8b2a36e2c8 <col:44, col:50> col:50 referenced class depth 0 index 2 _Allocator
| `-CXXMethodDecl 0x7f8b2a36e840 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:106:73> line:105:12 operator() '_Bool (const basic_string<_CharT, _Traits, _Allocator> &, const basic_string<_CharT, _Traits, _Allocator> &) const' inline
|   |-ParmVarDecl 0x7f8b2a36e530 <col:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   |-ParmVarDecl 0x7f8b2a36e730 <line:106:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   `-VisibilityAttr 0x7f8b2a36e938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:624:40, col:63> Hidden
|-CXXMethodDecl 0x7f8b2a36ea50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:109:5, col:39> col:19 global 'class std::__1::locale (const class std::__1::locale &)' static
| `-ParmVarDecl 0x7f8b2a36e990 <col:26, col:38> col:39 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f8b2a36eb40 <line:110:5, col:34> col:26 classic 'const class std::__1::locale &(void)' static
|-AccessSpecDecl 0x7f8b2a36ebd8 <line:112:1, col:8> col:1 private
|-CXXRecordDecl 0x7f8b2a36ec00 <line:113:5, col:11> col:11 referenced class __imp
|-FieldDecl 0x7f8b2a36ecf8 <line:114:5, col:12> col:12 __locale_ 'class std::__1::locale::__imp *'
|-CXXMethodDecl 0x7f8b2a36ef40 <line:116:5, col:52> col:10 referenced __install_ctor 'void (const class std::__1::locale &, class std::__1::locale::facet *, long)'
| |-ParmVarDecl 0x7f8b2a36ed50 <col:25, col:37> col:38 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f8b2a36ede8 <col:40, col:45> col:46 'class std::__1::locale::facet *'
| `-ParmVarDecl 0x7f8b2a36ee60 <col:48> col:52 'long'
|-CXXMethodDecl 0x7f8b2a36f070 <line:117:5, col:29> col:20 __global 'class std::__1::locale &(void)' static
|-CXXMethodDecl 0x7f8b2a36f210 <line:118:5, col:25> col:10 referenced has_facet '_Bool (class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7f8b2a36f148 <col:20, col:22> col:23 'class std::__1::locale::id &'
|-CXXMethodDecl 0x7f8b2a36f3b0 <line:119:5, col:33> col:18 used use_facet 'const class std::__1::locale::facet *(class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7f8b2a36f2c0 <col:28, col:30> col:31 'class std::__1::locale::id &'
|-FriendDecl 0x7f8b2a36f6d8 <line:121:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:121:41
| `-FunctionTemplateDecl 0x7f8b2a36f618 parent 0x7f8b2a36ad80 prev 0x7f8b2a36b1b0 <col:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:121:41 has_facet
|   |-TemplateTypeParmDecl 0x7f8b2a36f450 <col:15, col:21> col:21 class depth 0 index 0 _Facet
|   `-FunctionDecl 0x7f8b2a36f570 parent 0x7f8b2a36ad80 prev 0x7f8b2a36b118 <col:29, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:121:41 has_facet '_Bool (const class std::__1::locale &) noexcept'
|     |-ParmVarDecl 0x7f8b2a36f4e0 <col:51, col:63> col:64 'const class std::__1::locale &'
|     |-AlwaysInlineAttr 0x7f8b2a36f6b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|     `-VisibilityAttr 0x7f8b2a36f6c8 <col:51, col:74> Inherited Hidden
`-FriendDecl 0x7f8b2a3745f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:122:5, col:73> col:50
  `-FunctionTemplateDecl 0x7f8b2a374538 parent 0x7f8b2a36ad80 prev 0x7f8b2a36b4e8 <col:5, col:73> col:50 use_facet
    |-TemplateTypeParmDecl 0x7f8b2a36f710 <col:15, col:21> col:21 referenced class depth 0 index 0 _Facet
    |-FunctionDecl 0x7f8b2a374490 parent 0x7f8b2a36ad80 prev 0x7f8b2a36b450 <col:29, col:73> col:50 use_facet 'const _Facet &(const class std::__1::locale &)'
    | |-ParmVarDecl 0x7f8b2a36f7a0 <col:60, col:72> col:73 'const class std::__1::locale &'
    | |-AlwaysInlineAttr 0x7f8b2a3745d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
    | `-VisibilityAttr 0x7f8b2a3745e8 <col:51, col:74> Inherited Hidden
    `-Function 0x7f8b292f09b0 'use_facet' 'const class std::__1::ctype<char> &(const class std::__1::locale &)'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  NonVirtualBaseLLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f8b2989b358 parent 0x7f8b29892fe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:479:84> col:64 class basic_streambuf definition
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f8b29c030b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7f8b29c03178 prev 0x7f8b2989b358 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:122:1, col:28> col:28 implicit class basic_streambuf
|-AccessSpecDecl 0x7f8b29c03210 <line:124:1, col:7> col:1 public
|-TypedefDecl 0x7f8b29c03278 <line:126:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f8b29c03240 'char' sugar
|   |-TemplateTypeParmType 0x7f8b29be0230 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f8b29be01e8 '_CharT'
|   `-BuiltinType 0x7f8b28832b60 'char'
|-TypedefDecl 0x7f8b29c03308 <line:127:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f8b29c032d0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f8b29be02a0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f8b29be0258 '_Traits'
|   `-RecordType 0x7f8b2989abc0 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f8b299f4688 'char_traits'
|-TypedefDecl 0x7f8b29c03410 <line:128:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f8b29c033c0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f8b299f61d0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f8b299f49e8 'int_type'
|     `-BuiltinType 0x7f8b28832bc0 'int'
|-TypedefDecl 0x7f8b29c03500 <line:129:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f8b29c034b0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f8b29c03490 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f8b299f4ab8 'pos_type'
|     `-TypedefType 0x7f8b299ee040 'std::__1::streampos' sugar
|       |-Typedef 0x7f8b298a0eb8 'streampos'
|       `-TemplateSpecializationType 0x7f8b298a0e10 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f8b298a0df0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f8b298a0d00 'fpos'
|-TypedefDecl 0x7f8b29c035f0 <line:130:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f8b29c035a0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f8b29c03580 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f8b299f4a50 'off_type'
|     `-TypedefType 0x7f8b299edfb0 'std::__1::streamoff' sugar
|       |-Typedef 0x7f8b298a1258 'streamoff'
|       `-BuiltinType 0x7f8b28832c00 'long long'
|-CXXDestructorDecl 0x7f8b29c03678 <line:132:5, col:30> col:13 ~basic_streambuf 'void (void)' virtual noexcept-unevaluated 0x7f8b29c03678
|-CXXMethodDecl 0x7f8b29c037b0 <line:135:5, line:141:5> line:136:12 pubimbue 'class std::__1::locale (const class std::__1::locale &)' inline
| |-ParmVarDecl 0x7f8b29c03728 <col:21, col:35> col:35 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7f8b29c03888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29c038d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:143:5, line:144:44> col:12 getloc 'class std::__1::locale (void) const' inline
| `-AlwaysInlineAttr 0x7f8b29c03978 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29c03b90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:147:5, line:149:32> line:148:22 pubsetbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f8b29c03a18 <col:32, col:43> col:43 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f8b29c03a78 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f8b29c03c48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29c03ed0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:151:5, line:154:46> line:152:14 referenced pubseekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7f8b29c03ce0 <col:25, col:34> col:34 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7f8b29c03d40 <col:41, col:59> col:59 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| |-ParmVarDecl 0x7f8b29c03da0 <line:153:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7f8b29c03f90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29c04160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:156:5, line:159:38> line:157:14 referenced pubseekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7f8b29c03fe8 <col:25, col:34> col:34 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| |-ParmVarDecl 0x7f8b29c04048 <line:158:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7f8b29c04218 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29c04260 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:161:5, line:162:36> col:9 referenced pubsync 'int (void)' inline
| `-AlwaysInlineAttr 0x7f8b29c04308 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29c04350 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:166:5, line:171:5> line:167:16 in_avail 'std::__1::streamsize (void)' inline
| `-AlwaysInlineAttr 0x7f8b29c043f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29c044b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:173:5, line:178:5> line:174:14 snextc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f8b29c04558 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29c045c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:180:5, line:185:5> line:181:14 sbumpc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f8b29c04668 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29c046d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:187:5, line:192:5> line:188:14 sgetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f8b29c04778 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29c04940 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:194:5, line:196:32> line:195:16 referenced sgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f8b29c047d0 <col:22, col:33> col:33 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f8b29c04830 <col:38, col:49> col:49 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f8b29c049f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29c04b10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:199:5, line:204:5> line:200:14 sputbackc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7f8b29c04a50 <col:24, col:34> col:34 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7f8b29c04bc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29c04c28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:206:5, line:211:5> line:207:14 sungetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f8b29c04cd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29c04db0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:214:5, line:220:5> line:215:14 sputc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7f8b29c04d28 <col:20, col:30> col:30 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7f8b29c04e60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29c05060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:222:5, line:224:32> line:223:16 used sputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f8b29c04ee8 <col:22, col:39> col:39 used __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f8b29c04f48 <col:44, col:55> col:55 used __n 'std::__1::streamsize':'long'
| |-CompoundStmt 0x7f8b292f3150 <line:224:5, col:32>
| | `-ReturnStmt 0x7f8b292f3138 <col:7, col:29>
| |   `-CXXMemberCallExpr 0x7f8b292f30d0 <col:14, col:29> 'std::__1::streamsize':'long'
| |     |-MemberExpr 0x7f8b292f3048 <col:14> '<bound member function type>' ->xsputn 0x7f8b29c07500
| |     | `-CXXThisExpr 0x7f8b292f3030 <col:14> 'class std::__1::basic_streambuf<char> *' this
| |     |-ImplicitCastExpr 0x7f8b292f3108 <col:21> 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f8b292f3080 <col:21> 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *' lvalue ParmVar 0x7f8b29c04ee8 '__s' 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |     `-ImplicitCastExpr 0x7f8b292f3120 <col:26> 'std::__1::streamsize':'long' <LValueToRValue>
| |       `-DeclRefExpr 0x7f8b292f30a8 <col:26> 'std::__1::streamsize':'long' lvalue ParmVar 0x7f8b29c04f48 '__n' 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f8b29c05118 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-AccessSpecDecl 0x7f8b29c05160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:226:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f8b29c051c8 <line:227:5, col:21> col:5 basic_streambuf 'void (void)'
|-CXXConstructorDecl 0x7f8b29c053a0 <line:228:5, col:49> col:5 basic_streambuf 'void (const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7f8b29c052b8 <col:21, col:44> col:44 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7f8b29c05560 <line:229:5, col:60> col:22 operator= 'class std::__1::basic_streambuf<char> &(const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7f8b29c05498 <col:32, col:55> col:55 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7f8b29c056e0 <line:230:5, col:37> col:10 swap 'void (class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7f8b29c05620 <col:15, col:32> col:32 __rhs 'class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7f8b29c05810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:233:68> col:38 eback 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f8b29c058b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29c05920 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:234:68> col:38 gptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f8b29c059c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29c05a30 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:235:68> col:38 egptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f8b29c05ad8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29c05ba8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:237:5, line:238:43> col:10 gbump 'void (int)' inline
| |-ParmVarDecl 0x7f8b29c05b20 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7f8b29c05c58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29c05ec0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:240:5, line:245:5> line:241:10 setg 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7f8b29c05cb0 <col:15, col:26> col:26 __gbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f8b29c05d20 <col:34, col:45> col:45 __gnext 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f8b29c05d90 <col:54, col:65> col:65 __gend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7f8b29c05f80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29c05fe8 <line:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:248:68> col:38 pbase 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f8b29c06090 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29c060f8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:249:68> col:38 pptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f8b29c061a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29c06208 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:250:68> col:38 epptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f8b29c062b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f8b29c06380 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:252:5, line:253:43> col:10 pbump 'void (int)' inline
| |-ParmVarDecl 0x7f8b29c062f8 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7f8b29c06430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29c06610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:255:5, line:259:5> line:256:10 setp 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7f8b29c06488 <col:15, col:26> col:26 __pbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f8b29c064f8 <col:34, col:45> col:45 __pend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7f8b29c066c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f8b29c06798 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:263:5, col:43> col:18 imbue 'void (const class std::__1::locale &)' virtual
| `-ParmVarDecl 0x7f8b29c06710 <col:24, col:38> col:38 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f8b29c06948 <line:266:5, col:67> col:30 setbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7f8b29c06858 <col:37, col:48> col:48 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f8b29c068b8 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f8b29c06b68 <line:267:5, line:268:87> line:267:22 seekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7f8b29c06a10 <col:30, col:39> col:39 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7f8b29c06a70 <col:46, col:64> col:64 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-ParmVarDecl 0x7f8b29c06ad0 <line:268:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f8b29c06d28 <line:269:5, line:270:87> line:269:22 seekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7f8b29c06c38 <col:30, col:39> col:39 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ParmVarDecl 0x7f8b29c06c98 <line:270:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f8b29c06de0 <line:271:5, col:22> col:17 sync 'int (void)' virtual
|-CXXMethodDecl 0x7f8b29c06e88 <line:274:5, col:34> col:24 showmanyc 'std::__1::streamsize (void)' virtual
|-CXXMethodDecl 0x7f8b29c07030 <line:275:5, col:61> col:24 xsgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7f8b29c06f40 <col:31, col:42> col:42 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f8b29c06fa0 <col:47, col:58> col:58 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f8b29c07108 <line:276:5, col:32> col:22 underflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7f8b29c071d0 <line:277:5, col:28> col:22 uflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7f8b29c07350 <line:280:5, col:65> col:22 pbackfail 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7f8b29c07288 <col:32, col:64> col:41 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7f8b29c07500 <line:283:5, col:67> col:24 used xsputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7f8b29c07410 <col:31, col:48> col:48 __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f8b29c07470 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f8b29c07650 <line:284:5, col:64> col:22 overflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7f8b29c075c8 <col:31, col:63> col:40 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-AccessSpecDecl 0x7f8b29c07700 <line:286:1, col:8> col:1 private
|-FieldDecl 0x7f8b29c07728 <line:287:5, col:12> col:12 __loc_ 'class std::__1::locale'
|-FieldDecl 0x7f8b29c07780 <line:288:5, col:16> col:16 __binp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f8b29c077d8 <line:289:5, col:16> col:16 __ninp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f8b29c07830 <line:290:5, col:16> col:16 __einp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f8b29c07888 <line:291:5, col:16> col:16 __bout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f8b29c078e0 <line:292:5, col:16> col:16 __nout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
`-FieldDecl 0x7f8b29c07938 <line:293:5, col:16> col:16 __eout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f8b2a388f28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:998:1, line:1037:1> line:999:28 class ostreambuf_iterator definition
|-public 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-CXXRecordDecl 0x7f8b292eb580 prev 0x7f8b2a388f28 <col:1, col:28> col:28 implicit class ostreambuf_iterator
|-AccessSpecDecl 0x7f8b292eb618 <line:1002:1, col:7> col:1 public
|-TypedefDecl 0x7f8b292eb678 <line:1003:5, col:45> col:45 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f8b292eb640 'char' sugar
|   |-TemplateTypeParmType 0x7f8b289e38e0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f8b289e38a0 '_CharT'
|   `-BuiltinType 0x7f8b28832b60 'char'
|-TypedefDecl 0x7f8b292eb708 <line:1004:5, col:45> col:45 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f8b292eb6d0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f8b289e3950 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f8b289e3908 '_Traits'
|   `-RecordType 0x7f8b2989abc0 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f8b299f4688 'char_traits'
|-TypedefDecl 0x7f8b292eb828 <line:1005:5, col:45> col:45 streambuf_type 'basic_streambuf<char, struct std::__1::char_traits<char> >':'class std::__1::basic_streambuf<char>'
| `-TemplateSpecializationType 0x7f8b292eb780 'basic_streambuf<char, struct std::__1::char_traits<char> >' sugar basic_streambuf
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7f8b2989b460 'class std::__1::basic_streambuf<char>'
|     `-ClassTemplateSpecialization 0x7f8b2989b358 'basic_streambuf'
|-TypedefDecl 0x7f8b292eb948 <line:1006:5, col:45> col:45 ostream_type 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>'
| `-TemplateSpecializationType 0x7f8b292eb8a0 'basic_ostream<char, struct std::__1::char_traits<char> >' sugar basic_ostream
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7f8b2989ba40 'class std::__1::basic_ostream<char>'
|     `-ClassTemplateSpecialization 0x7f8b2989b938 'basic_ostream'
|-AccessSpecDecl 0x7f8b292eb9a0 <line:1007:1, col:8> col:1 private
|-FieldDecl 0x7f8b292eba28 <line:1008:5, col:21> col:21 referenced __sbuf_ 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
|-AccessSpecDecl 0x7f8b292eba70 <line:1009:1, col:7> col:1 public
|-CXXConstructorDecl 0x7f8b292ebc08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1011:33> line:1010:31 used ostreambuf_iterator 'void (std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type &) noexcept'
| |-ParmVarDecl 0x7f8b292ebaf8 <col:51, col:65> col:65 used __s 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type &'
| |-CXXCtorInitializer 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>'
| | `-CXXConstructExpr 0x7f8b292ef898 <col:31> 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7f8b292eba28 '__sbuf_' 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
| | `-CXXMemberCallExpr 0x7f8b292ef7e0 <line:1011:19, col:29> 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| |   `-MemberExpr 0x7f8b292ef7a8 <col:19, col:23> '<bound member function type>' .rdbuf 0x7f8b29c0e2e0
| |     `-ImplicitCastExpr 0x7f8b292ef808 <col:19> 'const class std::__1::basic_ios<char>' lvalue <UncheckedDerivedToBase (virtual basic_ios)>
| |       `-DeclRefExpr 0x7f8b292ef710 <col:19> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type':'class std::__1::basic_ostream<char>' lvalue ParmVar 0x7f8b292ebaf8 '__s' 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type &'
| |-CompoundStmt 0x7f8b289e6928 <col:32, col:33>
| `-AlwaysInlineAttr 0x7f8b292ebcf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8b292ebe38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1013:25> line:1012:31 ostreambuf_iterator 'void (std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *) noexcept'
| |-ParmVarDecl 0x7f8b292ebd50 <col:51, col:67> col:67 __s 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
| `-AlwaysInlineAttr 0x7f8b292ebef8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b292ec080 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1019:9> line:1014:52 operator= 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(char)'
| |-ParmVarDecl 0x7f8b292ebf78 <col:62, col:69> col:69 __c 'char':'char'
| `-AlwaysInlineAttr 0x7f8b292ec130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b292ec1d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1020:82> col:52 operator* 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(void)'
| `-AlwaysInlineAttr 0x7f8b292ec278 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b292ec2e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1021:82> col:52 operator++ 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(void)'
| `-AlwaysInlineAttr 0x7f8b292ec388 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b292ec490 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1022:82> col:52 operator++ 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(int)'
| |-ParmVarDecl 0x7f8b292ec3d0 <col:63> col:66 'int'
| `-AlwaysInlineAttr 0x7f8b292ec540 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b292ec588 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1023:82> col:36 used failed '_Bool (void) const noexcept'
| |-CompoundStmt 0x7f8b29313040 <col:61, col:82>
| | `-ReturnStmt 0x7f8b29313028 <col:62, col:80>
| |   `-BinaryOperator 0x7f8b29313000 <col:69, col:80> '_Bool' '=='
| |     |-ImplicitCastExpr 0x7f8b292f85c8 <col:69> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' <LValueToRValue>
| |     | `-MemberExpr 0x7f8b292f8590 <col:69> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *const' lvalue ->__sbuf_ 0x7f8b292eba28
| |     |   `-CXXThisExpr 0x7f8b292f8578 <col:69> 'const class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > *' this
| |     `-ImplicitCastExpr 0x7f8b292f85e0 <col:80> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' <NullToPointer>
| |       `-IntegerLiteral 0x7f8b289e6ff8 <col:80> 'int' 0
| `-AlwaysInlineAttr 0x7f8b292ec630 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FriendDecl 0x7f8b292ece70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1029:5, line:1035:47> line:1033:5
| `-FunctionTemplateDecl 0x7f8b292ecd40 parent 0x7f8b289adfe8 prev 0x7f8b292ad160 <line:1029:5, line:1035:47> line:1033:5 __pad_and_output
|   |-TemplateTypeParmDecl 0x7f8b292ec678 <line:1029:15, col:21> col:21 class depth 0 index 0 _Ch
|   |-TemplateTypeParmDecl 0x7f8b292ec6e8 <col:26, col:32> col:32 class depth 0 index 1 _Tr
|   |-FunctionDecl 0x7f8b292ecc68 parent 0x7f8b289adfe8 prev 0x7f8b292ad0c8 <line:1030:5, line:1035:47> line:1033:5 __pad_and_output 'ostreambuf_iterator<_Ch, _Tr> (ostreambuf_iterator<_Ch, _Tr>, const _Ch *, const _Ch *, const _Ch *, class std::__1::ios_base &, _Ch)'
|   | |-ParmVarDecl 0x7f8b292ec8c8 <col:22, col:52> col:52 __s 'ostreambuf_iterator<_Ch, _Tr>'
|   | |-ParmVarDecl 0x7f8b292ec968 <line:1034:22, col:33> col:33 __ob 'const _Ch *'
|   | |-ParmVarDecl 0x7f8b292ec9d8 <col:39, col:50> col:50 __op 'const _Ch *'
|   | |-ParmVarDecl 0x7f8b292eca48 <col:56, col:67> col:67 __oe 'const _Ch *'
|   | |-ParmVarDecl 0x7f8b292ecaa8 <line:1035:22, col:32> col:32 __iob 'class std::__1::ios_base &'
|   | |-ParmVarDecl 0x7f8b292ecb18 <col:39, col:43> col:43 __fl '_Ch'
|   | `-VisibilityAttr 0x7f8b292ecdd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:624:40, col:63> Inherited Hidden
|   `-Function 0x7f8b292eeb48 '__pad_and_output' 'ostreambuf_iterator<char, struct std::__1::char_traits<char> > (ostreambuf_iterator<char, struct std::__1::char_traits<char> >, const char *, const char *, const char *, class std::__1::ios_base &, char)'
|-CXXConstructorDecl 0x7f8b292ed298 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:999:28> col:28 implicit constexpr ostreambuf_iterator 'void (const class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &)' inline default trivial noexcept-unevaluated 0x7f8b292ed298
| `-ParmVarDecl 0x7f8b292ed3c0 <col:28> col:28 'const class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &'
|-CXXConstructorDecl 0x7f8b292ed458 <col:28> col:28 implicit used constexpr ostreambuf_iterator 'void (class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7f8b292ed580 <col:28> col:28 used 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&'
| |-CXXCtorInitializer 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>'
| | `-CXXConstructExpr 0x7f8b292eef90 <col:28> 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>' 'void (struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &&) noexcept'
| |   `-ImplicitCastExpr 0x7f8b292eee70 <col:28> 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>' xvalue <UncheckedDerivedToBase (iterator)>
| |     `-CXXStaticCastExpr 0x7f8b292eee40 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' xvalue static_cast<class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&> <NoOp>
| |       `-DeclRefExpr 0x7f8b292eee08 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' lvalue ParmVar 0x7f8b292ed580 '' 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&'
| |-CXXCtorInitializer Field 0x7f8b292eba28 '__sbuf_' 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
| | `-ImplicitCastExpr 0x7f8b292ef188 <col:28> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' <LValueToRValue>
| |   `-MemberExpr 0x7f8b292ef138 <col:28> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' xvalue .__sbuf_ 0x7f8b292eba28
| |     `-CXXStaticCastExpr 0x7f8b292ef108 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' xvalue static_cast<class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&> <NoOp>
| |       `-DeclRefExpr 0x7f8b292ef0d0 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' lvalue ParmVar 0x7f8b292ed580 '' 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&'
| `-CompoundStmt 0x7f8b292ef1d8 <col:28>
`-CXXDestructorDecl 0x7f8b292ed620 <col:28> col:28 implicit referenced ~ostreambuf_iterator 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ostreambuf_iterator" = type { %"class.std::__1::basic_streambuf"* }
  NonVirtualBaseLLVMType:%"class.std::__1::ostreambuf_iterator" = type { %"class.std::__1::basic_streambuf"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f8b29192d68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:583:90> col:64 class __basic_string_common definition
|-TemplateArgument integral 1
|-VisibilityAttr 0x7f8b29192ef8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7f8b29192fa8 prev 0x7f8b29192d68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:558:1, col:28> col:28 implicit class __basic_string_common
|-AccessSpecDecl 0x7f8b29193040 <line:560:1, col:10> col:1 protected
|-CXXMethodDecl 0x7f8b29193068 <line:561:22, col:50> col:27 used __throw_length_error 'void (void) const'
| `-CXX11NoReturnAttr 0x7f8b29193138 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:313:30> Inherited
|-CXXMethodDecl 0x7f8b29193180 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:562:22, col:50> col:27 __throw_out_of_range 'void (void) const'
| `-CXX11NoReturnAttr 0x7f8b29193228 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:313:30> Inherited
|-CXXDestructorDecl 0x7f8b28b73d40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:583:64> col:64 implicit ~__basic_string_common 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f8b28e1a1a8 <col:64> col:64 implicit used constexpr __basic_string_common 'void (void) noexcept' inline default trivial
| `-CompoundStmt 0x7f8b28e1a608 <col:64>
|-CXXConstructorDecl 0x7f8b28e1a2b8 <col:64> col:64 implicit constexpr __basic_string_common 'void (const class std::__1::__basic_string_common<true> &)' inline default trivial noexcept-unevaluated 0x7f8b28e1a2b8
| `-ParmVarDecl 0x7f8b28e1a3e0 <col:64> col:64 'const class std::__1::__basic_string_common<true> &'
`-CXXConstructorDecl 0x7f8b28e1a478 <col:64> col:64 implicit constexpr __basic_string_common 'void (class std::__1::__basic_string_common<true> &&)' inline default trivial noexcept-unevaluated 0x7f8b28e1a478
  `-ParmVarDecl 0x7f8b28e1a5a0 <col:64> col:64 'class std::__1::__basic_string_common<true> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f8b2989bf28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:101:1, col:52> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1759:28 class allocator definition
|-TemplateArgument type 'char'
|-CXXRecordDecl 0x7f8b28b1e848 prev 0x7f8b2989bf28 <col:1, col:28> col:28 implicit class allocator
|-AccessSpecDecl 0x7f8b28b1e8e0 <line:1761:1, col:7> col:1 public
|-TypedefDecl 0x7f8b28b1e908 <line:1762:5, col:31> col:31 referenced size_type 'size_t':'unsigned long'
| `-TypedefType 0x7f8b2983f300 'size_t' sugar
|   |-Typedef 0x7f8b288673b0 'size_t'
|   `-BuiltinType 0x7f8b28832c80 'unsigned long'
|-TypedefDecl 0x7f8b28b1e960 <line:1763:5, col:31> col:31 referenced difference_type 'ptrdiff_t':'long'
| `-TypedefType 0x7f8b289b9000 'ptrdiff_t' sugar
|   |-Typedef 0x7f8b28867340 'ptrdiff_t'
|   `-BuiltinType 0x7f8b28832be0 'long'
|-TypedefDecl 0x7f8b28b1ea28 <line:1764:5, col:31> col:31 referenced pointer 'char *'
| `-PointerType 0x7f8b28b1e9f0 'char *'
|   `-SubstTemplateTypeParmType 0x7f8b28b1e9c0 'char' sugar
|     |-TemplateTypeParmType 0x7f8b2a0ed9d0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f8b2a0ed988 '_Tp'
|     `-BuiltinType 0x7f8b28832b60 'char'
|-TypedefDecl 0x7f8b28b1eab8 <line:1765:5, col:31> col:31 referenced const_pointer 'const char *'
| `-PointerType 0x7f8b28b1ea80 'const char *'
|   `-QualType 0x7f8b28b1e9c1 'const char' const
|     `-SubstTemplateTypeParmType 0x7f8b28b1e9c0 'char' sugar
|       |-TemplateTypeParmType 0x7f8b2a0ed9d0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f8b2a0ed988 '_Tp'
|       `-BuiltinType 0x7f8b28832b60 'char'
|-TypedefDecl 0x7f8b28b1eb48 <line:1766:5, col:31> col:31 reference 'char &'
| `-LValueReferenceType 0x7f8b28b1eb10 'char &'
|   `-SubstTemplateTypeParmType 0x7f8b28b1e9c0 'char' sugar
|     |-TemplateTypeParmType 0x7f8b2a0ed9d0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f8b2a0ed988 '_Tp'
|     `-BuiltinType 0x7f8b28832b60 'char'
|-TypedefDecl 0x7f8b28b1ebd8 <line:1767:5, col:31> col:31 const_reference 'const char &'
| `-LValueReferenceType 0x7f8b28b1eba0 'const char &'
|   `-QualType 0x7f8b28b1e9c1 'const char' const
|     `-SubstTemplateTypeParmType 0x7f8b28b1e9c0 'char' sugar
|       |-TemplateTypeParmType 0x7f8b2a0ed9d0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f8b2a0ed988 '_Tp'
|       `-BuiltinType 0x7f8b28832b60 'char'
|-TypedefDecl 0x7f8b28b1ec40 <line:1768:5, col:31> col:31 referenced value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f8b28b1e9c0 'char' sugar
|   |-TemplateTypeParmType 0x7f8b2a0ed9d0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f8b2a0ed988 '_Tp'
|   `-BuiltinType 0x7f8b28832b60 'char'
|-TypedefDecl 0x7f8b28b1ec98 <line:1770:5, col:23> col:23 referenced propagate_on_container_move_assignment 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7f8b298bee30 'std::__1::true_type' sugar
|   |-Typedef 0x7f8b298af550 'true_type'
|   `-TemplateSpecializationType 0x7f8b298af460 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7f8b298af2c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:522:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7f8b298af2b0 <line:525:31> '_Bool' true
|     `-RecordType 0x7f8b298af440 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7f8b298af338 'integral_constant'
|-TypedefDecl 0x7f8b28b1ecf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1771:5, col:23> col:23 referenced is_always_equal 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7f8b298bee30 'std::__1::true_type' sugar
|   |-Typedef 0x7f8b298af550 'true_type'
|   `-TemplateSpecializationType 0x7f8b298af460 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7f8b298af2c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:522:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7f8b298af2b0 <line:525:31> '_Bool' true
|     `-RecordType 0x7f8b298af440 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7f8b298af338 'integral_constant'
|-ClassTemplateDecl 0x7f8b28b1ee68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1773:5, col:33> col:33 rebind
| |-TemplateTypeParmDecl 0x7f8b28b1ed48 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXRecordDecl 0x7f8b28b1edd0 <col:26, col:33> col:33 struct rebind
|-CXXConstructorDecl 0x7f8b28b1f0b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1775:54> col:31 used allocator 'void (void) noexcept'
| |-CompoundStmt 0x7f8b2a0f00b0 <col:53, col:54>
| `-AlwaysInlineAttr 0x7f8b28b1f198 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f8b28b1f4f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:5, col:96> col:52 allocator
| |-TemplateTypeParmDecl 0x7f8b28b1f1e0 <col:15, col:21> col:21 class depth 0 index 0 _Up
| |-CXXConstructorDecl 0x7f8b28b1f448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:96> col:52 allocator 'void (const allocator<_Up> &) noexcept'
| | |-ParmVarDecl 0x7f8b28b1f320 <col:62, col:82> col:83 'const allocator<_Up> &'
| | `-AlwaysInlineAttr 0x7f8b28b1f548 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-CXXConstructorDecl 0x7f8b28b76948 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:96> col:52 allocator 'void (const allocator<char> &) noexcept'
|   |-TemplateArgument type 'char'
|   |-ParmVarDecl 0x7f8b28b76880 <col:62, col:82> col:83 'const allocator<char> &'
|   `-AlwaysInlineAttr 0x7f8b28b76a50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b28b1f778 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1778:39> line:1777:39 address 'std::__1::allocator<char>::pointer (std::__1::allocator<char>::reference) const noexcept'
| |-ParmVarDecl 0x7f8b28b1f670 <col:47, col:57> col:57 __x 'std::__1::allocator<char>::reference':'char &'
| `-AlwaysInlineAttr 0x7f8b28b1f828 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b28b1f9c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1780:39> line:1779:45 address 'std::__1::allocator<char>::const_pointer (std::__1::allocator<char>::const_reference) const noexcept'
| |-ParmVarDecl 0x7f8b28b1f8c0 <col:53, col:69> col:69 __x 'std::__1::allocator<char>::const_reference':'const char &'
| `-AlwaysInlineAttr 0x7f8b28b1fa78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b28b1fc30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1787:9> line:1781:39 used allocate 'std::__1::allocator<char>::pointer (std::__1::allocator::size_type, allocator<void>::const_pointer)'
| |-ParmVarDecl 0x7f8b28b1fac0 <col:48, col:58> col:58 used __n 'std::__1::allocator::size_type':'unsigned long'
| |-ParmVarDecl 0x7f8b28b1fb20 <col:63, col:96> col:94 'allocator<void>::const_pointer':'const void *' cinit
| | `-ImplicitCastExpr 0x7f8b29dd3ae8 <col:96> 'allocator<void>::const_pointer':'const void *' <NullToPointer>
| |   `-IntegerLiteral 0x7f8b2a0f0078 <col:96> 'int' 0
| |-CompoundStmt 0x7f8b29dd3ea0 <line:1782:9, line:1787:9>
| | |-IfStmt 0x7f8b29dd3d30 <line:1783:9, line:1785:71>
| | | |-<<<NULL>>>
| | | |-<<<NULL>>>
| | | |-BinaryOperator 0x7f8b29dd3ca8 <line:1783:13, col:28> '_Bool' '>'
| | | | |-ImplicitCastExpr 0x7f8b29dd3c90 <col:13> 'std::__1::allocator::size_type':'unsigned long' <LValueToRValue>
| | | | | `-DeclRefExpr 0x7f8b29dd3bd8 <col:13> 'std::__1::allocator::size_type':'unsigned long' lvalue ParmVar 0x7f8b28b1fac0 '__n' 'std::__1::allocator::size_type':'unsigned long'
| | | | `-CXXMemberCallExpr 0x7f8b29dd3c50 <col:19, col:28> 'std::__1::allocator::size_type':'unsigned long'
| | | |   `-MemberExpr 0x7f8b29dd3c18 <col:19> '<bound member function type>' ->max_size 0x7f8b28b1ff78
| | | |     `-ImplicitCastExpr 0x7f8b29dd3c78 <col:19> 'const class std::__1::allocator<char> *' <NoOp>
| | | |       `-CXXThisExpr 0x7f8b29dd3c00 <col:19> 'class std::__1::allocator<char> *' this
| | | |-CallExpr 0x7f8b29dd3ce8 <line:1784:13, line:1785:71> 'void'
| | | | |-ImplicitCastExpr 0x7f8b29dd3cd0 <line:1784:13> 'void (*)(const char *)' <FunctionToPointerDecay>
| | | | | `-DeclRefExpr 0x7f8b2a0f05d0 <col:13> 'void (const char *)' lvalue Function 0x7f8b290dac80 '__throw_length_error' 'void (const char *)'
| | | | `-ImplicitCastExpr 0x7f8b29dd3d18 <col:34, line:1785:34> 'const char *' <ArrayToPointerDecay>
| | | |   `-StringLiteral 0x7f8b2a0f0558 <line:1784:34, line:1785:34> 'const char [68]' lvalue "allocator<T>::allocate(size_t n) 'n' exceeds maximum supported size"
| | | `-<<<NULL>>>
| | `-ReturnStmt 0x7f8b29dd3e88 <line:1786:9, col:73>
| |   `-CXXStaticCastExpr 0x7f8b29dd3e58 <col:16, col:73> 'std::__1::allocator<char>::pointer':'char *' static_cast<std::__1::allocator<char>::pointer> <BitCast>
| |     `-CallExpr 0x7f8b29dd3e28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1786:72> 'void *'
| |       |-ImplicitCastExpr 0x7f8b29dd3e10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1786:44> 'void *(*)(size_t)' <FunctionToPointerDecay>
| |       | `-DeclRefExpr 0x7f8b2a0f06f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1786:44> 'void *(size_t)' lvalue Function 0x7f8b2894b538 '__allocate' 'void *(size_t)'
| |       `-BinaryOperator 0x7f8b29dd3de8 <col:55, col:71> 'unsigned long' '*'
| |         |-ImplicitCastExpr 0x7f8b29dd3dd0 <col:55> 'std::__1::allocator::size_type':'unsigned long' <LValueToRValue>
| |         | `-DeclRefExpr 0x7f8b29dd3d78 <col:55> 'std::__1::allocator::size_type':'unsigned long' lvalue ParmVar 0x7f8b28b1fac0 '__n' 'std::__1::allocator::size_type':'unsigned long'
| |         `-UnaryExprOrTypeTraitExpr 0x7f8b29dd3db0 <col:61, col:71> 'unsigned long' sizeof 'char':'char'
| `-AlwaysInlineAttr 0x7f8b28b1fce8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b28b1fe78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:49> line:1788:36 used deallocate 'void (std::__1::allocator<char>::pointer, std::__1::allocator::size_type) noexcept'
| |-ParmVarDecl 0x7f8b28b1fd40 <col:47, col:55> col:55 used __p 'std::__1::allocator<char>::pointer':'char *'
| |-ParmVarDecl 0x7f8b28b1fda0 <col:60> col:69 'std::__1::allocator::size_type':'unsigned long'
| |-CompoundStmt 0x7f8b29dd5550 <line:1789:9, col:49>
| | `-CallExpr 0x7f8b29dd5520 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:47> 'void'
| |   |-ImplicitCastExpr 0x7f8b29dd5508 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:17> 'void (*)(void *)' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7f8b2a0f08e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:17> 'void (void *)' lvalue Function 0x7f8b2894b9c0 '__libcpp_deallocate' 'void (void *)'
| |   `-CStyleCastExpr 0x7f8b29dd54e0 <col:37, col:44> 'void *' <NoOp>
| |     `-ImplicitCastExpr 0x7f8b29dd54c8 <col:44> 'void *' <BitCast>
| |       `-ImplicitCastExpr 0x7f8b29dd54b0 <col:44> 'std::__1::allocator<char>::pointer':'char *' <LValueToRValue>
| |         `-DeclRefExpr 0x7f8b29dd5488 <col:44> 'std::__1::allocator<char>::pointer':'char *' lvalue ParmVar 0x7f8b28b1fd40 '__p' 'std::__1::allocator<char>::pointer':'char *'
| `-AlwaysInlineAttr 0x7f8b28b1ff30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b28b1ff78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1791:45> line:1790:41 used max_size 'std::__1::allocator::size_type (void) const noexcept'
| |-CompoundStmt 0x7f8b28e221c8 <line:1791:9, col:45>
| | `-ReturnStmt 0x7f8b28e221b0 <col:10, col:43>
| |   `-BinaryOperator 0x7f8b28e22188 <col:17, col:43> 'unsigned long' '/'
| |     |-CXXFunctionalCastExpr 0x7f8b28e22130 <col:17, col:29> 'std::__1::allocator::size_type':'unsigned long' functional cast to std::__1::allocator::size_type <NoOp>
| |     | `-ImplicitCastExpr 0x7f8b28e22118 <col:27, col:28> 'std::__1::allocator::size_type':'unsigned long' <IntegralCast>
| |     |   `-UnaryOperator 0x7f8b2a0f0a18 <col:27, col:28> 'int' prefix '~'
| |     |     `-IntegerLiteral 0x7f8b2a0f09f8 <col:28> 'int' 0
| |     `-UnaryExprOrTypeTraitExpr 0x7f8b28e22168 <col:33, col:43> 'unsigned long' sizeof 'char':'char'
| `-AlwaysInlineAttr 0x7f8b28b20020 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f8b28b20448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1793:5, line:1799:9> line:1796:9 construct
| |-TemplateTypeParmDecl 0x7f8b28b20068 <line:1793:15, col:21> col:21 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7f8b28b200d8 <col:26, col:35> col:35 class depth 0 index 1 ... _Args
| `-CXXMethodDecl 0x7f8b28b203b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1799:9> line:1796:9 construct 'void (_Up *, _Args &&...)'
|   |-ParmVarDecl 0x7f8b28b201a8 <col:19, col:24> col:24 __p '_Up *'
|   |-ParmVarDecl 0x7f8b28b20298 <col:29, col:40> col:40 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7f8b28b204a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b28b20690 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1853:70> col:36 destroy 'void (std::__1::allocator<char>::pointer)'
| |-ParmVarDecl 0x7f8b28b20588 <col:44, col:52> col:52 __p 'std::__1::allocator<char>::pointer':'char *'
| `-AlwaysInlineAttr 0x7f8b28b20740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8b28b72948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1759:28> col:28 implicit constexpr allocator 'void (const class std::__1::allocator<char> &)' inline default trivial noexcept-unevaluated 0x7f8b28b72948
| `-ParmVarDecl 0x7f8b28b72a30 <col:28> col:28 'const class std::__1::allocator<char> &'
|-CXXConstructorDecl 0x7f8b28b72ac8 <col:28> col:28 implicit used constexpr allocator 'void (class std::__1::allocator<char> &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7f8b28b72bf0 <col:28> col:28 'class std::__1::allocator<char> &&'
| `-CompoundStmt 0x7f8b29dd6be0 <col:28>
`-CXXDestructorDecl 0x7f8b28b73fd8 <col:28> col:28 implicit referenced ~allocator 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f8b28b3bc60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:699:5, line:704:5> line:699:12 struct __long definition
|-CXXRecordDecl 0x7f8b28b3c0d8 prev 0x7f8b28b3bc60 <col:5, col:12> col:12 implicit struct __long
|-FieldDecl 0x7f8b28b3c1a0 <line:701:9, col:19> col:19 referenced __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7f8b28b3c1f8 <line:702:9, col:19> col:19 referenced __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7f8b28b3c250 <line:703:9, col:19> col:19 referenced __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
|-CXXDestructorDecl 0x7f8b28b74198 <line:699:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f8b28e1acd8 <col:12> col:12 implicit constexpr __long 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &)' inline default trivial noexcept-unevaluated 0x7f8b28e1acd8
| `-ParmVarDecl 0x7f8b28e1ae00 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &'
|-CXXConstructorDecl 0x7f8b28e1ae98 <col:12> col:12 implicit constexpr __long 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7f8b28e1afc0 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &&'
`-CXXConstructorDecl 0x7f8b28e1c8b8 <col:12> col:12 implicit __long 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f8b28b3cb58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9, line:723:9> line:719:9 union definition
|-FieldDecl 0x7f8b28b3ccd8 <line:721:13, col:27> col:27 referenced __size_ 'unsigned char'
|-FieldDecl 0x7f8b28b3cd30 <line:722:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXDestructorDecl 0x7f8b28b74518 <line:719:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f8b28e1b0c8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &)' inline default trivial noexcept-unevaluated 0x7f8b28e1b0c8
| `-ParmVarDecl 0x7f8b28e1b1f0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &'
|-CXXConstructorDecl 0x7f8b28e1b288 <col:9> col:9 implicit constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7f8b28e1b3b0 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&'
`-CXXConstructorDecl 0x7f8b28e1cc38 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon.0 = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f8b28b3c638 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:717:5, line:725:5> line:717:12 struct __short definition
|-CXXRecordDecl 0x7f8b28b3cac0 prev 0x7f8b28b3c638 <col:5, col:12> col:12 implicit struct __short
|-CXXRecordDecl 0x7f8b28b3cb58 <line:719:9, line:723:9> line:719:9 union definition
| |-FieldDecl 0x7f8b28b3ccd8 <line:721:13, col:27> col:27 referenced __size_ 'unsigned char'
| |-FieldDecl 0x7f8b28b3cd30 <line:722:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-CXXDestructorDecl 0x7f8b28b74518 <line:719:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7f8b28e1b0c8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &)' inline default trivial noexcept-unevaluated 0x7f8b28e1b0c8
| | `-ParmVarDecl 0x7f8b28e1b1f0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &'
| |-CXXConstructorDecl 0x7f8b28e1b288 <col:9> col:9 implicit constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&) noexcept' inline default trivial
| | `-ParmVarDecl 0x7f8b28e1b3b0 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&'
| `-CXXConstructorDecl 0x7f8b28e1cc38 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial
|-FieldDecl 0x7f8b28b3cd98 <col:9> col:9 implicit referenced 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
|-IndirectFieldDecl 0x7f8b28b3cdf0 <line:721:27> col:27 implicit __size_ 'unsigned char'
| |-Field 0x7f8b28b3cd98 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| `-Field 0x7f8b28b3ccd8 '__size_' 'unsigned char'
|-IndirectFieldDecl 0x7f8b28b3ce40 <line:722:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-Field 0x7f8b28b3cd98 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| `-Field 0x7f8b28b3cd30 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FieldDecl 0x7f8b28b3cf08 <line:724:9, col:37> col:20 referenced __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
|-CXXDestructorDecl 0x7f8b28b74278 <line:717:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f8b28e1b418 <col:12> col:12 implicit constexpr __short 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &)' inline default trivial noexcept-unevaluated 0x7f8b28e1b418
| `-ParmVarDecl 0x7f8b28e1b540 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &'
|-CXXConstructorDecl 0x7f8b28e1b5d8 <col:12> col:12 implicit constexpr __short 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7f8b28e1b700 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &&'
`-CXXConstructorDecl 0x7f8b28e1c998 <col:12> col:12 implicit __short 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f8b28b3d310 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:733:5, line:736:5> line:733:12 struct __raw definition
|-CXXRecordDecl 0x7f8b28b3fa10 prev 0x7f8b28b3d310 <col:5, col:12> col:12 implicit struct __raw
|-FieldDecl 0x7f8b28b3fb68 <line:735:9, col:36> col:19 referenced __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
|-CXXDestructorDecl 0x7f8b28b74358 <line:733:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f8b28e1b7b8 <col:12> col:12 implicit constexpr __raw 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &)' inline default trivial noexcept-unevaluated 0x7f8b28e1b7b8
| `-ParmVarDecl 0x7f8b28e1b8e0 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &'
|-CXXConstructorDecl 0x7f8b28e1b978 <col:12> col:12 implicit constexpr __raw 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7f8b28e1baa0 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &&'
`-CXXConstructorDecl 0x7f8b28e1ca78 <col:12> col:12 implicit __raw 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f8b28b3f768 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9, line:745:9> line:740:9 union definition
|-FieldDecl 0x7f8b28b3f8f8 <line:742:13, col:21> col:21 referenced __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-FieldDecl 0x7f8b28b3f950 <line:743:13, col:21> col:21 referenced __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-FieldDecl 0x7f8b28b3fbd0 <line:744:13, col:21> col:21 referenced __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
|-CXXDestructorDecl 0x7f8b28b74438 <line:740:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f8b28e1a7a8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &)' inline default trivial noexcept-unevaluated 0x7f8b28e1a7a8
| `-ParmVarDecl 0x7f8b28e1a8d0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &'
|-CXXConstructorDecl 0x7f8b28e1a968 <col:9> col:9 implicit used constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7f8b28e1aa90 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&'
| `-CompoundStmt 0x7f8b29dd6dc0 <col:9>
`-CXXConstructorDecl 0x7f8b28e1cb58 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f8b28b3d3e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:738:5, line:746:5> line:738:12 struct __rep definition
|-CXXRecordDecl 0x7f8b28b3f6d0 prev 0x7f8b28b3d3e0 <col:5, col:12> col:12 implicit struct __rep
|-CXXRecordDecl 0x7f8b28b3f768 <line:740:9, line:745:9> line:740:9 union definition
| |-FieldDecl 0x7f8b28b3f8f8 <line:742:13, col:21> col:21 referenced __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-FieldDecl 0x7f8b28b3f950 <line:743:13, col:21> col:21 referenced __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-FieldDecl 0x7f8b28b3fbd0 <line:744:13, col:21> col:21 referenced __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-CXXDestructorDecl 0x7f8b28b74438 <line:740:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7f8b28e1a7a8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &)' inline default trivial noexcept-unevaluated 0x7f8b28e1a7a8
| | `-ParmVarDecl 0x7f8b28e1a8d0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &'
| |-CXXConstructorDecl 0x7f8b28e1a968 <col:9> col:9 implicit used constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept' inline default trivial
| | |-ParmVarDecl 0x7f8b28e1aa90 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&'
| | `-CompoundStmt 0x7f8b29dd6dc0 <col:9>
| `-CXXConstructorDecl 0x7f8b28e1cb58 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial
|-FieldDecl 0x7f8b28b3fc38 <col:9> col:9 implicit referenced 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
|-IndirectFieldDecl 0x7f8b28b3fc90 <line:742:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-Field 0x7f8b28b3fc38 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| `-Field 0x7f8b28b3f8f8 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-IndirectFieldDecl 0x7f8b28b3fce0 <line:743:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-Field 0x7f8b28b3fc38 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| `-Field 0x7f8b28b3f950 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-IndirectFieldDecl 0x7f8b28b3fd30 <line:744:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-Field 0x7f8b28b3fc38 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| `-Field 0x7f8b28b3fbd0 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
|-CXXDestructorDecl 0x7f8b28b740b8 <line:738:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f8b28e1aaf8 <col:12> col:12 implicit constexpr __rep 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &)' inline default trivial noexcept-unevaluated 0x7f8b28e1aaf8
| `-ParmVarDecl 0x7f8b28e1ac20 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
|-CXXConstructorDecl 0x7f8b28e1bb38 <col:12> col:12 implicit used constexpr __rep 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7f8b28e1bc60 <col:12> col:12 used 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&'
| |-CXXCtorInitializer Field 0x7f8b28b3fc38 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | `-CXXConstructExpr 0x7f8b29dd6dd8 <col:12> 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)' 'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept'
| |   `-MemberExpr 0x7f8b29dd6d88 <col:12> 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)' xvalue . 0x7f8b28b3fc38
| |     `-CXXStaticCastExpr 0x7f8b29dd6d58 <col:12> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' xvalue static_cast<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&> <NoOp>
| |       `-DeclRefExpr 0x7f8b29dd6d20 <col:12> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue ParmVar 0x7f8b28e1bc60 '' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&'
| `-CompoundStmt 0x7f8b29dd6e40 <col:12>
`-CXXConstructorDecl 0x7f8b28e1c7d0 <col:12> col:12 implicit referenced __rep 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f8b28b414d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2209:1, line:2264:1> line:2210:7 class __libcpp_compressed_pair_imp definition
|-private 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-TemplateArgument integral 2
|-CXXRecordDecl 0x7f8b28b418f8 prev 0x7f8b28b414d8 <col:1, col:7> col:7 implicit class __libcpp_compressed_pair_imp
|-AccessSpecDecl 0x7f8b28b41990 <line:2213:1, col:8> col:1 private
|-FieldDecl 0x7f8b28b419c8 <line:2214:5, col:9> col:9 referenced __first_ 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-AccessSpecDecl 0x7f8b28b41a10 <line:2215:1, col:7> col:1 public
|-TypedefDecl 0x7f8b28b41a48 <line:2216:5, col:17> col:17 referenced _T1_param 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-SubstTemplateTypeParmType 0x7f8b28b41780 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|   |-TemplateTypeParmType 0x7f8b2a112da0 '_T1' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f8b2a112d60 '_T1'
|   `-RecordType 0x7f8b28b3d480 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|     `-CXXRecord 0x7f8b28b3d3e0 '__rep'
|-TypedefDecl 0x7f8b28b41ab0 <line:2217:5, col:17> col:17 referenced _T2_param 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7f8b28b417c0 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7f8b2a112e10 '_T2' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f8b2a112dc8 '_T2'
|   `-RecordType 0x7f8b2989c010 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7f8b2989bf28 'allocator'
|-TypedefDecl 0x7f8b28b41fa0 <line:2219:5, col:51> col:51 referenced _T1_reference 'typename remove_reference<struct __rep>::type &'
| `-LValueReferenceType 0x7f8b28b41f50 'typename remove_reference<struct __rep>::type &'
|   `-ElaboratedType 0x7f8b28b41ef0 'typename remove_reference<struct __rep>::type' sugar
|     `-TypedefType 0x7f8b28b41ed0 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|       |-Typedef 0x7f8b28b41e58 'type'
|       `-SubstTemplateTypeParmType 0x7f8b28b41e20 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|         |-TemplateTypeParmType 0x7f8b298e0b20 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7f8b298e0ae0 '_Tp'
|         `-RecordType 0x7f8b28b3d480 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|           `-CXXRecord 0x7f8b28b3d3e0 '__rep'
|-TypedefDecl 0x7f8b28b42038 <line:2220:5, col:57> col:57 referenced _T2_reference 'class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7f8b28b42000 'class std::__1::allocator<char> &'
|   `-SubstTemplateTypeParmType 0x7f8b28b417c0 'class std::__1::allocator<char>' sugar
|     |-TemplateTypeParmType 0x7f8b2a112e10 '_T2' dependent depth 0 index 1
|     | `-TemplateTypeParm 0x7f8b2a112dc8 '_T2'
|     `-RecordType 0x7f8b2989c010 'class std::__1::allocator<char>'
|       `-ClassTemplateSpecialization 0x7f8b2989bf28 'allocator'
|-TypedefDecl 0x7f8b28b421f0 <line:2222:5, col:57> col:57 referenced _T1_const_reference 'const typename remove_reference<struct __rep>::type &'
| `-LValueReferenceType 0x7f8b28b421a0 'const typename remove_reference<struct __rep>::type &'
|   `-QualType 0x7f8b28b42141 'const typename remove_reference<struct __rep>::type' const
|     `-ElaboratedType 0x7f8b28b42140 'typename remove_reference<struct __rep>::type' sugar
|       `-TypedefType 0x7f8b28b41ed0 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|         |-Typedef 0x7f8b28b41e58 'type'
|         `-SubstTemplateTypeParmType 0x7f8b28b41e20 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|           |-TemplateTypeParmType 0x7f8b298e0b20 '_Tp' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x7f8b298e0ae0 '_Tp'
|           `-RecordType 0x7f8b28b3d480 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|             `-CXXRecord 0x7f8b28b3d3e0 '__rep'
|-TypedefDecl 0x7f8b28b42288 <line:2223:5, col:63> col:63 referenced _T2_const_reference 'const class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7f8b28b42250 'const class std::__1::allocator<char> &'
|   `-QualType 0x7f8b28b417c1 'const class std::__1::allocator<char>' const
|     `-SubstTemplateTypeParmType 0x7f8b28b417c0 'class std::__1::allocator<char>' sugar
|       |-TemplateTypeParmType 0x7f8b2a112e10 '_T2' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x7f8b2a112dc8 '_T2'
|       `-RecordType 0x7f8b2989c010 'class std::__1::allocator<char>'
|         `-ClassTemplateSpecialization 0x7f8b2989bf28 'allocator'
|-CXXConstructorDecl 0x7f8b28b42320 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2225:76> col:31 used __libcpp_compressed_pair_imp 'void (void)'
| |-CXXCtorInitializer 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| | `-CXXConstructExpr 0x7f8b28e1cd70 <col:31> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7f8b28b419c8 '__first_' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| | `-CXXConstructExpr 0x7f8b28e1cd18 <col:64, col:73> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' 'void (void) noexcept' zeroing
| |-CompoundStmt 0x7f8b2a115d28 <col:75, col:76>
| `-AlwaysInlineAttr 0x7f8b28b42408 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8b28b425a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2227:54> line:2226:40 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param)'
| |-ParmVarDecl 0x7f8b28b42480 <col:69, col:79> col:79 __t1 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-AlwaysInlineAttr 0x7f8b28b42660 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8b28b42800 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2229:61> line:2228:40 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param)'
| |-ParmVarDecl 0x7f8b28b426e0 <col:69, col:79> col:79 __t2 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7f8b28b428c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8b28b42ad0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2233:92> line:2230:31 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param, std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param)' noexcept-uninstantiated 0x7f8b2a1141a8
| |-ParmVarDecl 0x7f8b28b42918 <col:60, col:70> col:70 __t1 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| |-ParmVarDecl 0x7f8b28b42988 <col:76, col:86> col:86 __t2 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7f8b28b42bf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f8b28b435f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2237:5, line:2247:14> line:2239:9 __libcpp_compressed_pair_imp
| |-TemplateTypeParmDecl 0x7f8b28b42c38 <line:2237:15, col:24> col:24 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7f8b28b42ca8 <col:32, col:41> col:41 class depth 0 index 1 ... _Args2
| |-NonTypeTemplateParmDecl 0x7f8b28b42d18 <col:49, col:59> col:59 referenced 'size_t':'unsigned long' depth 0 index 2 ... _I1
| |-NonTypeTemplateParmDecl 0x7f8b28b42d70 <col:64, col:74> col:74 referenced 'size_t':'unsigned long' depth 0 index 3 ... _I2
| `-CXXConstructorDecl 0x7f8b28b43550 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2247:14> line:2239:9 __libcpp_compressed_pair_imp 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>, __tuple_indices<_I1...>, __tuple_indices<_I2...>)'
|   |-ParmVarDecl 0x7f8b28b42df8 <col:38> col:59 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f8b28b42f68 <line:2240:38, col:55> col:55 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7f8b28b430d8 <line:2241:38, col:55> col:55 __second_args 'tuple<_Args2...>'
|   |-ParmVarDecl 0x7f8b28b43228 <line:2242:38, col:60> col:61 '__tuple_indices<_I1...>'
|   |-ParmVarDecl 0x7f8b28b433c8 <line:2243:38, col:60> col:61 '__tuple_indices<_I2...>'
|   `-AlwaysInlineAttr 0x7f8b28b43670 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b28b437e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2251:92> col:51 used first 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_reference (void) noexcept'
| |-CompoundStmt 0x7f8b28e22ba0 <col:75, col:92>
| | `-ReturnStmt 0x7f8b28e22b88 <col:76, col:83>
| |   `-MemberExpr 0x7f8b28e22b50 <col:83> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue ->__first_ 0x7f8b28b419c8
| |     `-CXXThisExpr 0x7f8b28e22b38 <col:83> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7f8b28b43890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b28b43988 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2252:92> col:51 used first 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_const_reference (void) const noexcept'
| |-CompoundStmt 0x7f8b29dd5330 <col:75, col:92>
| | `-ReturnStmt 0x7f8b29dd5318 <col:76, col:83>
| |   `-MemberExpr 0x7f8b29dd52e0 <col:83> 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue ->__first_ 0x7f8b28b419c8
| |     `-CXXThisExpr 0x7f8b29dd52c8 <col:83> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7f8b28b43a30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b28b43b28 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2254:90> col:51 used second 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_reference (void) noexcept'
| |-CompoundStmt 0x7f8b29dd39e0 <col:76, col:90>
| | `-ReturnStmt 0x7f8b29dd39c8 <col:77, col:85>
| |   `-ImplicitCastExpr 0x7f8b29dd39a8 <col:84, col:85> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' lvalue <DerivedToBase (allocator)>
| |     `-UnaryOperator 0x7f8b29dd3988 <col:84, col:85> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue prefix '*'
| |       `-CXXThisExpr 0x7f8b29dd3970 <col:85> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7f8b28b43bd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b28b43cc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2255:90> col:51 used second 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_const_reference (void) const noexcept'
| |-CompoundStmt 0x7f8b28e225e8 <col:76, col:90>
| | `-ReturnStmt 0x7f8b28e225d0 <col:77, col:85>
| |   `-ImplicitCastExpr 0x7f8b28e225b0 <col:84, col:85> 'const class std::__1::allocator<char>':'const class std::__1::allocator<char>' lvalue <DerivedToBase (allocator)>
| |     `-UnaryOperator 0x7f8b28e22590 <col:84, col:85> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue prefix '*'
| |       `-CXXThisExpr 0x7f8b28e22578 <col:85> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7f8b28b43d70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b28b43f10 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2263:5> line:2257:36 swap 'void (class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &)' noexcept-uninstantiated 0x7f8b2a1155a8
| |-ParmVarDecl 0x7f8b28b43df8 <col:41, col:71> col:71 __x 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &'
| `-AlwaysInlineAttr 0x7f8b28b44008 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7f8b28b73ef8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2210:7> col:7 implicit ~__libcpp_compressed_pair_imp 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f8b28e1bcc8 <col:7> col:7 implicit constexpr __libcpp_compressed_pair_imp 'void (const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &)' inline default trivial noexcept-unevaluated 0x7f8b28e1bcc8
| `-ParmVarDecl 0x7f8b28e1bdf0 <col:7> col:7 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &'
`-CXXConstructorDecl 0x7f8b28e1bec0 <col:7> col:7 implicit used constexpr __libcpp_compressed_pair_imp 'void (class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&) noexcept' inline default trivial
  |-ParmVarDecl 0x7f8b28e1bff0 <col:7> col:7 used 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&'
  |-CXXCtorInitializer 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
  | `-CXXConstructExpr 0x7f8b29dd6bf8 <col:7> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' 'void (class std::__1::allocator<char> &&) noexcept'
  |   `-ImplicitCastExpr 0x7f8b29dd6b88 <col:7> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' xvalue <UncheckedDerivedToBase (allocator)>
  |     `-CXXStaticCastExpr 0x7f8b29dd6b58 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' xvalue static_cast<class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&> <NoOp>
  |       `-DeclRefExpr 0x7f8b29dd6b20 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue ParmVar 0x7f8b28e1bff0 '' 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&'
  |-CXXCtorInitializer Field 0x7f8b28b419c8 '__first_' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
  | `-CXXConstructExpr 0x7f8b29dd6e58 <col:7> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&) noexcept'
  |   `-MemberExpr 0x7f8b29dd6cd0 <col:7> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' xvalue .__first_ 0x7f8b28b419c8
  |     `-CXXStaticCastExpr 0x7f8b29dd6ca0 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' xvalue static_cast<class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&> <NoOp>
  |       `-DeclRefExpr 0x7f8b29dd6c68 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue ParmVar 0x7f8b28e1bff0 '' 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&'
  `-CompoundStmt 0x7f8b29dd6ec8 <col:7>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__libcpp_compressed_pair_imp" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  NonVirtualBaseLLVMType:%"class.std::__1::__libcpp_compressed_pair_imp" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f8b28b3d4d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2317:1, line:2363:1> line:2318:7 class __compressed_pair definition
|-private '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-CXXRecordDecl 0x7f8b28b440a0 prev 0x7f8b28b3d4d0 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7f8b28b44b08 <line:2321:5, col:52> col:52 base '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
| `-TemplateSpecializationType 0x7f8b28b44a60 '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >' sugar __libcpp_compressed_pair_imp
|   |-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|   |-TemplateArgument type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|   `-RecordType 0x7f8b28b415f0 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
|     `-ClassTemplateSpecialization 0x7f8b28b414d8 '__libcpp_compressed_pair_imp'
|-AccessSpecDecl 0x7f8b28b44b60 <line:2322:1, col:7> col:1 public
|-TypedefDecl 0x7f8b28b44c40 <line:2323:5, col:38> col:38 _T1_param 'typename base::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-ElaboratedType 0x7f8b28b44bf0 'typename base::_T1_param' sugar
|   `-TypedefType 0x7f8b28b42450 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param' sugar
|     |-Typedef 0x7f8b28b41a48 '_T1_param'
|     `-SubstTemplateTypeParmType 0x7f8b28b41780 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|       |-TemplateTypeParmType 0x7f8b2a112da0 '_T1' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f8b2a112d60 '_T1'
|       `-RecordType 0x7f8b28b3d480 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|         `-CXXRecord 0x7f8b28b3d3e0 '__rep'
|-TypedefDecl 0x7f8b28b44d10 <line:2324:5, col:38> col:38 _T2_param 'typename base::_T2_param':'class std::__1::allocator<char>'
| `-ElaboratedType 0x7f8b28b44cc0 'typename base::_T2_param' sugar
|   `-TypedefType 0x7f8b28b426b0 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param' sugar
|     |-Typedef 0x7f8b28b41ab0 '_T2_param'
|     `-SubstTemplateTypeParmType 0x7f8b28b417c0 'class std::__1::allocator<char>' sugar
|       |-TemplateTypeParmType 0x7f8b2a112e10 '_T2' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x7f8b2a112dc8 '_T2'
|       `-RecordType 0x7f8b2989c010 'class std::__1::allocator<char>'
|         `-ClassTemplateSpecialization 0x7f8b2989bf28 'allocator'
|-TypedefDecl 0x7f8b28b44de0 <line:2326:5, col:42> col:42 _T1_reference 'typename base::_T1_reference':'typename remove_reference<struct __rep>::type &'
| `-ElaboratedType 0x7f8b28b44d90 'typename base::_T1_reference' sugar
|   `-TypedefType 0x7f8b28b43740 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_reference' sugar
|     |-Typedef 0x7f8b28b41fa0 '_T1_reference'
|     `-LValueReferenceType 0x7f8b28b41f50 'typename remove_reference<struct __rep>::type &'
|       `-ElaboratedType 0x7f8b28b41ef0 'typename remove_reference<struct __rep>::type' sugar
|         `-TypedefType 0x7f8b28b41ed0 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|           |-Typedef 0x7f8b28b41e58 'type'
|           `-SubstTemplateTypeParmType 0x7f8b28b41e20 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|             |-TemplateTypeParmType 0x7f8b298e0b20 '_Tp' dependent depth 0 index 0
|             | `-TemplateTypeParm 0x7f8b298e0ae0 '_Tp'
|             `-RecordType 0x7f8b28b3d480 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|               `-CXXRecord 0x7f8b28b3d3e0 '__rep'
|-TypedefDecl 0x7f8b28b44eb0 <line:2327:5, col:42> col:42 _T2_reference 'typename base::_T2_reference':'class std::__1::allocator<char> &'
| `-ElaboratedType 0x7f8b28b44e60 'typename base::_T2_reference' sugar
|   `-TypedefType 0x7f8b28b43a80 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_reference' sugar
|     |-Typedef 0x7f8b28b42038 '_T2_reference'
|     `-LValueReferenceType 0x7f8b28b42000 'class std::__1::allocator<char> &'
|       `-SubstTemplateTypeParmType 0x7f8b28b417c0 'class std::__1::allocator<char>' sugar
|         |-TemplateTypeParmType 0x7f8b2a112e10 '_T2' dependent depth 0 index 1
|         | `-TemplateTypeParm 0x7f8b2a112dc8 '_T2'
|         `-RecordType 0x7f8b2989c010 'class std::__1::allocator<char>'
|           `-ClassTemplateSpecialization 0x7f8b2989bf28 'allocator'
|-TypedefDecl 0x7f8b28b44f80 <line:2329:5, col:48> col:48 _T1_const_reference 'typename base::_T1_const_reference':'const typename remove_reference<struct __rep>::type &'
| `-ElaboratedType 0x7f8b28b44f30 'typename base::_T1_const_reference' sugar
|   `-TypedefType 0x7f8b28b438e0 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_const_reference' sugar
|     |-Typedef 0x7f8b28b421f0 '_T1_const_reference'
|     `-LValueReferenceType 0x7f8b28b421a0 'const typename remove_reference<struct __rep>::type &'
|       `-QualType 0x7f8b28b42141 'const typename remove_reference<struct __rep>::type' const
|         `-ElaboratedType 0x7f8b28b42140 'typename remove_reference<struct __rep>::type' sugar
|           `-TypedefType 0x7f8b28b41ed0 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|             |-Typedef 0x7f8b28b41e58 'type'
|             `-SubstTemplateTypeParmType 0x7f8b28b41e20 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|               |-TemplateTypeParmType 0x7f8b298e0b20 '_Tp' dependent depth 0 index 0
|               | `-TemplateTypeParm 0x7f8b298e0ae0 '_Tp'
|               `-RecordType 0x7f8b28b3d480 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|                 `-CXXRecord 0x7f8b28b3d3e0 '__rep'
|-TypedefDecl 0x7f8b28b45050 <line:2330:5, col:48> col:48 _T2_const_reference 'typename base::_T2_const_reference':'const class std::__1::allocator<char> &'
| `-ElaboratedType 0x7f8b28b45000 'typename base::_T2_const_reference' sugar
|   `-TypedefType 0x7f8b28b43c20 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_const_reference' sugar
|     |-Typedef 0x7f8b28b42288 '_T2_const_reference'
|     `-LValueReferenceType 0x7f8b28b42250 'const class std::__1::allocator<char> &'
|       `-QualType 0x7f8b28b417c1 'const class std::__1::allocator<char>' const
|         `-SubstTemplateTypeParmType 0x7f8b28b417c0 'class std::__1::allocator<char>' sugar
|           |-TemplateTypeParmType 0x7f8b2a112e10 '_T2' dependent depth 0 index 1
|           | `-TemplateTypeParm 0x7f8b2a112dc8 '_T2'
|           `-RecordType 0x7f8b2989c010 'class std::__1::allocator<char>'
|             `-ClassTemplateSpecialization 0x7f8b2989bf28 'allocator'
|-CXXConstructorDecl 0x7f8b28b450e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2332:52> col:31 used __compressed_pair 'void (void)'
| |-CXXCtorInitializer '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
| | `-CXXConstructExpr 0x7f8b28e1c6e0 <col:31> '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' 'void (void)'
| |-CompoundStmt 0x7f8b2a123830 <col:51, col:52>
| `-AlwaysInlineAttr 0x7f8b28b451c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8b28b45320 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2334:50> line:2333:40 __compressed_pair 'void (std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param)'
| |-ParmVarDecl 0x7f8b28b45240 <col:58, col:68> col:68 __t1 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-AlwaysInlineAttr 0x7f8b28b453e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8b28b45540 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2336:50> line:2335:40 __compressed_pair 'void (std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param)'
| |-ParmVarDecl 0x7f8b28b45460 <col:58, col:68> col:68 __t2 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7f8b28b45600 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f8b28b457c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2338:83> line:2337:31 __compressed_pair 'void (std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param, std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param)'
| |-ParmVarDecl 0x7f8b28b45658 <col:49, col:59> col:59 __t1 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| |-ParmVarDecl 0x7f8b28b456c8 <col:65, col:75> col:75 __t2 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7f8b28b45888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f8b28b45ea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2342:5, line:2349:14> line:2344:9 __compressed_pair
| |-TemplateTypeParmDecl 0x7f8b28b458d0 <line:2342:15, col:24> col:24 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7f8b28b45938 <col:32, col:41> col:41 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7f8b28b45e00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2349:14> line:2344:9 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7f8b28b459c8 <col:27, col:49> col:49 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f8b28b45b38 <col:55, col:72> col:72 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7f8b28b45ca8 <line:2345:55, col:72> col:72 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7f8b28b45f10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b28b46058 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2353:97> col:51 used first 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_reference (void) noexcept'
| |-CompoundStmt 0x7f8b28e22b18 <col:75, col:97>
| | `-ReturnStmt 0x7f8b28e22b00 <col:76, col:95>
| |   `-CXXMemberCallExpr 0x7f8b28e22ab8 <col:83, col:95> 'typename remove_reference<struct __rep>::type':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue
| |     `-MemberExpr 0x7f8b28e22a68 <col:83, col:89> '<bound member function type>' ->first 0x7f8b28b437e8
| |       `-ImplicitCastExpr 0x7f8b28e22ae0 <col:83> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |         `-CXXThisExpr 0x7f8b28e22a50 <col:83> 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7f8b28b46100 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b28b461c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2354:97> col:51 used first 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_const_reference (void) const noexcept'
| |-CompoundStmt 0x7f8b29dd52a8 <col:75, col:97>
| | `-ReturnStmt 0x7f8b29dd5290 <col:76, col:95>
| |   `-CXXMemberCallExpr 0x7f8b29dd5230 <col:83, col:95> 'const typename remove_reference<struct __rep>::type':'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue
| |     `-MemberExpr 0x7f8b29dd51e0 <col:83, col:89> '<bound member function type>' ->first 0x7f8b28b43988
| |       `-ImplicitCastExpr 0x7f8b29dd5278 <col:83> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' <NoOp>
| |         `-ImplicitCastExpr 0x7f8b29dd5258 <col:83> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |           `-CXXThisExpr 0x7f8b29dd51c8 <col:83> 'const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7f8b28b46270 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b28b46338 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2356:99> col:51 used second 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_reference (void) noexcept'
| |-CompoundStmt 0x7f8b29dd3950 <col:76, col:99>
| | `-ReturnStmt 0x7f8b29dd3938 <col:77, col:97>
| |   `-CXXMemberCallExpr 0x7f8b29dd38f0 <col:84, col:97> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' lvalue
| |     `-MemberExpr 0x7f8b29dd38a0 <col:84, col:90> '<bound member function type>' ->second 0x7f8b28b43b28
| |       `-ImplicitCastExpr 0x7f8b29dd3918 <col:84> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |         `-CXXThisExpr 0x7f8b29dd3888 <col:84> 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7f8b28b463e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b28b464a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2357:99> col:51 used second 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_const_reference (void) const noexcept'
| |-CompoundStmt 0x7f8b28e22558 <col:76, col:99>
| | `-ReturnStmt 0x7f8b28e22540 <col:77, col:97>
| |   `-CXXMemberCallExpr 0x7f8b28e22488 <col:84, col:97> 'const class std::__1::allocator<char>':'const class std::__1::allocator<char>' lvalue
| |     `-MemberExpr 0x7f8b28e22438 <col:84, col:90> '<bound member function type>' ->second 0x7f8b28b43cc8
| |       `-ImplicitCastExpr 0x7f8b28e22528 <col:84> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' <NoOp>
| |         `-ImplicitCastExpr 0x7f8b28e22508 <col:84> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |           `-CXXThisExpr 0x7f8b28e22420 <col:84> 'const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7f8b28b46550 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f8b28b466f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2362:26> line:2359:36 swap 'void (class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &)' noexcept-uninstantiated 0x7f8b2a123458
| |-ParmVarDecl 0x7f8b28b465d8 <col:41, col:60> col:60 __x 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &'
| `-AlwaysInlineAttr 0x7f8b28b467e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7f8b28b73e18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2318:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f8b28e1c058 <col:7> col:7 implicit constexpr __compressed_pair 'void (const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &)' inline default trivial noexcept-unevaluated 0x7f8b28e1c058
| `-ParmVarDecl 0x7f8b28e1c180 <col:7> col:7 'const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &'
`-CXXConstructorDecl 0x7f8b28e1c218 <col:7> col:7 implicit used constexpr __compressed_pair 'void (class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &&) noexcept' inline default trivial
  |-ParmVarDecl 0x7f8b28e1c340 <col:7> col:7 used 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &&'
  |-CXXCtorInitializer '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
  | `-CXXConstructExpr 0x7f8b29dd6ee0 <col:7> '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' 'void (class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&) noexcept'
  |   `-ImplicitCastExpr 0x7f8b29dd6b00 <col:7> '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' xvalue <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
  |     `-CXXStaticCastExpr 0x7f8b29dd6ad0 <col:7> 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >' xvalue static_cast<class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &&> <NoOp>
  |       `-DeclRefExpr 0x7f8b29dd6a98 <col:7> 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >' lvalue ParmVar 0x7f8b28e1c340 '' 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &&'
  `-CompoundStmt 0x7f8b29dd6fb0 <col:7>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair" = type { %"class.std::__1::__libcpp_compressed_pair_imp" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair" = type { %"class.std::__1::__libcpp_compressed_pair_imp" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f8b298a42a8 parent 0x7f8b29892fe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:4036:81> col:64 class basic_string definition
|-private '__basic_string_common<true>':'class std::__1::__basic_string_common<true>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-VisibilityAttr 0x7f8b2a29f238 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7f8b28b1df48 prev 0x7f8b298a42a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:633:1, col:28> col:28 implicit class basic_string
|-AccessSpecDecl 0x7f8b28b1dfe0 <line:636:1, col:7> col:1 public
|-TypedefDecl 0x7f8b28b1e018 <line:637:5, col:58> col:58 __self 'class std::__1::basic_string<char>'
| `-RecordType 0x7f8b298a43c0 'class std::__1::basic_string<char>'
|   `-ClassTemplateSpecialization 0x7f8b298a42a8 'basic_string'
|-TypedefDecl 0x7f8b28b1e198 <line:638:5, col:58> col:58 __self_view 'basic_string_view<char, struct std::__1::char_traits<char> >':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-TemplateSpecializationType 0x7f8b28b1e0f0 'basic_string_view<char, struct std::__1::char_traits<char> >' sugar basic_string_view
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7f8b29a43db0 'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
|     `-ClassTemplateSpecialization 0x7f8b29a43ca8 'basic_string_view'
|-TypedefDecl 0x7f8b28b1e200 <line:639:5, col:58> col:58 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f8b28b1e0b0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f8b29195e80 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f8b29195e38 '_Traits'
|   `-RecordType 0x7f8b2989abc0 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f8b299f4688 'char_traits'
|-TypedefDecl 0x7f8b28b1e268 <line:640:5, col:58> col:58 referenced value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f8b28b1e070 'char' sugar
|   |-TemplateTypeParmType 0x7f8b29195e10 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f8b29195dd0 '_CharT'
|   `-BuiltinType 0x7f8b28832b60 'char'
|-TypedefDecl 0x7f8b28b1e2f8 <line:641:5, col:58> col:58 allocator_type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7f8b28b1e2c0 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7f8b29195ef0 '_Allocator' dependent depth 0 index 2
|   | `-TemplateTypeParm 0x7f8b29195ea8 '_Allocator'
|   `-RecordType 0x7f8b2989c010 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7f8b2989bf28 'allocator'
|-TypedefDecl 0x7f8b28b1e508 <line:642:5, col:58> col:58 __alloc_traits 'allocator_traits<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>':'struct std::__1::allocator_traits<class std::__1::allocator<char> >'
| `-TemplateSpecializationType 0x7f8b28b1e490 'allocator_traits<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type':'class std::__1::allocator<char>'
|   `-RecordType 0x7f8b28b1e470 'struct std::__1::allocator_traits<class std::__1::allocator<char> >'
|     `-ClassTemplateSpecialization 0x7f8b28b1e380 'allocator_traits'
|-TypedefDecl 0x7f8b28b3a9a0 <line:643:5, col:58> col:58 size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7f8b28b3a950 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7f8b28b33870 'std::__1::allocator_traits<class std::__1::allocator<char> >::size_type' sugar
|     |-Typedef 0x7f8b28b2c750 'size_type'
|     `-ElaboratedType 0x7f8b28b2c700 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7f8b28b2c6e0 'std::__1::__size_type<class std::__1::allocator<char>, long, true>::type' sugar
|         |-Typedef 0x7f8b28b2c660 'type'
|         `-ElaboratedType 0x7f8b28b2c610 'typename class allocator<char>::size_type' sugar
|           `-TypedefType 0x7f8b28b2bab0 'std::__1::allocator<char>::size_type' sugar
|             |-Typedef 0x7f8b28b1e908 'size_type'
|             `-TypedefType 0x7f8b2983f300 'size_t' sugar
|               |-Typedef 0x7f8b288673b0 'size_t'
|               `-BuiltinType 0x7f8b28832c80 'unsigned long'
|-TypedefDecl 0x7f8b28b3aa70 <line:644:5, col:58> col:58 difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7f8b28b3aa20 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7f8b28b2add0 'std::__1::allocator_traits<class std::__1::allocator<char> >::difference_type' sugar
|     |-Typedef 0x7f8b28b2ad60 'difference_type'
|     `-ElaboratedType 0x7f8b28b2ad10 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7f8b28b2acf0 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<char>, char *, true>::type' sugar
|         |-Typedef 0x7f8b28b2ac70 'type'
|         `-ElaboratedType 0x7f8b28b2ac20 'typename class allocator<char>::difference_type' sugar
|           `-TypedefType 0x7f8b28b2a0c0 'std::__1::allocator<char>::difference_type' sugar
|             |-Typedef 0x7f8b28b1e960 'difference_type'
|             `-TypedefType 0x7f8b289b9000 'ptrdiff_t' sugar
|               |-Typedef 0x7f8b28867340 'ptrdiff_t'
|               `-BuiltinType 0x7f8b28832be0 'long'
|-TypedefDecl 0x7f8b28b3ab28 <line:645:5, col:58> col:58 reference 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
| `-LValueReferenceType 0x7f8b28b3aaf0 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
|   `-TypedefType 0x7f8b28b3aad0 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' sugar
|     |-Typedef 0x7f8b28b1e268 'value_type'
|     `-SubstTemplateTypeParmType 0x7f8b28b1e070 'char' sugar
|       |-TemplateTypeParmType 0x7f8b29195e10 '_CharT' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f8b29195dd0 '_CharT'
|       `-BuiltinType 0x7f8b28832b60 'char'
|-TypedefDecl 0x7f8b28b3abb8 <line:646:5, col:58> col:58 const_reference 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
| `-LValueReferenceType 0x7f8b28b3ab80 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
|   `-QualType 0x7f8b28b3aad1 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' const
|     `-TypedefType 0x7f8b28b3aad0 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' sugar
|       |-Typedef 0x7f8b28b1e268 'value_type'
|       `-SubstTemplateTypeParmType 0x7f8b28b1e070 'char' sugar
|         |-TemplateTypeParmType 0x7f8b29195e10 '_CharT' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7f8b29195dd0 '_CharT'
|         `-BuiltinType 0x7f8b28832b60 'char'
|-TypedefDecl 0x7f8b28b3ac80 <line:647:5, col:58> col:58 pointer 'typename __alloc_traits::pointer':'char *'
| `-ElaboratedType 0x7f8b28b3ac30 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7f8b28b22390 'std::__1::allocator_traits<class std::__1::allocator<char> >::pointer' sugar
|     |-Typedef 0x7f8b28b22320 'pointer'
|     `-ElaboratedType 0x7f8b28b222d0 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7f8b28b222b0 'std::__1::__pointer_type<char, class std::__1::allocator<char> >::type' sugar
|         |-Typedef 0x7f8b28b22230 'type'
|         `-ElaboratedType 0x7f8b28b221e0 'typename __pointer_type_imp::__pointer_type<char, typename remove_reference<class allocator<char> >::type>::type' sugar
|           `-TypedefType 0x7f8b28b221c0 'std::__1::__pointer_type_imp::__pointer_type<char, class std::__1::allocator<char>, true>::type' sugar
|             |-Typedef 0x7f8b28b22140 'type'
|             `-ElaboratedType 0x7f8b28b220f0 'typename class allocator<char>::pointer' sugar
|               `-TypedefType 0x7f8b28b1f620 'std::__1::allocator<char>::pointer' sugar
|                 |-Typedef 0x7f8b28b1ea28 'pointer'
|                 `-PointerType 0x7f8b28b1e9f0 'char *'
|                   `-SubstTemplateTypeParmType 0x7f8b28b1e9c0 'char' sugar
|                     |-TemplateTypeParmType 0x7f8b2a0ed9d0 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7f8b2a0ed988 '_Tp'
|                     `-BuiltinType 0x7f8b28832b60 'char'
|-TypedefDecl 0x7f8b28b3ad70 <line:648:5, col:58> col:58 const_pointer 'typename __alloc_traits::const_pointer':'const char *'
| `-ElaboratedType 0x7f8b28b3ad20 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7f8b28b3ad00 'std::__1::allocator_traits<class std::__1::allocator<char> >::const_pointer' sugar
|     |-Typedef 0x7f8b28b23cb0 'const_pointer'
|     `-ElaboratedType 0x7f8b28b23c60 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7f8b28b23c40 'std::__1::__const_pointer<char, char *, class std::__1::allocator<char>, true>::type' sugar
|         |-Typedef 0x7f8b28b23bc0 'type'
|         `-ElaboratedType 0x7f8b28b23b70 'typename class allocator<char>::const_pointer' sugar
|           `-TypedefType 0x7f8b28b1f870 'std::__1::allocator<char>::const_pointer' sugar
|             |-Typedef 0x7f8b28b1eab8 'const_pointer'
|             `-PointerType 0x7f8b28b1ea80 'const char *'
|               `-QualType 0x7f8b28b1e9c1 'const char' const
|                 `-SubstTemplateTypeParmType 0x7f8b28b1e9c0 'char' sugar
|                   |-TemplateTypeParmType 0x7f8b2a0ed9d0 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7f8b2a0ed988 '_Tp'
|                   `-BuiltinType 0x7f8b28832b60 'char'
|-StaticAssertDecl 0x7f8b28b3aed0 <line:650:5, col:92> col:5
| |-DeclRefExpr 0x7f8b28b3ae80 <col:19, col:39> 'const _Bool':'const _Bool' lvalue Var 0x7f8b2a1b50a8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f8b29196e88 <col:46> 'const char [45]' lvalue "Character type of basic_string must be a POD"
|-StaticAssertDecl 0x7f8b28b3b110 <line:651:5, line:652:74> line:651:5
| |-ParenExpr 0x7f8b28b3b0d8 <col:19, col:75> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7f8b28b3b0a0 <col:20, col:70> 'const _Bool':'const _Bool' lvalue Var 0x7f8b2a1b50a8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f8b29197150 <line:652:19> 'const char [54]' lvalue "traits_type::char_type must be the same type as CharT"
|-StaticAssertDecl 0x7f8b28b3b320 <line:653:5, line:654:74> line:653:5
| |-ParenExpr 0x7f8b28b3b2e8 <col:19, col:83> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7f8b28b3b2b0 <col:20, col:78> 'const _Bool':'const _Bool' lvalue Var 0x7f8b2a1b50a8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f8b29197490 <line:654:19> 'const char [54]' lvalue "Allocator::value_type must be same type as value_type"
|-TypedefDecl 0x7f8b28b3b518 <line:659:5, col:58> col:58 iterator '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer>':'class std::__1::__wrap_iter<char *>'
| `-TemplateSpecializationType 0x7f8b28b3b4a0 '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
|   `-RecordType 0x7f8b28b3b480 'class std::__1::__wrap_iter<char *>'
|     `-ClassTemplateSpecialization 0x7f8b28b3b390 '__wrap_iter'
|-TypedefDecl 0x7f8b28b3b728 <line:660:5, col:58> col:58 const_iterator '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer>':'class std::__1::__wrap_iter<const char *>'
| `-TemplateSpecializationType 0x7f8b28b3b6b0 '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer':'const char *'
|   `-RecordType 0x7f8b28b3b690 'class std::__1::__wrap_iter<const char *>'
|     `-ClassTemplateSpecialization 0x7f8b28b3b5a0 '__wrap_iter'
|-TypedefDecl 0x7f8b28b3b980 <line:662:5, col:59> col:59 reverse_iterator 'std::__1::reverse_iterator<iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<char *> >'
| `-ElaboratedType 0x7f8b28b3b910 'std::__1::reverse_iterator<iterator>' sugar
|   `-TemplateSpecializationType 0x7f8b28b3b8c0 'reverse_iterator<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator':'class std::__1::__wrap_iter<char *>'
|     `-RecordType 0x7f8b28b3b8a0 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<char *> >'
|       `-ClassTemplateSpecialization 0x7f8b28b3b7b0 'reverse_iterator'
|-TypedefDecl 0x7f8b28b3bbe0 <line:663:5, col:59> col:59 const_reverse_iterator 'std::__1::reverse_iterator<const_iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const char *> >'
| `-ElaboratedType 0x7f8b28b3bb70 'std::__1::reverse_iterator<const_iterator>' sugar
|   `-TemplateSpecializationType 0x7f8b28b3bb20 'reverse_iterator<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|     `-RecordType 0x7f8b28b3bb00 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const char *> >'
|       `-ClassTemplateSpecialization 0x7f8b28b3ba10 'reverse_iterator'
|-AccessSpecDecl 0x7f8b28b3bc38 <line:665:1, col:8> col:1 private
|-CXXRecordDecl 0x7f8b28b3bc60 <line:699:5, line:704:5> line:699:12 struct __long definition
| |-CXXRecordDecl 0x7f8b28b3c0d8 prev 0x7f8b28b3bc60 <col:5, col:12> col:12 implicit struct __long
| |-FieldDecl 0x7f8b28b3c1a0 <line:701:9, col:19> col:19 referenced __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-FieldDecl 0x7f8b28b3c1f8 <line:702:9, col:19> col:19 referenced __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-FieldDecl 0x7f8b28b3c250 <line:703:9, col:19> col:19 referenced __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
| |-CXXDestructorDecl 0x7f8b28b74198 <line:699:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7f8b28e1acd8 <col:12> col:12 implicit constexpr __long 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &)' inline default trivial noexcept-unevaluated 0x7f8b28e1acd8
| | `-ParmVarDecl 0x7f8b28e1ae00 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &'
| |-CXXConstructorDecl 0x7f8b28e1ae98 <col:12> col:12 implicit constexpr __long 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &&) noexcept' inline default trivial
| | `-ParmVarDecl 0x7f8b28e1afc0 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &&'
| `-CXXConstructorDecl 0x7f8b28e1c8b8 <col:12> col:12 implicit __long 'void (void) noexcept' inline default trivial
|-EnumDecl 0x7f8b28b3bd30 <line:710:5> col:5
| `-EnumConstantDecl 0x7f8b28b3be00 <col:11, col:26> col:11 referenced __short_mask 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:710:5)'
|   `-ImplicitCastExpr 0x7f8b28b3be50 <col:26> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7f8b29198050 <col:26> 'int' 1
|-EnumDecl 0x7f8b28b3be68 <line:711:5> col:5
| `-EnumConstantDecl 0x7f8b28b3bf30 <col:11, col:26> col:11 referenced __long_mask 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:711:5)'
|   `-ImplicitCastExpr 0x7f8b28b3bf80 <col:26> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7f8b29198180 <col:26> 'unsigned long' 1
|-EnumDecl 0x7f8b28b3bf98 <line:714:5> col:5
| `-EnumConstantDecl 0x7f8b28b3c5d0 <col:11, line:715:65> line:714:11 referenced __min_cap 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:714:5)'
|   `-ImplicitCastExpr 0x7f8b28b3c620 <col:23, line:715:65> 'unsigned int' <IntegralCast>
|     `-ConditionalOperator 0x7f8b28b3c4d0 <line:714:23, line:715:65> 'unsigned long'
|       |-BinaryOperator 0x7f8b28b3c3a8 <line:714:23, col:65> '_Bool' '>'
|       | |-BinaryOperator 0x7f8b28b3c368 <col:23, col:61> 'unsigned long' '/'
|       | | |-ParenExpr 0x7f8b28b3c318 <col:23, col:42> 'unsigned long'
|       | | | `-BinaryOperator 0x7f8b28b3c2f0 <col:24, col:41> 'unsigned long' '-'
|       | | |   |-UnaryExprOrTypeTraitExpr 0x7f8b28b3c2b8 <col:24, col:37> 'unsigned long' sizeof 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|       | | |   `-ImplicitCastExpr 0x7f8b28b3c2d8 <col:41> 'unsigned long' <IntegralCast>
|       | | |     `-IntegerLiteral 0x7f8b291982e0 <col:41> 'int' 1
|       | | `-UnaryExprOrTypeTraitExpr 0x7f8b28b3c348 <col:44, col:61> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|       | `-ImplicitCastExpr 0x7f8b28b3c390 <col:65> 'unsigned long' <IntegralCast>
|       |   `-IntegerLiteral 0x7f8b291983b8 <col:65> 'int' 2
|       |-BinaryOperator 0x7f8b28b3c490 <line:715:23, col:61> 'unsigned long' '/'
|       | |-ParenExpr 0x7f8b28b3c440 <col:23, col:42> 'unsigned long'
|       | | `-BinaryOperator 0x7f8b28b3c418 <col:24, col:41> 'unsigned long' '-'
|       | |   |-UnaryExprOrTypeTraitExpr 0x7f8b28b3c3e0 <col:24, col:37> 'unsigned long' sizeof 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|       | |   `-ImplicitCastExpr 0x7f8b28b3c400 <col:41> 'unsigned long' <IntegralCast>
|       | |     `-IntegerLiteral 0x7f8b29198448 <col:41> 'int' 1
|       | `-UnaryExprOrTypeTraitExpr 0x7f8b28b3c470 <col:44, col:61> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|       `-ImplicitCastExpr 0x7f8b28b3c4b8 <col:65> 'unsigned long' <IntegralCast>
|         `-IntegerLiteral 0x7f8b29198520 <col:65> 'int' 2
|-CXXRecordDecl 0x7f8b28b3c638 <line:717:5, line:725:5> line:717:12 struct __short definition
| |-CXXRecordDecl 0x7f8b28b3cac0 prev 0x7f8b28b3c638 <col:5, col:12> col:12 implicit struct __short
| |-CXXRecordDecl 0x7f8b28b3cb58 <line:719:9, line:723:9> line:719:9 union definition
| | |-FieldDecl 0x7f8b28b3ccd8 <line:721:13, col:27> col:27 referenced __size_ 'unsigned char'
| | |-FieldDecl 0x7f8b28b3cd30 <line:722:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| | |-CXXDestructorDecl 0x7f8b28b74518 <line:719:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| | |-CXXConstructorDecl 0x7f8b28e1b0c8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &)' inline default trivial noexcept-unevaluated 0x7f8b28e1b0c8
| | | `-ParmVarDecl 0x7f8b28e1b1f0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &'
| | |-CXXConstructorDecl 0x7f8b28e1b288 <col:9> col:9 implicit constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&) noexcept' inline default trivial
| | | `-ParmVarDecl 0x7f8b28e1b3b0 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&'
| | `-CXXConstructorDecl 0x7f8b28e1cc38 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial
| |-FieldDecl 0x7f8b28b3cd98 <col:9> col:9 implicit referenced 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| |-IndirectFieldDecl 0x7f8b28b3cdf0 <line:721:27> col:27 implicit __size_ 'unsigned char'
| | |-Field 0x7f8b28b3cd98 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| | `-Field 0x7f8b28b3ccd8 '__size_' 'unsigned char'
| |-IndirectFieldDecl 0x7f8b28b3ce40 <line:722:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| | |-Field 0x7f8b28b3cd98 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| | `-Field 0x7f8b28b3cd30 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-FieldDecl 0x7f8b28b3cf08 <line:724:9, col:37> col:20 referenced __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
| |-CXXDestructorDecl 0x7f8b28b74278 <line:717:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7f8b28e1b418 <col:12> col:12 implicit constexpr __short 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &)' inline default trivial noexcept-unevaluated 0x7f8b28e1b418
| | `-ParmVarDecl 0x7f8b28e1b540 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &'
| |-CXXConstructorDecl 0x7f8b28e1b5d8 <col:12> col:12 implicit constexpr __short 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &&) noexcept' inline default trivial
| | `-ParmVarDecl 0x7f8b28e1b700 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &&'
| `-CXXConstructorDecl 0x7f8b28e1c998 <col:12> col:12 implicit __short 'void (void) noexcept' inline default trivial
|-CXXRecordDecl 0x7f8b28b3c700 <line:729:5, col:44> col:11 union __ulx definition
| |-CXXRecordDecl 0x7f8b28b3c918 prev 0x7f8b28b3c700 <col:5, col:11> col:11 implicit union __ulx
| |-FieldDecl 0x7f8b28b3ca00 <col:17, col:24> col:24 __lx 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| `-FieldDecl 0x7f8b28b3cf70 <col:30, col:38> col:38 __lxx 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-EnumDecl 0x7f8b28b3c7d0 <line:731:5> col:5
| `-EnumConstantDecl 0x7f8b28b3d2a8 <col:11, col:55> col:11 referenced __n_words 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:731:5)'
|   `-ImplicitCastExpr 0x7f8b28b3d2f8 <col:23, col:55> 'unsigned int' <IntegralCast>
|     `-BinaryOperator 0x7f8b28b3d028 <col:23, col:55> 'unsigned long' '/'
|       |-UnaryExprOrTypeTraitExpr 0x7f8b28b3cfd8 <col:23, col:35> 'unsigned long' sizeof 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx'
|       `-UnaryExprOrTypeTraitExpr 0x7f8b28b3d008 <col:39, col:55> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXRecordDecl 0x7f8b28b3d310 <line:733:5, line:736:5> line:733:12 struct __raw definition
| |-CXXRecordDecl 0x7f8b28b3fa10 prev 0x7f8b28b3d310 <col:5, col:12> col:12 implicit struct __raw
| |-FieldDecl 0x7f8b28b3fb68 <line:735:9, col:36> col:19 referenced __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
| |-CXXDestructorDecl 0x7f8b28b74358 <line:733:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7f8b28e1b7b8 <col:12> col:12 implicit constexpr __raw 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &)' inline default trivial noexcept-unevaluated 0x7f8b28e1b7b8
| | `-ParmVarDecl 0x7f8b28e1b8e0 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &'
| |-CXXConstructorDecl 0x7f8b28e1b978 <col:12> col:12 implicit constexpr __raw 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &&) noexcept' inline default trivial
| | `-ParmVarDecl 0x7f8b28e1baa0 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &&'
| `-CXXConstructorDecl 0x7f8b28e1ca78 <col:12> col:12 implicit __raw 'void (void) noexcept' inline default trivial
|-CXXRecordDecl 0x7f8b28b3d3e0 <line:738:5, line:746:5> line:738:12 struct __rep definition
| |-CXXRecordDecl 0x7f8b28b3f6d0 prev 0x7f8b28b3d3e0 <col:5, col:12> col:12 implicit struct __rep
| |-CXXRecordDecl 0x7f8b28b3f768 <line:740:9, line:745:9> line:740:9 union definition
| | |-FieldDecl 0x7f8b28b3f8f8 <line:742:13, col:21> col:21 referenced __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| | |-FieldDecl 0x7f8b28b3f950 <line:743:13, col:21> col:21 referenced __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| | |-FieldDecl 0x7f8b28b3fbd0 <line:744:13, col:21> col:21 referenced __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| | |-CXXDestructorDecl 0x7f8b28b74438 <line:740:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| | |-CXXConstructorDecl 0x7f8b28e1a7a8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &)' inline default trivial noexcept-unevaluated 0x7f8b28e1a7a8
| | | `-ParmVarDecl 0x7f8b28e1a8d0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &'
| | |-CXXConstructorDecl 0x7f8b28e1a968 <col:9> col:9 implicit used constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept' inline default trivial
| | | |-ParmVarDecl 0x7f8b28e1aa90 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&'
| | | `-CompoundStmt 0x7f8b29dd6dc0 <col:9>
| | `-CXXConstructorDecl 0x7f8b28e1cb58 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial
| |-FieldDecl 0x7f8b28b3fc38 <col:9> col:9 implicit referenced 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| |-IndirectFieldDecl 0x7f8b28b3fc90 <line:742:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| | |-Field 0x7f8b28b3fc38 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | `-Field 0x7f8b28b3f8f8 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-IndirectFieldDecl 0x7f8b28b3fce0 <line:743:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| | |-Field 0x7f8b28b3fc38 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | `-Field 0x7f8b28b3f950 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-IndirectFieldDecl 0x7f8b28b3fd30 <line:744:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| | |-Field 0x7f8b28b3fc38 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | `-Field 0x7f8b28b3fbd0 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-CXXDestructorDecl 0x7f8b28b740b8 <line:738:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7f8b28e1aaf8 <col:12> col:12 implicit constexpr __rep 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &)' inline default trivial noexcept-unevaluated 0x7f8b28e1aaf8
| | `-ParmVarDecl 0x7f8b28e1ac20 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
| |-CXXConstructorDecl 0x7f8b28e1bb38 <col:12> col:12 implicit used constexpr __rep 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&) noexcept' inline default trivial
| | |-ParmVarDecl 0x7f8b28e1bc60 <col:12> col:12 used 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&'
| | |-CXXCtorInitializer Field 0x7f8b28b3fc38 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | | `-CXXConstructExpr 0x7f8b29dd6dd8 <col:12> 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)' 'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept'
