
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1507:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1504:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1507:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::once_flag
         0 |   unsigned long __state_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale::id
         0 |   struct std::__1::once_flag __flag_
         0 |     unsigned long __state_
         8 |   int32_t __id_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__basic_string_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>
         0 |   class std::__1::allocator<char> (base) (empty)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
         0 |   class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
         0 |     class std::__1::allocator<char> (base) (empty)
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<char>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |     class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
         0 |       class std::__1::allocator<char> (base) (empty)
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<wchar_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2>
         0 |   class std::__1::allocator<wchar_t> (base) (empty)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> >
         0 |   class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2> (base)
         0 |     class std::__1::allocator<wchar_t> (base) (empty)
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |           union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<wchar_t>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> > __r_
         0 |     class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2> (base)
         0 |       class std::__1::allocator<wchar_t> (base) (empty)
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |             union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::money_base::pattern
         0 |   char [4] field
           | [sizeof=4, dsize=4, align=1,
           |  nvsize=4, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__bitset<0, 0> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct B
         0 |   (B vtable pointer)
         8 |   int n
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class X
         0 |   (X vtable pointer)
         8 |   struct B (virtual base)
         8 |     (B vtable pointer)
        16 |     int n
           | [sizeof=24, dsize=20, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class Y
         0 |   (Y vtable pointer)
         8 |   struct B (virtual base)
         8 |     (B vtable pointer)
        16 |     int n
           | [sizeof=24, dsize=20, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class Z
         0 |   struct B (primary base)
         0 |     (B vtable pointer)
         8 |     int n
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | struct AA
         0 |   class X (primary base)
         0 |     (X vtable pointer)
         8 |   class Y (base)
         8 |     (Y vtable pointer)
        16 |   class Z (base)
        16 |     struct B (primary base)
        16 |       (B vtable pointer)
        24 |       int n
        32 |   struct B (virtual base)
        32 |     (B vtable pointer)
        40 |     int n
           | [sizeof=48, dsize=44, align=8,
           |  nvsize=28, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffbe53e8408 <object_model_refined/4_functions/05_virtual_functions_under_virtual_inheritance.cpp:3:1, line:10:1> line:3:8 referenced struct B definition
|-CXXRecordDecl 0x7ffbe53e8528 <col:1, col:8> col:8 implicit struct B
|-FieldDecl 0x7ffbe53e85d8 <line:4:5, col:9> col:9 referenced n 'int'
|-CXXMethodDecl 0x7ffbe53e8668 <line:6:5, line:9:5> line:6:18 m 'void (void)' virtual
| `-CompoundStmt 0x7ffbe53edaf0 <col:22, line:9:5>
|   |-BinaryOperator 0x7ffbe53e8bf8 <line:7:9, col:13> 'int' lvalue '='
|   | |-MemberExpr 0x7ffbe53e8ba0 <col:9> 'int' lvalue ->n 0x7ffbe53e85d8
|   | | `-CXXThisExpr 0x7ffbe53e8b88 <col:9> 'struct B *' this
|   | `-IntegerLiteral 0x7ffbe53e8bd8 <col:13> 'int' 1
|   `-CXXOperatorCallExpr 0x7ffbe53edaa8 <line:8:9, col:47> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
|     |-ImplicitCastExpr 0x7ffbe53eda90 <col:44> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
|     | `-DeclRefExpr 0x7ffbe53eda68 <col:44> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7ffbe53e9dd0 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
|     |-CXXOperatorCallExpr 0x7ffbe53ed130 <col:9, col:42> 'class std::__1::basic_ostream<char>' lvalue
|     | |-ImplicitCastExpr 0x7ffbe53ed118 <col:39> 'class std::__1::basic_ostream<char> &(*)(int)' <FunctionToPointerDecay>
|     | | `-DeclRefExpr 0x7ffbe53ed0c8 <col:39> 'class std::__1::basic_ostream<char> &(int)' lvalue CXXMethod 0x7ffbe4db87e0 'operator<<' 'class std::__1::basic_ostream<char> &(int)'
|     | |-CXXOperatorCallExpr 0x7ffbe53eb340 <col:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
|     | | |-ImplicitCastExpr 0x7ffbe53eb328 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
|     | | | `-DeclRefExpr 0x7ffbe53eb2a0 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7ffbe53e9dd0 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
|     | | |-DeclRefExpr 0x7ffbe53e8c58 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7ffbe53e7eb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
|     | | `-ImplicitCastExpr 0x7ffbe53eb288 <col:22> 'const char *' <ArrayToPointerDecay>
|     | |   `-StringLiteral 0x7ffbe53e8d08 <col:22> 'const char [15]' lvalue "B::m() -> n = "
|     | `-ImplicitCastExpr 0x7ffbe53ed0b0 <col:42> 'int' <LValueToRValue>
|     |   `-MemberExpr 0x7ffbe53eb3a0 <col:42> 'int' lvalue ->n 0x7ffbe53e85d8
|     |     `-CXXThisExpr 0x7ffbe53eb388 <col:42> 'struct B *' this
|     `-ImplicitCastExpr 0x7ffbe53eda50 <col:47> 'const char *' <ArrayToPointerDecay>
|       `-StringLiteral 0x7ffbe53ed178 <col:47> 'const char [2]' lvalue "\n"
|-CXXMethodDecl 0x7ffbe53e8758 <line:3:8, <invalid sloc>> col:8 implicit operator= 'struct B &(const struct B &)' inline default noexcept-unevaluated 0x7ffbe53e8758
| `-ParmVarDecl 0x7ffbe53e8870 <col:8> col:8 'const struct B &'
|-CXXMethodDecl 0x7ffbe53e8908 <col:8, <invalid sloc>> col:8 implicit operator= 'struct B &(struct B &&)' inline default noexcept-unevaluated 0x7ffbe53e8908
| `-ParmVarDecl 0x7ffbe53e8a20 <col:8> col:8 'struct B &&'
|-CXXDestructorDecl 0x7ffbe53e8aa8 <col:8> col:8 implicit ~B 'void (void)' inline default trivial noexcept-unevaluated 0x7ffbe53e8aa8
|-CXXConstructorDecl 0x7ffbe5404df8 <col:8> col:8 implicit used B 'void (void) noexcept' inline default
| `-CompoundStmt 0x7ffbe5406078 <col:8>
|-CXXConstructorDecl 0x7ffbe54053f8 <col:8> col:8 implicit constexpr B 'void (const struct B &)' inline default noexcept-unevaluated 0x7ffbe54053f8
| `-ParmVarDecl 0x7ffbe5405520 <col:8> col:8 'const struct B &'
`-CXXConstructorDecl 0x7ffbe5405588 <col:8> col:8 implicit constexpr B 'void (struct B &&)' inline default noexcept-unevaluated 0x7ffbe5405588
  `-ParmVarDecl 0x7ffbe54056b0 <col:8> col:8 'struct B &&'

Layout: <CGRecordLayout
  LLVMType:%struct.B = type <{ i32 (...)**, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%struct.B.base = type <{ i32 (...)**, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffbe53edb18 <object_model_refined/4_functions/05_virtual_functions_under_virtual_inheritance.cpp:12:1, line:17:1> line:12:7 referenced class X definition
|-virtual public 'struct B'
|-CXXRecordDecl 0x7ffbe53edc90 <col:1, col:7> col:7 implicit class X
|-CXXMethodDecl 0x7ffbe53edd78 <line:13:5, line:16:5> line:13:18 m 'void (void)' virtual
| |-CompoundStmt 0x7ffbe53f0120 <col:31, line:16:5>
| | |-BinaryOperator 0x7ffbe53ee3e0 <line:14:9, col:16> 'int' lvalue '='
| | | |-MemberExpr 0x7ffbe53ee370 <col:9, col:12> 'int' lvalue ->n 0x7ffbe53e85d8
| | | | `-ImplicitCastExpr 0x7ffbe53ee350 <col:12> 'struct B *' <UncheckedDerivedToBase (virtual B)>
| | | |   `-CXXThisExpr 0x7ffbe53ee338 <col:12> 'class X *' this
| | | `-IntegerLiteral 0x7ffbe53ee3c0 <col:16> 'int' 2
| | `-CXXOperatorCallExpr 0x7ffbe53f00d8 <line:15:9, col:50> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
| |   |-ImplicitCastExpr 0x7ffbe53f00c0 <col:47> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7ffbe53f0098 <col:47> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7ffbe53e9dd0 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
| |   |-CXXOperatorCallExpr 0x7ffbe53ef768 <col:9, col:45> 'class std::__1::basic_ostream<char>' lvalue
| |   | |-ImplicitCastExpr 0x7ffbe53ef750 <col:42> 'class std::__1::basic_ostream<char> &(*)(int)' <FunctionToPointerDecay>
| |   | | `-DeclRefExpr 0x7ffbe53ef728 <col:42> 'class std::__1::basic_ostream<char> &(int)' lvalue CXXMethod 0x7ffbe4db87e0 'operator<<' 'class std::__1::basic_ostream<char> &(int)'
| |   | |-CXXOperatorCallExpr 0x7ffbe53eed98 <col:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
| |   | | |-ImplicitCastExpr 0x7ffbe53eed80 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
| |   | | | `-DeclRefExpr 0x7ffbe53eed58 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7ffbe53e9dd0 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
| |   | | |-DeclRefExpr 0x7ffbe53ee428 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7ffbe53e7eb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
| |   | | `-ImplicitCastExpr 0x7ffbe53eed40 <col:22> 'const char *' <ArrayToPointerDecay>
| |   | |   `-StringLiteral 0x7ffbe53ee460 <col:22> 'const char [18]' lvalue "X::m() -> B::n = "
| |   | `-ImplicitCastExpr 0x7ffbe53ef710 <col:45> 'int' <LValueToRValue>
| |   |   `-MemberExpr 0x7ffbe53eee18 <col:45> 'int' lvalue ->n 0x7ffbe53e85d8
| |   |     `-ImplicitCastExpr 0x7ffbe53eedf8 <col:45> 'struct B *' <UncheckedDerivedToBase (virtual B)>
| |   |       `-CXXThisExpr 0x7ffbe53eede0 <col:45> 'class X *' this
| |   `-ImplicitCastExpr 0x7ffbe53f0080 <col:50> 'const char *' <ArrayToPointerDecay>
| |     `-StringLiteral 0x7ffbe53ef7b0 <col:50> 'const char [2]' lvalue "\n"
| `-OverrideAttr 0x7ffbe53ede10 <line:13:22>
|-CXXMethodDecl 0x7ffbe53edeb8 <line:12:7, <invalid sloc>> col:7 implicit operator= 'class X &(const class X &)' inline default noexcept-unevaluated 0x7ffbe53edeb8
| `-ParmVarDecl 0x7ffbe53edfd0 <col:7> col:7 'const class X &'
|-CXXMethodDecl 0x7ffbe53ee068 <col:7, <invalid sloc>> col:7 implicit operator= 'class X &(class X &&)' inline default noexcept-unevaluated 0x7ffbe53ee068
| `-ParmVarDecl 0x7ffbe53ee180 <col:7> col:7 'class X &&'
|-CXXDestructorDecl 0x7ffbe53ee208 <col:7> col:7 implicit ~X 'void (void)' inline default trivial noexcept-unevaluated 0x7ffbe53ee208
|-CXXConstructorDecl 0x7ffbe5404cf8 <col:7> col:7 implicit used X 'void (void) noexcept' inline default
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7ffbe54060f8 <col:7> 'struct B' 'void (void) noexcept'
| `-CompoundStmt 0x7ffbe5406168 <col:7>
|-CXXConstructorDecl 0x7ffbe5405268 <col:7> col:7 implicit X 'void (const class X &)' inline default noexcept-unevaluated 0x7ffbe5405268
| `-ParmVarDecl 0x7ffbe5405390 <col:7> col:7 'const class X &'
`-CXXConstructorDecl 0x7ffbe5405718 <col:7> col:7 implicit X 'void (class X &&)' inline default noexcept-unevaluated 0x7ffbe5405718
  `-ParmVarDecl 0x7ffbe5405840 <col:7> col:7 'class X &&'

Layout: <CGRecordLayout
  LLVMType:%class.X = type { i32 (...)**, %struct.B.base }
  NonVirtualBaseLLVMType:%class.X.base = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffbe53f0148 <object_model_refined/4_functions/05_virtual_functions_under_virtual_inheritance.cpp:19:1, line:24:1> line:19:7 referenced class Y definition
|-virtual public 'struct B'
|-CXXRecordDecl 0x7ffbe53f02c0 <col:1, col:7> col:7 implicit class Y
|-CXXMethodDecl 0x7ffbe53f03a8 <line:20:5, line:23:5> line:20:18 m 'void (void)' virtual
| |-CompoundStmt 0x7ffbe53f2740 <col:31, line:23:5>
| | |-BinaryOperator 0x7ffbe53f09f8 <line:21:9, col:16> 'int' lvalue '='
| | | |-MemberExpr 0x7ffbe53f0988 <col:9, col:12> 'int' lvalue ->n 0x7ffbe53e85d8
| | | | `-ImplicitCastExpr 0x7ffbe53f0968 <col:12> 'struct B *' <UncheckedDerivedToBase (virtual B)>
| | | |   `-CXXThisExpr 0x7ffbe53f0950 <col:12> 'class Y *' this
| | | `-IntegerLiteral 0x7ffbe53f09d8 <col:16> 'int' 3
| | `-CXXOperatorCallExpr 0x7ffbe53f26f8 <line:22:9, col:50> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
| |   |-ImplicitCastExpr 0x7ffbe53f26e0 <col:47> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7ffbe53f26b8 <col:47> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7ffbe53e9dd0 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
| |   |-CXXOperatorCallExpr 0x7ffbe53f1d88 <col:9, col:45> 'class std::__1::basic_ostream<char>' lvalue
| |   | |-ImplicitCastExpr 0x7ffbe53f1d70 <col:42> 'class std::__1::basic_ostream<char> &(*)(int)' <FunctionToPointerDecay>
| |   | | `-DeclRefExpr 0x7ffbe53f1d48 <col:42> 'class std::__1::basic_ostream<char> &(int)' lvalue CXXMethod 0x7ffbe4db87e0 'operator<<' 'class std::__1::basic_ostream<char> &(int)'
| |   | |-CXXOperatorCallExpr 0x7ffbe53f13b8 <col:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
| |   | | |-ImplicitCastExpr 0x7ffbe53f13a0 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
| |   | | | `-DeclRefExpr 0x7ffbe53f1378 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7ffbe53e9dd0 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
| |   | | |-DeclRefExpr 0x7ffbe53f0a40 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7ffbe53e7eb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
| |   | | `-ImplicitCastExpr 0x7ffbe53f1360 <col:22> 'const char *' <ArrayToPointerDecay>
| |   | |   `-StringLiteral 0x7ffbe53f0a78 <col:22> 'const char [18]' lvalue "Y::m() -> B::n = "
| |   | `-ImplicitCastExpr 0x7ffbe53f1d30 <col:45> 'int' <LValueToRValue>
| |   |   `-MemberExpr 0x7ffbe53f1438 <col:45> 'int' lvalue ->n 0x7ffbe53e85d8
| |   |     `-ImplicitCastExpr 0x7ffbe53f1418 <col:45> 'struct B *' <UncheckedDerivedToBase (virtual B)>
| |   |       `-CXXThisExpr 0x7ffbe53f1400 <col:45> 'class Y *' this
| |   `-ImplicitCastExpr 0x7ffbe53f26a0 <col:50> 'const char *' <ArrayToPointerDecay>
| |     `-StringLiteral 0x7ffbe53f1dd0 <col:50> 'const char [2]' lvalue "\n"
| `-OverrideAttr 0x7ffbe53f0440 <line:20:22>
|-CXXMethodDecl 0x7ffbe53f04e8 <line:19:7, <invalid sloc>> col:7 implicit operator= 'class Y &(const class Y &)' inline default noexcept-unevaluated 0x7ffbe53f04e8
| `-ParmVarDecl 0x7ffbe53f0600 <col:7> col:7 'const class Y &'
|-CXXMethodDecl 0x7ffbe53f0698 <col:7, <invalid sloc>> col:7 implicit operator= 'class Y &(class Y &&)' inline default noexcept-unevaluated 0x7ffbe53f0698
| `-ParmVarDecl 0x7ffbe53f07b0 <col:7> col:7 'class Y &&'
|-CXXDestructorDecl 0x7ffbe53f0838 <col:7> col:7 implicit ~Y 'void (void)' inline default trivial noexcept-unevaluated 0x7ffbe53f0838
|-CXXConstructorDecl 0x7ffbe5404ef8 <col:7> col:7 implicit used Y 'void (void) noexcept' inline default
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7ffbe54061e8 <col:7> 'struct B' 'void (void) noexcept'
| `-CompoundStmt 0x7ffbe5406258 <col:7>
|-CXXConstructorDecl 0x7ffbe54058a8 <col:7> col:7 implicit Y 'void (const class Y &)' inline default noexcept-unevaluated 0x7ffbe54058a8
| `-ParmVarDecl 0x7ffbe54059d0 <col:7> col:7 'const class Y &'
`-CXXConstructorDecl 0x7ffbe5405a38 <col:7> col:7 implicit Y 'void (class Y &&)' inline default noexcept-unevaluated 0x7ffbe5405a38
  `-ParmVarDecl 0x7ffbe5405b60 <col:7> col:7 'class Y &&'

Layout: <CGRecordLayout
  LLVMType:%class.Y = type { i32 (...)**, %struct.B.base }
  NonVirtualBaseLLVMType:%class.Y.base = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffbe53f2768 <object_model_refined/4_functions/05_virtual_functions_under_virtual_inheritance.cpp:26:1, line:31:1> line:26:7 referenced class Z definition
|-public 'struct B'
|-CXXRecordDecl 0x7ffbe53f28c8 <col:1, col:7> col:7 implicit class Z
|-CXXMethodDecl 0x7ffbe53f29a8 <line:27:5, line:30:5> line:27:18 m 'void (void)' virtual
| |-CompoundStmt 0x7ffbe53f4d40 <col:31, line:30:5>
| | |-BinaryOperator 0x7ffbe53f2ff8 <line:28:9, col:16> 'int' lvalue '='
| | | |-MemberExpr 0x7ffbe53f2f88 <col:9, col:12> 'int' lvalue ->n 0x7ffbe53e85d8
| | | | `-ImplicitCastExpr 0x7ffbe53f2f68 <col:12> 'struct B *' <UncheckedDerivedToBase (B)>
| | | |   `-CXXThisExpr 0x7ffbe53f2f50 <col:12> 'class Z *' this
| | | `-IntegerLiteral 0x7ffbe53f2fd8 <col:16> 'int' 4
| | `-CXXOperatorCallExpr 0x7ffbe53f4cf8 <line:29:9, col:50> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
| |   |-ImplicitCastExpr 0x7ffbe53f4ce0 <col:47> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7ffbe53f4cb8 <col:47> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7ffbe53e9dd0 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
| |   |-CXXOperatorCallExpr 0x7ffbe53f4388 <col:9, col:45> 'class std::__1::basic_ostream<char>' lvalue
| |   | |-ImplicitCastExpr 0x7ffbe53f4370 <col:42> 'class std::__1::basic_ostream<char> &(*)(int)' <FunctionToPointerDecay>
| |   | | `-DeclRefExpr 0x7ffbe53f4348 <col:42> 'class std::__1::basic_ostream<char> &(int)' lvalue CXXMethod 0x7ffbe4db87e0 'operator<<' 'class std::__1::basic_ostream<char> &(int)'
| |   | |-CXXOperatorCallExpr 0x7ffbe53f39b8 <col:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
| |   | | |-ImplicitCastExpr 0x7ffbe53f39a0 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
| |   | | | `-DeclRefExpr 0x7ffbe53f3978 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7ffbe53e9dd0 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
| |   | | |-DeclRefExpr 0x7ffbe53f3040 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7ffbe53e7eb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
| |   | | `-ImplicitCastExpr 0x7ffbe53f3960 <col:22> 'const char *' <ArrayToPointerDecay>
| |   | |   `-StringLiteral 0x7ffbe53f3078 <col:22> 'const char [18]' lvalue "Z::m() -> B::n = "
| |   | `-ImplicitCastExpr 0x7ffbe53f4330 <col:45> 'int' <LValueToRValue>
| |   |   `-MemberExpr 0x7ffbe53f3a38 <col:45> 'int' lvalue ->n 0x7ffbe53e85d8
| |   |     `-ImplicitCastExpr 0x7ffbe53f3a18 <col:45> 'struct B *' <UncheckedDerivedToBase (B)>
| |   |       `-CXXThisExpr 0x7ffbe53f3a00 <col:45> 'class Z *' this
| |   `-ImplicitCastExpr 0x7ffbe53f4ca0 <col:50> 'const char *' <ArrayToPointerDecay>
| |     `-StringLiteral 0x7ffbe53f43d0 <col:50> 'const char [2]' lvalue "\n"
| `-OverrideAttr 0x7ffbe53f2a40 <line:27:22>
|-CXXMethodDecl 0x7ffbe53f2ae8 <line:26:7, <invalid sloc>> col:7 implicit operator= 'class Z &(const class Z &)' inline default noexcept-unevaluated 0x7ffbe53f2ae8
| `-ParmVarDecl 0x7ffbe53f2c00 <col:7> col:7 'const class Z &'
|-CXXMethodDecl 0x7ffbe53f2c98 <col:7, <invalid sloc>> col:7 implicit operator= 'class Z &(class Z &&)' inline default noexcept-unevaluated 0x7ffbe53f2c98
| `-ParmVarDecl 0x7ffbe53f2db0 <col:7> col:7 'class Z &&'
|-CXXDestructorDecl 0x7ffbe53f2e38 <col:7> col:7 implicit ~Z 'void (void)' inline default trivial noexcept-unevaluated 0x7ffbe53f2e38
|-CXXConstructorDecl 0x7ffbe5404ff8 <col:7> col:7 implicit used Z 'void (void) noexcept' inline default
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7ffbe54062d8 <col:7> 'struct B' 'void (void) noexcept'
| `-CompoundStmt 0x7ffbe5406348 <col:7>
|-CXXConstructorDecl 0x7ffbe5405bc8 <col:7> col:7 implicit constexpr Z 'void (const class Z &)' inline default noexcept-unevaluated 0x7ffbe5405bc8
| `-ParmVarDecl 0x7ffbe5405cf0 <col:7> col:7 'const class Z &'
`-CXXConstructorDecl 0x7ffbe5405d58 <col:7> col:7 implicit constexpr Z 'void (class Z &&)' inline default noexcept-unevaluated 0x7ffbe5405d58
  `-ParmVarDecl 0x7ffbe5405e80 <col:7> col:7 'class Z &&'

Layout: <CGRecordLayout
  LLVMType:%class.Z = type { %struct.B.base, [4 x i8] }
  NonVirtualBaseLLVMType:%class.Z.base = type { %struct.B.base }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffbe53f4d68 <object_model_refined/4_functions/05_virtual_functions_under_virtual_inheritance.cpp:33:1, line:42:1> line:33:8 referenced struct AA definition
|-public 'class X'
|-public 'class Y'
|-public 'class Z'
|-CXXRecordDecl 0x7ffbe53f4f60 <col:1, col:8> col:8 implicit struct AA
|-CXXMethodDecl 0x7ffbe53f5048 <line:34:5, line:41:5> line:34:10 used m 'void (void)'
| |-CompoundStmt 0x7ffbe5404a28 <line:35:5, line:41:5>
| | |-BinaryOperator 0x7ffbe53f56d0 <line:36:9, col:16> 'int' lvalue '='
| | | |-MemberExpr 0x7ffbe53f5660 <col:9, col:12> 'int' lvalue ->n 0x7ffbe53e85d8
| | | | `-ImplicitCastExpr 0x7ffbe53f5640 <col:12> 'struct B *' <UncheckedDerivedToBase (virtual B)>
| | | |   `-ImplicitCastExpr 0x7ffbe53f5620 <col:12> 'class X *' <UncheckedDerivedToBase (X)>
| | | |     `-CXXThisExpr 0x7ffbe53f5608 <col:12> 'struct AA *' this
| | | `-IntegerLiteral 0x7ffbe53f56b0 <col:16> 'int' 5
| | |-BinaryOperator 0x7ffbe53f5810 <line:37:9, col:16> 'int' lvalue '='
| | | |-MemberExpr 0x7ffbe53f57a0 <col:9, col:12> 'int' lvalue ->n 0x7ffbe53e85d8
| | | | `-ImplicitCastExpr 0x7ffbe53f5780 <col:12> 'struct B *' <UncheckedDerivedToBase (virtual B)>
| | | |   `-ImplicitCastExpr 0x7ffbe53f5760 <col:12> 'class Y *' <UncheckedDerivedToBase (Y)>
| | | |     `-CXXThisExpr 0x7ffbe53f5748 <col:12> 'struct AA *' this
| | | `-IntegerLiteral 0x7ffbe53f57f0 <col:16> 'int' 6
| | |-BinaryOperator 0x7ffbe53f5950 <line:38:9, col:16> 'int' lvalue '='
| | | |-MemberExpr 0x7ffbe53f58e0 <col:9, col:12> 'int' lvalue ->n 0x7ffbe53e85d8
| | | | `-ImplicitCastExpr 0x7ffbe53f58c0 <col:12> 'struct B *' <UncheckedDerivedToBase (B)>
| | | |   `-ImplicitCastExpr 0x7ffbe53f58a0 <col:12> 'class Z *' <UncheckedDerivedToBase (Z)>
| | | |     `-CXXThisExpr 0x7ffbe53f5888 <col:12> 'struct AA *' this
| | | `-IntegerLiteral 0x7ffbe53f5930 <col:16> 'int' 7
| | `-CXXOperatorCallExpr 0x7ffbe54049e0 <line:40:9, col:46> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
| |   |-ImplicitCastExpr 0x7ffbe54049c8 <col:43> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, char)' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7ffbe5404940 <col:43> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, char)' lvalue Function 0x7ffbe53ebe60 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, char)'
| |   |-CXXOperatorCallExpr 0x7ffbe5403858 <col:9, col:41> 'class std::__1::basic_ostream<char>' lvalue
| |   | |-ImplicitCastExpr 0x7ffbe5403840 <col:35> 'class std::__1::basic_ostream<char> &(*)(int)' <FunctionToPointerDecay>
| |   | | `-DeclRefExpr 0x7ffbe5403818 <col:35> 'class std::__1::basic_ostream<char> &(int)' lvalue CXXMethod 0x7ffbe4db87e0 'operator<<' 'class std::__1::basic_ostream<char> &(int)'
| |   | |-CXXOperatorCallExpr 0x7ffbe53f6e08 <col:9, col:33> 'class std::__1::basic_ostream<char>' lvalue
| |   | | |-ImplicitCastExpr 0x7ffbe53f6df0 <col:27> 'class std::__1::basic_ostream<char> &(*)(int)' <FunctionToPointerDecay>
| |   | | | `-DeclRefExpr 0x7ffbe53f6dc8 <col:27> 'class std::__1::basic_ostream<char> &(int)' lvalue CXXMethod 0x7ffbe4db87e0 'operator<<' 'class std::__1::basic_ostream<char> &(int)'
| |   | | |-CXXOperatorCallExpr 0x7ffbe53f63c8 <col:9, col:25> 'class std::__1::basic_ostream<char>' lvalue
| |   | | | |-ImplicitCastExpr 0x7ffbe53f63b0 <col:19> 'class std::__1::basic_ostream<char> &(*)(int)' <FunctionToPointerDecay>
| |   | | | | `-DeclRefExpr 0x7ffbe53f6388 <col:19> 'class std::__1::basic_ostream<char> &(int)' lvalue CXXMethod 0x7ffbe4db87e0 'operator<<' 'class std::__1::basic_ostream<char> &(int)'
| |   | | | |-DeclRefExpr 0x7ffbe53f5998 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7ffbe53e7eb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
| |   | | | `-ImplicitCastExpr 0x7ffbe53f6370 <col:22, col:25> 'int' <LValueToRValue>
| |   | | |   `-MemberExpr 0x7ffbe53f5a60 <col:22, col:25> 'int' lvalue ->n 0x7ffbe53e85d8
| |   | | |     `-ImplicitCastExpr 0x7ffbe53f5a40 <col:25> 'struct B *' <UncheckedDerivedToBase (virtual B)>
| |   | | |       `-ImplicitCastExpr 0x7ffbe53f5a20 <col:25> 'class X *' <UncheckedDerivedToBase (X)>
| |   | | |         `-CXXThisExpr 0x7ffbe53f5a08 <col:25> 'struct AA *' this
| |   | | `-ImplicitCastExpr 0x7ffbe53f6db0 <col:30, col:33> 'int' <LValueToRValue>
| |   | |   `-MemberExpr 0x7ffbe53f64a0 <col:30, col:33> 'int' lvalue ->n 0x7ffbe53e85d8
| |   | |     `-ImplicitCastExpr 0x7ffbe53f6480 <col:33> 'struct B *' <UncheckedDerivedToBase (virtual B)>
| |   | |       `-ImplicitCastExpr 0x7ffbe53f6460 <col:33> 'class Y *' <UncheckedDerivedToBase (Y)>
| |   | |         `-CXXThisExpr 0x7ffbe53f6448 <col:33> 'struct AA *' this
| |   | `-ImplicitCastExpr 0x7ffbe5403800 <col:38, col:41> 'int' <LValueToRValue>
| |   |   `-MemberExpr 0x7ffbe53f6ee0 <col:38, col:41> 'int' lvalue ->n 0x7ffbe53e85d8
| |   |     `-ImplicitCastExpr 0x7ffbe53f6ec0 <col:41> 'struct B *' <UncheckedDerivedToBase (B)>
| |   |       `-ImplicitCastExpr 0x7ffbe53f6ea0 <col:41> 'class Z *' <UncheckedDerivedToBase (Z)>
| |   |         `-CXXThisExpr 0x7ffbe53f6e88 <col:41> 'struct AA *' this
| |   `-CharacterLiteral 0x7ffbe54038a0 <col:46> 'char' 10
| `-OverrideAttr 0x7ffbe53f50e0 <line:34:14>
|-CXXMethodDecl 0x7ffbe53f5188 <line:33:8, <invalid sloc>> col:8 implicit operator= 'struct AA &(const struct AA &)' inline default noexcept-unevaluated 0x7ffbe53f5188
| `-ParmVarDecl 0x7ffbe53f52a0 <col:8> col:8 'const struct AA &'
|-CXXMethodDecl 0x7ffbe53f5338 <col:8, <invalid sloc>> col:8 implicit operator= 'struct AA &(struct AA &&)' inline default noexcept-unevaluated 0x7ffbe53f5338
| `-ParmVarDecl 0x7ffbe53f5450 <col:8> col:8 'struct AA &&'
|-CXXDestructorDecl 0x7ffbe53f54d8 <col:8> col:8 implicit ~AA 'void (void)' inline default trivial noexcept-unevaluated 0x7ffbe53f54d8
|-CXXConstructorDecl 0x7ffbe5404bf0 <col:8> col:8 implicit used AA 'void (void) noexcept' inline default
| |-CXXCtorInitializer 'struct B'
| | `-CXXConstructExpr 0x7ffbe5406090 <col:8> 'struct B' 'void (void) noexcept'
| |-CXXCtorInitializer 'class X'
| | `-CXXConstructExpr 0x7ffbe5406180 <col:8> 'class X' 'void (void) noexcept'
| |-CXXCtorInitializer 'class Y'
| | `-CXXConstructExpr 0x7ffbe5406270 <col:8> 'class Y' 'void (void) noexcept'
| |-CXXCtorInitializer 'class Z'
| | `-CXXConstructExpr 0x7ffbe5406360 <col:8> 'class Z' 'void (void) noexcept'
| `-CompoundStmt 0x7ffbe54063e8 <col:8>
|-CXXConstructorDecl 0x7ffbe54050d8 <col:8> col:8 implicit AA 'void (const struct AA &)' inline default noexcept-unevaluated 0x7ffbe54050d8
| `-ParmVarDecl 0x7ffbe5405200 <col:8> col:8 'const struct AA &'
`-CXXConstructorDecl 0x7ffbe5405ee8 <col:8> col:8 implicit AA 'void (struct AA &&)' inline default noexcept-unevaluated 0x7ffbe5405ee8
  `-ParmVarDecl 0x7ffbe5406010 <col:8> col:8 'struct AA &&'

Layout: <CGRecordLayout
  LLVMType:%struct.AA = type <{ %class.X.base, %class.Y.base, %class.Z.base, [4 x i8], %struct.B.base, [4 x i8] }>
  NonVirtualBaseLLVMType:%struct.AA.base = type <{ %class.X.base, %class.Y.base, %class.Z.base }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1185:9)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1203:9)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >
         0 |   struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> (base) (empty)
         0 |   std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type * __sbuf_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::ios_base
         0 |   (ios_base vtable pointer)
         8 |   std::__1::ios_base::fmtflags __fmtflags_
        16 |   std::__1::streamsize __precision_
        24 |   std::__1::streamsize __width_
        32 |   std::__1::ios_base::iostate __rdstate_
        36 |   std::__1::ios_base::iostate __exceptions_
        40 |   void * __rdbuf_
        48 |   void * __loc_
        56 |   std::__1::ios_base::event_callback * __fn_
        64 |   int * __index_
        72 |   size_t __event_size_
        80 |   size_t __event_cap_
        88 |   long * __iarray_
        96 |   size_t __iarray_size_
       104 |   size_t __iarray_cap_
       112 |   void ** __parray_
       120 |   size_t __parray_size_
       128 |   size_t __parray_cap_
           | [sizeof=136, dsize=136, align=8,
           |  nvsize=136, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ios<char>
         0 |   class std::__1::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     std::__1::ios_base::fmtflags __fmtflags_
        16 |     std::__1::streamsize __precision_
        24 |     std::__1::streamsize __width_
        32 |     std::__1::ios_base::iostate __rdstate_
        36 |     std::__1::ios_base::iostate __exceptions_
        40 |     void * __rdbuf_
        48 |     void * __loc_
        56 |     std::__1::ios_base::event_callback * __fn_
        64 |     int * __index_
        72 |     size_t __event_size_
        80 |     size_t __event_cap_
        88 |     long * __iarray_
        96 |     size_t __iarray_size_
       104 |     size_t __iarray_cap_
       112 |     void ** __parray_
       120 |     size_t __parray_size_
       128 |     size_t __parray_cap_
       136 |   basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       144 |   std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=152, dsize=148, align=8,
           |  nvsize=148, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ostream<char>
         0 |   (basic_ostream vtable pointer)
         8 |   class std::__1::basic_ios<char> (virtual base)
         8 |     class std::__1::ios_base (primary base)
         8 |       (ios_base vtable pointer)
        16 |       std::__1::ios_base::fmtflags __fmtflags_
        24 |       std::__1::streamsize __precision_
        32 |       std::__1::streamsize __width_
        40 |       std::__1::ios_base::iostate __rdstate_
        44 |       std::__1::ios_base::iostate __exceptions_
        48 |       void * __rdbuf_
        56 |       void * __loc_
        64 |       std::__1::ios_base::event_callback * __fn_
        72 |       int * __index_
        80 |       size_t __event_size_
        88 |       size_t __event_cap_
        96 |       long * __iarray_
       104 |       size_t __iarray_size_
       112 |       size_t __iarray_cap_
       120 |       void ** __parray_
       128 |       size_t __parray_size_
       136 |       size_t __parray_cap_
       144 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       152 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=160, dsize=156, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffbe6802f60 prev 0x7ffbe405a320 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, line:386:1> line:231:24 referenced class ios_base definition
|-VisibilityAttr 0x7ffbe6803060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7ffbe68030a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, col:24> col:24 implicit referenced class ios_base
|-AccessSpecDecl 0x7ffbe6803140 <line:233:1, col:7> col:1 public
|-CXXRecordDecl 0x7ffbe6803198 <line:234:5, col:33> col:33 class failure
| `-VisibilityAttr 0x7ffbe6803250 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:681:47, col:71> Default
|-TypedefDecl 0x7ffbe68032b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:236:5, col:26> col:26 referenced fmtflags 'unsigned int'
| `-BuiltinType 0x7ffbe4819e60 'unsigned int'
|-VarDecl 0x7ffbe6803340 <line:237:5, col:41> col:27 referenced boolalpha 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe68033c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe68033a0 <col:41> 'int' 1
|-VarDecl 0x7ffbe6803440 <line:238:5, col:41> col:27 referenced dec 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe68034c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe68034a0 <col:41> 'int' 2
|-VarDecl 0x7ffbe6803540 <line:239:5, col:41> col:27 referenced fixed 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe68035c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe68035a0 <col:41> 'int' 4
|-VarDecl 0x7ffbe6803640 <line:240:5, col:41> col:27 referenced hex 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe68036c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe68036a0 <col:41> 'int' 8
|-VarDecl 0x7ffbe6803740 <line:241:5, col:41> col:27 referenced internal 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe68037c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe68037a0 <col:41> 'int' 16
|-VarDecl 0x7ffbe6803840 <line:242:5, col:41> col:27 referenced left 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe68038c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe68038a0 <col:41> 'int' 32
|-VarDecl 0x7ffbe6803940 <line:243:5, col:41> col:27 referenced oct 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe68039c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe68039a0 <col:41> 'int' 64
|-VarDecl 0x7ffbe6803a40 <line:244:5, col:41> col:27 referenced right 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe6803ac0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe6803aa0 <col:41> 'int' 128
|-VarDecl 0x7ffbe6803b40 <line:245:5, col:41> col:27 referenced scientific 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe6803bc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe6803ba0 <col:41> 'int' 256
|-VarDecl 0x7ffbe6803c40 <line:246:5, col:41> col:27 referenced showbase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe6803cc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe6803ca0 <col:41> 'int' 512
|-VarDecl 0x7ffbe6803d40 <line:247:5, col:41> col:27 referenced showpoint 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe6803dc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe6803da0 <col:41> 'int' 1024
|-VarDecl 0x7ffbe6803e40 <line:248:5, col:41> col:27 referenced showpos 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe6803ec0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe6803ea0 <col:41> 'int' 2048
|-VarDecl 0x7ffbe6803f40 <line:249:5, col:41> col:27 referenced skipws 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe6803fc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe6803fa0 <col:41> 'int' 4096
|-VarDecl 0x7ffbe6804040 <line:250:5, col:41> col:27 referenced unitbuf 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe68040c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe68040a0 <col:41> 'int' 8192
|-VarDecl 0x7ffbe6804140 <line:251:5, col:41> col:27 referenced uppercase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe68041c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe68041a0 <col:41> 'int' 16384
|-VarDecl 0x7ffbe6804240 <line:252:5, col:56> col:27 referenced adjustfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7ffbe6804388 <col:41, col:56> 'unsigned int' '|'
|   |-BinaryOperator 0x7ffbe6804320 <col:41, col:48> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7ffbe68042f0 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7ffbe68042a0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7ffbe6803840 'left' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7ffbe6804308 <col:48> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7ffbe68042c8 <col:48> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7ffbe6803a40 'right' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7ffbe6804370 <col:56> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7ffbe6804348 <col:56> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7ffbe6803740 'internal' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7ffbe6804418 <line:253:5, col:53> col:27 referenced basefield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7ffbe6804560 <col:41, col:53> 'unsigned int' '|'
|   |-BinaryOperator 0x7ffbe68044f8 <col:41, col:47> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7ffbe68044c8 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7ffbe6804478 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7ffbe6803440 'dec' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7ffbe68044e0 <col:47> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7ffbe68044a0 <col:47> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7ffbe6803940 'oct' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7ffbe6804548 <col:53> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7ffbe6804520 <col:53> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7ffbe6803640 'hex' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7ffbe68045f0 <line:254:5, col:54> col:27 referenced floatfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7ffbe68046d0 <col:41, col:54> 'unsigned int' '|'
|   |-ImplicitCastExpr 0x7ffbe68046a0 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | `-DeclRefExpr 0x7ffbe6804650 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7ffbe6803b40 'scientific' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7ffbe68046b8 <col:54> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7ffbe6804678 <col:54> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7ffbe6803540 'fixed' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-TypedefDecl 0x7ffbe6804768 <line:256:5, col:26> col:26 referenced iostate 'unsigned int'
| `-BuiltinType 0x7ffbe4819e60 'unsigned int'
|-VarDecl 0x7ffbe68047f0 <line:257:5, col:36> col:26 referenced badbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe6804870 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe6804850 <col:36> 'int' 1
|-VarDecl 0x7ffbe68048f0 <line:258:5, col:36> col:26 referenced eofbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe6804970 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe6804950 <col:36> 'int' 2
|-VarDecl 0x7ffbe68049f0 <line:259:5, col:36> col:26 referenced failbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe6804a70 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe6804a50 <col:36> 'int' 4
|-VarDecl 0x7ffbe6804af0 <line:260:5, col:36> col:26 referenced goodbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe6804b70 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe6804b50 <col:36> 'int' 0
|-TypedefDecl 0x7ffbe6804bf8 <line:262:5, col:26> col:26 referenced openmode 'unsigned int'
| `-BuiltinType 0x7ffbe4819e60 'unsigned int'
|-VarDecl 0x7ffbe6804c80 <line:263:5, col:36> col:27 app 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe6804d00 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe6804ce0 <col:36> 'int' 1
|-VarDecl 0x7ffbe6804d80 <line:264:5, col:36> col:27 ate 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe6804e00 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe6804de0 <col:36> 'int' 2
|-VarDecl 0x7ffbe6804e80 <line:265:5, col:36> col:27 binary 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe6804f00 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe6804ee0 <col:36> 'int' 4
|-VarDecl 0x7ffbe6804f80 <line:266:5, col:36> col:27 referenced in 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe6805000 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe6804fe0 <col:36> 'int' 8
|-VarDecl 0x7ffbe6805080 <line:267:5, col:36> col:27 referenced out 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe6805100 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe68050e0 <col:36> 'int' 16
|-VarDecl 0x7ffbe6805180 <line:268:5, col:36> col:27 trunc 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7ffbe6805200 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7ffbe68051e0 <col:36> 'int' 32
|-EnumDecl 0x7ffbe6805270 <line:270:5, col:32> col:10 referenced seekdir
| |-EnumConstantDecl 0x7ffbe6805330 <col:19> col:19 referenced beg 'enum std::__1::ios_base::seekdir'
| |-EnumConstantDecl 0x7ffbe6805380 <col:24> col:24 referenced cur 'enum std::__1::ios_base::seekdir'
| `-EnumConstantDecl 0x7ffbe68053d0 <col:29> col:29 referenced end 'enum std::__1::ios_base::seekdir'
|-TypedefDecl 0x7ffbe6805430 <line:273:5, col:26> col:26 io_state 'std::__1::ios_base::iostate':'unsigned int'
| `-TypedefType 0x7ffbe68047c0 'std::__1::ios_base::iostate' sugar
|   |-Typedef 0x7ffbe6804768 'iostate'
|   `-BuiltinType 0x7ffbe4819e60 'unsigned int'
|-TypedefDecl 0x7ffbe6805498 <line:274:5, col:26> col:26 open_mode 'std::__1::ios_base::openmode':'unsigned int'
| `-TypedefType 0x7ffbe6804c50 'std::__1::ios_base::openmode' sugar
|   |-Typedef 0x7ffbe6804bf8 'openmode'
|   `-BuiltinType 0x7ffbe4819e60 'unsigned int'
|-TypedefDecl 0x7ffbe6805500 <line:275:5, col:26> col:26 seek_dir 'enum std::__1::ios_base::seekdir'
| `-EnumType 0x7ffbe6805310 'enum std::__1::ios_base::seekdir'
|   `-Enum 0x7ffbe6805270 'seekdir'
|-TypedefDecl 0x7ffbe6805610 <line:277:5, col:30> col:30 streamoff 'std::__1::streamoff':'long long'
| `-ElaboratedType 0x7ffbe68055a0 'std::__1::streamoff' sugar
|   `-TypedefType 0x7ffbe411cfb0 'std::__1::streamoff' sugar
|     |-Typedef 0x7ffbe4060958 'streamoff'
|     `-BuiltinType 0x7ffbe4819e00 'long long'
|-TypedefDecl 0x7ffbe68056f0 <line:278:5, col:30> col:30 streampos 'std::__1::streampos':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7ffbe6805680 'std::__1::streampos' sugar
|   `-TypedefType 0x7ffbe411d040 'std::__1::streampos' sugar
|     |-Typedef 0x7ffbe40605b8 'streampos'
|     `-TemplateSpecializationType 0x7ffbe4060510 'fpos<mbstate_t>' sugar fpos
|       |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|       `-RecordType 0x7ffbe40604f0 'class std::__1::fpos<__mbstate_t>'
|         `-ClassTemplateSpecialization 0x7ffbe4060400 'fpos'
|-CXXRecordDecl 0x7ffbe6805778 <line:281:5, col:28> col:28 class Init
| `-VisibilityAttr 0x7ffbe6805830 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXMethodDecl 0x7ffbe6805960 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:284:48> col:40 used flags 'std::__1::ios_base::fmtflags (void) const'
| |-AlwaysInlineAttr 0x7ffbe68059f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffbe6805a40 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffbe6805b80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:285:62> col:40 flags 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7ffbe6805a90 <col:46, col:55> col:55 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7ffbe6805c20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffbe6805c68 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffbe6805d40 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:286:61> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7ffbe6805cb8 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7ffbe6805de0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffbe6805e28 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffbe6806000 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:287:78> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags, std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7ffbe6805e78 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-ParmVarDecl 0x7ffbe6805ee8 <col:63, col:72> col:72 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7ffbe68060a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffbe68060f0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffbe6806200 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:288:58> col:36 used unsetf 'void (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7ffbe6806140 <col:43, col:52> col:52 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7ffbe68062a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffbe68062e8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffbe68063a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:290:54> col:42 precision 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7ffbe6806438 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffbe6806480 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffbe6806590 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:291:69> col:42 precision 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7ffbe68064d0 <col:52, col:63> col:63 __prec 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7ffbe6806630 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffbe6806678 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffbe68066d8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:292:50> col:42 used width 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7ffbe6806770 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffbe68067b8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffbe6806890 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:293:65> col:42 used width 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7ffbe6806808 <col:48, col:59> col:59 __wide 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7ffbe6806930 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffbe6806978 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffbe6806a20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:296:5, col:37> col:12 referenced imbue 'class std::__1::locale (const class std::__1::locale &)'
| `-ParmVarDecl 0x7ffbe6806998 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7ffbe6806b10 <line:297:5, col:21> col:12 used getloc 'class std::__1::locale (void) const'
|-CXXMethodDecl 0x7ffbe6806bd0 <line:300:5, col:23> col:16 xalloc 'int (void)' static
|-CXXMethodDecl 0x7ffbe6806d10 <line:301:5, col:28> col:11 iword 'long &(int)'
| `-ParmVarDecl 0x7ffbe6806c80 <col:17, col:21> col:21 __index 'int'
|-CXXMethodDecl 0x7ffbe6806e98 <line:302:5, col:29> col:12 pword 'void *&(int)'
| `-ParmVarDecl 0x7ffbe6806dc8 <col:18, col:22> col:22 __index 'int'
|-CXXDestructorDecl 0x7ffbe6806f88 <line:305:5, col:23> col:13 ~ios_base 'void (void) noexcept' virtual
|-EnumDecl 0x7ffbe6807028 <line:308:5, col:58> col:10 referenced event
| |-EnumConstantDecl 0x7ffbe68070e0 <col:18> col:18 referenced erase_event 'enum std::__1::ios_base::event'
| |-EnumConstantDecl 0x7ffbe6807130 <col:31> col:31 imbue_event 'enum std::__1::ios_base::event'
| `-EnumConstantDecl 0x7ffbe6807180 <col:44> col:44 referenced copyfmt_event 'enum std::__1::ios_base::event'
|-TypedefDecl 0x7ffbe6807450 <line:309:5, col:65> col:20 referenced event_callback 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-PointerType 0x7ffbe68073e0 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
|   `-ParenType 0x7ffbe6807380 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' sugar
|     `-FunctionProtoType 0x7ffbe6807330 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' cdecl
|       |-BuiltinType 0x7ffbe4819d20 'void'
|       |-EnumType 0x7ffbe68070c0 'enum std::__1::ios_base::event'
|       | `-Enum 0x7ffbe6807028 'event'
|       |-LValueReferenceType 0x7ffbe50e0c80 'class std::__1::ios_base &'
|       | `-RecordType 0x7ffbe405a3c0 'class std::__1::ios_base'
|       |   `-CXXRecord 0x7ffbe6802f60 'ios_base'
|       `-BuiltinType 0x7ffbe4819dc0 'int'
|-CXXMethodDecl 0x7ffbe6807670 <line:310:5, col:60> col:10 register_callback 'void (std::__1::ios_base::event_callback, int)'
| |-ParmVarDecl 0x7ffbe68074e0 <col:28, col:43> col:43 __fn 'std::__1::ios_base::event_callback':'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-ParmVarDecl 0x7ffbe6807558 <col:49, col:53> col:53 __index 'int'
|-AccessSpecDecl 0x7ffbe6807718 <line:312:1, col:8> col:1 private
|-CXXConstructorDecl 0x7ffbe6807860 <line:313:5, col:29> col:5 ios_base 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7ffbe6807778 <col:14, col:28> col:29 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7ffbe68079e0 <line:314:5, col:40> col:15 operator= 'class std::__1::ios_base &(const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7ffbe6807920 <col:25, col:39> col:40 'const class std::__1::ios_base &'
|-AccessSpecDecl 0x7ffbe6807a80 <line:316:1, col:7> col:1 public
|-CXXMethodDecl 0x7ffbe6807b80 <line:317:5, col:51> col:17 sync_with_stdio '_Bool (_Bool)' static
| `-ParmVarDecl 0x7ffbe6807ab8 <col:33, col:47> col:38 __sync '_Bool' cinit
|   `-CXXBoolLiteralExpr 0x7ffbe6809f78 <col:47> '_Bool' true
|-CXXMethodDecl 0x7ffbe6807ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:319:49> col:39 rdstate 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7ffbe6807d38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffbe6807d80 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffbe6807e60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:320:5, col:41> col:10 used clear 'void (std::__1::ios_base::iostate)'
| `-ParmVarDecl 0x7ffbe6807da0 <col:16, col:34> col:24 __state 'std::__1::ios_base::iostate':'unsigned int' cinit
|   `-ImplicitCastExpr 0x7ffbe6809fb8 <col:34> 'std::__1::ios_base::iostate':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7ffbe6809f90 <col:34> 'const std::__1::ios_base::iostate':'const unsigned int' lvalue Var 0x7ffbe6804af0 'goodbit' 'const std::__1::ios_base::iostate':'const unsigned int'
|-CXXMethodDecl 0x7ffbe6807fc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:321:60> col:36 used setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7ffbe6807f40 <col:45, col:53> col:53 __state 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7ffbe6808068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffbe68080b0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffbe6808110 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:323:43> col:36 good '_Bool (void) const'
| |-AlwaysInlineAttr 0x7ffbe68081a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffbe68081f0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffbe6808250 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:324:42> col:36 eof '_Bool (void) const'
| |-AlwaysInlineAttr 0x7ffbe68082e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffbe6808330 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffbe6808390 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:325:43> col:36 fail '_Bool (void) const'
| |-AlwaysInlineAttr 0x7ffbe6808428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffbe6808470 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffbe68084d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:326:42> col:36 bad '_Bool (void) const'
| |-AlwaysInlineAttr 0x7ffbe6808568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffbe68085b0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffbe6808610 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:328:52> col:39 exceptions 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7ffbe68086a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffbe68086f0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffbe68087c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:329:64> col:36 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7ffbe6808740 <col:47, col:55> col:55 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7ffbe6808868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffbe68088b0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffbe68088e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:331:5, col:44> col:10 used __set_badbit_and_consider_rethrow 'void (void)'
|-CXXMethodDecl 0x7ffbe6808998 <line:332:5, col:45> col:10 __set_failbit_and_consider_rethrow 'void (void)'
|-AccessSpecDecl 0x7ffbe6808a30 <line:334:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7ffbe6808aa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:337:16> line:336:5 ios_base 'void (void)'
| |-CompoundStmt 0x7ffbe6809fd0 <col:16, line:337:16>
| |-AlwaysInlineAttr 0x7ffbe6808b50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7ffbe6808b98 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7ffbe6808c48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:339:5, col:25> col:10 referenced init 'void (void *)'
| `-ParmVarDecl 0x7ffbe6808bc0 <col:15, col:21> col:21 __sb 'void *'
|-CXXMethodDecl 0x7ffbe6808d78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:340:64> col:33 used rdbuf 'void *(void) const'
| |-CompoundStmt 0x7ffbe680a068 <col:47, col:64>
| | `-ReturnStmt 0x7ffbe680a050 <col:48, col:55>
| |   `-ImplicitCastExpr 0x7ffbe680a038 <col:55> 'void *' <LValueToRValue>
| |     `-MemberExpr 0x7ffbe680a000 <col:55> 'void *const' lvalue ->__rdbuf_ 0x7ffbe6809988
| |       `-CXXThisExpr 0x7ffbe6809fe8 <col:55> 'const class std::__1::ios_base *' this
| |-AlwaysInlineAttr 0x7ffbe6808e10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7ffbe6808e58 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7ffbe6808f38 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:347:5> line:343:10 rdbuf 'void (void *)'
| |-ParmVarDecl 0x7ffbe6808eb0 <col:16, col:22> col:22 used __sb 'void *'
| |-CompoundStmt 0x7ffbe680a1e8 <line:344:5, line:347:5>
| | |-BinaryOperator 0x7ffbe680a118 <line:345:9, col:20> 'void *' lvalue '='
| | | |-MemberExpr 0x7ffbe680a0a0 <col:9> 'void *' lvalue ->__rdbuf_ 0x7ffbe6809988
| | | | `-CXXThisExpr 0x7ffbe680a088 <col:9> 'class std::__1::ios_base *' this
| | | `-ImplicitCastExpr 0x7ffbe680a100 <col:20> 'void *' <LValueToRValue>
| | |   `-DeclRefExpr 0x7ffbe680a0d8 <col:20> 'void *' lvalue ParmVar 0x7ffbe6808eb0 '__sb' 'void *'
| | `-CXXMemberCallExpr 0x7ffbe680a190 <line:346:9, col:15> 'void'
| |   |-MemberExpr 0x7ffbe680a158 <col:9> '<bound member function type>' ->clear 0x7ffbe6807e60
| |   | `-CXXThisExpr 0x7ffbe680a140 <col:9> 'class std::__1::ios_base *' this
| |   `-CXXDefaultArgExpr 0x7ffbe680a1c8 <<invalid sloc>> 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7ffbe6808fd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7ffbe6809020 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7ffbe6809100 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:349:5, col:32> col:10 referenced __call_callbacks 'void (enum std::__1::ios_base::event)'
| `-ParmVarDecl 0x7ffbe6809040 <col:27> col:32 'enum std::__1::ios_base::event'
|-CXXMethodDecl 0x7ffbe6809238 <line:350:5, col:33> col:10 referenced copyfmt 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7ffbe68091b0 <col:18, col:32> col:33 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7ffbe68093b0 <line:351:5, col:24> col:10 referenced move 'void (class std::__1::ios_base &)'
| `-ParmVarDecl 0x7ffbe68092e8 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7ffbe6809528 <line:352:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:352:10 referenced swap 'void (class std::__1::ios_base &) noexcept'
| `-ParmVarDecl 0x7ffbe6809460 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7ffbe6809698 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:358:5> line:355:10 referenced set_rdbuf 'void (void *)'
| |-ParmVarDecl 0x7ffbe6809610 <col:20, col:26> col:26 used __sb 'void *'
| |-CompoundStmt 0x7ffbe680a2c8 <line:356:5, line:358:5>
| | `-BinaryOperator 0x7ffbe680a2a0 <line:357:9, col:20> 'void *' lvalue '='
| |   |-MemberExpr 0x7ffbe680a228 <col:9> 'void *' lvalue ->__rdbuf_ 0x7ffbe6809988
| |   | `-CXXThisExpr 0x7ffbe680a210 <col:9> 'class std::__1::ios_base *' this
| |   `-ImplicitCastExpr 0x7ffbe680a288 <col:20> 'void *' <LValueToRValue>
| |     `-DeclRefExpr 0x7ffbe680a260 <col:20> 'void *' lvalue ParmVar 0x7ffbe6809610 '__sb' 'void *'
| |-AlwaysInlineAttr 0x7ffbe6809738 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7ffbe6809780 <col:48, col:71> Hidden
|-AccessSpecDecl 0x7ffbe6809790 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:360:1, col:8> col:1 private
|-FieldDecl 0x7ffbe68097c8 <line:362:5, col:21> col:21 referenced __fmtflags_ 'std::__1::ios_base::fmtflags':'unsigned int'
|-FieldDecl 0x7ffbe6809820 <line:363:5, col:21> col:21 referenced __precision_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7ffbe6809878 <line:364:5, col:21> col:21 referenced __width_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7ffbe68098d0 <line:365:5, col:21> col:21 referenced __rdstate_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7ffbe6809928 <line:366:5, col:21> col:21 referenced __exceptions_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7ffbe6809988 <line:367:5, col:21> col:21 referenced __rdbuf_ 'void *'
|-FieldDecl 0x7ffbe68099e8 <line:368:5, col:21> col:21 __loc_ 'void *'
|-FieldDecl 0x7ffbe6809a98 <line:369:5, col:21> col:21 __fn_ 'std::__1::ios_base::event_callback *'
|-FieldDecl 0x7ffbe6809af8 <line:370:5, col:21> col:21 __index_ 'int *'
|-FieldDecl 0x7ffbe6809b50 <line:371:5, col:21> col:21 __event_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7ffbe6809ba8 <line:372:5, col:21> col:21 __event_cap_ 'size_t':'unsigned long'
|-VarDecl 0x7ffbe6809cb8 <line:376:5, col:24> col:24 __xindex_ 'atomic<int>':'struct std::__1::atomic<int>' static
|-FieldDecl 0x7ffbe6809d30 <line:380:5, col:21> col:21 __iarray_ 'long *'
|-FieldDecl 0x7ffbe6809d88 <line:381:5, col:21> col:21 __iarray_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7ffbe6809de0 <line:382:5, col:21> col:21 __iarray_cap_ 'size_t':'unsigned long'
|-FieldDecl 0x7ffbe6809e40 <line:383:5, col:21> col:21 __parray_ 'void **'
|-FieldDecl 0x7ffbe6809e98 <line:384:5, col:21> col:21 __parray_size_ 'size_t':'unsigned long'
`-FieldDecl 0x7ffbe6809ef0 <line:385:5, col:21> col:21 __parray_cap_ 'size_t':'unsigned long'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffbe58337f8 parent 0x7ffbe405a288 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:482:78> col:64 class basic_ios definition
|-public 'class std::__1::ios_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7ffbe4d16ae8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7ffbe4d16bd8 prev 0x7ffbe58337f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:583:1, col:28> col:28 implicit class basic_ios
|-AccessSpecDecl 0x7ffbe4d16c70 <line:586:1, col:7> col:1 public
|-TypedefDecl 0x7ffbe4d16cd8 <line:588:5, col:20> col:20 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7ffbe4d16ca0 'char' sugar
|   |-TemplateTypeParmType 0x7ffbe4cde500 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7ffbe4cde4c0 '_CharT'
|   `-BuiltinType 0x7ffbe4819d60 'char'
|-TypedefDecl 0x7ffbe4d16d68 <line:589:5, col:21> col:21 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7ffbe4d16d30 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7ffbe4cde570 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7ffbe4cde528 '_Traits'
|   `-RecordType 0x7ffbe5833760 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7ffbe4aba888 'char_traits'
|-TypedefDecl 0x7ffbe4d16e70 <line:591:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7ffbe4d16e20 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7ffbe4abc3d0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7ffbe4ababe8 'int_type'
|     `-BuiltinType 0x7ffbe4819dc0 'int'
|-TypedefDecl 0x7ffbe4d16f40 <line:592:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7ffbe4d16ef0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7ffbe536b290 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7ffbe4abacb8 'pos_type'
|     `-TypedefType 0x7ffbe411d040 'std::__1::streampos' sugar
|       |-Typedef 0x7ffbe40605b8 'streampos'
|       `-TemplateSpecializationType 0x7ffbe4060510 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7ffbe40604f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7ffbe4060400 'fpos'
|-TypedefDecl 0x7ffbe4d17010 <line:593:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7ffbe4d16fc0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7ffbe536b380 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7ffbe4abac50 'off_type'
|     `-TypedefType 0x7ffbe411cfb0 'std::__1::streamoff' sugar
|       |-Typedef 0x7ffbe4060958 'streamoff'
|       `-BuiltinType 0x7ffbe4819e00 'long long'
|-CXXConversionDecl 0x7ffbe4d17068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:605:60> col:22 operator bool '_Bool (void) const'
| `-AlwaysInlineAttr 0x7ffbe4d17138 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe4d17188 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:608:69> col:32 operator! '_Bool (void) const'
| `-AlwaysInlineAttr 0x7ffbe4d17230 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe4d17278 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:609:81> col:35 rdstate 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7ffbe4d17320 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe4d173f0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:610:91> col:32 clear 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7ffbe4d17368 <col:38, col:56> col:46 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7ffbe4d174a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe4d17570 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:611:87> col:32 used setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7ffbe4d174e8 <col:41, col:49> col:49 used __state 'std::__1::ios_base::iostate':'unsigned int'
| |-CompoundStmt 0x7ffbe5e612e0 <col:58, col:87>
| | `-CXXMemberCallExpr 0x7ffbe5e61278 <col:59, col:85> 'void'
| |   |-MemberExpr 0x7ffbe5e61200 <col:59, col:69> '<bound member function type>' ->setstate 0x7ffbe680f948
| |   | `-ImplicitCastExpr 0x7ffbe5e612a8 <col:69> 'class std::__1::ios_base *' <UncheckedDerivedToBase (ios_base)>
| |   |   `-CXXThisExpr 0x7ffbe5e611e8 <col:69> 'class std::__1::basic_ios<char> *' this
| |   `-ImplicitCastExpr 0x7ffbe5e612c8 <col:78> 'std::__1::ios_base::iostate':'unsigned int' <LValueToRValue>
| |     `-DeclRefExpr 0x7ffbe5e61250 <col:78> 'std::__1::ios_base::iostate':'unsigned int' lvalue ParmVar 0x7ffbe4d174e8 '__state' 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7ffbe4d17620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe4d17668 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:612:70> col:32 good '_Bool (void) const'
| `-AlwaysInlineAttr 0x7ffbe4d17710 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe4d17758 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:613:69> col:32 eof '_Bool (void) const'
| `-AlwaysInlineAttr 0x7ffbe4d17800 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe4d17848 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:614:70> col:32 fail '_Bool (void) const'
| `-AlwaysInlineAttr 0x7ffbe4d178f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe4d17938 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:615:69> col:32 bad '_Bool (void) const'
| `-AlwaysInlineAttr 0x7ffbe4d179e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe4d17a28 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:617:85> col:35 exceptions 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7ffbe4d17ad0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe4d17ba0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:618:95> col:32 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7ffbe4d17b18 <col:43, col:51> col:51 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7ffbe4d17c50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXConstructorDecl 0x7ffbe4d17f00 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:622:68> col:14 basic_ios 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7ffbe4d17db8 <col:24, col:64> col:64 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7ffbe4d17fc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7ffbe4d18038 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:623:5, col:24> col:13 ~basic_ios 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7ffbe4d18290 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:627:50> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7ffbe4d18338 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe4d18670 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:629:95> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7ffbe4d18528 <col:48, col:87> col:87 __tiestr 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7ffbe4d18720 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe4d188e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:714:1, line:719:1> line:632:46 used rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| |-CompoundStmt 0x7ffbe5e58988 <line:717:1, line:719:1>
| | `-ReturnStmt 0x7ffbe5e58970 <line:718:5, col:83>
| |   `-CXXStaticCastExpr 0x7ffbe5e58940 <col:12, col:83> 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *' static_cast<basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *> <BitCast>
| |     `-CXXMemberCallExpr 0x7ffbe5e588e0 <col:66, col:82> 'void *'
| |       `-MemberExpr 0x7ffbe5e58890 <col:66, col:76> '<bound member function type>' ->rdbuf 0x7ffbe6808d78
| |         `-ImplicitCastExpr 0x7ffbe5e58928 <col:66> 'const class std::__1::ios_base *' <NoOp>
| |           `-ImplicitCastExpr 0x7ffbe5e58908 <col:66> 'class std::__1::ios_base *' <UncheckedDerivedToBase (ios_base)>
| |             `-CXXThisExpr 0x7ffbe5e58878 <col:66> 'const class std::__1::basic_ios<char> *' this
| `-AlwaysInlineAttr 0x7ffbe4d18988 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe4d18cc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:634:97> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7ffbe4d18b78 <col:52, col:93> col:93 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7ffbe4d18d70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe4d18ef0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:636:5, col:46> col:16 copyfmt 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)'
| `-ParmVarDecl 0x7ffbe4d18e28 <col:24, col:41> col:41 __rhs 'const class std::__1::basic_ios<char> &'
|-CXXMethodDecl 0x7ffbe4d18ff0 <line:760:1, line:767:1> line:639:15 used fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (void) const'
| |-CompoundStmt 0x7ffbe5e58ef0 <line:763:1, line:767:1>
| | |-IfStmt 0x7ffbe5e58e20 <line:764:5, line:765:28>
| | | |-<<<NULL>>>
| | | |-<<<NULL>>>
| | | |-CallExpr 0x7ffbe5e58cc0 <line:764:9, col:61> '_Bool'
| | | | |-ImplicitCastExpr 0x7ffbe5e58ca8 <col:9, col:22> '_Bool (*)(std::__1::char_traits<char>::int_type, std::__1::char_traits<char>::int_type) noexcept' <FunctionToPointerDecay>
| | | | | `-DeclRefExpr 0x7ffbe5e58b68 <col:9, col:22> '_Bool (std::__1::char_traits<char>::int_type, std::__1::char_traits<char>::int_type) noexcept' lvalue CXXMethod 0x7ffbe4abca48 'eq_int_type' '_Bool (std::__1::char_traits<char>::int_type, std::__1::char_traits<char>::int_type) noexcept'
| | | | |-CallExpr 0x7ffbe5e58c30 <col:34, col:51> 'std::__1::char_traits<char>::int_type':'int'
| | | | | `-ImplicitCastExpr 0x7ffbe5e58c18 <col:34, col:47> 'std::__1::char_traits<char>::int_type (*)(void) noexcept' <FunctionToPointerDecay>
| | | | |   `-DeclRefExpr 0x7ffbe5e58be0 <col:34, col:47> 'std::__1::char_traits<char>::int_type (void) noexcept' lvalue CXXMethod 0x7ffbe4abcb48 'eof' 'std::__1::char_traits<char>::int_type (void) noexcept'
| | | | `-ImplicitCastExpr 0x7ffbe5e58cf8 <col:54> 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' <LValueToRValue>
| | | |   `-MemberExpr 0x7ffbe5e58c70 <col:54> 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' lvalue ->__fill_ 0x7ffbe4d1a660
| | | |     `-CXXThisExpr 0x7ffbe5e58c58 <col:54> 'const class std::__1::basic_ios<char> *' this
| | | |-BinaryOperator 0x7ffbe5e58df8 <line:765:9, col:28> 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' lvalue '='
| | | | |-MemberExpr 0x7ffbe5e58d28 <col:9> 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' lvalue ->__fill_ 0x7ffbe4d1a660
| | | | | `-CXXThisExpr 0x7ffbe5e58d10 <col:9> 'const class std::__1::basic_ios<char> *' this
| | | | `-ImplicitCastExpr 0x7ffbe5e58de0 <col:19, col:28> 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' <IntegralCast>
| | | |   `-CXXMemberCallExpr 0x7ffbe5e58db0 <col:19, col:28> 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| | | |     |-MemberExpr 0x7ffbe5e58d78 <col:19> '<bound member function type>' ->widen 0x7ffbe4d19770
| | | |     | `-CXXThisExpr 0x7ffbe5e58d60 <col:19> 'const class std::__1::basic_ios<char> *' this
| | | |     `-CharacterLiteral 0x7ffbe4ce9848 <col:25> 'char' 32
| | | `-<<<NULL>>>
| | `-ReturnStmt 0x7ffbe5e58ed8 <line:766:5, col:12>
| |   `-ImplicitCastExpr 0x7ffbe5e58ec0 <col:12> 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char' <IntegralCast>
| |     `-ImplicitCastExpr 0x7ffbe5e58ea8 <col:12> 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' <LValueToRValue>
| |       `-MemberExpr 0x7ffbe5e58e70 <col:12> 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' lvalue ->__fill_ 0x7ffbe4d1a660
| |         `-CXXThisExpr 0x7ffbe5e58e58 <col:12> 'const class std::__1::basic_ios<char> *' this
| `-AlwaysInlineAttr 0x7ffbe4d19098 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe4d191f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:641:34> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7ffbe4d190f0 <col:20, col:30> col:30 __ch 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7ffbe4d192a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe4d19370 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:644:37> col:12 imbue 'class std::__1::locale (const class std::__1::locale &)'
| |-ParmVarDecl 0x7ffbe4d192e8 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7ffbe4d19420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe4d195b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:647:47> col:10 narrow 'char (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, char) const'
| |-ParmVarDecl 0x7ffbe4d19478 <col:17, col:27> col:27 __c 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| |-ParmVarDecl 0x7ffbe4d194d8 <col:32, col:37> col:37 __dfault 'char'
| `-AlwaysInlineAttr 0x7ffbe4d19668 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe4d19770 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:752:1, line:757:1> line:649:15 used widen 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (char) const'
| |-ParmVarDecl 0x7ffbe4d196b0 <col:21, col:26> col:26 used __c 'char'
| |-CompoundStmt 0x7ffbe5e59908 <line:755:1, line:757:1>
| | `-ReturnStmt 0x7ffbe5e598f0 <line:756:5, col:60>
| |   `-ExprWithCleanups 0x7ffbe5e598d8 <col:12, col:60> 'std::__1::ctype<char>::char_type':'char'
| |     `-CXXMemberCallExpr 0x7ffbe5e59890 <col:12, col:60> 'std::__1::ctype<char>::char_type':'char'
| |       |-MemberExpr 0x7ffbe5e59858 <col:12, col:51> '<bound member function type>' .widen 0x7ffbe4cb4460
| |       | `-CallExpr 0x7ffbe5e59760 <col:12, col:49> 'const class std::__1::ctype<char>':'const class std::__1::ctype<char>' lvalue
| |       |   |-ImplicitCastExpr 0x7ffbe5e59748 <col:12, col:39> 'const class std::__1::ctype<char> &(*)(const class std::__1::locale &)' <FunctionToPointerDecay>
| |       |   | `-DeclRefExpr 0x7ffbe5e59680 <col:12, col:39> 'const class std::__1::ctype<char> &(const class std::__1::locale &)' lvalue Function 0x7ffbe5e59540 'use_facet' 'const class std::__1::ctype<char> &(const class std::__1::locale &)' (FunctionTemplate 0x7ffbe53501d8 'use_facet')
| |       |   `-MaterializeTemporaryExpr 0x7ffbe5e597a8 <col:41, col:48> 'const class std::__1::locale' lvalue
| |       |     `-ImplicitCastExpr 0x7ffbe5e59790 <col:41, col:48> 'const class std::__1::locale' <NoOp>
| |       |       `-CXXBindTemporaryExpr 0x7ffbe5e59260 <col:41, col:48> 'class std::__1::locale' (CXXTemporary 0x7ffbe5e59258)
| |       |         `-CXXMemberCallExpr 0x7ffbe5e59210 <col:41, col:48> 'class std::__1::locale'
| |       |           `-MemberExpr 0x7ffbe5e591d8 <col:41> '<bound member function type>' ->getloc 0x7ffbe6806b10
| |       |             `-ImplicitCastExpr 0x7ffbe5e59238 <col:41> 'const class std::__1::ios_base *' <UncheckedDerivedToBase (ios_base)>
| |       |               `-CXXThisExpr 0x7ffbe5e591c0 <col:41> 'const class std::__1::basic_ios<char> *' this
| |       `-ImplicitCastExpr 0x7ffbe5e598c0 <col:57> 'char' <LValueToRValue>
| |         `-DeclRefExpr 0x7ffbe5e59830 <col:57> 'char' lvalue ParmVar 0x7ffbe4d196b0 '__c' 'char'
| `-AlwaysInlineAttr 0x7ffbe4d19820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-AccessSpecDecl 0x7ffbe4d19868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:651:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7ffbe4d198b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:654:17> line:653:5 basic_ios 'void (void)'
| `-AlwaysInlineAttr 0x7ffbe4d19968 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe4d19b70 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:656:60> col:10 init 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7ffbe4d19aa8 <col:15, col:56> col:56 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7ffbe4d19c20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe4d19d40 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:659:31> col:10 move 'void (class std::__1::basic_ios<char> &)'
| |-ParmVarDecl 0x7ffbe4d19c78 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7ffbe4d19df0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe4d19f40 <line:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:662:47> col:10 move 'void (class std::__1::basic_ios<char> &&)'
| |-ParmVarDecl 0x7ffbe4d19e78 <col:15, col:27> col:27 __rhs 'class std::__1::basic_ios<char> &&'
| `-AlwaysInlineAttr 0x7ffbe4d19ff0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe4d1a118 <line:709:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:665:10 swap 'void (class std::__1::basic_ios<char> &) noexcept'
| |-ParmVarDecl 0x7ffbe4d1a048 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7ffbe4d1a1c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe4d1a3d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:667:65> col:10 set_rdbuf 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7ffbe4d1a308 <col:20, col:61> col:61 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7ffbe4d1a480 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-AccessSpecDecl 0x7ffbe4d1a4c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:668:1, col:8> col:1 private
|-FieldDecl 0x7ffbe4d1a5e8 <line:669:5, col:44> col:44 __tie_ 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
|-FieldDecl 0x7ffbe4d1a660 <line:670:6, col:23> col:23 referenced __fill_ 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' mutable
|-CXXConstructorDecl 0x7ffbe4d1a6e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:482:64> col:64 implicit basic_ios 'void (const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7ffbe4d1a6e8
| `-ParmVarDecl 0x7ffbe4d1a810 <col:64> col:64 'const class std::__1::basic_ios<char> &'
`-CXXMethodDecl 0x7ffbe4d1a878 <col:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7ffbe4d1a878
  `-ParmVarDecl 0x7ffbe4d1a950 <col:64> col:64 'const class std::__1::basic_ios<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ios" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffbe405b8b8 parent 0x7ffbe405a288 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:1085:82> col:64 class basic_ostream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7ffbe4db62d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7ffbe4db6510 prev 0x7ffbe405b8b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:151:1, col:28> col:28 implicit class basic_ostream
|-AccessSpecDecl 0x7ffbe4db65a8 <line:154:1, col:7> col:1 public
|-TypedefDecl 0x7ffbe4db65e0 <line:156:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7ffbe4db63a0 'char' sugar
|   |-TemplateTypeParmType 0x7ffbe4290b30 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7ffbe4290ae8 '_CharT'
|   `-BuiltinType 0x7ffbe4819d60 'char'
|-TypedefDecl 0x7ffbe4db6648 <line:157:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7ffbe4db63e0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7ffbe4290ba0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7ffbe4290b58 '_Traits'
|   `-RecordType 0x7ffbe5833760 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7ffbe4aba888 'char_traits'
|-TypedefDecl 0x7ffbe4db6750 <line:158:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7ffbe4db6700 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7ffbe4abc3d0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7ffbe4ababe8 'int_type'
|     `-BuiltinType 0x7ffbe4819dc0 'int'
|-TypedefDecl 0x7ffbe4db6820 <line:159:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7ffbe4db67d0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7ffbe536b290 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7ffbe4abacb8 'pos_type'
|     `-TypedefType 0x7ffbe411d040 'std::__1::streampos' sugar
|       |-Typedef 0x7ffbe40605b8 'streampos'
|       `-TemplateSpecializationType 0x7ffbe4060510 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7ffbe40604f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7ffbe4060400 'fpos'
|-TypedefDecl 0x7ffbe4db68f0 <line:160:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7ffbe4db68a0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7ffbe536b380 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7ffbe4abac50 'off_type'
|     `-TypedefType 0x7ffbe411cfb0 'std::__1::streamoff' sugar
|       |-Typedef 0x7ffbe4060958 'streamoff'
|       `-BuiltinType 0x7ffbe4819e00 'long long'
|-CXXConstructorDecl 0x7ffbe4db6b70 <line:163:5, line:165:25> line:164:14 basic_ostream 'void (basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7ffbe4db6a68 <col:28, col:69> col:69 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7ffbe4db6c30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXDestructorDecl 0x7ffbe4db6ca8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:166:5, col:28> col:13 ~basic_ostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7ffbe4db6d58 <line:167:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7ffbe4db6ea0 <line:169:5, line:170:40> col:5 basic_ostream 'void (class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7ffbe4db6db8 <col:19, col:35> col:35 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7ffbe4db6f60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7ffbe4db70b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:175:5, line:176:51> col:20 operator= 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7ffbe4db6fe8 <col:30, col:46> col:46 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7ffbe4db7160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7ffbe4db7280 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:178:5, line:180:55> line:179:10 swap 'void (class std::__1::basic_ostream<char> &)' inline
| |-ParmVarDecl 0x7ffbe4db71b8 <col:15, col:30> col:30 __rhs 'class std::__1::basic_ostream<char> &'
| `-AlwaysInlineAttr 0x7ffbe4db7330 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXConstructorDecl 0x7ffbe4db74a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:183:5, col:65> col:5 basic_ostream 'void (const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7ffbe4db73b8 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-CXXMethodDecl 0x7ffbe4db7630 <line:184:5, col:65> col:20 operator= 'class std::__1::basic_ostream<char> &(const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7ffbe4db7570 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-AccessSpecDecl 0x7ffbe4db76e0 <line:189:1, col:7> col:1 public
|-CXXRecordDecl 0x7ffbe4db7708 <line:192:5, col:32> col:32 referenced class sentry definition
| |-CXXRecordDecl 0x7ffbe4dba590 prev 0x7ffbe4db7708 <line:242:1, col:60> col:60 implicit class sentry
| |-FieldDecl 0x7ffbe4dba628 <line:244:5, col:10> col:10 referenced __ok_ '_Bool'
| |-FieldDecl 0x7ffbe4dba7c8 <line:245:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXConstructorDecl 0x7ffbe4dba950 <line:247:5, col:25> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7ffbe4dba848 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x7ffbe4dbab10 <line:248:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7ffbe4dbaa48 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x7ffbe4dbabc0 <line:250:1, col:7> col:1 public
| |-CXXConstructorDecl 0x7ffbe4dbadd0 <line:251:5, col:57> col:14 used sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| | `-ParmVarDecl 0x7ffbe4dbace8 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXDestructorDecl 0x7ffbe4dbaec0 <line:252:5, col:13> col:5 used ~sentry 'void (void) noexcept'
| `-CXXConversionDecl 0x7ffbe4dbaf70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:256:45> col:9 used operator bool '_Bool (void) const'
|   |-CompoundStmt 0x7ffbe5e58280 <col:31, col:45>
|   | `-ReturnStmt 0x7ffbe5e58268 <col:32, col:39>
|   |   `-ImplicitCastExpr 0x7ffbe5e58250 <col:39> '_Bool' <LValueToRValue>
|   |     `-MemberExpr 0x7ffbe5e58218 <col:39> 'const _Bool' lvalue ->__ok_ 0x7ffbe4dba628
|   |       `-CXXThisExpr 0x7ffbe5e58200 <col:39> 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry *' this
|   `-AlwaysInlineAttr 0x7ffbe4dbb048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe4db7a40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:195:5, line:197:27> line:196:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &))' inline
| |-ParmVarDecl 0x7ffbe4db7940 <col:31, col:68> col:48 __pf 'class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &)'
| `-AlwaysInlineAttr 0x7ffbe4db7af0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe4db7fd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:199:5, line:202:34> line:200:20 operator<< 'class std::__1::basic_ostream<char> &(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &))' inline
| |-ParmVarDecl 0x7ffbe4db7ed0 <col:31, line:201:72> col:33 __pf 'basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &)'
| `-AlwaysInlineAttr 0x7ffbe4db8080 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe4db81d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:204:5, line:206:34> line:205:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))' inline
| |-ParmVarDecl 0x7ffbe4db80c8 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x7ffbe4db8280 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe4db8390 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:208:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(_Bool)'
| `-ParmVarDecl 0x7ffbe4db82c8 <col:31, col:36> col:36 __n '_Bool'
|-CXXMethodDecl 0x7ffbe4db8500 <line:209:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(short)'
| `-ParmVarDecl 0x7ffbe4db8440 <col:31, col:37> col:37 __n 'short'
|-CXXMethodDecl 0x7ffbe4db8670 <line:210:5, col:49> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned short)'
| `-ParmVarDecl 0x7ffbe4db85b0 <col:31, col:46> col:46 __n 'unsigned short'
|-CXXMethodDecl 0x7ffbe4db87e0 <line:211:5, col:38> col:20 used operator<< 'class std::__1::basic_ostream<char> &(int)'
| `-ParmVarDecl 0x7ffbe4db8720 <col:31, col:35> col:35 __n 'int'
|-CXXMethodDecl 0x7ffbe4db8950 <line:212:5, col:47> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned int)'
| `-ParmVarDecl 0x7ffbe4db8890 <col:31, col:44> col:44 __n 'unsigned int'
|-CXXMethodDecl 0x7ffbe4db8ac0 <line:213:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(long)'
| `-ParmVarDecl 0x7ffbe4db8a00 <col:31, col:36> col:36 __n 'long'
|-CXXMethodDecl 0x7ffbe4db8c30 <line:214:5, col:48> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long)'
| `-ParmVarDecl 0x7ffbe4db8b70 <col:31, col:45> col:45 __n 'unsigned long'
|-CXXMethodDecl 0x7ffbe4db8da0 <line:215:5, col:44> col:20 operator<< 'class std::__1::basic_ostream<char> &(long long)'
| `-ParmVarDecl 0x7ffbe4db8ce0 <col:31, col:41> col:41 __n 'long long'
|-CXXMethodDecl 0x7ffbe4db8f10 <line:216:5, col:53> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long long)'
| `-ParmVarDecl 0x7ffbe4db8e50 <col:31, col:50> col:50 __n 'unsigned long long'
|-CXXMethodDecl 0x7ffbe4db9080 <line:217:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(float)'
| `-ParmVarDecl 0x7ffbe4db8fc0 <col:31, col:37> col:37 __f 'float'
|-CXXMethodDecl 0x7ffbe4db91f0 <line:218:5, col:41> col:20 operator<< 'class std::__1::basic_ostream<char> &(double)'
| `-ParmVarDecl 0x7ffbe4db9130 <col:31, col:38> col:38 __f 'double'
|-CXXMethodDecl 0x7ffbe4db9360 <line:219:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(long double)'
| `-ParmVarDecl 0x7ffbe4db92a0 <col:31, col:43> col:43 __f 'long double'
|-CXXMethodDecl 0x7ffbe4db94d0 <line:220:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(const void *)'
| `-ParmVarDecl 0x7ffbe4db9410 <col:31, col:43> col:43 __p 'const void *'
|-CXXMethodDecl 0x7ffbe4db9780 <line:221:5, col:76> col:20 operator<< 'class std::__1::basic_ostream<char> &(basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)'
| `-ParmVarDecl 0x7ffbe4db9678 <col:31, col:72> col:72 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
|-CXXMethodDecl 0x7ffbe4db9940 <line:224:5, col:37> col:20 put 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type)'
| `-ParmVarDecl 0x7ffbe4db9840 <col:24, col:34> col:34 __c 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7ffbe4db9ba0 <line:225:5, col:62> col:20 write 'class std::__1::basic_ostream<char> &(const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7ffbe4db9a28 <col:26, col:43> col:43 __s 'const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7ffbe4db9a88 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7ffbe4db9cb0 <line:226:5, col:26> col:20 flush 'class std::__1::basic_ostream<char> &(void)'
|-CXXMethodDecl 0x7ffbe4db9e00 <line:229:5, line:230:20> col:14 tellp 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type (void)' inline
| `-AlwaysInlineAttr 0x7ffbe4db9ea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-CXXMethodDecl 0x7ffbe4dba000 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:231:5, line:232:40> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type)' inline
| |-ParmVarDecl 0x7ffbe4db9f00 <col:26, col:35> col:35 __pos 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-AlwaysInlineAttr 0x7ffbe4dba0b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-CXXMethodDecl 0x7ffbe4dba2a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:233:5, line:234:65> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir)' inline
| |-ParmVarDecl 0x7ffbe4dba130 <col:26, col:35> col:35 __off 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7ffbe4dba190 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-AlwaysInlineAttr 0x7ffbe4dba358 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-AccessSpecDecl 0x7ffbe4dba3a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:236:1, col:10> col:1 protected
`-CXXConstructorDecl 0x7ffbe4dba3e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:238:22> col:5 basic_ostream 'void (void)'
  `-AlwaysInlineAttr 0x7ffbe4dba4a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream.base" = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry
         0 |   _Bool __ok_
         8 |   basic_ostream<char, struct std::__1::char_traits<char> > & __os_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffbe4db7708 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:192:5, col:32> col:32 referenced class sentry definition
|-CXXRecordDecl 0x7ffbe4dba590 prev 0x7ffbe4db7708 <line:242:1, col:60> col:60 implicit class sentry
|-FieldDecl 0x7ffbe4dba628 <line:244:5, col:10> col:10 referenced __ok_ '_Bool'
|-FieldDecl 0x7ffbe4dba7c8 <line:245:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
|-CXXConstructorDecl 0x7ffbe4dba950 <line:247:5, col:25> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| `-ParmVarDecl 0x7ffbe4dba848 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
|-CXXMethodDecl 0x7ffbe4dbab10 <line:248:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| `-ParmVarDecl 0x7ffbe4dbaa48 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
|-AccessSpecDecl 0x7ffbe4dbabc0 <line:250:1, col:7> col:1 public
|-CXXConstructorDecl 0x7ffbe4dbadd0 <line:251:5, col:57> col:14 used sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| `-ParmVarDecl 0x7ffbe4dbace8 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
|-CXXDestructorDecl 0x7ffbe4dbaec0 <line:252:5, col:13> col:5 used ~sentry 'void (void) noexcept'
`-CXXConversionDecl 0x7ffbe4dbaf70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:256:45> col:9 used operator bool '_Bool (void) const'
  |-CompoundStmt 0x7ffbe5e58280 <col:31, col:45>
  | `-ReturnStmt 0x7ffbe5e58268 <col:32, col:39>
  |   `-ImplicitCastExpr 0x7ffbe5e58250 <col:39> '_Bool' <LValueToRValue>
  |     `-MemberExpr 0x7ffbe5e58218 <col:39> 'const _Bool' lvalue ->__ok_ 0x7ffbe4dba628
  |       `-CXXThisExpr 0x7ffbe5e58200 <col:39> 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry *' this
  `-AlwaysInlineAttr 0x7ffbe4dbb048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream<char, std::__1::char_traits<char> >::sentry" = type { i8, %"class.std::__1::basic_ostream"* }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream<char, std::__1::char_traits<char> >::sentry" = type { i8, %"class.std::__1::basic_ostream"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffbe50cb258 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:520:1, line:529:1> line:522:29 struct iterator definition
|-TemplateArgument type 'struct std::__1::output_iterator_tag'
|-TemplateArgument type 'void'
|-TemplateArgument type 'void'
|-TemplateArgument type 'void'
|-TemplateArgument type 'void'
|-CXXRecordDecl 0x7ffbe50cb560 prev 0x7ffbe50cb258 <col:1, col:29> col:29 implicit struct iterator
|-TypedefDecl 0x7ffbe50cb638 <line:524:5, col:24> col:24 value_type 'void':'void'
| `-SubstTemplateTypeParmType 0x7ffbe50cb600 'void' sugar
|   |-TemplateTypeParmType 0x7ffbe50b48b0 '_Tp' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7ffbe50b4868 '_Tp'
|   `-BuiltinType 0x7ffbe4819d20 'void'
|-TypedefDecl 0x7ffbe50cb6c8 <line:525:5, col:24> col:24 difference_type 'void':'void'
| `-SubstTemplateTypeParmType 0x7ffbe50cb690 'void' sugar
|   |-TemplateTypeParmType 0x7ffbe50b4930 '_Distance' dependent depth 0 index 2
|   | `-TemplateTypeParm 0x7ffbe50b48e8 '_Distance'
|   `-BuiltinType 0x7ffbe4819d20 'void'
|-TypedefDecl 0x7ffbe50cb758 <line:526:5, col:24> col:24 pointer 'void':'void'
| `-SubstTemplateTypeParmType 0x7ffbe50cb720 'void' sugar
|   |-TemplateTypeParmType 0x7ffbe50b49e0 '_Pointer' dependent depth 0 index 3
|   | `-TemplateTypeParm 0x7ffbe50b4998 '_Pointer'
|   `-BuiltinType 0x7ffbe4819d20 'void'
|-TypedefDecl 0x7ffbe50cb7e8 <line:527:5, col:24> col:24 reference 'void':'void'
| `-SubstTemplateTypeParmType 0x7ffbe50cb7b0 'void' sugar
|   |-TemplateTypeParmType 0x7ffbe50b4a90 '_Reference' dependent depth 0 index 4
|   | `-TemplateTypeParm 0x7ffbe50b4a48 '_Reference'
|   `-BuiltinType 0x7ffbe4819d20 'void'
|-TypedefDecl 0x7ffbe50cb878 <line:528:5, col:24> col:24 iterator_category 'struct std::__1::output_iterator_tag':'struct std::__1::output_iterator_tag'
| `-SubstTemplateTypeParmType 0x7ffbe50cb840 'struct std::__1::output_iterator_tag' sugar
|   |-TemplateTypeParmType 0x7ffbe50b4840 '_Category' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7ffbe50b4800 '_Category'
|   `-RecordType 0x7ffbe50aa1f0 'struct std::__1::output_iterator_tag'
|     `-CXXRecord 0x7ffbe50aa158 'output_iterator_tag'
|-CXXDestructorDecl 0x7ffbe5da60e8 <line:522:29> col:29 implicit ~iterator 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7ffbe5e55ad8 <col:29> col:29 implicit constexpr iterator 'void (const struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &)' inline default trivial noexcept-unevaluated 0x7ffbe5e55ad8
| `-ParmVarDecl 0x7ffbe5e55c00 <col:29> col:29 'const struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &'
|-CXXConstructorDecl 0x7ffbe5e55c98 <col:29> col:29 implicit used constexpr iterator 'void (struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7ffbe5e55dc0 <col:29> col:29 'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &&'
| `-CompoundStmt 0x7ffbe5e57b08 <col:29>
`-CXXConstructorDecl 0x7ffbe5e57a20 <col:29> col:29 implicit used constexpr iterator 'void (void) noexcept' inline default trivial
  `-CompoundStmt 0x7ffbe5e58410 <col:29>

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::iterator" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::iterator" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::locale
         0 |   class std::__1::locale::__imp * __locale_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_streambuf<char>
         0 |   (basic_streambuf vtable pointer)
         8 |   class std::__1::locale __loc_
         8 |     class std::__1::locale::__imp * __locale_
        16 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        24 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        32 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        40 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        48 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        56 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffbe533e1c8 prev 0x7ffbe533da18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:62:1, line:123:1> line:62:24 referenced class locale definition
|-VisibilityAttr 0x7ffbe533e2c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7ffbe533e310 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:62:1, col:24> col:24 implicit referenced class locale
|-AccessSpecDecl 0x7ffbe533e3a8 <line:64:1, col:7> col:1 public
|-CXXRecordDecl 0x7ffbe533e400 <line:66:5, col:28> col:28 referenced class facet
| `-VisibilityAttr 0x7ffbe533e4c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7ffbe533e538 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:67:5, col:28> col:28 referenced class id
| `-VisibilityAttr 0x7ffbe533e5f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-TypedefDecl 0x7ffbe533e650 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:69:5, col:17> col:17 referenced category 'int'
| `-BuiltinType 0x7ffbe4819dc0 'int'
|-VarDecl 0x7ffbe533e6e0 <line:70:5, line:71:20> col:9 none 'const std::__1::locale::category':'const int' static cinit
| `-IntegerLiteral 0x7ffbe533e740 <col:20> 'int' 0
|-VarDecl 0x7ffbe533e7c8 <line:70:5, /usr/include/xlocale.h:45:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:72:9 referenced collate 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7ffbe533e890 </usr/include/xlocale.h:45:27, col:34> 'int'
|   `-BinaryOperator 0x7ffbe533e868 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7ffbe533e828 <col:28> 'int' 1
|     `-IntegerLiteral 0x7ffbe533e848 <col:33> 'int' 0
|-VarDecl 0x7ffbe533e918 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:46:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:73:9 referenced ctype 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7ffbe533e9e0 </usr/include/xlocale.h:46:25, col:32> 'int'
|   `-BinaryOperator 0x7ffbe533e9b8 <col:26, col:31> 'int' '<<'
|     |-IntegerLiteral 0x7ffbe533e978 <col:26> 'int' 1
|     `-IntegerLiteral 0x7ffbe533e998 <col:31> 'int' 1
|-VarDecl 0x7ffbe533ea68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:48:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:74:9 referenced monetary 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7ffbe533eb30 </usr/include/xlocale.h:48:27, col:34> 'int'
|   `-BinaryOperator 0x7ffbe533eb08 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7ffbe533eac8 <col:28> 'int' 1
|     `-IntegerLiteral 0x7ffbe533eae8 <col:33> 'int' 3
|-VarDecl 0x7ffbe533ebb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:49:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:75:9 referenced numeric 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7ffbe533ec80 </usr/include/xlocale.h:49:27, col:34> 'int'
|   `-BinaryOperator 0x7ffbe533ec58 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7ffbe533ec18 <col:28> 'int' 1
|     `-IntegerLiteral 0x7ffbe533ec38 <col:33> 'int' 4
|-VarDecl 0x7ffbe533ed08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:50:31> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:76:9 referenced time 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7ffbe533edd0 </usr/include/xlocale.h:50:24, col:31> 'int'
|   `-BinaryOperator 0x7ffbe533eda8 <col:25, col:30> 'int' '<<'
|     |-IntegerLiteral 0x7ffbe533ed68 <col:25> 'int' 1
|     `-IntegerLiteral 0x7ffbe533ed88 <col:30> 'int' 5
|-VarDecl 0x7ffbe533ee58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:47:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:77:9 referenced messages 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7ffbe533ef20 </usr/include/xlocale.h:47:27, col:34> 'int'
|   `-BinaryOperator 0x7ffbe533eef8 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7ffbe533eeb8 <col:28> 'int' 1
|     `-IntegerLiteral 0x7ffbe533eed8 <col:33> 'int' 2
|-VarDecl 0x7ffbe533efa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, line:78:61> col:9 all 'const std::__1::locale::category':'const int' static cinit
| `-BinaryOperator 0x7ffbe533f228 <col:15, col:61> 'int' '|'
|   |-BinaryOperator 0x7ffbe533f1c0 <col:15, col:54> 'int' '|'
|   | |-BinaryOperator 0x7ffbe533f158 <col:15, col:44> 'int' '|'
|   | | |-BinaryOperator 0x7ffbe533f0f0 <col:15, col:33> 'int' '|'
|   | | | |-BinaryOperator 0x7ffbe533f088 <col:15, col:25> 'int' '|'
|   | | | | |-ImplicitCastExpr 0x7ffbe533f058 <col:15> 'std::__1::locale::category':'int' <LValueToRValue>
|   | | | | | `-DeclRefExpr 0x7ffbe533f008 <col:15> 'const std::__1::locale::category':'const int' lvalue Var 0x7ffbe533e7c8 'collate' 'const std::__1::locale::category':'const int'
|   | | | | `-ImplicitCastExpr 0x7ffbe533f070 <col:25> 'std::__1::locale::category':'int' <LValueToRValue>
|   | | | |   `-DeclRefExpr 0x7ffbe533f030 <col:25> 'const std::__1::locale::category':'const int' lvalue Var 0x7ffbe533e918 'ctype' 'const std::__1::locale::category':'const int'
|   | | | `-ImplicitCastExpr 0x7ffbe533f0d8 <col:33> 'std::__1::locale::category':'int' <LValueToRValue>
|   | | |   `-DeclRefExpr 0x7ffbe533f0b0 <col:33> 'const std::__1::locale::category':'const int' lvalue Var 0x7ffbe533ea68 'monetary' 'const std::__1::locale::category':'const int'
|   | | `-ImplicitCastExpr 0x7ffbe533f140 <col:44> 'std::__1::locale::category':'int' <LValueToRValue>
|   | |   `-DeclRefExpr 0x7ffbe533f118 <col:44> 'const std::__1::locale::category':'const int' lvalue Var 0x7ffbe533ebb8 'numeric' 'const std::__1::locale::category':'const int'
|   | `-ImplicitCastExpr 0x7ffbe533f1a8 <col:54> 'std::__1::locale::category':'int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7ffbe533f180 <col:54> 'const std::__1::locale::category':'const int' lvalue Var 0x7ffbe533ed08 'time' 'const std::__1::locale::category':'const int'
|   `-ImplicitCastExpr 0x7ffbe533f210 <col:61> 'std::__1::locale::category':'int' <LValueToRValue>
|     `-DeclRefExpr 0x7ffbe533f1e8 <col:61> 'const std::__1::locale::category':'const int' lvalue Var 0x7ffbe533ee58 'messages' 'const std::__1::locale::category':'const int'
|-CXXConstructorDecl 0x7ffbe533f360 <line:81:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:81:5 locale 'void (void) noexcept'
|-CXXConstructorDecl 0x7ffbe533f528 <line:82:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:82:5 referenced locale 'void (const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7ffbe533f418 <col:12, col:24> col:25 'const class std::__1::locale &'
|-CXXConstructorDecl 0x7ffbe533f678 <line:83:5, col:32> col:14 locale 'void (const char *)'
| `-ParmVarDecl 0x7ffbe533f5f0 <col:21, col:31> col:32 'const char *'
|-CXXConstructorDecl 0x7ffbe533f7c0 <line:84:5, col:34> col:14 locale 'void (const std::__1::string &)'
| `-ParmVarDecl 0x7ffbe533f738 <col:21, col:33> col:34 'const std::__1::string &'
|-CXXConstructorDecl 0x7ffbe533faa0 <line:85:5, col:48> col:5 locale 'void (const class std::__1::locale &, const char *, std::__1::locale::category)'
| |-ParmVarDecl 0x7ffbe533f880 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7ffbe533f8f8 <col:27, col:37> col:38 'const char *'
| `-ParmVarDecl 0x7ffbe533f968 <col:40> col:48 'std::__1::locale::category':'int'
|-CXXConstructorDecl 0x7ffbe533fd80 <line:86:5, col:50> col:5 locale 'void (const class std::__1::locale &, const std::__1::string &, std::__1::locale::category)'
| |-ParmVarDecl 0x7ffbe533fb70 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7ffbe533fbe0 <col:27, col:39> col:40 'const std::__1::string &'
| `-ParmVarDecl 0x7ffbe533fc50 <col:42> col:50 'std::__1::locale::category':'int'
|-FunctionTemplateDecl 0x7ffbe5340158 <line:87:5, line:88:64> col:35 locale
| |-TemplateTypeParmDecl 0x7ffbe533fe40 <line:87:15, col:21> col:21 referenced class depth 0 index 0 _Facet
| `-CXXConstructorDecl 0x7ffbe53400b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:88:64> col:35 locale 'void (const class std::__1::locale &, _Facet *)'
|   |-ParmVarDecl 0x7ffbe533ff00 <col:42, col:54> col:55 'const class std::__1::locale &'
|   |-ParmVarDecl 0x7ffbe533ff98 <col:57, col:63> col:64 '_Facet *'
|   |-AlwaysInlineAttr 0x7ffbe53401b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|   `-VisibilityAttr 0x7ffbe5340200 <col:51, col:74> Hidden
|-CXXConstructorDecl 0x7ffbe5340430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:89:5, col:50> col:5 locale 'void (const class std::__1::locale &, const class std::__1::locale &, std::__1::locale::category)'
| |-ParmVarDecl 0x7ffbe5340220 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7ffbe5340290 <col:27, col:39> col:40 'const class std::__1::locale &'
| `-ParmVarDecl 0x7ffbe5340300 <col:42> col:50 'std::__1::locale::category':'int'
|-CXXDestructorDecl 0x7ffbe5340540 <line:91:5, col:13> col:5 used ~locale 'void (void) noexcept'
|-CXXMethodDecl 0x7ffbe53406f8 <line:93:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:93:19 operator= 'const class std::__1::locale &(const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7ffbe53405f0 <col:29, col:41> col:42 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7ffbe53409e8 <line:95:5, line:97:37> col:14 combine
| |-TemplateTypeParmDecl 0x7ffbe5340798 <line:95:15, col:21> col:21 class depth 0 index 0 _Facet
| `-CXXMethodDecl 0x7ffbe5340950 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:97:37> col:14 combine 'class std::__1::locale (const class std::__1::locale &) const' inline
|   |-ParmVarDecl 0x7ffbe5340860 <col:22, col:34> col:35 'const class std::__1::locale &'
|   `-VisibilityAttr 0x7ffbe5340a40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:624:40, col:63> Hidden
|-CXXMethodDecl 0x7ffbe5340aa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:100:5, col:19> col:12 name 'std::__1::string (void) const'
|-CXXMethodDecl 0x7ffbe5340c10 <line:101:5, col:36> col:10 used operator== '_Bool (const class std::__1::locale &) const'
| `-ParmVarDecl 0x7ffbe5340b50 <col:21, col:33> col:34 'const class std::__1::locale &'
|-CXXMethodDecl 0x7ffbe5340d48 <line:102:5, col:70> col:10 operator!= '_Bool (const class std::__1::locale &) const'
| |-ParmVarDecl 0x7ffbe5340cc0 <col:21, col:35> col:35 used __y 'const class std::__1::locale &'
| `-CompoundStmt 0x7ffbe534d460 <col:46, col:70>
|   `-ReturnStmt 0x7ffbe534d448 <col:47, col:68>
|     `-UnaryOperator 0x7ffbe534d428 <col:54, col:68> '_Bool' prefix '!'
|       `-ParenExpr 0x7ffbe534d408 <col:55, col:68> '_Bool'
|         `-CXXOperatorCallExpr 0x7ffbe534d3c0 <col:56, col:65> '_Bool'
|           |-ImplicitCastExpr 0x7ffbe534d3a8 <col:62> '_Bool (*)(const class std::__1::locale &) const' <FunctionToPointerDecay>
|           | `-DeclRefExpr 0x7ffbe534d350 <col:62> '_Bool (const class std::__1::locale &) const' lvalue CXXMethod 0x7ffbe5340c10 'operator==' '_Bool (const class std::__1::locale &) const'
|           |-UnaryOperator 0x7ffbe534c080 <col:56, col:57> 'const class std::__1::locale' lvalue prefix '*'
|           | `-CXXThisExpr 0x7ffbe534c068 <col:57> 'const class std::__1::locale *' this
|           `-DeclRefExpr 0x7ffbe534c0a0 <col:65> 'const class std::__1::locale' lvalue ParmVar 0x7ffbe5340cc0 '__y' 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7ffbe53414d8 <line:103:5, line:106:73> line:105:12 operator()
| |-TemplateTypeParmDecl 0x7ffbe5340de8 <line:103:15, col:21> col:21 referenced class depth 0 index 0 _CharT
| |-TemplateTypeParmDecl 0x7ffbe5340e58 <col:29, col:35> col:35 referenced class depth 0 index 1 _Traits
| |-TemplateTypeParmDecl 0x7ffbe5340ec8 <col:44, col:50> col:50 referenced class depth 0 index 2 _Allocator
| `-CXXMethodDecl 0x7ffbe5341440 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:106:73> line:105:12 operator() '_Bool (const basic_string<_CharT, _Traits, _Allocator> &, const basic_string<_CharT, _Traits, _Allocator> &) const' inline
|   |-ParmVarDecl 0x7ffbe5341130 <col:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   |-ParmVarDecl 0x7ffbe5341330 <line:106:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   `-VisibilityAttr 0x7ffbe5341538 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:624:40, col:63> Hidden
|-CXXMethodDecl 0x7ffbe5341650 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:109:5, col:39> col:19 global 'class std::__1::locale (const class std::__1::locale &)' static
| `-ParmVarDecl 0x7ffbe5341590 <col:26, col:38> col:39 'const class std::__1::locale &'
|-CXXMethodDecl 0x7ffbe5341740 <line:110:5, col:34> col:26 classic 'const class std::__1::locale &(void)' static
|-AccessSpecDecl 0x7ffbe53417d8 <line:112:1, col:8> col:1 private
|-CXXRecordDecl 0x7ffbe5341800 <line:113:5, col:11> col:11 referenced class __imp
|-FieldDecl 0x7ffbe53418f8 <line:114:5, col:12> col:12 __locale_ 'class std::__1::locale::__imp *'
|-CXXMethodDecl 0x7ffbe5341b40 <line:116:5, col:52> col:10 referenced __install_ctor 'void (const class std::__1::locale &, class std::__1::locale::facet *, long)'
| |-ParmVarDecl 0x7ffbe5341950 <col:25, col:37> col:38 'const class std::__1::locale &'
| |-ParmVarDecl 0x7ffbe53419e8 <col:40, col:45> col:46 'class std::__1::locale::facet *'
| `-ParmVarDecl 0x7ffbe5341a60 <col:48> col:52 'long'
|-CXXMethodDecl 0x7ffbe5341c70 <line:117:5, col:29> col:20 __global 'class std::__1::locale &(void)' static
|-CXXMethodDecl 0x7ffbe5341e10 <line:118:5, col:25> col:10 referenced has_facet '_Bool (class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7ffbe5341d48 <col:20, col:22> col:23 'class std::__1::locale::id &'
|-CXXMethodDecl 0x7ffbe5341fb0 <line:119:5, col:33> col:18 used use_facet 'const class std::__1::locale::facet *(class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7ffbe5341ec0 <col:28, col:30> col:31 'class std::__1::locale::id &'
|-FriendDecl 0x7ffbe53422d8 <line:121:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:121:41
| `-FunctionTemplateDecl 0x7ffbe5342218 parent 0x7ffbe533d980 prev 0x7ffbe533ddb0 <col:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:121:41 has_facet
|   |-TemplateTypeParmDecl 0x7ffbe5342050 <col:15, col:21> col:21 class depth 0 index 0 _Facet
|   `-FunctionDecl 0x7ffbe5342170 parent 0x7ffbe533d980 prev 0x7ffbe533dd18 <col:29, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:121:41 has_facet '_Bool (const class std::__1::locale &) noexcept'
|     |-ParmVarDecl 0x7ffbe53420e0 <col:51, col:63> col:64 'const class std::__1::locale &'
|     |-AlwaysInlineAttr 0x7ffbe53422b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|     `-VisibilityAttr 0x7ffbe53422c8 <col:51, col:74> Inherited Hidden
`-FriendDecl 0x7ffbe534bff8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:122:5, col:73> col:50
  `-FunctionTemplateDecl 0x7ffbe534bf38 parent 0x7ffbe533d980 prev 0x7ffbe533e0e8 <col:5, col:73> col:50 use_facet
    |-TemplateTypeParmDecl 0x7ffbe5342310 <col:15, col:21> col:21 referenced class depth 0 index 0 _Facet
    |-FunctionDecl 0x7ffbe534be90 parent 0x7ffbe533d980 prev 0x7ffbe533e050 <col:29, col:73> col:50 use_facet 'const _Facet &(const class std::__1::locale &)'
    | |-ParmVarDecl 0x7ffbe53423a0 <col:60, col:72> col:73 'const class std::__1::locale &'
    | |-AlwaysInlineAttr 0x7ffbe534bfd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
    | `-VisibilityAttr 0x7ffbe534bfe8 <col:51, col:74> Inherited Hidden
    `-Function 0x7ffbe5e59540 'use_facet' 'const class std::__1::ctype<char> &(const class std::__1::locale &)'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  NonVirtualBaseLLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffbe5833ed8 parent 0x7ffbe405a288 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:479:84> col:64 class basic_streambuf definition
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7ffbe536aeb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7ffbe536af78 prev 0x7ffbe5833ed8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:122:1, col:28> col:28 implicit class basic_streambuf
|-AccessSpecDecl 0x7ffbe536b010 <line:124:1, col:7> col:1 public
|-TypedefDecl 0x7ffbe536b078 <line:126:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7ffbe536b040 'char' sugar
|   |-TemplateTypeParmType 0x7ffbe4d09830 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7ffbe4d097e8 '_CharT'
|   `-BuiltinType 0x7ffbe4819d60 'char'
|-TypedefDecl 0x7ffbe536b108 <line:127:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7ffbe536b0d0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7ffbe4d098a0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7ffbe4d09858 '_Traits'
|   `-RecordType 0x7ffbe5833760 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7ffbe4aba888 'char_traits'
|-TypedefDecl 0x7ffbe536b210 <line:128:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7ffbe536b1c0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7ffbe4abc3d0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7ffbe4ababe8 'int_type'
|     `-BuiltinType 0x7ffbe4819dc0 'int'
|-TypedefDecl 0x7ffbe536b300 <line:129:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7ffbe536b2b0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7ffbe536b290 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7ffbe4abacb8 'pos_type'
|     `-TypedefType 0x7ffbe411d040 'std::__1::streampos' sugar
|       |-Typedef 0x7ffbe40605b8 'streampos'
|       `-TemplateSpecializationType 0x7ffbe4060510 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7ffbe40604f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7ffbe4060400 'fpos'
|-TypedefDecl 0x7ffbe536b3f0 <line:130:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7ffbe536b3a0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7ffbe536b380 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7ffbe4abac50 'off_type'
|     `-TypedefType 0x7ffbe411cfb0 'std::__1::streamoff' sugar
|       |-Typedef 0x7ffbe4060958 'streamoff'
|       `-BuiltinType 0x7ffbe4819e00 'long long'
|-CXXDestructorDecl 0x7ffbe536b478 <line:132:5, col:30> col:13 ~basic_streambuf 'void (void)' virtual noexcept-unevaluated 0x7ffbe536b478
|-CXXMethodDecl 0x7ffbe536b5b0 <line:135:5, line:141:5> line:136:12 pubimbue 'class std::__1::locale (const class std::__1::locale &)' inline
| |-ParmVarDecl 0x7ffbe536b528 <col:21, col:35> col:35 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7ffbe536b688 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe536b6d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:143:5, line:144:44> col:12 getloc 'class std::__1::locale (void) const' inline
| `-AlwaysInlineAttr 0x7ffbe536b778 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe536b990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:147:5, line:149:32> line:148:22 pubsetbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7ffbe536b818 <col:32, col:43> col:43 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7ffbe536b878 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7ffbe536ba48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe536bcd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:151:5, line:154:46> line:152:14 referenced pubseekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7ffbe536bae0 <col:25, col:34> col:34 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7ffbe536bb40 <col:41, col:59> col:59 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| |-ParmVarDecl 0x7ffbe536bba0 <line:153:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7ffbe536bd90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe536bf60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:156:5, line:159:38> line:157:14 referenced pubseekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7ffbe536bde8 <col:25, col:34> col:34 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| |-ParmVarDecl 0x7ffbe536be48 <line:158:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7ffbe536c018 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe536c060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:161:5, line:162:36> col:9 referenced pubsync 'int (void)' inline
| `-AlwaysInlineAttr 0x7ffbe536c108 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe536c150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:166:5, line:171:5> line:167:16 in_avail 'std::__1::streamsize (void)' inline
| `-AlwaysInlineAttr 0x7ffbe536c1f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe536c2b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:173:5, line:178:5> line:174:14 snextc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7ffbe536c358 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe536c3c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:180:5, line:185:5> line:181:14 sbumpc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7ffbe536c468 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe536c4d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:187:5, line:192:5> line:188:14 sgetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7ffbe536c578 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe536c740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:194:5, line:196:32> line:195:16 referenced sgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7ffbe536c5d0 <col:22, col:33> col:33 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7ffbe536c630 <col:38, col:49> col:49 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7ffbe536c7f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe536c910 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:199:5, line:204:5> line:200:14 sputbackc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7ffbe536c850 <col:24, col:34> col:34 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7ffbe536c9c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe536ca28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:206:5, line:211:5> line:207:14 sungetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7ffbe536cad0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe536cbb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:214:5, line:220:5> line:215:14 sputc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7ffbe536cb28 <col:20, col:30> col:30 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7ffbe536cc60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe536ce60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:222:5, line:224:32> line:223:16 used sputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7ffbe536cce8 <col:22, col:39> col:39 used __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7ffbe536cd48 <col:44, col:55> col:55 used __n 'std::__1::streamsize':'long'
| |-CompoundStmt 0x7ffbe5e5bce0 <line:224:5, col:32>
| | `-ReturnStmt 0x7ffbe5e5bcc8 <col:7, col:29>
| |   `-CXXMemberCallExpr 0x7ffbe5e5bc60 <col:14, col:29> 'std::__1::streamsize':'long'
| |     |-MemberExpr 0x7ffbe5e5bbd8 <col:14> '<bound member function type>' ->xsputn 0x7ffbe536f300
| |     | `-CXXThisExpr 0x7ffbe5e5bbc0 <col:14> 'class std::__1::basic_streambuf<char> *' this
| |     |-ImplicitCastExpr 0x7ffbe5e5bc98 <col:21> 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7ffbe5e5bc10 <col:21> 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *' lvalue ParmVar 0x7ffbe536cce8 '__s' 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |     `-ImplicitCastExpr 0x7ffbe5e5bcb0 <col:26> 'std::__1::streamsize':'long' <LValueToRValue>
| |       `-DeclRefExpr 0x7ffbe5e5bc38 <col:26> 'std::__1::streamsize':'long' lvalue ParmVar 0x7ffbe536cd48 '__n' 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7ffbe536cf18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-AccessSpecDecl 0x7ffbe536cf60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:226:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7ffbe536cfc8 <line:227:5, col:21> col:5 basic_streambuf 'void (void)'
|-CXXConstructorDecl 0x7ffbe536d1a0 <line:228:5, col:49> col:5 basic_streambuf 'void (const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7ffbe536d0b8 <col:21, col:44> col:44 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7ffbe536d360 <line:229:5, col:60> col:22 operator= 'class std::__1::basic_streambuf<char> &(const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7ffbe536d298 <col:32, col:55> col:55 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7ffbe536d4e0 <line:230:5, col:37> col:10 swap 'void (class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7ffbe536d420 <col:15, col:32> col:32 __rhs 'class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7ffbe536d610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:233:68> col:38 eback 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7ffbe536d6b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe536d720 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:234:68> col:38 gptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7ffbe536d7c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe536d830 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:235:68> col:38 egptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7ffbe536d8d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe536d9a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:237:5, line:238:43> col:10 gbump 'void (int)' inline
| |-ParmVarDecl 0x7ffbe536d920 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7ffbe536da58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe536dcc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:240:5, line:245:5> line:241:10 setg 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7ffbe536dab0 <col:15, col:26> col:26 __gbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7ffbe536db20 <col:34, col:45> col:45 __gnext 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7ffbe536db90 <col:54, col:65> col:65 __gend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7ffbe536dd80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe536dde8 <line:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:248:68> col:38 pbase 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7ffbe536de90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe536def8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:249:68> col:38 pptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7ffbe536dfa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe536e008 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:250:68> col:38 epptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7ffbe536e0b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7ffbe536e180 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:252:5, line:253:43> col:10 pbump 'void (int)' inline
| |-ParmVarDecl 0x7ffbe536e0f8 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7ffbe536e230 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe536e410 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:255:5, line:259:5> line:256:10 setp 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7ffbe536e288 <col:15, col:26> col:26 __pbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7ffbe536e2f8 <col:34, col:45> col:45 __pend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7ffbe536e4c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7ffbe536e598 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:263:5, col:43> col:18 imbue 'void (const class std::__1::locale &)' virtual
| `-ParmVarDecl 0x7ffbe536e510 <col:24, col:38> col:38 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7ffbe536e748 <line:266:5, col:67> col:30 setbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7ffbe536e658 <col:37, col:48> col:48 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7ffbe536e6b8 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7ffbe536e968 <line:267:5, line:268:87> line:267:22 seekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7ffbe536e810 <col:30, col:39> col:39 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7ffbe536e870 <col:46, col:64> col:64 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-ParmVarDecl 0x7ffbe536e8d0 <line:268:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7ffbe536eb28 <line:269:5, line:270:87> line:269:22 seekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7ffbe536ea38 <col:30, col:39> col:39 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ParmVarDecl 0x7ffbe536ea98 <line:270:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7ffbe536ebe0 <line:271:5, col:22> col:17 sync 'int (void)' virtual
|-CXXMethodDecl 0x7ffbe536ec88 <line:274:5, col:34> col:24 showmanyc 'std::__1::streamsize (void)' virtual
|-CXXMethodDecl 0x7ffbe536ee30 <line:275:5, col:61> col:24 xsgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7ffbe536ed40 <col:31, col:42> col:42 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7ffbe536eda0 <col:47, col:58> col:58 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7ffbe536ef08 <line:276:5, col:32> col:22 underflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7ffbe536efd0 <line:277:5, col:28> col:22 uflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7ffbe536f150 <line:280:5, col:65> col:22 pbackfail 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7ffbe536f088 <col:32, col:64> col:41 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7ffbe536f300 <line:283:5, col:67> col:24 used xsputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7ffbe536f210 <col:31, col:48> col:48 __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7ffbe536f270 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7ffbe536f450 <line:284:5, col:64> col:22 overflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7ffbe536f3c8 <col:31, col:63> col:40 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-AccessSpecDecl 0x7ffbe536f500 <line:286:1, col:8> col:1 private
|-FieldDecl 0x7ffbe536f528 <line:287:5, col:12> col:12 __loc_ 'class std::__1::locale'
|-FieldDecl 0x7ffbe536f580 <line:288:5, col:16> col:16 __binp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7ffbe536f5d8 <line:289:5, col:16> col:16 __ninp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7ffbe536f630 <line:290:5, col:16> col:16 __einp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7ffbe536f688 <line:291:5, col:16> col:16 __bout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7ffbe536f6e0 <line:292:5, col:16> col:16 __nout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
`-FieldDecl 0x7ffbe536f738 <line:293:5, col:16> col:16 __eout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffbe5caaf28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:998:1, line:1037:1> line:999:28 class ostreambuf_iterator definition
|-public 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-CXXRecordDecl 0x7ffbe7017700 prev 0x7ffbe5caaf28 <col:1, col:28> col:28 implicit class ostreambuf_iterator
|-AccessSpecDecl 0x7ffbe7017798 <line:1002:1, col:7> col:1 public
|-TypedefDecl 0x7ffbe70177f8 <line:1003:5, col:45> col:45 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7ffbe70177c0 'char' sugar
|   |-TemplateTypeParmType 0x7ffbe50de180 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7ffbe50de140 '_CharT'
|   `-BuiltinType 0x7ffbe4819d60 'char'
|-TypedefDecl 0x7ffbe7017888 <line:1004:5, col:45> col:45 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7ffbe7017850 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7ffbe50de1f0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7ffbe50de1a8 '_Traits'
|   `-RecordType 0x7ffbe5833760 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7ffbe4aba888 'char_traits'
|-TypedefDecl 0x7ffbe70179a8 <line:1005:5, col:45> col:45 streambuf_type 'basic_streambuf<char, struct std::__1::char_traits<char> >':'class std::__1::basic_streambuf<char>'
| `-TemplateSpecializationType 0x7ffbe7017900 'basic_streambuf<char, struct std::__1::char_traits<char> >' sugar basic_streambuf
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7ffbe5833fe0 'class std::__1::basic_streambuf<char>'
|     `-ClassTemplateSpecialization 0x7ffbe5833ed8 'basic_streambuf'
|-TypedefDecl 0x7ffbe7017ac8 <line:1006:5, col:45> col:45 ostream_type 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>'
| `-TemplateSpecializationType 0x7ffbe7017a20 'basic_ostream<char, struct std::__1::char_traits<char> >' sugar basic_ostream
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7ffbe405b9c0 'class std::__1::basic_ostream<char>'
|     `-ClassTemplateSpecialization 0x7ffbe405b8b8 'basic_ostream'
|-AccessSpecDecl 0x7ffbe7017b20 <line:1007:1, col:8> col:1 private
|-FieldDecl 0x7ffbe7017ba8 <line:1008:5, col:21> col:21 referenced __sbuf_ 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
|-AccessSpecDecl 0x7ffbe7017bf0 <line:1009:1, col:7> col:1 public
|-CXXConstructorDecl 0x7ffbe7017d88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1011:33> line:1010:31 used ostreambuf_iterator 'void (std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type &) noexcept'
| |-ParmVarDecl 0x7ffbe7017c78 <col:51, col:65> col:65 used __s 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type &'
| |-CXXCtorInitializer 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>'
| | `-CXXConstructExpr 0x7ffbe5e58428 <col:31> 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7ffbe7017ba8 '__sbuf_' 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
| | `-CXXMemberCallExpr 0x7ffbe5e58370 <line:1011:19, col:29> 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| |   `-MemberExpr 0x7ffbe5e58338 <col:19, col:23> '<bound member function type>' .rdbuf 0x7ffbe4d188e0
| |     `-ImplicitCastExpr 0x7ffbe5e58398 <col:19> 'const class std::__1::basic_ios<char>' lvalue <UncheckedDerivedToBase (virtual basic_ios)>
| |       `-DeclRefExpr 0x7ffbe5e582a0 <col:19> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type':'class std::__1::basic_ostream<char>' lvalue ParmVar 0x7ffbe7017c78 '__s' 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type &'
| |-CompoundStmt 0x7ffbe50e11b8 <col:32, col:33>
| `-AlwaysInlineAttr 0x7ffbe7017e78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7ffbe7017fb8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1013:25> line:1012:31 ostreambuf_iterator 'void (std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *) noexcept'
| |-ParmVarDecl 0x7ffbe7017ed0 <col:51, col:67> col:67 __s 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
| `-AlwaysInlineAttr 0x7ffbe7018078 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe7018200 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1019:9> line:1014:52 operator= 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(char)'
| |-ParmVarDecl 0x7ffbe70180f8 <col:62, col:69> col:69 __c 'char':'char'
| `-AlwaysInlineAttr 0x7ffbe70182b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe7018350 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1020:82> col:52 operator* 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(void)'
| `-AlwaysInlineAttr 0x7ffbe5e54e00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe5e54e68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1021:82> col:52 operator++ 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(void)'
| `-AlwaysInlineAttr 0x7ffbe5e54f10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe5e55020 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1022:82> col:52 operator++ 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(int)'
| |-ParmVarDecl 0x7ffbe5e54f58 <col:63> col:66 'int'
| `-AlwaysInlineAttr 0x7ffbe5e550d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe5e55118 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1023:82> col:36 used failed '_Bool (void) const noexcept'
| |-CompoundStmt 0x7ffbe5e611c8 <col:61, col:82>
| | `-ReturnStmt 0x7ffbe5e611b0 <col:62, col:80>
| |   `-BinaryOperator 0x7ffbe5e61188 <col:69, col:80> '_Bool' '=='
| |     |-ImplicitCastExpr 0x7ffbe5e61158 <col:69> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' <LValueToRValue>
| |     | `-MemberExpr 0x7ffbe5e61120 <col:69> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *const' lvalue ->__sbuf_ 0x7ffbe7017ba8
| |     |   `-CXXThisExpr 0x7ffbe5e61108 <col:69> 'const class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > *' this
| |     `-ImplicitCastExpr 0x7ffbe5e61170 <col:80> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' <NullToPointer>
| |       `-IntegerLiteral 0x7ffbe50e1888 <col:80> 'int' 0
| `-AlwaysInlineAttr 0x7ffbe5e551c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FriendDecl 0x7ffbe5e55a00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1029:5, line:1035:47> line:1033:5
| `-FunctionTemplateDecl 0x7ffbe5e558d0 parent 0x7ffbe50a9e68 prev 0x7ffbe4d5ad60 <line:1029:5, line:1035:47> line:1033:5 __pad_and_output
|   |-TemplateTypeParmDecl 0x7ffbe5e55208 <line:1029:15, col:21> col:21 class depth 0 index 0 _Ch
|   |-TemplateTypeParmDecl 0x7ffbe5e55278 <col:26, col:32> col:32 class depth 0 index 1 _Tr
|   |-FunctionDecl 0x7ffbe5e557f8 parent 0x7ffbe50a9e68 prev 0x7ffbe4d5acc8 <line:1030:5, line:1035:47> line:1033:5 __pad_and_output 'ostreambuf_iterator<_Ch, _Tr> (ostreambuf_iterator<_Ch, _Tr>, const _Ch *, const _Ch *, const _Ch *, class std::__1::ios_base &, _Ch)'
|   | |-ParmVarDecl 0x7ffbe5e55458 <col:22, col:52> col:52 __s 'ostreambuf_iterator<_Ch, _Tr>'
|   | |-ParmVarDecl 0x7ffbe5e554f8 <line:1034:22, col:33> col:33 __ob 'const _Ch *'
|   | |-ParmVarDecl 0x7ffbe5e55568 <col:39, col:50> col:50 __op 'const _Ch *'
|   | |-ParmVarDecl 0x7ffbe5e555d8 <col:56, col:67> col:67 __oe 'const _Ch *'
|   | |-ParmVarDecl 0x7ffbe5e55638 <line:1035:22, col:32> col:32 __iob 'class std::__1::ios_base &'
|   | |-ParmVarDecl 0x7ffbe5e556a8 <col:39, col:43> col:43 __fl '_Ch'
|   | `-VisibilityAttr 0x7ffbe5e55968 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:624:40, col:63> Inherited Hidden
|   `-Function 0x7ffbe5e576d8 '__pad_and_output' 'ostreambuf_iterator<char, struct std::__1::char_traits<char> > (ostreambuf_iterator<char, struct std::__1::char_traits<char> >, const char *, const char *, const char *, class std::__1::ios_base &, char)'
|-CXXConstructorDecl 0x7ffbe5e55e28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:999:28> col:28 implicit constexpr ostreambuf_iterator 'void (const class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &)' inline default trivial noexcept-unevaluated 0x7ffbe5e55e28
| `-ParmVarDecl 0x7ffbe5e55f50 <col:28> col:28 'const class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &'
|-CXXConstructorDecl 0x7ffbe5e55fe8 <col:28> col:28 implicit used constexpr ostreambuf_iterator 'void (class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7ffbe5e56110 <col:28> col:28 used 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&'
| |-CXXCtorInitializer 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>'
| | `-CXXConstructExpr 0x7ffbe5e57b20 <col:28> 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>' 'void (struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &&) noexcept'
| |   `-ImplicitCastExpr 0x7ffbe5e57a00 <col:28> 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>' xvalue <UncheckedDerivedToBase (iterator)>
| |     `-CXXStaticCastExpr 0x7ffbe5e579d0 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' xvalue static_cast<class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&> <NoOp>
| |       `-DeclRefExpr 0x7ffbe5e57998 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' lvalue ParmVar 0x7ffbe5e56110 '' 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&'
| |-CXXCtorInitializer Field 0x7ffbe7017ba8 '__sbuf_' 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
| | `-ImplicitCastExpr 0x7ffbe5e57d18 <col:28> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' <LValueToRValue>
| |   `-MemberExpr 0x7ffbe5e57cc8 <col:28> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' xvalue .__sbuf_ 0x7ffbe7017ba8
| |     `-CXXStaticCastExpr 0x7ffbe5e57c98 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' xvalue static_cast<class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&> <NoOp>
| |       `-DeclRefExpr 0x7ffbe5e57c60 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' lvalue ParmVar 0x7ffbe5e56110 '' 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&'
| `-CompoundStmt 0x7ffbe5e57d68 <col:28>
`-CXXDestructorDecl 0x7ffbe5e561b0 <col:28> col:28 implicit referenced ~ostreambuf_iterator 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ostreambuf_iterator" = type { %"class.std::__1::basic_streambuf"* }
  NonVirtualBaseLLVMType:%"class.std::__1::ostreambuf_iterator" = type { %"class.std::__1::basic_streambuf"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffbe4124168 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:583:90> col:64 class __basic_string_common definition
|-TemplateArgument integral 1
|-VisibilityAttr 0x7ffbe41242f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7ffbe41243a8 prev 0x7ffbe4124168 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:558:1, col:28> col:28 implicit class __basic_string_common
|-AccessSpecDecl 0x7ffbe4124440 <line:560:1, col:10> col:1 protected
|-CXXMethodDecl 0x7ffbe4124468 <line:561:22, col:50> col:27 used __throw_length_error 'void (void) const'
| `-CXX11NoReturnAttr 0x7ffbe4124538 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:313:30> Inherited
|-CXXMethodDecl 0x7ffbe4124580 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:562:22, col:50> col:27 __throw_out_of_range 'void (void) const'
| `-CXX11NoReturnAttr 0x7ffbe4124628 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:313:30> Inherited
|-CXXDestructorDecl 0x7ffbe417d740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:583:64> col:64 implicit ~__basic_string_common 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7ffbe42d1388 <col:64> col:64 implicit used constexpr __basic_string_common 'void (void) noexcept' inline default trivial
| `-CompoundStmt 0x7ffbe42d17e8 <col:64>
|-CXXConstructorDecl 0x7ffbe42d1498 <col:64> col:64 implicit constexpr __basic_string_common 'void (const class std::__1::__basic_string_common<true> &)' inline default trivial noexcept-unevaluated 0x7ffbe42d1498
| `-ParmVarDecl 0x7ffbe42d15c0 <col:64> col:64 'const class std::__1::__basic_string_common<true> &'
`-CXXConstructorDecl 0x7ffbe42d1658 <col:64> col:64 implicit constexpr __basic_string_common 'void (class std::__1::__basic_string_common<true> &&)' inline default trivial noexcept-unevaluated 0x7ffbe42d1658
  `-ParmVarDecl 0x7ffbe42d1780 <col:64> col:64 'class std::__1::__basic_string_common<true> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffbe405bea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:101:1, col:52> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1759:28 class allocator definition
|-TemplateArgument type 'char'
|-CXXRecordDecl 0x7ffbe51e3448 prev 0x7ffbe405bea8 <col:1, col:28> col:28 implicit class allocator
|-AccessSpecDecl 0x7ffbe51e34e0 <line:1761:1, col:7> col:1 public
|-TypedefDecl 0x7ffbe51e3508 <line:1762:5, col:31> col:31 referenced size_type 'size_t':'unsigned long'
| `-TypedefType 0x7ffbe5042020 'size_t' sugar
|   |-Typedef 0x7ffbe401c960 'size_t'
|   `-TypedefType 0x7ffbe401c930 '__darwin_size_t' sugar
|     |-Typedef 0x7ffbe484f430 '__darwin_size_t'
|     `-BuiltinType 0x7ffbe4819e80 'unsigned long'
|-TypedefDecl 0x7ffbe51e3560 <line:1763:5, col:31> col:31 referenced difference_type 'ptrdiff_t':'long'
| `-TypedefType 0x7ffbe50b08a0 'ptrdiff_t' sugar
|   |-Typedef 0x7ffbe4064e28 'ptrdiff_t'
|   `-BuiltinType 0x7ffbe4819de0 'long'
|-TypedefDecl 0x7ffbe51e3628 <line:1764:5, col:31> col:31 referenced pointer 'char *'
| `-PointerType 0x7ffbe51e35f0 'char *'
|   `-SubstTemplateTypeParmType 0x7ffbe51e35c0 'char' sugar
|     |-TemplateTypeParmType 0x7ffbe59f8bd0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7ffbe59f8b88 '_Tp'
|     `-BuiltinType 0x7ffbe4819d60 'char'
|-TypedefDecl 0x7ffbe51e36b8 <line:1765:5, col:31> col:31 referenced const_pointer 'const char *'
| `-PointerType 0x7ffbe51e3680 'const char *'
|   `-QualType 0x7ffbe51e35c1 'const char' const
|     `-SubstTemplateTypeParmType 0x7ffbe51e35c0 'char' sugar
|       |-TemplateTypeParmType 0x7ffbe59f8bd0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7ffbe59f8b88 '_Tp'
|       `-BuiltinType 0x7ffbe4819d60 'char'
|-TypedefDecl 0x7ffbe51e3748 <line:1766:5, col:31> col:31 reference 'char &'
| `-LValueReferenceType 0x7ffbe51e3710 'char &'
|   `-SubstTemplateTypeParmType 0x7ffbe51e35c0 'char' sugar
|     |-TemplateTypeParmType 0x7ffbe59f8bd0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7ffbe59f8b88 '_Tp'
|     `-BuiltinType 0x7ffbe4819d60 'char'
|-TypedefDecl 0x7ffbe51e37d8 <line:1767:5, col:31> col:31 const_reference 'const char &'
| `-LValueReferenceType 0x7ffbe51e37a0 'const char &'
|   `-QualType 0x7ffbe51e35c1 'const char' const
|     `-SubstTemplateTypeParmType 0x7ffbe51e35c0 'char' sugar
|       |-TemplateTypeParmType 0x7ffbe59f8bd0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7ffbe59f8b88 '_Tp'
|       `-BuiltinType 0x7ffbe4819d60 'char'
|-TypedefDecl 0x7ffbe51e3840 <line:1768:5, col:31> col:31 referenced value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7ffbe51e35c0 'char' sugar
|   |-TemplateTypeParmType 0x7ffbe59f8bd0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7ffbe59f8b88 '_Tp'
|   `-BuiltinType 0x7ffbe4819d60 'char'
|-TypedefDecl 0x7ffbe51e3898 <line:1770:5, col:23> col:23 referenced propagate_on_container_move_assignment 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7ffbe5049400 'std::__1::true_type' sugar
|   |-Typedef 0x7ffbe48b68d0 'true_type'
|   `-TemplateSpecializationType 0x7ffbe48b67e0 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7ffbe48b6648 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:522:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7ffbe48b6630 <line:525:31> '_Bool' true
|     `-RecordType 0x7ffbe48b67c0 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7ffbe48b66b8 'integral_constant'
|-TypedefDecl 0x7ffbe51e38f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1771:5, col:23> col:23 referenced is_always_equal 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7ffbe5049400 'std::__1::true_type' sugar
|   |-Typedef 0x7ffbe48b68d0 'true_type'
|   `-TemplateSpecializationType 0x7ffbe48b67e0 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7ffbe48b6648 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:522:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7ffbe48b6630 <line:525:31> '_Bool' true
|     `-RecordType 0x7ffbe48b67c0 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7ffbe48b66b8 'integral_constant'
|-ClassTemplateDecl 0x7ffbe51e3a68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1773:5, col:33> col:33 rebind
| |-TemplateTypeParmDecl 0x7ffbe51e3948 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXRecordDecl 0x7ffbe51e39d0 <col:26, col:33> col:33 struct rebind
|-CXXConstructorDecl 0x7ffbe51e3cb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1775:54> col:31 used allocator 'void (void) noexcept'
| |-CompoundStmt 0x7ffbe59fb2b0 <col:53, col:54>
| `-AlwaysInlineAttr 0x7ffbe51e3d98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7ffbe51e40f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:5, col:96> col:52 allocator
| |-TemplateTypeParmDecl 0x7ffbe51e3de0 <col:15, col:21> col:21 class depth 0 index 0 _Up
| |-CXXConstructorDecl 0x7ffbe51e4048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:96> col:52 allocator 'void (const allocator<_Up> &) noexcept'
| | |-ParmVarDecl 0x7ffbe51e3f20 <col:62, col:82> col:83 'const allocator<_Up> &'
| | `-AlwaysInlineAttr 0x7ffbe51e4148 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-CXXConstructorDecl 0x7ffbe5b3bb48 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:96> col:52 allocator 'void (const allocator<char> &) noexcept'
|   |-TemplateArgument type 'char'
|   |-ParmVarDecl 0x7ffbe5b3ba80 <col:62, col:82> col:83 'const allocator<char> &'
|   `-AlwaysInlineAttr 0x7ffbe5b3bc50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe51e4378 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1778:39> line:1777:39 address 'std::__1::allocator<char>::pointer (std::__1::allocator<char>::reference) const noexcept'
| |-ParmVarDecl 0x7ffbe51e4270 <col:47, col:57> col:57 __x 'std::__1::allocator<char>::reference':'char &'
| `-AlwaysInlineAttr 0x7ffbe51e4428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe51e45c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1780:39> line:1779:45 address 'std::__1::allocator<char>::const_pointer (std::__1::allocator<char>::const_reference) const noexcept'
| |-ParmVarDecl 0x7ffbe51e44c0 <col:53, col:69> col:69 __x 'std::__1::allocator<char>::const_reference':'const char &'
| `-AlwaysInlineAttr 0x7ffbe51e4678 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe51e4830 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1787:9> line:1781:39 used allocate 'std::__1::allocator<char>::pointer (std::__1::allocator::size_type, allocator<void>::const_pointer)'
| |-ParmVarDecl 0x7ffbe51e46c0 <col:48, col:58> col:58 used __n 'std::__1::allocator::size_type':'unsigned long'
| |-ParmVarDecl 0x7ffbe51e4720 <col:63, col:96> col:94 'allocator<void>::const_pointer':'const void *' cinit
| | `-ImplicitCastExpr 0x7ffbe42dc4b8 <col:96> 'allocator<void>::const_pointer':'const void *' <NullToPointer>
| |   `-IntegerLiteral 0x7ffbe59fb278 <col:96> 'int' 0
| |-CompoundStmt 0x7ffbe42dc870 <line:1782:9, line:1787:9>
| | |-IfStmt 0x7ffbe42dc700 <line:1783:9, line:1785:71>
| | | |-<<<NULL>>>
| | | |-<<<NULL>>>
| | | |-BinaryOperator 0x7ffbe42dc678 <line:1783:13, col:28> '_Bool' '>'
| | | | |-ImplicitCastExpr 0x7ffbe42dc660 <col:13> 'std::__1::allocator::size_type':'unsigned long' <LValueToRValue>
| | | | | `-DeclRefExpr 0x7ffbe42dc5a8 <col:13> 'std::__1::allocator::size_type':'unsigned long' lvalue ParmVar 0x7ffbe51e46c0 '__n' 'std::__1::allocator::size_type':'unsigned long'
| | | | `-CXXMemberCallExpr 0x7ffbe42dc620 <col:19, col:28> 'std::__1::allocator::size_type':'unsigned long'
| | | |   `-MemberExpr 0x7ffbe42dc5e8 <col:19> '<bound member function type>' ->max_size 0x7ffbe51e4b78
| | | |     `-ImplicitCastExpr 0x7ffbe42dc648 <col:19> 'const class std::__1::allocator<char> *' <NoOp>
| | | |       `-CXXThisExpr 0x7ffbe42dc5d0 <col:19> 'class std::__1::allocator<char> *' this
| | | |-CallExpr 0x7ffbe42dc6b8 <line:1784:13, line:1785:71> 'void'
| | | | |-ImplicitCastExpr 0x7ffbe42dc6a0 <line:1784:13> 'void (*)(const char *)' <FunctionToPointerDecay>
| | | | | `-DeclRefExpr 0x7ffbe59fb7d0 <col:13> 'void (const char *)' lvalue Function 0x7ffbe5960480 '__throw_length_error' 'void (const char *)'
| | | | `-ImplicitCastExpr 0x7ffbe42dc6e8 <col:34, line:1785:34> 'const char *' <ArrayToPointerDecay>
| | | |   `-StringLiteral 0x7ffbe59fb758 <line:1784:34, line:1785:34> 'const char [68]' lvalue "allocator<T>::allocate(size_t n) 'n' exceeds maximum supported size"
| | | `-<<<NULL>>>
| | `-ReturnStmt 0x7ffbe42dc858 <line:1786:9, col:73>
| |   `-CXXStaticCastExpr 0x7ffbe42dc828 <col:16, col:73> 'std::__1::allocator<char>::pointer':'char *' static_cast<std::__1::allocator<char>::pointer> <BitCast>
| |     `-CallExpr 0x7ffbe42dc7f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1786:72> 'void *'
| |       |-ImplicitCastExpr 0x7ffbe42dc7e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1786:44> 'void *(*)(size_t)' <FunctionToPointerDecay>
| |       | `-DeclRefExpr 0x7ffbe59fb8f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1786:44> 'void *(size_t)' lvalue Function 0x7ffbe49a8eb8 '__allocate' 'void *(size_t)'
| |       `-BinaryOperator 0x7ffbe42dc7b8 <col:55, col:71> 'unsigned long' '*'
| |         |-ImplicitCastExpr 0x7ffbe42dc7a0 <col:55> 'std::__1::allocator::size_type':'unsigned long' <LValueToRValue>
| |         | `-DeclRefExpr 0x7ffbe42dc748 <col:55> 'std::__1::allocator::size_type':'unsigned long' lvalue ParmVar 0x7ffbe51e46c0 '__n' 'std::__1::allocator::size_type':'unsigned long'
| |         `-UnaryExprOrTypeTraitExpr 0x7ffbe42dc780 <col:61, col:71> 'unsigned long' sizeof 'char':'char'
| `-AlwaysInlineAttr 0x7ffbe51e48e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe51e4a78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:49> line:1788:36 used deallocate 'void (std::__1::allocator<char>::pointer, std::__1::allocator::size_type) noexcept'
| |-ParmVarDecl 0x7ffbe51e4940 <col:47, col:55> col:55 used __p 'std::__1::allocator<char>::pointer':'char *'
| |-ParmVarDecl 0x7ffbe51e49a0 <col:60> col:69 'std::__1::allocator::size_type':'unsigned long'
| |-CompoundStmt 0x7ffbe42ddf20 <line:1789:9, col:49>
| | `-CallExpr 0x7ffbe42ddef0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:47> 'void'
| |   |-ImplicitCastExpr 0x7ffbe42dded8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:17> 'void (*)(void *)' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7ffbe59fbae0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:17> 'void (void *)' lvalue Function 0x7ffbe49a9340 '__libcpp_deallocate' 'void (void *)'
| |   `-CStyleCastExpr 0x7ffbe42ddeb0 <col:37, col:44> 'void *' <NoOp>
| |     `-ImplicitCastExpr 0x7ffbe42dde98 <col:44> 'void *' <BitCast>
| |       `-ImplicitCastExpr 0x7ffbe42dde80 <col:44> 'std::__1::allocator<char>::pointer':'char *' <LValueToRValue>
| |         `-DeclRefExpr 0x7ffbe42dde58 <col:44> 'std::__1::allocator<char>::pointer':'char *' lvalue ParmVar 0x7ffbe51e4940 '__p' 'std::__1::allocator<char>::pointer':'char *'
| `-AlwaysInlineAttr 0x7ffbe51e4b30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe51e4b78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1791:45> line:1790:41 used max_size 'std::__1::allocator::size_type (void) const noexcept'
| |-CompoundStmt 0x7ffbe42d93a8 <line:1791:9, col:45>
| | `-ReturnStmt 0x7ffbe42d9390 <col:10, col:43>
| |   `-BinaryOperator 0x7ffbe42d9368 <col:17, col:43> 'unsigned long' '/'
| |     |-CXXFunctionalCastExpr 0x7ffbe42d9310 <col:17, col:29> 'std::__1::allocator::size_type':'unsigned long' functional cast to std::__1::allocator::size_type <NoOp>
| |     | `-ImplicitCastExpr 0x7ffbe42d92f8 <col:27, col:28> 'std::__1::allocator::size_type':'unsigned long' <IntegralCast>
| |     |   `-UnaryOperator 0x7ffbe59fbc18 <col:27, col:28> 'int' prefix '~'
| |     |     `-IntegerLiteral 0x7ffbe59fbbf8 <col:28> 'int' 0
| |     `-UnaryExprOrTypeTraitExpr 0x7ffbe42d9348 <col:33, col:43> 'unsigned long' sizeof 'char':'char'
| `-AlwaysInlineAttr 0x7ffbe51e4c20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7ffbe51e5048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1793:5, line:1799:9> line:1796:9 construct
| |-TemplateTypeParmDecl 0x7ffbe51e4c68 <line:1793:15, col:21> col:21 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7ffbe51e4cd8 <col:26, col:35> col:35 class depth 0 index 1 ... _Args
| `-CXXMethodDecl 0x7ffbe51e4fb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1799:9> line:1796:9 construct 'void (_Up *, _Args &&...)'
|   |-ParmVarDecl 0x7ffbe51e4da8 <col:19, col:24> col:24 __p '_Up *'
|   |-ParmVarDecl 0x7ffbe51e4e98 <col:29, col:40> col:40 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7ffbe51e50a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe51e5290 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1853:70> col:36 destroy 'void (std::__1::allocator<char>::pointer)'
| |-ParmVarDecl 0x7ffbe51e5188 <col:44, col:52> col:52 __p 'std::__1::allocator<char>::pointer':'char *'
| `-AlwaysInlineAttr 0x7ffbe51e5340 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7ffbe417c348 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1759:28> col:28 implicit constexpr allocator 'void (const class std::__1::allocator<char> &)' inline default trivial noexcept-unevaluated 0x7ffbe417c348
| `-ParmVarDecl 0x7ffbe417c430 <col:28> col:28 'const class std::__1::allocator<char> &'
|-CXXConstructorDecl 0x7ffbe417c4c8 <col:28> col:28 implicit used constexpr allocator 'void (class std::__1::allocator<char> &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7ffbe417c5f0 <col:28> col:28 'class std::__1::allocator<char> &&'
| `-CompoundStmt 0x7ffbe42df5b0 <col:28>
`-CXXDestructorDecl 0x7ffbe417d9d8 <col:28> col:28 implicit referenced ~allocator 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffbe5203c60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:699:5, line:704:5> line:699:12 struct __long definition
|-CXXRecordDecl 0x7ffbe52040d8 prev 0x7ffbe5203c60 <col:5, col:12> col:12 implicit struct __long
|-FieldDecl 0x7ffbe52041a0 <line:701:9, col:19> col:19 referenced __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7ffbe52041f8 <line:702:9, col:19> col:19 referenced __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7ffbe5204250 <line:703:9, col:19> col:19 referenced __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
|-CXXDestructorDecl 0x7ffbe417db98 <line:699:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7ffbe42d1eb8 <col:12> col:12 implicit constexpr __long 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &)' inline default trivial noexcept-unevaluated 0x7ffbe42d1eb8
| `-ParmVarDecl 0x7ffbe42d1fe0 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &'
|-CXXConstructorDecl 0x7ffbe42d2078 <col:12> col:12 implicit constexpr __long 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7ffbe42d21a0 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &&'
`-CXXConstructorDecl 0x7ffbe42d3a98 <col:12> col:12 implicit __long 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffbe5206758 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9, line:723:9> line:719:9 union definition
|-FieldDecl 0x7ffbe52068d8 <line:721:13, col:27> col:27 referenced __size_ 'unsigned char'
|-FieldDecl 0x7ffbe5206930 <line:722:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXDestructorDecl 0x7ffbe417df18 <line:719:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7ffbe42d22a8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &)' inline default trivial noexcept-unevaluated 0x7ffbe42d22a8
| `-ParmVarDecl 0x7ffbe42d23d0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &'
|-CXXConstructorDecl 0x7ffbe42d2468 <col:9> col:9 implicit constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7ffbe42d2590 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&'
`-CXXConstructorDecl 0x7ffbe42d3e18 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon.0 = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffbe5204638 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:717:5, line:725:5> line:717:12 struct __short definition
|-CXXRecordDecl 0x7ffbe52066c0 prev 0x7ffbe5204638 <col:5, col:12> col:12 implicit struct __short
|-CXXRecordDecl 0x7ffbe5206758 <line:719:9, line:723:9> line:719:9 union definition
| |-FieldDecl 0x7ffbe52068d8 <line:721:13, col:27> col:27 referenced __size_ 'unsigned char'
| |-FieldDecl 0x7ffbe5206930 <line:722:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-CXXDestructorDecl 0x7ffbe417df18 <line:719:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7ffbe42d22a8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &)' inline default trivial noexcept-unevaluated 0x7ffbe42d22a8
| | `-ParmVarDecl 0x7ffbe42d23d0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &'
| |-CXXConstructorDecl 0x7ffbe42d2468 <col:9> col:9 implicit constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&) noexcept' inline default trivial
| | `-ParmVarDecl 0x7ffbe42d2590 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&'
| `-CXXConstructorDecl 0x7ffbe42d3e18 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial
|-FieldDecl 0x7ffbe5206998 <col:9> col:9 implicit referenced 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
|-IndirectFieldDecl 0x7ffbe52069f0 <line:721:27> col:27 implicit __size_ 'unsigned char'
| |-Field 0x7ffbe5206998 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| `-Field 0x7ffbe52068d8 '__size_' 'unsigned char'
|-IndirectFieldDecl 0x7ffbe5206a40 <line:722:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-Field 0x7ffbe5206998 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| `-Field 0x7ffbe5206930 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FieldDecl 0x7ffbe5206b08 <line:724:9, col:37> col:20 referenced __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
|-CXXDestructorDecl 0x7ffbe417dc78 <line:717:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7ffbe42d25f8 <col:12> col:12 implicit constexpr __short 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &)' inline default trivial noexcept-unevaluated 0x7ffbe42d25f8
| `-ParmVarDecl 0x7ffbe42d2720 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &'
|-CXXConstructorDecl 0x7ffbe42d27b8 <col:12> col:12 implicit constexpr __short 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7ffbe42d28e0 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &&'
`-CXXConstructorDecl 0x7ffbe42d3b78 <col:12> col:12 implicit __short 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffbe5206f10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:733:5, line:736:5> line:733:12 struct __raw definition
|-CXXRecordDecl 0x7ffbe5209610 prev 0x7ffbe5206f10 <col:5, col:12> col:12 implicit struct __raw
|-FieldDecl 0x7ffbe5209768 <line:735:9, col:36> col:19 referenced __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
|-CXXDestructorDecl 0x7ffbe417dd58 <line:733:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7ffbe42d2998 <col:12> col:12 implicit constexpr __raw 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &)' inline default trivial noexcept-unevaluated 0x7ffbe42d2998
| `-ParmVarDecl 0x7ffbe42d2ac0 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &'
|-CXXConstructorDecl 0x7ffbe42d2b58 <col:12> col:12 implicit constexpr __raw 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7ffbe42d2c80 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &&'
`-CXXConstructorDecl 0x7ffbe42d3c58 <col:12> col:12 implicit __raw 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffbe5209368 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9, line:745:9> line:740:9 union definition
|-FieldDecl 0x7ffbe52094f8 <line:742:13, col:21> col:21 referenced __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-FieldDecl 0x7ffbe5209550 <line:743:13, col:21> col:21 referenced __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-FieldDecl 0x7ffbe52097d0 <line:744:13, col:21> col:21 referenced __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
|-CXXDestructorDecl 0x7ffbe417de38 <line:740:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7ffbe42d1988 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &)' inline default trivial noexcept-unevaluated 0x7ffbe42d1988
| `-ParmVarDecl 0x7ffbe42d1ab0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &'
|-CXXConstructorDecl 0x7ffbe42d1b48 <col:9> col:9 implicit used constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7ffbe42d1c70 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&'
| `-CompoundStmt 0x7ffbe42df790 <col:9>
`-CXXConstructorDecl 0x7ffbe42d3d38 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7ffbe5206fe0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:738:5, line:746:5> line:738:12 struct __rep definition
|-CXXRecordDecl 0x7ffbe52092d0 prev 0x7ffbe5206fe0 <col:5, col:12> col:12 implicit struct __rep
|-CXXRecordDecl 0x7ffbe5209368 <line:740:9, line:745:9> line:740:9 union definition
| |-FieldDecl 0x7ffbe52094f8 <line:742:13, col:21> col:21 referenced __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-FieldDecl 0x7ffbe5209550 <line:743:13, col:21> col:21 referenced __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-FieldDecl 0x7ffbe52097d0 <line:744:13, col:21> col:21 referenced __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-CXXDestructorDecl 0x7ffbe417de38 <line:740:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7ffbe42d1988 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &)' inline default trivial noexcept-unevaluated 0x7ffbe42d1988
| | `-ParmVarDecl 0x7ffbe42d1ab0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &'
| |-CXXConstructorDecl 0x7ffbe42d1b48 <col:9> col:9 implicit used constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept' inline default trivial
| | |-ParmVarDecl 0x7ffbe42d1c70 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&'
| | `-CompoundStmt 0x7ffbe42df790 <col:9>
| `-CXXConstructorDecl 0x7ffbe42d3d38 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial
|-FieldDecl 0x7ffbe5209838 <col:9> col:9 implicit referenced 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
|-IndirectFieldDecl 0x7ffbe5209890 <line:742:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-Field 0x7ffbe5209838 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| `-Field 0x7ffbe52094f8 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-IndirectFieldDecl 0x7ffbe52098e0 <line:743:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-Field 0x7ffbe5209838 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| `-Field 0x7ffbe5209550 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-IndirectFieldDecl 0x7ffbe5209930 <line:744:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-Field 0x7ffbe5209838 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| `-Field 0x7ffbe52097d0 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
|-CXXDestructorDecl 0x7ffbe417dab8 <line:738:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7ffbe42d1cd8 <col:12> col:12 implicit constexpr __rep 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &)' inline default trivial noexcept-unevaluated 0x7ffbe42d1cd8
| `-ParmVarDecl 0x7ffbe42d1e00 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
|-CXXConstructorDecl 0x7ffbe42d2d18 <col:12> col:12 implicit used constexpr __rep 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7ffbe42d2e40 <col:12> col:12 used 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&'
| |-CXXCtorInitializer Field 0x7ffbe5209838 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | `-CXXConstructExpr 0x7ffbe42df7a8 <col:12> 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)' 'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept'
| |   `-MemberExpr 0x7ffbe42df758 <col:12> 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)' xvalue . 0x7ffbe5209838
| |     `-CXXStaticCastExpr 0x7ffbe42df728 <col:12> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' xvalue static_cast<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&> <NoOp>
| |       `-DeclRefExpr 0x7ffbe42df6f0 <col:12> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue ParmVar 0x7ffbe42d2e40 '' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&'
| `-CompoundStmt 0x7ffbe42df810 <col:12>
`-CXXConstructorDecl 0x7ffbe42d39b0 <col:12> col:12 implicit referenced __rep 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffbe520b0d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2209:1, line:2264:1> line:2210:7 class __libcpp_compressed_pair_imp definition
|-private 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-TemplateArgument integral 2
|-CXXRecordDecl 0x7ffbe520b4f8 prev 0x7ffbe520b0d8 <col:1, col:7> col:7 implicit class __libcpp_compressed_pair_imp
|-AccessSpecDecl 0x7ffbe520b590 <line:2213:1, col:8> col:1 private
|-FieldDecl 0x7ffbe520b5c8 <line:2214:5, col:9> col:9 referenced __first_ 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-AccessSpecDecl 0x7ffbe520b610 <line:2215:1, col:7> col:1 public
|-TypedefDecl 0x7ffbe520b648 <line:2216:5, col:17> col:17 referenced _T1_param 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-SubstTemplateTypeParmType 0x7ffbe520b380 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|   |-TemplateTypeParmType 0x7ffbe5a06ba0 '_T1' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7ffbe5a06b60 '_T1'
|   `-RecordType 0x7ffbe5207080 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|     `-CXXRecord 0x7ffbe5206fe0 '__rep'
|-TypedefDecl 0x7ffbe520b6b0 <line:2217:5, col:17> col:17 referenced _T2_param 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7ffbe520b3c0 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7ffbe5a06c10 '_T2' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7ffbe5a06bc8 '_T2'
|   `-RecordType 0x7ffbe405bf90 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7ffbe405bea8 'allocator'
|-TypedefDecl 0x7ffbe520bba0 <line:2219:5, col:51> col:51 referenced _T1_reference 'typename remove_reference<struct __rep>::type &'
| `-LValueReferenceType 0x7ffbe520bb50 'typename remove_reference<struct __rep>::type &'
|   `-ElaboratedType 0x7ffbe520baf0 'typename remove_reference<struct __rep>::type' sugar
|     `-TypedefType 0x7ffbe520bad0 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|       |-Typedef 0x7ffbe520ba58 'type'
|       `-SubstTemplateTypeParmType 0x7ffbe520ba20 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|         |-TemplateTypeParmType 0x7ffbe58450b0 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7ffbe5845070 '_Tp'
|         `-RecordType 0x7ffbe5207080 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|           `-CXXRecord 0x7ffbe5206fe0 '__rep'
|-TypedefDecl 0x7ffbe520bc38 <line:2220:5, col:57> col:57 referenced _T2_reference 'class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7ffbe520bc00 'class std::__1::allocator<char> &'
|   `-SubstTemplateTypeParmType 0x7ffbe520b3c0 'class std::__1::allocator<char>' sugar
|     |-TemplateTypeParmType 0x7ffbe5a06c10 '_T2' dependent depth 0 index 1
|     | `-TemplateTypeParm 0x7ffbe5a06bc8 '_T2'
|     `-RecordType 0x7ffbe405bf90 'class std::__1::allocator<char>'
|       `-ClassTemplateSpecialization 0x7ffbe405bea8 'allocator'
|-TypedefDecl 0x7ffbe520bdf0 <line:2222:5, col:57> col:57 referenced _T1_const_reference 'const typename remove_reference<struct __rep>::type &'
| `-LValueReferenceType 0x7ffbe520bda0 'const typename remove_reference<struct __rep>::type &'
|   `-QualType 0x7ffbe520bd41 'const typename remove_reference<struct __rep>::type' const
|     `-ElaboratedType 0x7ffbe520bd40 'typename remove_reference<struct __rep>::type' sugar
|       `-TypedefType 0x7ffbe520bad0 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|         |-Typedef 0x7ffbe520ba58 'type'
|         `-SubstTemplateTypeParmType 0x7ffbe520ba20 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|           |-TemplateTypeParmType 0x7ffbe58450b0 '_Tp' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x7ffbe5845070 '_Tp'
|           `-RecordType 0x7ffbe5207080 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|             `-CXXRecord 0x7ffbe5206fe0 '__rep'
|-TypedefDecl 0x7ffbe520be88 <line:2223:5, col:63> col:63 referenced _T2_const_reference 'const class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7ffbe520be50 'const class std::__1::allocator<char> &'
|   `-QualType 0x7ffbe520b3c1 'const class std::__1::allocator<char>' const
|     `-SubstTemplateTypeParmType 0x7ffbe520b3c0 'class std::__1::allocator<char>' sugar
|       |-TemplateTypeParmType 0x7ffbe5a06c10 '_T2' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x7ffbe5a06bc8 '_T2'
|       `-RecordType 0x7ffbe405bf90 'class std::__1::allocator<char>'
|         `-ClassTemplateSpecialization 0x7ffbe405bea8 'allocator'
|-CXXConstructorDecl 0x7ffbe520bf20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2225:76> col:31 used __libcpp_compressed_pair_imp 'void (void)'
| |-CXXCtorInitializer 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| | `-CXXConstructExpr 0x7ffbe42d3f50 <col:31> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7ffbe520b5c8 '__first_' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| | `-CXXConstructExpr 0x7ffbe42d3ef8 <col:64, col:73> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' 'void (void) noexcept' zeroing
| |-CompoundStmt 0x7ffbe5a09b28 <col:75, col:76>
| `-AlwaysInlineAttr 0x7ffbe520c008 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7ffbe520c1a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2227:54> line:2226:40 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param)'
| |-ParmVarDecl 0x7ffbe520c080 <col:69, col:79> col:79 __t1 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-AlwaysInlineAttr 0x7ffbe520c260 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7ffbe520c400 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2229:61> line:2228:40 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param)'
| |-ParmVarDecl 0x7ffbe520c2e0 <col:69, col:79> col:79 __t2 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7ffbe520c4c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7ffbe520c6d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2233:92> line:2230:31 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param, std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param)' noexcept-uninstantiated 0x7ffbe5a07fa8
| |-ParmVarDecl 0x7ffbe520c518 <col:60, col:70> col:70 __t1 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| |-ParmVarDecl 0x7ffbe520c588 <col:76, col:86> col:86 __t2 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7ffbe520c7f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7ffbe520d1f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2237:5, line:2247:14> line:2239:9 __libcpp_compressed_pair_imp
| |-TemplateTypeParmDecl 0x7ffbe520c838 <line:2237:15, col:24> col:24 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7ffbe520c8a8 <col:32, col:41> col:41 class depth 0 index 1 ... _Args2
| |-NonTypeTemplateParmDecl 0x7ffbe520c918 <col:49, col:59> col:59 referenced 'size_t':'unsigned long' depth 0 index 2 ... _I1
| |-NonTypeTemplateParmDecl 0x7ffbe520c970 <col:64, col:74> col:74 referenced 'size_t':'unsigned long' depth 0 index 3 ... _I2
| `-CXXConstructorDecl 0x7ffbe520d150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2247:14> line:2239:9 __libcpp_compressed_pair_imp 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>, __tuple_indices<_I1...>, __tuple_indices<_I2...>)'
|   |-ParmVarDecl 0x7ffbe520c9f8 <col:38> col:59 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7ffbe520cb68 <line:2240:38, col:55> col:55 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7ffbe520ccd8 <line:2241:38, col:55> col:55 __second_args 'tuple<_Args2...>'
|   |-ParmVarDecl 0x7ffbe520ce28 <line:2242:38, col:60> col:61 '__tuple_indices<_I1...>'
|   |-ParmVarDecl 0x7ffbe520cfc8 <line:2243:38, col:60> col:61 '__tuple_indices<_I2...>'
|   `-AlwaysInlineAttr 0x7ffbe520d270 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe520d3e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2251:92> col:51 used first 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_reference (void) noexcept'
| |-CompoundStmt 0x7ffbe42d9d80 <col:75, col:92>
| | `-ReturnStmt 0x7ffbe42d9d68 <col:76, col:83>
| |   `-MemberExpr 0x7ffbe42d9d30 <col:83> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue ->__first_ 0x7ffbe520b5c8
| |     `-CXXThisExpr 0x7ffbe42d9d18 <col:83> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7ffbe520d490 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe520d588 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2252:92> col:51 used first 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_const_reference (void) const noexcept'
| |-CompoundStmt 0x7ffbe42ddd00 <col:75, col:92>
| | `-ReturnStmt 0x7ffbe42ddce8 <col:76, col:83>
| |   `-MemberExpr 0x7ffbe42ddcb0 <col:83> 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue ->__first_ 0x7ffbe520b5c8
| |     `-CXXThisExpr 0x7ffbe42ddc98 <col:83> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7ffbe520d630 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe520d728 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2254:90> col:51 used second 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_reference (void) noexcept'
| |-CompoundStmt 0x7ffbe42dc3b0 <col:76, col:90>
| | `-ReturnStmt 0x7ffbe42dc398 <col:77, col:85>
| |   `-ImplicitCastExpr 0x7ffbe42dc378 <col:84, col:85> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' lvalue <DerivedToBase (allocator)>
| |     `-UnaryOperator 0x7ffbe42dc358 <col:84, col:85> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue prefix '*'
| |       `-CXXThisExpr 0x7ffbe42dc340 <col:85> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7ffbe520d7d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe520d8c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2255:90> col:51 used second 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_const_reference (void) const noexcept'
| |-CompoundStmt 0x7ffbe42d97c8 <col:76, col:90>
| | `-ReturnStmt 0x7ffbe42d97b0 <col:77, col:85>
| |   `-ImplicitCastExpr 0x7ffbe42d9790 <col:84, col:85> 'const class std::__1::allocator<char>':'const class std::__1::allocator<char>' lvalue <DerivedToBase (allocator)>
| |     `-UnaryOperator 0x7ffbe42d9770 <col:84, col:85> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue prefix '*'
| |       `-CXXThisExpr 0x7ffbe42d9758 <col:85> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7ffbe520d970 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe520db10 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2263:5> line:2257:36 swap 'void (class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &)' noexcept-uninstantiated 0x7ffbe5a093a8
| |-ParmVarDecl 0x7ffbe520d9f8 <col:41, col:71> col:71 __x 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &'
| `-AlwaysInlineAttr 0x7ffbe520dc08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7ffbe417d8f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2210:7> col:7 implicit ~__libcpp_compressed_pair_imp 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7ffbe42d2ea8 <col:7> col:7 implicit constexpr __libcpp_compressed_pair_imp 'void (const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &)' inline default trivial noexcept-unevaluated 0x7ffbe42d2ea8
| `-ParmVarDecl 0x7ffbe42d2fd0 <col:7> col:7 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &'
`-CXXConstructorDecl 0x7ffbe42d30a0 <col:7> col:7 implicit used constexpr __libcpp_compressed_pair_imp 'void (class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&) noexcept' inline default trivial
  |-ParmVarDecl 0x7ffbe42d31d0 <col:7> col:7 used 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&'
  |-CXXCtorInitializer 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
  | `-CXXConstructExpr 0x7ffbe42df5c8 <col:7> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' 'void (class std::__1::allocator<char> &&) noexcept'
  |   `-ImplicitCastExpr 0x7ffbe42df558 <col:7> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' xvalue <UncheckedDerivedToBase (allocator)>
  |     `-CXXStaticCastExpr 0x7ffbe42df528 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' xvalue static_cast<class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&> <NoOp>
  |       `-DeclRefExpr 0x7ffbe42df4f0 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue ParmVar 0x7ffbe42d31d0 '' 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&'
  |-CXXCtorInitializer Field 0x7ffbe520b5c8 '__first_' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
  | `-CXXConstructExpr 0x7ffbe42df828 <col:7> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&) noexcept'
  |   `-MemberExpr 0x7ffbe42df6a0 <col:7> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' xvalue .__first_ 0x7ffbe520b5c8
  |     `-CXXStaticCastExpr 0x7ffbe42df670 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' xvalue static_cast<class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&> <NoOp>
  |       `-DeclRefExpr 0x7ffbe42df638 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue ParmVar 0x7ffbe42d31d0 '' 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&'
  `-CompoundStmt 0x7ffbe42df898 <col:7>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__libcpp_compressed_pair_imp" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  NonVirtualBaseLLVMType:%"class.std::__1::__libcpp_compressed_pair_imp" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffbe52070d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2317:1, line:2363:1> line:2318:7 class __compressed_pair definition
|-private '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-CXXRecordDecl 0x7ffbe520dca0 prev 0x7ffbe52070d0 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7ffbe5210708 <line:2321:5, col:52> col:52 base '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
| `-TemplateSpecializationType 0x7ffbe5210660 '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >' sugar __libcpp_compressed_pair_imp
|   |-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|   |-TemplateArgument type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|   `-RecordType 0x7ffbe520b1f0 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
|     `-ClassTemplateSpecialization 0x7ffbe520b0d8 '__libcpp_compressed_pair_imp'
|-AccessSpecDecl 0x7ffbe5210760 <line:2322:1, col:7> col:1 public
|-TypedefDecl 0x7ffbe5210840 <line:2323:5, col:38> col:38 _T1_param 'typename base::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-ElaboratedType 0x7ffbe52107f0 'typename base::_T1_param' sugar
|   `-TypedefType 0x7ffbe520c050 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param' sugar
|     |-Typedef 0x7ffbe520b648 '_T1_param'
|     `-SubstTemplateTypeParmType 0x7ffbe520b380 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|       |-TemplateTypeParmType 0x7ffbe5a06ba0 '_T1' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7ffbe5a06b60 '_T1'
|       `-RecordType 0x7ffbe5207080 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|         `-CXXRecord 0x7ffbe5206fe0 '__rep'
|-TypedefDecl 0x7ffbe5210910 <line:2324:5, col:38> col:38 _T2_param 'typename base::_T2_param':'class std::__1::allocator<char>'
| `-ElaboratedType 0x7ffbe52108c0 'typename base::_T2_param' sugar
|   `-TypedefType 0x7ffbe520c2b0 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param' sugar
|     |-Typedef 0x7ffbe520b6b0 '_T2_param'
|     `-SubstTemplateTypeParmType 0x7ffbe520b3c0 'class std::__1::allocator<char>' sugar
|       |-TemplateTypeParmType 0x7ffbe5a06c10 '_T2' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x7ffbe5a06bc8 '_T2'
|       `-RecordType 0x7ffbe405bf90 'class std::__1::allocator<char>'
|         `-ClassTemplateSpecialization 0x7ffbe405bea8 'allocator'
|-TypedefDecl 0x7ffbe52109e0 <line:2326:5, col:42> col:42 _T1_reference 'typename base::_T1_reference':'typename remove_reference<struct __rep>::type &'
| `-ElaboratedType 0x7ffbe5210990 'typename base::_T1_reference' sugar
|   `-TypedefType 0x7ffbe520d340 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_reference' sugar
|     |-Typedef 0x7ffbe520bba0 '_T1_reference'
|     `-LValueReferenceType 0x7ffbe520bb50 'typename remove_reference<struct __rep>::type &'
|       `-ElaboratedType 0x7ffbe520baf0 'typename remove_reference<struct __rep>::type' sugar
|         `-TypedefType 0x7ffbe520bad0 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|           |-Typedef 0x7ffbe520ba58 'type'
|           `-SubstTemplateTypeParmType 0x7ffbe520ba20 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|             |-TemplateTypeParmType 0x7ffbe58450b0 '_Tp' dependent depth 0 index 0
|             | `-TemplateTypeParm 0x7ffbe5845070 '_Tp'
|             `-RecordType 0x7ffbe5207080 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|               `-CXXRecord 0x7ffbe5206fe0 '__rep'
|-TypedefDecl 0x7ffbe5210ab0 <line:2327:5, col:42> col:42 _T2_reference 'typename base::_T2_reference':'class std::__1::allocator<char> &'
| `-ElaboratedType 0x7ffbe5210a60 'typename base::_T2_reference' sugar
|   `-TypedefType 0x7ffbe520d680 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_reference' sugar
|     |-Typedef 0x7ffbe520bc38 '_T2_reference'
|     `-LValueReferenceType 0x7ffbe520bc00 'class std::__1::allocator<char> &'
|       `-SubstTemplateTypeParmType 0x7ffbe520b3c0 'class std::__1::allocator<char>' sugar
|         |-TemplateTypeParmType 0x7ffbe5a06c10 '_T2' dependent depth 0 index 1
|         | `-TemplateTypeParm 0x7ffbe5a06bc8 '_T2'
|         `-RecordType 0x7ffbe405bf90 'class std::__1::allocator<char>'
|           `-ClassTemplateSpecialization 0x7ffbe405bea8 'allocator'
|-TypedefDecl 0x7ffbe5210b80 <line:2329:5, col:48> col:48 _T1_const_reference 'typename base::_T1_const_reference':'const typename remove_reference<struct __rep>::type &'
| `-ElaboratedType 0x7ffbe5210b30 'typename base::_T1_const_reference' sugar
|   `-TypedefType 0x7ffbe520d4e0 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_const_reference' sugar
|     |-Typedef 0x7ffbe520bdf0 '_T1_const_reference'
|     `-LValueReferenceType 0x7ffbe520bda0 'const typename remove_reference<struct __rep>::type &'
|       `-QualType 0x7ffbe520bd41 'const typename remove_reference<struct __rep>::type' const
|         `-ElaboratedType 0x7ffbe520bd40 'typename remove_reference<struct __rep>::type' sugar
|           `-TypedefType 0x7ffbe520bad0 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|             |-Typedef 0x7ffbe520ba58 'type'
|             `-SubstTemplateTypeParmType 0x7ffbe520ba20 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|               |-TemplateTypeParmType 0x7ffbe58450b0 '_Tp' dependent depth 0 index 0
|               | `-TemplateTypeParm 0x7ffbe5845070 '_Tp'
|               `-RecordType 0x7ffbe5207080 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|                 `-CXXRecord 0x7ffbe5206fe0 '__rep'
|-TypedefDecl 0x7ffbe5210c50 <line:2330:5, col:48> col:48 _T2_const_reference 'typename base::_T2_const_reference':'const class std::__1::allocator<char> &'
| `-ElaboratedType 0x7ffbe5210c00 'typename base::_T2_const_reference' sugar
|   `-TypedefType 0x7ffbe520d820 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_const_reference' sugar
|     |-Typedef 0x7ffbe520be88 '_T2_const_reference'
|     `-LValueReferenceType 0x7ffbe520be50 'const class std::__1::allocator<char> &'
|       `-QualType 0x7ffbe520b3c1 'const class std::__1::allocator<char>' const
|         `-SubstTemplateTypeParmType 0x7ffbe520b3c0 'class std::__1::allocator<char>' sugar
|           |-TemplateTypeParmType 0x7ffbe5a06c10 '_T2' dependent depth 0 index 1
|           | `-TemplateTypeParm 0x7ffbe5a06bc8 '_T2'
|           `-RecordType 0x7ffbe405bf90 'class std::__1::allocator<char>'
|             `-ClassTemplateSpecialization 0x7ffbe405bea8 'allocator'
|-CXXConstructorDecl 0x7ffbe5210ce8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2332:52> col:31 used __compressed_pair 'void (void)'
| |-CXXCtorInitializer '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
| | `-CXXConstructExpr 0x7ffbe42d38c0 <col:31> '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' 'void (void)'
| |-CompoundStmt 0x7ffbe4033230 <col:51, col:52>
| `-AlwaysInlineAttr 0x7ffbe5210dc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7ffbe5210f20 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2334:50> line:2333:40 __compressed_pair 'void (std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param)'
| |-ParmVarDecl 0x7ffbe5210e40 <col:58, col:68> col:68 __t1 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-AlwaysInlineAttr 0x7ffbe5210fe0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7ffbe5211140 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2336:50> line:2335:40 __compressed_pair 'void (std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param)'
| |-ParmVarDecl 0x7ffbe5211060 <col:58, col:68> col:68 __t2 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7ffbe5211200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7ffbe52113c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2338:83> line:2337:31 __compressed_pair 'void (std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param, std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param)'
| |-ParmVarDecl 0x7ffbe5211258 <col:49, col:59> col:59 __t1 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| |-ParmVarDecl 0x7ffbe52112c8 <col:65, col:75> col:75 __t2 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7ffbe5211488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7ffbe5211aa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2342:5, line:2349:14> line:2344:9 __compressed_pair
| |-TemplateTypeParmDecl 0x7ffbe52114d0 <line:2342:15, col:24> col:24 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7ffbe5211538 <col:32, col:41> col:41 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7ffbe5211a00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2349:14> line:2344:9 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7ffbe52115c8 <col:27, col:49> col:49 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7ffbe5211738 <col:55, col:72> col:72 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7ffbe52118a8 <line:2345:55, col:72> col:72 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7ffbe5211b10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe5211c58 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2353:97> col:51 used first 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_reference (void) noexcept'
| |-CompoundStmt 0x7ffbe42d9cf8 <col:75, col:97>
| | `-ReturnStmt 0x7ffbe42d9ce0 <col:76, col:95>
| |   `-CXXMemberCallExpr 0x7ffbe42d9c98 <col:83, col:95> 'typename remove_reference<struct __rep>::type':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue
| |     `-MemberExpr 0x7ffbe42d9c48 <col:83, col:89> '<bound member function type>' ->first 0x7ffbe520d3e8
| |       `-ImplicitCastExpr 0x7ffbe42d9cc0 <col:83> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |         `-CXXThisExpr 0x7ffbe42d9c30 <col:83> 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7ffbe5211d00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe5211dc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2354:97> col:51 used first 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_const_reference (void) const noexcept'
| |-CompoundStmt 0x7ffbe42ddc78 <col:75, col:97>
| | `-ReturnStmt 0x7ffbe42ddc60 <col:76, col:95>
| |   `-CXXMemberCallExpr 0x7ffbe42ddc00 <col:83, col:95> 'const typename remove_reference<struct __rep>::type':'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue
| |     `-MemberExpr 0x7ffbe42ddbb0 <col:83, col:89> '<bound member function type>' ->first 0x7ffbe520d588
| |       `-ImplicitCastExpr 0x7ffbe42ddc48 <col:83> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' <NoOp>
| |         `-ImplicitCastExpr 0x7ffbe42ddc28 <col:83> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |           `-CXXThisExpr 0x7ffbe42ddb98 <col:83> 'const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7ffbe5211e70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe5211f38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2356:99> col:51 used second 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_reference (void) noexcept'
| |-CompoundStmt 0x7ffbe42dc320 <col:76, col:99>
| | `-ReturnStmt 0x7ffbe42dc308 <col:77, col:97>
| |   `-CXXMemberCallExpr 0x7ffbe42dc2c0 <col:84, col:97> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' lvalue
| |     `-MemberExpr 0x7ffbe42dc270 <col:84, col:90> '<bound member function type>' ->second 0x7ffbe520d728
| |       `-ImplicitCastExpr 0x7ffbe42dc2e8 <col:84> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |         `-CXXThisExpr 0x7ffbe42dc258 <col:84> 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7ffbe5211fe0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe52120a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2357:99> col:51 used second 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_const_reference (void) const noexcept'
| |-CompoundStmt 0x7ffbe42d9738 <col:76, col:99>
| | `-ReturnStmt 0x7ffbe42d9720 <col:77, col:97>
| |   `-CXXMemberCallExpr 0x7ffbe42d9668 <col:84, col:97> 'const class std::__1::allocator<char>':'const class std::__1::allocator<char>' lvalue
| |     `-MemberExpr 0x7ffbe42d9618 <col:84, col:90> '<bound member function type>' ->second 0x7ffbe520d8c8
| |       `-ImplicitCastExpr 0x7ffbe42d9708 <col:84> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' <NoOp>
| |         `-ImplicitCastExpr 0x7ffbe42d96e8 <col:84> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |           `-CXXThisExpr 0x7ffbe42d9600 <col:84> 'const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7ffbe5212150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7ffbe52122f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2362:26> line:2359:36 swap 'void (class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &)' noexcept-uninstantiated 0x7ffbe4032e58
| |-ParmVarDecl 0x7ffbe52121d8 <col:41, col:60> col:60 __x 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &'
| `-AlwaysInlineAttr 0x7ffbe52123e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7ffbe417d818 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2318:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7ffbe42d3238 <col:7> col:7 implicit constexpr __compressed_pair 'void (const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &)' inline default trivial noexcept-unevaluated 0x7ffbe42d3238
| `-ParmVarDecl 0x7ffbe42d3360 <col:7> col:7 'const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &'
`-CXXConstructorDecl 0x7ffbe42d33f8 <col:7> col:7 implicit used constexpr __compressed_pair 'void (class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &&) noexcept' inline default trivial
  |-ParmVarDecl 0x7ffbe42d3520 <col:7> col:7 used 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &&'
  |-CXXCtorInitializer '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
  | `-CXXConstructExpr 0x7ffbe42df8b0 <col:7> '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' 'void (class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&) noexcept'
  |   `-ImplicitCastExpr 0x7ffbe42df4d0 <col:7> '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' xvalue <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
  |     `-CXXStaticCastExpr 0x7ffbe42df4a0 <col:7> 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >' xvalue static_cast<class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &&> <NoOp>
  |       `-DeclRefExpr 0x7ffbe42df468 <col:7> 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >' lvalue ParmVar 0x7ffbe42d3520 '' 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &&'
  `-CompoundStmt 0x7ffbe42df980 <col:7>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair" = type { %"class.std::__1::__libcpp_compressed_pair_imp" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair" = type { %"class.std::__1::__libcpp_compressed_pair_imp" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7ffbe40611a8 parent 0x7ffbe405a288 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:4036:81> col:64 class basic_string definition
|-private '__basic_string_common<true>':'class std::__1::__basic_string_common<true>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-VisibilityAttr 0x7ffbe5b8d238 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
