
*** Dumping AST Record Layout
         0 | struct B1 (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct D1 (empty)
         0 |   struct B1 (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct B2
         0 |   (B2 vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct D2
         0 |   struct B2 (primary base)
         0 |     (B2 vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct B3
         0 |   (B3 vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct B4
         0 |   (B4 vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct D3
         0 |   struct B3 (primary base)
         0 |     (B3 vtable pointer)
         8 |   struct B4 (base)
         8 |     (B4 vtable pointer)
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct B5
         0 |   (B5 vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class X
         0 |   struct B5 (primary virtual base)
         0 |     (B5 vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class Y
         0 |   struct B5 (primary virtual base)
         0 |     (B5 vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct D4
         0 |   class X (primary base)
         8 |   class Y (base)
         0 |   struct B5 (virtual base)
         0 |     (B5 vtable pointer)
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc72900ee58 <object_model/4_functions/06_pointer_to_member_functions.cpp:2:1, line:4:1> line:2:8 referenced struct B1 definition
|-CXXRecordDecl 0x7fc72900ef78 <col:1, col:8> col:8 implicit struct B1
|-CXXMethodDecl 0x7fc72900f090 <line:3:5, col:15> col:10 used m 'void (void)'
| `-CompoundStmt 0x7fc72900f148 <col:14, col:15>
|-CXXConstructorDecl 0x7fc729802188 <line:2:8> col:8 implicit constexpr B1 'void (void) noexcept' inline default trivial
|-CXXDestructorDecl 0x7fc729802268 <col:8> col:8 implicit ~B1 'void (void)' inline default trivial noexcept-unevaluated 0x7fc729802268
|-CXXConstructorDecl 0x7fc7298023a8 <col:8> col:8 implicit constexpr B1 'void (const struct B1 &)' inline default trivial noexcept-unevaluated 0x7fc7298023a8
| `-ParmVarDecl 0x7fc7298024d0 <col:8> col:8 'const struct B1 &'
`-CXXConstructorDecl 0x7fc729802568 <col:8> col:8 implicit constexpr B1 'void (struct B1 &&)' inline default trivial noexcept-unevaluated 0x7fc729802568
  `-ParmVarDecl 0x7fc729802690 <col:8> col:8 'struct B1 &&'

Layout: <CGRecordLayout
  LLVMType:%struct.B1 = type { i8 }
  NonVirtualBaseLLVMType:%struct.B1 = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc72900f160 <object_model/4_functions/06_pointer_to_member_functions.cpp:6:1, col:17> col:8 referenced struct D1 definition
|-public 'struct B1'
|-CXXRecordDecl 0x7fc72900f2c8 <col:1, col:8> col:8 implicit struct D1
|-CXXConstructorDecl 0x7fc729802080 <col:8> col:8 implicit referenced constexpr D1 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fc7298026f8 <col:8> col:8 implicit constexpr D1 'void (const struct D1 &)' inline default trivial noexcept-unevaluated 0x7fc7298026f8
| `-ParmVarDecl 0x7fc729803840 <col:8> col:8 'const struct D1 &'
`-CXXConstructorDecl 0x7fc7298038d8 <col:8> col:8 implicit constexpr D1 'void (struct D1 &&)' inline default trivial noexcept-unevaluated 0x7fc7298038d8
  `-ParmVarDecl 0x7fc729803a00 <col:8> col:8 'struct D1 &&'

Layout: <CGRecordLayout
  LLVMType:%struct.D1 = type { i8 }
  NonVirtualBaseLLVMType:%struct.D1 = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc72900f380 <object_model/4_functions/06_pointer_to_member_functions.cpp:9:1, line:11:1> line:9:8 referenced struct B2 definition
|-CXXRecordDecl 0x7fc72900f4a8 <col:1, col:8> col:8 implicit struct B2
|-CXXMethodDecl 0x7fc72900f588 <line:10:5, col:23> col:18 referenced m 'void (void)' virtual
| `-CompoundStmt 0x7fc72900faa8 <col:22, col:23>
|-CXXMethodDecl 0x7fc72900f678 <line:9:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct B2 &(const struct B2 &)' inline default noexcept-unevaluated 0x7fc72900f678
| `-ParmVarDecl 0x7fc72900f790 <col:8> col:8 'const struct B2 &'
|-CXXMethodDecl 0x7fc72900f828 <col:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct B2 &(struct B2 &&)' inline default noexcept-unevaluated 0x7fc72900f828
| `-ParmVarDecl 0x7fc72900f940 <col:8> col:8 'struct B2 &&'
|-CXXDestructorDecl 0x7fc72900f9c8 <col:8> col:8 implicit ~B2 'void (void)' inline default trivial noexcept-unevaluated 0x7fc72900f9c8
|-CXXConstructorDecl 0x7fc729804118 <col:8> col:8 implicit used constexpr B2 'void (void) noexcept' inline default
| `-CompoundStmt 0x7fc729806868 <col:8>
|-CXXConstructorDecl 0x7fc7298041f8 <col:8> col:8 implicit constexpr B2 'void (const struct B2 &)' inline default noexcept-unevaluated 0x7fc7298041f8
| `-ParmVarDecl 0x7fc729804320 <col:8> col:8 'const struct B2 &'
`-CXXConstructorDecl 0x7fc729804388 <col:8> col:8 implicit constexpr B2 'void (struct B2 &&)' inline default noexcept-unevaluated 0x7fc729804388
  `-ParmVarDecl 0x7fc7298044b0 <col:8> col:8 'struct B2 &&'

Layout: <CGRecordLayout
  LLVMType:%struct.B2 = type { i32 (...)** }
  NonVirtualBaseLLVMType:%struct.B2 = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc72900fac0 <object_model/4_functions/06_pointer_to_member_functions.cpp:13:1, col:17> col:8 referenced struct D2 definition
|-public 'struct B2'
|-CXXRecordDecl 0x7fc72900fc28 <col:1, col:8> col:8 implicit struct D2
|-CXXMethodDecl 0x7fc72900fd18 <col:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct D2 &(const struct D2 &)' inline default noexcept-unevaluated 0x7fc72900fd18
| `-ParmVarDecl 0x7fc729040240 <col:8> col:8 'const struct D2 &'
|-CXXMethodDecl 0x7fc7290402d8 <col:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct D2 &(struct D2 &&)' inline default noexcept-unevaluated 0x7fc7290402d8
| `-ParmVarDecl 0x7fc7290403f0 <col:8> col:8 'struct D2 &&'
|-CXXDestructorDecl 0x7fc729040478 <col:8> col:8 implicit ~D2 'void (void)' inline default trivial noexcept-unevaluated 0x7fc729040478
|-CXXConstructorDecl 0x7fc729804010 <col:8> col:8 implicit used constexpr D2 'void (void) noexcept' inline default
| |-CXXCtorInitializer 'struct B2'
| | `-CXXConstructExpr 0x7fc729806880 <col:8> 'struct B2' 'void (void) noexcept'
| `-CompoundStmt 0x7fc7298068f0 <col:8>
|-CXXConstructorDecl 0x7fc729804518 <col:8> col:8 implicit constexpr D2 'void (const struct D2 &)' inline default noexcept-unevaluated 0x7fc729804518
| `-ParmVarDecl 0x7fc729804640 <col:8> col:8 'const struct D2 &'
`-CXXConstructorDecl 0x7fc7298046a8 <col:8> col:8 implicit constexpr D2 'void (struct D2 &&)' inline default noexcept-unevaluated 0x7fc7298046a8
  `-ParmVarDecl 0x7fc729806800 <col:8> col:8 'struct D2 &&'

Layout: <CGRecordLayout
  LLVMType:%struct.D2 = type { %struct.B2 }
  NonVirtualBaseLLVMType:%struct.D2 = type { %struct.B2 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc729040558 <object_model/4_functions/06_pointer_to_member_functions.cpp:16:1, line:18:1> line:16:8 referenced struct B3 definition
|-CXXRecordDecl 0x7fc729040678 <col:1, col:8> col:8 implicit struct B3
|-CXXMethodDecl 0x7fc729040758 <line:17:5, col:23> col:18 referenced m 'void (void)' virtual
| `-CompoundStmt 0x7fc729040c78 <col:22, col:23>
|-CXXMethodDecl 0x7fc729040848 <line:16:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct B3 &(const struct B3 &)' inline default noexcept-unevaluated 0x7fc729040848
| `-ParmVarDecl 0x7fc729040960 <col:8> col:8 'const struct B3 &'
|-CXXMethodDecl 0x7fc7290409f8 <col:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct B3 &(struct B3 &&)' inline default noexcept-unevaluated 0x7fc7290409f8
| `-ParmVarDecl 0x7fc729040b10 <col:8> col:8 'struct B3 &&'
|-CXXDestructorDecl 0x7fc729040b98 <col:8> col:8 implicit ~B3 'void (void)' inline default trivial noexcept-unevaluated 0x7fc729040b98
|-CXXConstructorDecl 0x7fc729807168 <col:8> col:8 implicit used constexpr B3 'void (void) noexcept' inline default
| `-CompoundStmt 0x7fc729808ab8 <col:8>
|-CXXConstructorDecl 0x7fc729807348 <col:8> col:8 implicit constexpr B3 'void (const struct B3 &)' inline default noexcept-unevaluated 0x7fc729807348
| `-ParmVarDecl 0x7fc729807470 <col:8> col:8 'const struct B3 &'
`-CXXConstructorDecl 0x7fc7298074d8 <col:8> col:8 implicit constexpr B3 'void (struct B3 &&)' inline default noexcept-unevaluated 0x7fc7298074d8
  `-ParmVarDecl 0x7fc729807600 <col:8> col:8 'struct B3 &&'

Layout: <CGRecordLayout
  LLVMType:%struct.B3 = type { i32 (...)** }
  NonVirtualBaseLLVMType:%struct.B3 = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc729040c90 <object_model/4_functions/06_pointer_to_member_functions.cpp:20:1, line:22:1> line:20:8 referenced struct B4 definition
|-CXXRecordDecl 0x7fc729040db8 <col:1, col:8> col:8 implicit struct B4
|-CXXMethodDecl 0x7fc729040e98 <line:21:5, col:23> col:18 referenced m 'void (void)' virtual
| `-CompoundStmt 0x7fc7290413e8 <col:22, col:23>
|-CXXMethodDecl 0x7fc729040f88 <line:20:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct B4 &(const struct B4 &)' inline default noexcept-unevaluated 0x7fc729040f88
| `-ParmVarDecl 0x7fc7290410a0 <col:8> col:8 'const struct B4 &'
|-CXXMethodDecl 0x7fc729041138 <col:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct B4 &(struct B4 &&)' inline default noexcept-unevaluated 0x7fc729041138
| `-ParmVarDecl 0x7fc729041280 <col:8> col:8 'struct B4 &&'
|-CXXDestructorDecl 0x7fc729041308 <col:8> col:8 implicit ~B4 'void (void)' inline default trivial noexcept-unevaluated 0x7fc729041308
|-CXXConstructorDecl 0x7fc729807268 <col:8> col:8 implicit used constexpr B4 'void (void) noexcept' inline default
| `-CompoundStmt 0x7fc729808b38 <col:8>
|-CXXConstructorDecl 0x7fc729807668 <col:8> col:8 implicit constexpr B4 'void (const struct B4 &)' inline default noexcept-unevaluated 0x7fc729807668
| `-ParmVarDecl 0x7fc729807790 <col:8> col:8 'const struct B4 &'
`-CXXConstructorDecl 0x7fc729808600 <col:8> col:8 implicit constexpr B4 'void (struct B4 &&)' inline default noexcept-unevaluated 0x7fc729808600
  `-ParmVarDecl 0x7fc729808730 <col:8> col:8 'struct B4 &&'

Layout: <CGRecordLayout
  LLVMType:%struct.B4 = type { i32 (...)** }
  NonVirtualBaseLLVMType:%struct.B4 = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc729041400 <object_model/4_functions/06_pointer_to_member_functions.cpp:24:1, col:21> col:8 referenced struct D3 definition
|-public 'struct B3'
|-public 'struct B4'
|-CXXRecordDecl 0x7fc7290415a8 <col:1, col:8> col:8 implicit struct D3
|-CXXMethodDecl 0x7fc729041698 <col:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct D3 &(const struct D3 &)' inline default noexcept-unevaluated 0x7fc729041698
| `-ParmVarDecl 0x7fc7290417b0 <col:8> col:8 'const struct D3 &'
|-CXXMethodDecl 0x7fc729041848 <col:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct D3 &(struct D3 &&)' inline default noexcept-unevaluated 0x7fc729041848
| `-ParmVarDecl 0x7fc729041960 <col:8> col:8 'struct D3 &&'
|-CXXDestructorDecl 0x7fc7290419e8 <col:8> col:8 implicit ~D3 'void (void)' inline default trivial noexcept-unevaluated 0x7fc7290419e8
|-CXXConstructorDecl 0x7fc729807060 <col:8> col:8 implicit used constexpr D3 'void (void) noexcept' inline default
| |-CXXCtorInitializer 'struct B3'
| | `-CXXConstructExpr 0x7fc729808ad0 <col:8> 'struct B3' 'void (void) noexcept'
| |-CXXCtorInitializer 'struct B4'
| | `-CXXConstructExpr 0x7fc729808b50 <col:8> 'struct B4' 'void (void) noexcept'
| `-CompoundStmt 0x7fc729808bc8 <col:8>
|-CXXConstructorDecl 0x7fc729808798 <col:8> col:8 implicit constexpr D3 'void (const struct D3 &)' inline default noexcept-unevaluated 0x7fc729808798
| `-ParmVarDecl 0x7fc7298088c0 <col:8> col:8 'const struct D3 &'
`-CXXConstructorDecl 0x7fc729808928 <col:8> col:8 implicit constexpr D3 'void (struct D3 &&)' inline default noexcept-unevaluated 0x7fc729808928
  `-ParmVarDecl 0x7fc729808a50 <col:8> col:8 'struct D3 &&'

Layout: <CGRecordLayout
  LLVMType:%struct.D3 = type { %struct.B3, %struct.B4 }
  NonVirtualBaseLLVMType:%struct.D3 = type { %struct.B3, %struct.B4 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc729041ac8 <object_model/4_functions/06_pointer_to_member_functions.cpp:27:1, line:29:1> line:27:8 referenced struct B5 definition
|-CXXRecordDecl 0x7fc729041be8 <col:1, col:8> col:8 implicit struct B5
|-CXXMethodDecl 0x7fc729041cc8 <line:28:5, col:23> col:18 referenced m 'void (void)' virtual
| `-CompoundStmt 0x7fc7290421e8 <col:22, col:23>
|-CXXMethodDecl 0x7fc729041db8 <line:27:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct B5 &(const struct B5 &)' inline default noexcept-unevaluated 0x7fc729041db8
| `-ParmVarDecl 0x7fc729041ed0 <col:8> col:8 'const struct B5 &'
|-CXXMethodDecl 0x7fc729041f68 <col:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct B5 &(struct B5 &&)' inline default noexcept-unevaluated 0x7fc729041f68
| `-ParmVarDecl 0x7fc729042080 <col:8> col:8 'struct B5 &&'
|-CXXDestructorDecl 0x7fc729042108 <col:8> col:8 implicit ~B5 'void (void)' inline default trivial noexcept-unevaluated 0x7fc729042108
|-CXXConstructorDecl 0x7fc729809508 <col:8> col:8 implicit used constexpr B5 'void (void) noexcept' inline default
| `-CompoundStmt 0x7fc72980a788 <col:8>
|-CXXConstructorDecl 0x7fc729809e28 <col:8> col:8 implicit constexpr B5 'void (const struct B5 &)' inline default noexcept-unevaluated 0x7fc729809e28
| `-ParmVarDecl 0x7fc729809f50 <col:8> col:8 'const struct B5 &'
`-CXXConstructorDecl 0x7fc729809fb8 <col:8> col:8 implicit constexpr B5 'void (struct B5 &&)' inline default noexcept-unevaluated 0x7fc729809fb8
  `-ParmVarDecl 0x7fc72980a0e0 <col:8> col:8 'struct B5 &&'

Layout: <CGRecordLayout
  LLVMType:%struct.B5 = type { i32 (...)** }
  NonVirtualBaseLLVMType:%struct.B5 = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc729042a00 <object_model/4_functions/06_pointer_to_member_functions.cpp:31:1, col:30> col:7 referenced class X definition
|-virtual public 'struct B5'
|-CXXRecordDecl 0x7fc729042b80 <col:1, col:7> col:7 implicit class X
|-CXXMethodDecl 0x7fc729042c78 <col:7, <invalid sloc>> col:7 implicit operator= 'class X &(const class X &)' inline default noexcept-unevaluated 0x7fc729042c78
| `-ParmVarDecl 0x7fc729042d90 <col:7> col:7 'const class X &'
|-CXXMethodDecl 0x7fc729042e28 <col:7, <invalid sloc>> col:7 implicit operator= 'class X &(class X &&)' inline default noexcept-unevaluated 0x7fc729042e28
| `-ParmVarDecl 0x7fc729042f40 <col:7> col:7 'class X &&'
|-CXXDestructorDecl 0x7fc729042fc8 <col:7> col:7 implicit ~X 'void (void)' inline default trivial noexcept-unevaluated 0x7fc729042fc8
|-CXXConstructorDecl 0x7fc729809408 <col:7> col:7 implicit used X 'void (void) noexcept' inline default
| |-CXXCtorInitializer 'struct B5'
| | `-CXXConstructExpr 0x7fc72980a808 <col:7> 'struct B5' 'void (void) noexcept'
| `-CompoundStmt 0x7fc72980a878 <col:7>
|-CXXConstructorDecl 0x7fc729809c98 <col:7> col:7 implicit X 'void (const class X &)' inline default noexcept-unevaluated 0x7fc729809c98
| `-ParmVarDecl 0x7fc729809dc0 <col:7> col:7 'const class X &'
`-CXXConstructorDecl 0x7fc72980a148 <col:7> col:7 implicit X 'void (class X &&)' inline default noexcept-unevaluated 0x7fc72980a148
  `-ParmVarDecl 0x7fc72980a270 <col:7> col:7 'class X &&'

Layout: <CGRecordLayout
  LLVMType:%class.X = type { %struct.B5 }
  NonVirtualBaseLLVMType:%class.X = type { %struct.B5 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc7290430a8 <object_model/4_functions/06_pointer_to_member_functions.cpp:33:1, col:30> col:7 referenced class Y definition
|-virtual public 'struct B5'
|-CXXRecordDecl 0x7fc729043220 <col:1, col:7> col:7 implicit class Y
|-CXXMethodDecl 0x7fc729043318 <col:7, <invalid sloc>> col:7 implicit operator= 'class Y &(const class Y &)' inline default noexcept-unevaluated 0x7fc729043318
| `-ParmVarDecl 0x7fc729043430 <col:7> col:7 'const class Y &'
|-CXXMethodDecl 0x7fc7290434c8 <col:7, <invalid sloc>> col:7 implicit operator= 'class Y &(class Y &&)' inline default noexcept-unevaluated 0x7fc7290434c8
| `-ParmVarDecl 0x7fc7290435e0 <col:7> col:7 'class Y &&'
|-CXXDestructorDecl 0x7fc729043668 <col:7> col:7 implicit ~Y 'void (void)' inline default trivial noexcept-unevaluated 0x7fc729043668
|-CXXConstructorDecl 0x7fc729809a20 <col:7> col:7 implicit used Y 'void (void) noexcept' inline default
| |-CXXCtorInitializer 'struct B5'
| | `-CXXConstructExpr 0x7fc72980a8f8 <col:7> 'struct B5' 'void (void) noexcept'
| `-CompoundStmt 0x7fc72980a968 <col:7>
|-CXXConstructorDecl 0x7fc72980a2d8 <col:7> col:7 implicit Y 'void (const class Y &)' inline default noexcept-unevaluated 0x7fc72980a2d8
| `-ParmVarDecl 0x7fc72980a400 <col:7> col:7 'const class Y &'
`-CXXConstructorDecl 0x7fc72980a468 <col:7> col:7 implicit Y 'void (class Y &&)' inline default noexcept-unevaluated 0x7fc72980a468
  `-ParmVarDecl 0x7fc72980a590 <col:7> col:7 'class Y &&'

Layout: <CGRecordLayout
  LLVMType:%class.Y = type { %struct.B5 }
  NonVirtualBaseLLVMType:%class.Y = type { %struct.B5 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc729043748 <object_model/4_functions/06_pointer_to_member_functions.cpp:35:1, col:19> col:8 referenced struct D4 definition
|-public 'class X'
|-public 'class Y'
|-CXXRecordDecl 0x7fc729043900 <col:1, col:8> col:8 implicit struct D4
|-CXXMethodDecl 0x7fc729801800 <col:8, <invalid sloc>> col:8 implicit operator= 'struct D4 &(const struct D4 &)' inline default noexcept-unevaluated 0x7fc729801800
| `-ParmVarDecl 0x7fc729801920 <col:8> col:8 'const struct D4 &'
|-CXXMethodDecl 0x7fc7298019b8 <col:8, <invalid sloc>> col:8 implicit operator= 'struct D4 &(struct D4 &&)' inline default noexcept-unevaluated 0x7fc7298019b8
| `-ParmVarDecl 0x7fc729801ad0 <col:8> col:8 'struct D4 &&'
|-CXXDestructorDecl 0x7fc729801b58 <col:8> col:8 implicit ~D4 'void (void)' inline default trivial noexcept-unevaluated 0x7fc729801b58
|-CXXConstructorDecl 0x7fc729809300 <col:8> col:8 implicit used D4 'void (void) noexcept' inline default
| |-CXXCtorInitializer 'struct B5'
| | `-CXXConstructExpr 0x7fc72980a7a0 <col:8> 'struct B5' 'void (void) noexcept'
| |-CXXCtorInitializer 'class X'
| | `-CXXConstructExpr 0x7fc72980a890 <col:8> 'class X' 'void (void) noexcept'
| |-CXXCtorInitializer 'class Y'
| | `-CXXConstructExpr 0x7fc72980a980 <col:8> 'class Y' 'void (void) noexcept'
| `-CompoundStmt 0x7fc72980b400 <col:8>
|-CXXConstructorDecl 0x7fc729809b08 <col:8> col:8 implicit D4 'void (const struct D4 &)' inline default noexcept-unevaluated 0x7fc729809b08
| `-ParmVarDecl 0x7fc729809c30 <col:8> col:8 'const struct D4 &'
`-CXXConstructorDecl 0x7fc72980a5f8 <col:8> col:8 implicit D4 'void (struct D4 &&)' inline default noexcept-unevaluated 0x7fc72980a5f8
  `-ParmVarDecl 0x7fc72980a720 <col:8> col:8 'struct D4 &&'

Layout: <CGRecordLayout
  LLVMType:%struct.D4 = type { %class.X, %class.Y }
  NonVirtualBaseLLVMType:%struct.D4 = type { %class.X, %class.Y }
  IsZeroInitializable:1
  BitFields:[
]>
