
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1507:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1504:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1507:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::once_flag
         0 |   unsigned long __state_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale::id
         0 |   struct std::__1::once_flag __flag_
         0 |     unsigned long __state_
         8 |   int32_t __id_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__basic_string_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>
         0 |   class std::__1::allocator<char> (base) (empty)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
         0 |   class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
         0 |     class std::__1::allocator<char> (base) (empty)
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<char>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |     class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
         0 |       class std::__1::allocator<char> (base) (empty)
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<wchar_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2>
         0 |   class std::__1::allocator<wchar_t> (base) (empty)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> >
         0 |   class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2> (base)
         0 |     class std::__1::allocator<wchar_t> (base) (empty)
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |           union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<wchar_t>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> > __r_
         0 |     class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2> (base)
         0 |       class std::__1::allocator<wchar_t> (base) (empty)
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |             union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::money_base::pattern
         0 |   char [4] field
           | [sizeof=4, dsize=4, align=1,
           |  nvsize=4, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__bitset<0, 0> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct B1
         0 |   (B1 vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct B2
         0 |   (B2 vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct X
         0 |   (X vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct Y
         0 |   (Y vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct D1
         0 |   struct B1 (primary base)
         0 |     (B1 vtable pointer)
         8 |   struct B2 (base)
         8 |     (B2 vtable pointer)
        16 |   struct X x
        16 |     (X vtable pointer)
        24 |   struct Y y
        24 |     (Y vtable pointer)
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd50e327208 <object_model_refined/5_ctor_dtor_semantics/03_object_construction_under_inheritance.cpp:3:1, line:13:1> line:3:8 referenced struct B1 definition
|-CXXRecordDecl 0x7fd50e327328 <col:1, col:8> col:8 implicit referenced struct B1
|-CXXConstructorDecl 0x7fd50e327428 <line:4:5, line:7:5> line:4:5 used B1 'void (void)'
| `-CompoundStmt 0x7fd50e329ec8 <line:5:5, line:7:5>
|   `-CXXOperatorCallExpr 0x7fd50e329e80 <line:6:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
|     |-ImplicitCastExpr 0x7fd50e329e68 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
|     | `-DeclRefExpr 0x7fd50e329de0 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7fd50e328910 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
|     |-DeclRefExpr 0x7fd50e327810 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7fd50e326cb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
|     `-ImplicitCastExpr 0x7fd50e329dc8 <col:22> 'const char *' <ArrayToPointerDecay>
|       `-StringLiteral 0x7fd50e327848 <col:22> 'const char [6]' lvalue "B1()\n"
|-CXXDestructorDecl 0x7fd50e327520 <line:9:5, line:12:5> line:9:13 used ~B1 'void (void) noexcept' virtual
| `-CompoundStmt 0x7fd50e32a8b0 <line:10:5, line:12:5>
|   `-CXXOperatorCallExpr 0x7fd50e32a868 <line:11:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
|     |-ImplicitCastExpr 0x7fd50e32a850 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
|     | `-DeclRefExpr 0x7fd50e32a828 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7fd50e328910 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
|     |-DeclRefExpr 0x7fd50e329f08 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7fd50e326cb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
|     `-ImplicitCastExpr 0x7fd50e32a810 <col:22> 'const char *' <ArrayToPointerDecay>
|       `-StringLiteral 0x7fd50e329f40 <col:22> 'const char [7]' lvalue "~B1()\n"
|-CXXMethodDecl 0x7fd50e327658 <line:3:8, <invalid sloc>> col:8 implicit operator= 'struct B1 &(const struct B1 &)' inline default noexcept-unevaluated 0x7fd50e327658
| `-ParmVarDecl 0x7fd50e327770 <col:8> col:8 'const struct B1 &'
`-CXXConstructorDecl 0x7fd50e32fd68 <col:8> col:8 implicit constexpr B1 'void (const struct B1 &)' inline default noexcept-unevaluated 0x7fd50e32fd68
  `-ParmVarDecl 0x7fd50e32fe90 <col:8> col:8 'const struct B1 &'

Layout: <CGRecordLayout
  LLVMType:%struct.B1 = type { i32 (...)** }
  NonVirtualBaseLLVMType:%struct.B1 = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd50e32a8d0 <object_model_refined/5_ctor_dtor_semantics/03_object_construction_under_inheritance.cpp:15:1, line:25:1> line:15:8 referenced struct B2 definition
|-CXXRecordDecl 0x7fd50e32a9f8 <col:1, col:8> col:8 implicit referenced struct B2
|-CXXConstructorDecl 0x7fd50e32aaf8 <line:16:5, line:19:5> line:16:5 used B2 'void (void)'
| `-CompoundStmt 0x7fd50e32b870 <line:17:5, line:19:5>
|   `-CXXOperatorCallExpr 0x7fd50e32b828 <line:18:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
|     |-ImplicitCastExpr 0x7fd50e32b810 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
|     | `-DeclRefExpr 0x7fd50e32b7e8 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7fd50e328910 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
|     |-DeclRefExpr 0x7fd50e32aec8 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7fd50e326cb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
|     `-ImplicitCastExpr 0x7fd50e32b7d0 <col:22> 'const char *' <ArrayToPointerDecay>
|       `-StringLiteral 0x7fd50e32af00 <col:22> 'const char [6]' lvalue "B2()\n"
|-CXXDestructorDecl 0x7fd50e32abf0 <line:21:5, line:24:5> line:21:13 used ~B2 'void (void) noexcept' virtual
| `-CompoundStmt 0x7fd50e32c260 <line:22:5, line:24:5>
|   `-CXXOperatorCallExpr 0x7fd50e32c218 <line:23:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
|     |-ImplicitCastExpr 0x7fd50e32c200 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
|     | `-DeclRefExpr 0x7fd50e32c1d8 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7fd50e328910 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
|     |-DeclRefExpr 0x7fd50e32b8b0 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7fd50e326cb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
|     `-ImplicitCastExpr 0x7fd50e32c1c0 <col:22> 'const char *' <ArrayToPointerDecay>
|       `-StringLiteral 0x7fd50e32b8e8 <col:22> 'const char [7]' lvalue "~B2()\n"
|-CXXMethodDecl 0x7fd50e32ad28 <line:15:8, <invalid sloc>> col:8 implicit operator= 'struct B2 &(const struct B2 &)' inline default noexcept-unevaluated 0x7fd50e32ad28
| `-ParmVarDecl 0x7fd50e32ae40 <col:8> col:8 'const struct B2 &'
`-CXXConstructorDecl 0x7fd50e32ff60 <col:8> col:8 implicit constexpr B2 'void (const struct B2 &)' inline default noexcept-unevaluated 0x7fd50e32ff60
  `-ParmVarDecl 0x7fd50e330090 <col:8> col:8 'const struct B2 &'

Layout: <CGRecordLayout
  LLVMType:%struct.B2 = type { i32 (...)** }
  NonVirtualBaseLLVMType:%struct.B2 = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd50e32c280 <object_model_refined/5_ctor_dtor_semantics/03_object_construction_under_inheritance.cpp:27:1, line:37:1> line:27:8 referenced struct X definition
|-CXXRecordDecl 0x7fd50e32c3a8 <col:1, col:8> col:8 implicit referenced struct X
|-CXXConstructorDecl 0x7fd50e32c4a8 <line:28:5, line:31:5> line:28:5 used X 'void (void)'
| `-CompoundStmt 0x7fd50e32d2a0 <line:29:5, line:31:5>
|   `-CXXOperatorCallExpr 0x7fd50e32d258 <line:30:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
|     |-ImplicitCastExpr 0x7fd50e32d240 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
|     | `-DeclRefExpr 0x7fd50e32d218 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7fd50e328910 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
|     |-DeclRefExpr 0x7fd50e32c878 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7fd50e326cb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
|     `-ImplicitCastExpr 0x7fd50e32d200 <col:22> 'const char *' <ArrayToPointerDecay>
|       `-StringLiteral 0x7fd50e32c928 <col:22> 'const char [5]' lvalue "X()\n"
|-CXXDestructorDecl 0x7fd50e32c5a0 <line:33:5, line:36:5> line:33:13 used ~X 'void (void) noexcept' virtual
| `-CompoundStmt 0x7fd50e32dc90 <line:34:5, line:36:5>
|   `-CXXOperatorCallExpr 0x7fd50e32dc48 <line:35:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
|     |-ImplicitCastExpr 0x7fd50e32dc30 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
|     | `-DeclRefExpr 0x7fd50e32dc08 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7fd50e328910 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
|     |-DeclRefExpr 0x7fd50e32d2e0 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7fd50e326cb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
|     `-ImplicitCastExpr 0x7fd50e32dbf0 <col:22> 'const char *' <ArrayToPointerDecay>
|       `-StringLiteral 0x7fd50e32d318 <col:22> 'const char [6]' lvalue "~X()\n"
|-CXXMethodDecl 0x7fd50e32c6d8 <line:27:8, <invalid sloc>> col:8 implicit operator= 'struct X &(const struct X &)' inline default noexcept-unevaluated 0x7fd50e32c6d8
| `-ParmVarDecl 0x7fd50e32c7f0 <col:8> col:8 'const struct X &'
`-CXXConstructorDecl 0x7fd50e330160 <col:8> col:8 implicit constexpr X 'void (const struct X &)' inline default noexcept-unevaluated 0x7fd50e330160
  `-ParmVarDecl 0x7fd50e330290 <col:8> col:8 'const struct X &'

Layout: <CGRecordLayout
  LLVMType:%struct.X = type { i32 (...)** }
  NonVirtualBaseLLVMType:%struct.X = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd50e32dcb0 <object_model_refined/5_ctor_dtor_semantics/03_object_construction_under_inheritance.cpp:39:1, line:49:1> line:39:8 referenced struct Y definition
|-CXXRecordDecl 0x7fd50e32ddd8 <col:1, col:8> col:8 implicit referenced struct Y
|-CXXConstructorDecl 0x7fd50e32ded8 <line:40:5, line:43:5> line:40:5 used Y 'void (void)'
| `-CompoundStmt 0x7fd50e32ec50 <line:41:5, line:43:5>
|   `-CXXOperatorCallExpr 0x7fd50e32ec08 <line:42:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
|     |-ImplicitCastExpr 0x7fd50e32ebf0 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
|     | `-DeclRefExpr 0x7fd50e32ebc8 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7fd50e328910 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
|     |-DeclRefExpr 0x7fd50e32e2a8 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7fd50e326cb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
|     `-ImplicitCastExpr 0x7fd50e32ebb0 <col:22> 'const char *' <ArrayToPointerDecay>
|       `-StringLiteral 0x7fd50e32e2e0 <col:22> 'const char [5]' lvalue "Y()\n"
|-CXXDestructorDecl 0x7fd50e32dfd0 <line:45:5, line:48:5> line:45:13 used ~Y 'void (void) noexcept' virtual
| `-CompoundStmt 0x7fd50e32f640 <line:46:5, line:48:5>
|   `-CXXOperatorCallExpr 0x7fd50e32f5f8 <line:47:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
|     |-ImplicitCastExpr 0x7fd50e32f5e0 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
|     | `-DeclRefExpr 0x7fd50e32f5b8 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7fd50e328910 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
|     |-DeclRefExpr 0x7fd50e32ec90 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7fd50e326cb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
|     `-ImplicitCastExpr 0x7fd50e32f5a0 <col:22> 'const char *' <ArrayToPointerDecay>
|       `-StringLiteral 0x7fd50e32ecc8 <col:22> 'const char [6]' lvalue "~Y()\n"
|-CXXMethodDecl 0x7fd50e32e108 <line:39:8, <invalid sloc>> col:8 implicit operator= 'struct Y &(const struct Y &)' inline default noexcept-unevaluated 0x7fd50e32e108
| `-ParmVarDecl 0x7fd50e32e220 <col:8> col:8 'const struct Y &'
`-CXXConstructorDecl 0x7fd50e330350 <col:8> col:8 implicit constexpr Y 'void (const struct Y &)' inline default noexcept-unevaluated 0x7fd50e330350
  `-ParmVarDecl 0x7fd50e330480 <col:8> col:8 'const struct Y &'

Layout: <CGRecordLayout
  LLVMType:%struct.Y = type { i32 (...)** }
  NonVirtualBaseLLVMType:%struct.Y = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd50e32f660 <object_model_refined/5_ctor_dtor_semantics/03_object_construction_under_inheritance.cpp:51:1, line:64:1> line:51:8 referenced struct D1 definition
|-public 'struct B1'
|-public 'struct B2'
|-CXXRecordDecl 0x7fd50e32f808 <col:1, col:8> col:8 implicit referenced struct D1
|-FieldDecl 0x7fd50e32f8b0 <line:52:5, col:7> col:7 x 'struct X'
|-FieldDecl 0x7fd50e32f908 <line:53:5, col:7> col:7 y 'struct Y'
|-CXXConstructorDecl 0x7fd50e32f9b8 <line:55:5, line:58:5> line:55:5 used D1 'void (void)'
| |-CXXCtorInitializer 'struct B1'
| | `-CXXConstructExpr 0x7fd50e32fef8 <col:5> 'struct B1' 'void (void)'
| |-CXXCtorInitializer 'struct B2'
| | `-CXXConstructExpr 0x7fd50e3300f8 <col:5> 'struct B2' 'void (void)'
| |-CXXCtorInitializer Field 0x7fd50e32f8b0 'x' 'struct X'
| | `-CXXConstructExpr 0x7fd50e3302f8 <col:5> 'struct X' 'void (void)'
| |-CXXCtorInitializer Field 0x7fd50e32f908 'y' 'struct Y'
| | `-CXXConstructExpr 0x7fd50e3304e8 <col:5> 'struct Y' 'void (void)'
| `-CompoundStmt 0x7fd50e330f30 <line:56:5, line:58:5>
|   `-CXXOperatorCallExpr 0x7fd50e330ee8 <line:57:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
|     |-ImplicitCastExpr 0x7fd50e330ed0 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
|     | `-DeclRefExpr 0x7fd50e330ea8 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7fd50e328910 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
|     |-DeclRefExpr 0x7fd50e330580 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7fd50e326cb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
|     `-ImplicitCastExpr 0x7fd50e330e90 <col:22> 'const char *' <ArrayToPointerDecay>
|       `-StringLiteral 0x7fd50e3305b8 <col:22> 'const char [5]' lvalue "D()\n"
|-CXXDestructorDecl 0x7fd50e32fab0 <line:60:5, line:63:5> line:60:5 used ~D1 'void (void) noexcept'
| `-CompoundStmt 0x7fd50e331920 <line:61:5, line:63:5>
|   `-CXXOperatorCallExpr 0x7fd50e3318d8 <line:62:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
|     |-ImplicitCastExpr 0x7fd50e3318c0 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
|     | `-DeclRefExpr 0x7fd50e331898 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7fd50e328910 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
|     |-DeclRefExpr 0x7fd50e330f70 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7fd50e326cb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
|     `-ImplicitCastExpr 0x7fd50e331880 <col:22> 'const char *' <ArrayToPointerDecay>
|       `-StringLiteral 0x7fd50e330fa8 <col:22> 'const char [6]' lvalue "~D()\n"
|-CXXMethodDecl 0x7fd50e32fbe8 <line:51:8, <invalid sloc>> col:8 implicit operator= 'struct D1 &(const struct D1 &)' inline default noexcept-unevaluated 0x7fd50e32fbe8
| `-ParmVarDecl 0x7fd50e32fd00 <col:8> col:8 'const struct D1 &'
`-CXXConstructorDecl 0x7fd50dc60ea0 <col:8> col:8 implicit constexpr D1 'void (const struct D1 &)' inline default noexcept-unevaluated 0x7fd50dc60ea0
  `-ParmVarDecl 0x7fd50dc60fd0 <col:8> col:8 'const struct D1 &'

Layout: <CGRecordLayout
  LLVMType:%struct.D1 = type { %struct.B1, %struct.B2, %struct.X, %struct.Y }
  NonVirtualBaseLLVMType:%struct.D1 = type { %struct.B1, %struct.B2, %struct.X, %struct.Y }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct B3
         0 |   struct B1 (primary virtual base)
         0 |     (B1 vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct B4
         0 |   struct B1 (primary virtual base)
         0 |     (B1 vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct D2
         0 |   struct B3 (primary base)
         8 |   struct B4 (base)
         0 |   struct B1 (virtual base)
         0 |     (B1 vtable pointer)
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd50e331940 <object_model_refined/5_ctor_dtor_semantics/03_object_construction_under_inheritance.cpp:66:1, line:75:1> line:66:8 referenced struct B3 definition
|-virtual public 'struct B1'
|-CXXRecordDecl 0x7fd50e331ac0 <col:1, col:8> col:8 implicit referenced struct B3
|-CXXConstructorDecl 0x7fd50e331bc8 <line:67:5, line:69:5> line:67:5 used B3 'void (void)'
| |-CXXCtorInitializer 'struct B1'
| | `-CXXConstructExpr 0x7fd50e331f78 <col:5> 'struct B1' 'void (void)'
| `-CompoundStmt 0x7fd50e3329b0 <col:10, line:69:5>
|   `-CXXOperatorCallExpr 0x7fd50e332968 <line:68:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
|     |-ImplicitCastExpr 0x7fd50e332950 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
|     | `-DeclRefExpr 0x7fd50e332928 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7fd50e328910 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
|     |-DeclRefExpr 0x7fd50e332008 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7fd50e326cb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
|     `-ImplicitCastExpr 0x7fd50e332910 <col:22> 'const char *' <ArrayToPointerDecay>
|       `-StringLiteral 0x7fd50e332040 <col:22> 'const char [6]' lvalue "B3()\n"
|-CXXDestructorDecl 0x7fd50e331cc0 <line:71:5, line:74:5> line:71:13 used ~B3 'void (void) noexcept' virtual
| `-CompoundStmt 0x7fd50e3333a0 <line:72:5, line:74:5>
|   `-CXXOperatorCallExpr 0x7fd50e333358 <line:73:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
|     |-ImplicitCastExpr 0x7fd50e333340 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
|     | `-DeclRefExpr 0x7fd50e333318 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7fd50e328910 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
|     |-DeclRefExpr 0x7fd50e3329f0 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7fd50e326cb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
|     `-ImplicitCastExpr 0x7fd50e333300 <col:22> 'const char *' <ArrayToPointerDecay>
|       `-StringLiteral 0x7fd50e332a28 <col:22> 'const char [7]' lvalue "~B3()\n"
|-CXXMethodDecl 0x7fd50e331df8 <line:66:8, <invalid sloc>> col:8 implicit operator= 'struct B3 &(const struct B3 &)' inline default noexcept-unevaluated 0x7fd50e331df8
| `-ParmVarDecl 0x7fd50e331f10 <col:8> col:8 'const struct B3 &'
`-CXXConstructorDecl 0x7fd50e335520 <col:8> col:8 implicit B3 'void (const struct B3 &)' inline default noexcept-unevaluated 0x7fd50e335520
  `-ParmVarDecl 0x7fd50e335650 <col:8> col:8 'const struct B3 &'

Layout: <CGRecordLayout
  LLVMType:%struct.B3 = type { %struct.B1 }
  NonVirtualBaseLLVMType:%struct.B3 = type { %struct.B1 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd50e3333c0 <object_model_refined/5_ctor_dtor_semantics/03_object_construction_under_inheritance.cpp:77:1, line:86:1> line:77:8 referenced struct B4 definition
|-virtual public 'struct B1'
|-CXXRecordDecl 0x7fd50e333540 <col:1, col:8> col:8 implicit referenced struct B4
|-CXXConstructorDecl 0x7fd50e333648 <line:78:5, line:80:5> line:78:5 used B4 'void (void)'
| |-CXXCtorInitializer 'struct B1'
| | `-CXXConstructExpr 0x7fd50e3339f8 <col:5> 'struct B1' 'void (void)'
| `-CompoundStmt 0x7fd50e334430 <col:10, line:80:5>
|   `-CXXOperatorCallExpr 0x7fd50e3343e8 <line:79:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
|     |-ImplicitCastExpr 0x7fd50e3343d0 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
|     | `-DeclRefExpr 0x7fd50e3343a8 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7fd50e328910 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
|     |-DeclRefExpr 0x7fd50e333a88 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7fd50e326cb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
|     `-ImplicitCastExpr 0x7fd50e334390 <col:22> 'const char *' <ArrayToPointerDecay>
|       `-StringLiteral 0x7fd50e333ac0 <col:22> 'const char [6]' lvalue "B4()\n"
|-CXXDestructorDecl 0x7fd50e333740 <line:82:5, line:85:5> line:82:13 used ~B4 'void (void) noexcept' virtual
| `-CompoundStmt 0x7fd50e334e20 <line:83:5, line:85:5>
|   `-CXXOperatorCallExpr 0x7fd50e334dd8 <line:84:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
|     |-ImplicitCastExpr 0x7fd50e334dc0 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
|     | `-DeclRefExpr 0x7fd50e334d98 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7fd50e328910 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
|     |-DeclRefExpr 0x7fd50e334470 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7fd50e326cb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
|     `-ImplicitCastExpr 0x7fd50e334d80 <col:22> 'const char *' <ArrayToPointerDecay>
|       `-StringLiteral 0x7fd50e3344a8 <col:22> 'const char [7]' lvalue "~B4()\n"
|-CXXMethodDecl 0x7fd50e333878 <line:77:8, <invalid sloc>> col:8 implicit operator= 'struct B4 &(const struct B4 &)' inline default noexcept-unevaluated 0x7fd50e333878
| `-ParmVarDecl 0x7fd50e333990 <col:8> col:8 'const struct B4 &'
`-CXXConstructorDecl 0x7fd50e335720 <col:8> col:8 implicit B4 'void (const struct B4 &)' inline default noexcept-unevaluated 0x7fd50e335720
  `-ParmVarDecl 0x7fd50e335850 <col:8> col:8 'const struct B4 &'

Layout: <CGRecordLayout
  LLVMType:%struct.B4 = type { %struct.B1 }
  NonVirtualBaseLLVMType:%struct.B4 = type { %struct.B1 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd50e334e40 <object_model_refined/5_ctor_dtor_semantics/03_object_construction_under_inheritance.cpp:88:1, line:97:1> line:88:8 referenced struct D2 definition
|-public 'struct B3'
|-public 'struct B4'
|-CXXRecordDecl 0x7fd50e335000 <col:1, col:8> col:8 implicit referenced struct D2
|-CXXConstructorDecl 0x7fd50e335108 <line:89:5, line:91:5> line:89:5 used D2 'void (void)'
| |-CXXCtorInitializer 'struct B1'
| | `-CXXConstructExpr 0x7fd50e3354b8 <col:5> 'struct B1' 'void (void)'
| |-CXXCtorInitializer 'struct B3'
| | `-CXXConstructExpr 0x7fd50e3356b8 <col:5> 'struct B3' 'void (void)'
| |-CXXCtorInitializer 'struct B4'
| | `-CXXConstructExpr 0x7fd50e3358b8 <col:5> 'struct B4' 'void (void)'
| `-CompoundStmt 0x7fd50e336300 <col:10, line:91:5>
|   `-CXXOperatorCallExpr 0x7fd50e3362b8 <line:90:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
|     |-ImplicitCastExpr 0x7fd50e3362a0 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
|     | `-DeclRefExpr 0x7fd50e336278 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7fd50e328910 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
|     |-DeclRefExpr 0x7fd50e335958 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7fd50e326cb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
|     `-ImplicitCastExpr 0x7fd50e336260 <col:22> 'const char *' <ArrayToPointerDecay>
|       `-StringLiteral 0x7fd50e335990 <col:22> 'const char [6]' lvalue "D2()\n"
|-CXXDestructorDecl 0x7fd50e335200 <line:93:5, line:96:5> line:93:13 used ~D2 'void (void) noexcept' virtual
| `-CompoundStmt 0x7fd50dc60d10 <line:94:5, line:96:5>
|   `-CXXOperatorCallExpr 0x7fd50dc60cc8 <line:95:9, col:22> 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>' lvalue
|     |-ImplicitCastExpr 0x7fd50dc60cb0 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(*)(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' <FunctionToPointerDecay>
|     | `-DeclRefExpr 0x7fd50dc60c88 <col:19> 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)' lvalue Function 0x7fd50e328910 'operator<<' 'basic_ostream<char, struct std::__1::char_traits<char> > &(basic_ostream<char, struct std::__1::char_traits<char> > &, const char *)'
|     |-DeclRefExpr 0x7fd50e336340 <col:9, col:14> 'std::__1::ostream':'class std::__1::basic_ostream<char>' lvalue Var 0x7fd50e326cb0 'cout' 'std::__1::ostream':'class std::__1::basic_ostream<char>'
|     `-ImplicitCastExpr 0x7fd50dc60c70 <col:22> 'const char *' <ArrayToPointerDecay>
|       `-StringLiteral 0x7fd50e336378 <col:22> 'const char [7]' lvalue "~D2()\n"
|-CXXMethodDecl 0x7fd50e335338 <line:88:8, <invalid sloc>> col:8 implicit operator= 'struct D2 &(const struct D2 &)' inline default noexcept-unevaluated 0x7fd50e335338
| `-ParmVarDecl 0x7fd50e335450 <col:8> col:8 'const struct D2 &'
`-CXXConstructorDecl 0x7fd50dc61150 <col:8> col:8 implicit D2 'void (const struct D2 &)' inline default noexcept-unevaluated 0x7fd50dc61150
  `-ParmVarDecl 0x7fd50dc61280 <col:8> col:8 'const struct D2 &'

Layout: <CGRecordLayout
  LLVMType:%struct.D2 = type { %struct.B3, %struct.B4 }
  NonVirtualBaseLLVMType:%struct.D2 = type { %struct.B3, %struct.B4 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1185:9)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1203:9)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >
         0 |   struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> (base) (empty)
         0 |   std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type * __sbuf_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::ios_base
         0 |   (ios_base vtable pointer)
         8 |   std::__1::ios_base::fmtflags __fmtflags_
        16 |   std::__1::streamsize __precision_
        24 |   std::__1::streamsize __width_
        32 |   std::__1::ios_base::iostate __rdstate_
        36 |   std::__1::ios_base::iostate __exceptions_
        40 |   void * __rdbuf_
        48 |   void * __loc_
        56 |   std::__1::ios_base::event_callback * __fn_
        64 |   int * __index_
        72 |   size_t __event_size_
        80 |   size_t __event_cap_
        88 |   long * __iarray_
        96 |   size_t __iarray_size_
       104 |   size_t __iarray_cap_
       112 |   void ** __parray_
       120 |   size_t __parray_size_
       128 |   size_t __parray_cap_
           | [sizeof=136, dsize=136, align=8,
           |  nvsize=136, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ios<char>
         0 |   class std::__1::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     std::__1::ios_base::fmtflags __fmtflags_
        16 |     std::__1::streamsize __precision_
        24 |     std::__1::streamsize __width_
        32 |     std::__1::ios_base::iostate __rdstate_
        36 |     std::__1::ios_base::iostate __exceptions_
        40 |     void * __rdbuf_
        48 |     void * __loc_
        56 |     std::__1::ios_base::event_callback * __fn_
        64 |     int * __index_
        72 |     size_t __event_size_
        80 |     size_t __event_cap_
        88 |     long * __iarray_
        96 |     size_t __iarray_size_
       104 |     size_t __iarray_cap_
       112 |     void ** __parray_
       120 |     size_t __parray_size_
       128 |     size_t __parray_cap_
       136 |   basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       144 |   std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=152, dsize=148, align=8,
           |  nvsize=148, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ostream<char>
         0 |   (basic_ostream vtable pointer)
         8 |   class std::__1::basic_ios<char> (virtual base)
         8 |     class std::__1::ios_base (primary base)
         8 |       (ios_base vtable pointer)
        16 |       std::__1::ios_base::fmtflags __fmtflags_
        24 |       std::__1::streamsize __precision_
        32 |       std::__1::streamsize __width_
        40 |       std::__1::ios_base::iostate __rdstate_
        44 |       std::__1::ios_base::iostate __exceptions_
        48 |       void * __rdbuf_
        56 |       void * __loc_
        64 |       std::__1::ios_base::event_callback * __fn_
        72 |       int * __index_
        80 |       size_t __event_size_
        88 |       size_t __event_cap_
        96 |       long * __iarray_
       104 |       size_t __iarray_size_
       112 |       size_t __iarray_cap_
       120 |       void ** __parray_
       128 |       size_t __parray_size_
       136 |       size_t __parray_cap_
       144 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       152 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=160, dsize=156, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd50f1e4f60 prev 0x7fd50e8c2120 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, line:386:1> line:231:24 referenced class ios_base definition
|-VisibilityAttr 0x7fd50f1e5060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7fd50f1e50a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, col:24> col:24 implicit referenced class ios_base
|-AccessSpecDecl 0x7fd50f1e5140 <line:233:1, col:7> col:1 public
|-CXXRecordDecl 0x7fd50f1e5198 <line:234:5, col:33> col:33 class failure
| `-VisibilityAttr 0x7fd50f1e5250 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:681:47, col:71> Default
|-TypedefDecl 0x7fd50f1e52b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:236:5, col:26> col:26 referenced fmtflags 'unsigned int'
| `-BuiltinType 0x7fd50e02ee60 'unsigned int'
|-VarDecl 0x7fd50f1e5340 <line:237:5, col:41> col:27 referenced boolalpha 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e53c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e53a0 <col:41> 'int' 1
|-VarDecl 0x7fd50f1e5440 <line:238:5, col:41> col:27 referenced dec 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e54c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e54a0 <col:41> 'int' 2
|-VarDecl 0x7fd50f1e5540 <line:239:5, col:41> col:27 referenced fixed 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e55c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e55a0 <col:41> 'int' 4
|-VarDecl 0x7fd50f1e5640 <line:240:5, col:41> col:27 referenced hex 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e56c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e56a0 <col:41> 'int' 8
|-VarDecl 0x7fd50f1e5740 <line:241:5, col:41> col:27 referenced internal 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e57c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e57a0 <col:41> 'int' 16
|-VarDecl 0x7fd50f1e5840 <line:242:5, col:41> col:27 referenced left 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e58c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e58a0 <col:41> 'int' 32
|-VarDecl 0x7fd50f1e5940 <line:243:5, col:41> col:27 referenced oct 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e59c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e59a0 <col:41> 'int' 64
|-VarDecl 0x7fd50f1e5a40 <line:244:5, col:41> col:27 referenced right 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e5ac0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e5aa0 <col:41> 'int' 128
|-VarDecl 0x7fd50f1e5b40 <line:245:5, col:41> col:27 referenced scientific 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e5bc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e5ba0 <col:41> 'int' 256
|-VarDecl 0x7fd50f1e5c40 <line:246:5, col:41> col:27 referenced showbase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e5cc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e5ca0 <col:41> 'int' 512
|-VarDecl 0x7fd50f1e5d40 <line:247:5, col:41> col:27 referenced showpoint 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e5dc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e5da0 <col:41> 'int' 1024
|-VarDecl 0x7fd50f1e5e40 <line:248:5, col:41> col:27 referenced showpos 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e5ec0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e5ea0 <col:41> 'int' 2048
|-VarDecl 0x7fd50f1e5f40 <line:249:5, col:41> col:27 referenced skipws 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e5fc0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e5fa0 <col:41> 'int' 4096
|-VarDecl 0x7fd50f1e6040 <line:250:5, col:41> col:27 referenced unitbuf 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e60c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e60a0 <col:41> 'int' 8192
|-VarDecl 0x7fd50f1e6140 <line:251:5, col:41> col:27 referenced uppercase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e61c0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e61a0 <col:41> 'int' 16384
|-VarDecl 0x7fd50f1e6240 <line:252:5, col:56> col:27 referenced adjustfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7fd50f1e6388 <col:41, col:56> 'unsigned int' '|'
|   |-BinaryOperator 0x7fd50f1e6320 <col:41, col:48> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7fd50f1e62f0 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7fd50f1e62a0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fd50f1e5840 'left' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7fd50f1e6308 <col:48> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7fd50f1e62c8 <col:48> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fd50f1e5a40 'right' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7fd50f1e6370 <col:56> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fd50f1e6348 <col:56> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fd50f1e5740 'internal' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7fd50f1e6418 <line:253:5, col:53> col:27 referenced basefield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7fd50f1e6560 <col:41, col:53> 'unsigned int' '|'
|   |-BinaryOperator 0x7fd50f1e64f8 <col:41, col:47> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7fd50f1e64c8 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7fd50f1e6478 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fd50f1e5440 'dec' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7fd50f1e64e0 <col:47> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7fd50f1e64a0 <col:47> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fd50f1e5940 'oct' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7fd50f1e6548 <col:53> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fd50f1e6520 <col:53> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fd50f1e5640 'hex' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7fd50f1e65f0 <line:254:5, col:54> col:27 referenced floatfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7fd50f1e66d0 <col:41, col:54> 'unsigned int' '|'
|   |-ImplicitCastExpr 0x7fd50f1e66a0 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | `-DeclRefExpr 0x7fd50f1e6650 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fd50f1e5b40 'scientific' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7fd50f1e66b8 <col:54> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fd50f1e6678 <col:54> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fd50f1e5540 'fixed' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-TypedefDecl 0x7fd50f1e6768 <line:256:5, col:26> col:26 referenced iostate 'unsigned int'
| `-BuiltinType 0x7fd50e02ee60 'unsigned int'
|-VarDecl 0x7fd50f1e67f0 <line:257:5, col:36> col:26 referenced badbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e6870 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e6850 <col:36> 'int' 1
|-VarDecl 0x7fd50f1e68f0 <line:258:5, col:36> col:26 referenced eofbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e6970 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e6950 <col:36> 'int' 2
|-VarDecl 0x7fd50f1e69f0 <line:259:5, col:36> col:26 referenced failbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e6a70 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e6a50 <col:36> 'int' 4
|-VarDecl 0x7fd50f1e6af0 <line:260:5, col:36> col:26 referenced goodbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e6b70 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e6b50 <col:36> 'int' 0
|-TypedefDecl 0x7fd50f1e6bf8 <line:262:5, col:26> col:26 referenced openmode 'unsigned int'
| `-BuiltinType 0x7fd50e02ee60 'unsigned int'
|-VarDecl 0x7fd50f1e6c80 <line:263:5, col:36> col:27 app 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e6d00 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e6ce0 <col:36> 'int' 1
|-VarDecl 0x7fd50f1e6d80 <line:264:5, col:36> col:27 ate 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e6e00 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e6de0 <col:36> 'int' 2
|-VarDecl 0x7fd50f1e6e80 <line:265:5, col:36> col:27 binary 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e6f00 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e6ee0 <col:36> 'int' 4
|-VarDecl 0x7fd50f1e6f80 <line:266:5, col:36> col:27 referenced in 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e7000 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e6fe0 <col:36> 'int' 8
|-VarDecl 0x7fd50f1e7080 <line:267:5, col:36> col:27 referenced out 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e7100 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e70e0 <col:36> 'int' 16
|-VarDecl 0x7fd50f1e7180 <line:268:5, col:36> col:27 trunc 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fd50f1e7200 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fd50f1e71e0 <col:36> 'int' 32
|-EnumDecl 0x7fd50f1e7270 <line:270:5, col:32> col:10 referenced seekdir
| |-EnumConstantDecl 0x7fd50f1e7330 <col:19> col:19 referenced beg 'enum std::__1::ios_base::seekdir'
| |-EnumConstantDecl 0x7fd50f1e7380 <col:24> col:24 referenced cur 'enum std::__1::ios_base::seekdir'
| `-EnumConstantDecl 0x7fd50f1e73d0 <col:29> col:29 referenced end 'enum std::__1::ios_base::seekdir'
|-TypedefDecl 0x7fd50f1e7430 <line:273:5, col:26> col:26 io_state 'std::__1::ios_base::iostate':'unsigned int'
| `-TypedefType 0x7fd50f1e67c0 'std::__1::ios_base::iostate' sugar
|   |-Typedef 0x7fd50f1e6768 'iostate'
|   `-BuiltinType 0x7fd50e02ee60 'unsigned int'
|-TypedefDecl 0x7fd50f1e7498 <line:274:5, col:26> col:26 open_mode 'std::__1::ios_base::openmode':'unsigned int'
| `-TypedefType 0x7fd50f1e6c50 'std::__1::ios_base::openmode' sugar
|   |-Typedef 0x7fd50f1e6bf8 'openmode'
|   `-BuiltinType 0x7fd50e02ee60 'unsigned int'
|-TypedefDecl 0x7fd50f1e7500 <line:275:5, col:26> col:26 seek_dir 'enum std::__1::ios_base::seekdir'
| `-EnumType 0x7fd50f1e7310 'enum std::__1::ios_base::seekdir'
|   `-Enum 0x7fd50f1e7270 'seekdir'
|-TypedefDecl 0x7fd50f1e7610 <line:277:5, col:30> col:30 streamoff 'std::__1::streamoff':'long long'
| `-ElaboratedType 0x7fd50f1e75a0 'std::__1::streamoff' sugar
|   `-TypedefType 0x7fd50ed099b0 'std::__1::streamoff' sugar
|     |-Typedef 0x7fd50e8d0b58 'streamoff'
|     `-BuiltinType 0x7fd50e02ee00 'long long'
|-TypedefDecl 0x7fd50f1e76f0 <line:278:5, col:30> col:30 streampos 'std::__1::streampos':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fd50f1e7680 'std::__1::streampos' sugar
|   `-TypedefType 0x7fd50ed09a40 'std::__1::streampos' sugar
|     |-Typedef 0x7fd50e8d07b8 'streampos'
|     `-TemplateSpecializationType 0x7fd50e8d0710 'fpos<mbstate_t>' sugar fpos
|       |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|       `-RecordType 0x7fd50e8d06f0 'class std::__1::fpos<__mbstate_t>'
|         `-ClassTemplateSpecialization 0x7fd50e8d0600 'fpos'
|-CXXRecordDecl 0x7fd50f1e7778 <line:281:5, col:28> col:28 class Init
| `-VisibilityAttr 0x7fd50f1e7830 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXMethodDecl 0x7fd50f1e7960 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:284:48> col:40 used flags 'std::__1::ios_base::fmtflags (void) const'
| |-AlwaysInlineAttr 0x7fd50f1e79f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fd50f1e7a40 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd50f1e7b80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:285:62> col:40 flags 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fd50f1e7a90 <col:46, col:55> col:55 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fd50f1e7c20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fd50f1e7c68 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd50f1e7d40 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:286:61> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fd50f1e7cb8 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fd50f1e7de0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fd50f1e7e28 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd50f1e8000 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:287:78> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags, std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fd50f1e7e78 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-ParmVarDecl 0x7fd50f1e7ee8 <col:63, col:72> col:72 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fd50f1e80a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fd50f1e80f0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd50f1e8200 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:288:58> col:36 used unsetf 'void (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fd50f1e8140 <col:43, col:52> col:52 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fd50f1e82a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fd50f1e82e8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd50f1e83a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:290:54> col:42 precision 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7fd50f1e8438 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fd50f1e8480 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd50f1e8590 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:291:69> col:42 precision 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7fd50f1e84d0 <col:52, col:63> col:63 __prec 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7fd50f1e8630 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fd50f1e8678 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd50f1e86d8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:292:50> col:42 used width 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7fd50f1e8770 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fd50f1e87b8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd50f1e8890 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:293:65> col:42 used width 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7fd50f1e8808 <col:48, col:59> col:59 __wide 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7fd50f1e8930 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fd50f1e8978 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd50f1e8a20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:296:5, col:37> col:12 referenced imbue 'class std::__1::locale (const class std::__1::locale &)'
| `-ParmVarDecl 0x7fd50f1e8998 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7fd50f1e8b10 <line:297:5, col:21> col:12 used getloc 'class std::__1::locale (void) const'
|-CXXMethodDecl 0x7fd50f1e8bd0 <line:300:5, col:23> col:16 xalloc 'int (void)' static
|-CXXMethodDecl 0x7fd50f1e8d10 <line:301:5, col:28> col:11 iword 'long &(int)'
| `-ParmVarDecl 0x7fd50f1e8c80 <col:17, col:21> col:21 __index 'int'
|-CXXMethodDecl 0x7fd50f1e8e98 <line:302:5, col:29> col:12 pword 'void *&(int)'
| `-ParmVarDecl 0x7fd50f1e8dc8 <col:18, col:22> col:22 __index 'int'
|-CXXDestructorDecl 0x7fd50f1e8f88 <line:305:5, col:23> col:13 ~ios_base 'void (void) noexcept' virtual
|-EnumDecl 0x7fd50f1e9028 <line:308:5, col:58> col:10 referenced event
| |-EnumConstantDecl 0x7fd50f1e90e0 <col:18> col:18 referenced erase_event 'enum std::__1::ios_base::event'
| |-EnumConstantDecl 0x7fd50f1e9130 <col:31> col:31 imbue_event 'enum std::__1::ios_base::event'
| `-EnumConstantDecl 0x7fd50f1e9180 <col:44> col:44 referenced copyfmt_event 'enum std::__1::ios_base::event'
|-TypedefDecl 0x7fd50f1e9450 <line:309:5, col:65> col:20 referenced event_callback 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-PointerType 0x7fd50f1e93e0 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
|   `-ParenType 0x7fd50f1e9380 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' sugar
|     `-FunctionProtoType 0x7fd50f1e9330 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' cdecl
|       |-BuiltinType 0x7fd50e02ed20 'void'
|       |-EnumType 0x7fd50f1e90c0 'enum std::__1::ios_base::event'
|       | `-Enum 0x7fd50f1e9028 'event'
|       |-LValueReferenceType 0x7fd50eb39080 'class std::__1::ios_base &'
|       | `-RecordType 0x7fd50e8c21c0 'class std::__1::ios_base'
|       |   `-CXXRecord 0x7fd50f1e4f60 'ios_base'
|       `-BuiltinType 0x7fd50e02edc0 'int'
|-CXXMethodDecl 0x7fd50f1e9670 <line:310:5, col:60> col:10 register_callback 'void (std::__1::ios_base::event_callback, int)'
| |-ParmVarDecl 0x7fd50f1e94e0 <col:28, col:43> col:43 __fn 'std::__1::ios_base::event_callback':'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-ParmVarDecl 0x7fd50f1e9558 <col:49, col:53> col:53 __index 'int'
|-AccessSpecDecl 0x7fd50f1e9718 <line:312:1, col:8> col:1 private
|-CXXConstructorDecl 0x7fd50f1e9860 <line:313:5, col:29> col:5 ios_base 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fd50f1e9778 <col:14, col:28> col:29 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7fd50f1e99e0 <line:314:5, col:40> col:15 operator= 'class std::__1::ios_base &(const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fd50f1e9920 <col:25, col:39> col:40 'const class std::__1::ios_base &'
|-AccessSpecDecl 0x7fd50f1e9a80 <line:316:1, col:7> col:1 public
|-CXXMethodDecl 0x7fd50f1e9b80 <line:317:5, col:51> col:17 sync_with_stdio '_Bool (_Bool)' static
| `-ParmVarDecl 0x7fd50f1e9ab8 <col:33, col:47> col:38 __sync '_Bool' cinit
|   `-CXXBoolLiteralExpr 0x7fd50f1ebf78 <col:47> '_Bool' true
|-CXXMethodDecl 0x7fd50f1e9ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:319:49> col:39 rdstate 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7fd50f1e9d38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fd50f1e9d80 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd50f1e9e60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:320:5, col:41> col:10 used clear 'void (std::__1::ios_base::iostate)'
| `-ParmVarDecl 0x7fd50f1e9da0 <col:16, col:34> col:24 __state 'std::__1::ios_base::iostate':'unsigned int' cinit
|   `-ImplicitCastExpr 0x7fd50f1ebfb8 <col:34> 'std::__1::ios_base::iostate':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fd50f1ebf90 <col:34> 'const std::__1::ios_base::iostate':'const unsigned int' lvalue Var 0x7fd50f1e6af0 'goodbit' 'const std::__1::ios_base::iostate':'const unsigned int'
|-CXXMethodDecl 0x7fd50f1e9fc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:321:60> col:36 used setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fd50f1e9f40 <col:45, col:53> col:53 __state 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7fd50f1ea068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fd50f1ea0b0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd50f1ea110 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:323:43> col:36 good '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fd50f1ea1a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fd50f1ea1f0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd50f1ea250 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:324:42> col:36 eof '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fd50f1ea2e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fd50f1ea330 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd50f1ea390 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:325:43> col:36 fail '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fd50f1ea428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fd50f1ea470 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd50f1ea4d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:326:42> col:36 bad '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fd50f1ea568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fd50f1ea5b0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd50f1ea610 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:328:52> col:39 exceptions 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7fd50f1ea6a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fd50f1ea6f0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd50f1ea7c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:329:64> col:36 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fd50f1ea740 <col:47, col:55> col:55 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7fd50f1ea868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fd50f1ea8b0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd50f1ea8e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:331:5, col:44> col:10 used __set_badbit_and_consider_rethrow 'void (void)'
|-CXXMethodDecl 0x7fd50f1ea998 <line:332:5, col:45> col:10 __set_failbit_and_consider_rethrow 'void (void)'
|-AccessSpecDecl 0x7fd50f1eaa30 <line:334:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fd50f1eaaa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:337:16> line:336:5 ios_base 'void (void)'
| |-CompoundStmt 0x7fd50f1ebfd0 <col:16, line:337:16>
| |-AlwaysInlineAttr 0x7fd50f1eab50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fd50f1eab98 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fd50f1eac48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:339:5, col:25> col:10 referenced init 'void (void *)'
| `-ParmVarDecl 0x7fd50f1eabc0 <col:15, col:21> col:21 __sb 'void *'
|-CXXMethodDecl 0x7fd50f1ead78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:340:64> col:33 used rdbuf 'void *(void) const'
| |-CompoundStmt 0x7fd50f1ec068 <col:47, col:64>
| | `-ReturnStmt 0x7fd50f1ec050 <col:48, col:55>
| |   `-ImplicitCastExpr 0x7fd50f1ec038 <col:55> 'void *' <LValueToRValue>
| |     `-MemberExpr 0x7fd50f1ec000 <col:55> 'void *const' lvalue ->__rdbuf_ 0x7fd50f1eb988
| |       `-CXXThisExpr 0x7fd50f1ebfe8 <col:55> 'const class std::__1::ios_base *' this
| |-AlwaysInlineAttr 0x7fd50f1eae10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7fd50f1eae58 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fd50f1eaf38 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:347:5> line:343:10 rdbuf 'void (void *)'
| |-ParmVarDecl 0x7fd50f1eaeb0 <col:16, col:22> col:22 used __sb 'void *'
| |-CompoundStmt 0x7fd50f1ec1e8 <line:344:5, line:347:5>
| | |-BinaryOperator 0x7fd50f1ec118 <line:345:9, col:20> 'void *' lvalue '='
| | | |-MemberExpr 0x7fd50f1ec0a0 <col:9> 'void *' lvalue ->__rdbuf_ 0x7fd50f1eb988
| | | | `-CXXThisExpr 0x7fd50f1ec088 <col:9> 'class std::__1::ios_base *' this
| | | `-ImplicitCastExpr 0x7fd50f1ec100 <col:20> 'void *' <LValueToRValue>
| | |   `-DeclRefExpr 0x7fd50f1ec0d8 <col:20> 'void *' lvalue ParmVar 0x7fd50f1eaeb0 '__sb' 'void *'
| | `-CXXMemberCallExpr 0x7fd50f1ec190 <line:346:9, col:15> 'void'
| |   |-MemberExpr 0x7fd50f1ec158 <col:9> '<bound member function type>' ->clear 0x7fd50f1e9e60
| |   | `-CXXThisExpr 0x7fd50f1ec140 <col:9> 'class std::__1::ios_base *' this
| |   `-CXXDefaultArgExpr 0x7fd50f1ec1c8 <<invalid sloc>> 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7fd50f1eafd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7fd50f1eb020 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fd50f1eb100 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:349:5, col:32> col:10 referenced __call_callbacks 'void (enum std::__1::ios_base::event)'
| `-ParmVarDecl 0x7fd50f1eb040 <col:27> col:32 'enum std::__1::ios_base::event'
|-CXXMethodDecl 0x7fd50f1eb238 <line:350:5, col:33> col:10 referenced copyfmt 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fd50f1eb1b0 <col:18, col:32> col:33 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7fd50f1eb3b0 <line:351:5, col:24> col:10 referenced move 'void (class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fd50f1eb2e8 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7fd50f1eb528 <line:352:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:352:10 referenced swap 'void (class std::__1::ios_base &) noexcept'
| `-ParmVarDecl 0x7fd50f1eb460 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7fd50f1eb698 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:358:5> line:355:10 referenced set_rdbuf 'void (void *)'
| |-ParmVarDecl 0x7fd50f1eb610 <col:20, col:26> col:26 used __sb 'void *'
| |-CompoundStmt 0x7fd50f1ec2c8 <line:356:5, line:358:5>
| | `-BinaryOperator 0x7fd50f1ec2a0 <line:357:9, col:20> 'void *' lvalue '='
| |   |-MemberExpr 0x7fd50f1ec228 <col:9> 'void *' lvalue ->__rdbuf_ 0x7fd50f1eb988
| |   | `-CXXThisExpr 0x7fd50f1ec210 <col:9> 'class std::__1::ios_base *' this
| |   `-ImplicitCastExpr 0x7fd50f1ec288 <col:20> 'void *' <LValueToRValue>
| |     `-DeclRefExpr 0x7fd50f1ec260 <col:20> 'void *' lvalue ParmVar 0x7fd50f1eb610 '__sb' 'void *'
| |-AlwaysInlineAttr 0x7fd50f1eb738 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7fd50f1eb780 <col:48, col:71> Hidden
|-AccessSpecDecl 0x7fd50f1eb790 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:360:1, col:8> col:1 private
|-FieldDecl 0x7fd50f1eb7c8 <line:362:5, col:21> col:21 referenced __fmtflags_ 'std::__1::ios_base::fmtflags':'unsigned int'
|-FieldDecl 0x7fd50f1eb820 <line:363:5, col:21> col:21 referenced __precision_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7fd50f1eb878 <line:364:5, col:21> col:21 referenced __width_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7fd50f1eb8d0 <line:365:5, col:21> col:21 referenced __rdstate_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7fd50f1eb928 <line:366:5, col:21> col:21 referenced __exceptions_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7fd50f1eb988 <line:367:5, col:21> col:21 referenced __rdbuf_ 'void *'
|-FieldDecl 0x7fd50f1eb9e8 <line:368:5, col:21> col:21 __loc_ 'void *'
|-FieldDecl 0x7fd50f1eba98 <line:369:5, col:21> col:21 __fn_ 'std::__1::ios_base::event_callback *'
|-FieldDecl 0x7fd50f1ebaf8 <line:370:5, col:21> col:21 __index_ 'int *'
|-FieldDecl 0x7fd50f1ebb50 <line:371:5, col:21> col:21 __event_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7fd50f1ebba8 <line:372:5, col:21> col:21 __event_cap_ 'size_t':'unsigned long'
|-VarDecl 0x7fd50f1ebcb8 <line:376:5, col:24> col:24 __xindex_ 'atomic<int>':'struct std::__1::atomic<int>' static
|-FieldDecl 0x7fd50f1ebd30 <line:380:5, col:21> col:21 __iarray_ 'long *'
|-FieldDecl 0x7fd50f1ebd88 <line:381:5, col:21> col:21 __iarray_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7fd50f1ebde0 <line:382:5, col:21> col:21 __iarray_cap_ 'size_t':'unsigned long'
|-FieldDecl 0x7fd50f1ebe40 <line:383:5, col:21> col:21 __parray_ 'void **'
|-FieldDecl 0x7fd50f1ebe98 <line:384:5, col:21> col:21 __parray_size_ 'size_t':'unsigned long'
`-FieldDecl 0x7fd50f1ebef0 <line:385:5, col:21> col:21 __parray_cap_ 'size_t':'unsigned long'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fd50e8ca5f8 parent 0x7fd50e8c2088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:482:78> col:64 class basic_ios definition
|-public 'class std::__1::ios_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fd50f2396e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7fd50f2397d8 prev 0x7fd50e8ca5f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:583:1, col:28> col:28 implicit class basic_ios
|-AccessSpecDecl 0x7fd50f239870 <line:586:1, col:7> col:1 public
|-TypedefDecl 0x7fd50f2398d8 <line:588:5, col:20> col:20 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fd50f2398a0 'char' sugar
|   |-TemplateTypeParmType 0x7fd50f1f3f00 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fd50f1f3ec0 '_CharT'
|   `-BuiltinType 0x7fd50e02ed60 'char'
|-TypedefDecl 0x7fd50f239968 <line:589:5, col:21> col:21 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fd50f239930 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fd50f1f3f70 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fd50f1f3f28 '_Traits'
|   `-RecordType 0x7fd50e8ca560 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fd50ed13e88 'char_traits'
|-TypedefDecl 0x7fd50f239a70 <line:591:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fd50f239a20 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fd50ed159d0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fd50ed141e8 'int_type'
|     `-BuiltinType 0x7fd50e02edc0 'int'
|-TypedefDecl 0x7fd50f239b40 <line:592:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fd50f239af0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fd50f230690 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fd50ed142b8 'pos_type'
|     `-TypedefType 0x7fd50ed09a40 'std::__1::streampos' sugar
|       |-Typedef 0x7fd50e8d07b8 'streampos'
|       `-TemplateSpecializationType 0x7fd50e8d0710 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fd50e8d06f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fd50e8d0600 'fpos'
|-TypedefDecl 0x7fd50f239c10 <line:593:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fd50f239bc0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fd50f230780 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fd50ed14250 'off_type'
|     `-TypedefType 0x7fd50ed099b0 'std::__1::streamoff' sugar
|       |-Typedef 0x7fd50e8d0b58 'streamoff'
|       `-BuiltinType 0x7fd50e02ee00 'long long'
|-CXXConversionDecl 0x7fd50f239c68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:605:60> col:22 operator bool '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fd50f239d38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f239d88 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:608:69> col:32 operator! '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fd50f239e30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f239e78 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:609:81> col:35 rdstate 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7fd50f239f20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f239ff0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:610:91> col:32 clear 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fd50f239f68 <col:38, col:56> col:46 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7fd50f23a0a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f23a170 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:611:87> col:32 used setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fd50f23a0e8 <col:41, col:49> col:49 used __state 'std::__1::ios_base::iostate':'unsigned int'
| |-CompoundStmt 0x7fd510861860 <col:58, col:87>
| | `-CXXMemberCallExpr 0x7fd5108617f8 <col:59, col:85> 'void'
| |   |-MemberExpr 0x7fd510861780 <col:59, col:69> '<bound member function type>' ->setstate 0x7fd50f1f1948
| |   | `-ImplicitCastExpr 0x7fd510861828 <col:69> 'class std::__1::ios_base *' <UncheckedDerivedToBase (ios_base)>
| |   |   `-CXXThisExpr 0x7fd510861768 <col:69> 'class std::__1::basic_ios<char> *' this
| |   `-ImplicitCastExpr 0x7fd510861848 <col:78> 'std::__1::ios_base::iostate':'unsigned int' <LValueToRValue>
| |     `-DeclRefExpr 0x7fd5108617d0 <col:78> 'std::__1::ios_base::iostate':'unsigned int' lvalue ParmVar 0x7fd50f23a0e8 '__state' 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7fd50f23a220 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f23a268 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:612:70> col:32 good '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fd50f23a310 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f23a358 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:613:69> col:32 eof '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fd50f23a400 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f23a448 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:614:70> col:32 fail '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fd50f23a4f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f23a538 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:615:69> col:32 bad '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fd50f23a5e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f23a628 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:617:85> col:35 exceptions 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7fd50f23a6d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f23a7a0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:618:95> col:32 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fd50f23a718 <col:43, col:51> col:51 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7fd50f23a850 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXConstructorDecl 0x7fd50f23ab00 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:622:68> col:14 basic_ios 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fd50f23a9b8 <col:24, col:64> col:64 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fd50f23abc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7fd50f23ac38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:623:5, col:24> col:13 ~basic_ios 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7fd50f23ae90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:627:50> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7fd50f23af38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f23b270 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:629:95> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fd50f23b128 <col:48, col:87> col:87 __tiestr 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fd50f23b320 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f23b4e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:714:1, line:719:1> line:632:46 used rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| |-CompoundStmt 0x7fd510858f08 <line:717:1, line:719:1>
| | `-ReturnStmt 0x7fd510858ef0 <line:718:5, col:83>
| |   `-CXXStaticCastExpr 0x7fd510858ec0 <col:12, col:83> 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *' static_cast<basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *> <BitCast>
| |     `-CXXMemberCallExpr 0x7fd510858e60 <col:66, col:82> 'void *'
| |       `-MemberExpr 0x7fd510858e10 <col:66, col:76> '<bound member function type>' ->rdbuf 0x7fd50f1ead78
| |         `-ImplicitCastExpr 0x7fd510858ea8 <col:66> 'const class std::__1::ios_base *' <NoOp>
| |           `-ImplicitCastExpr 0x7fd510858e88 <col:66> 'class std::__1::ios_base *' <UncheckedDerivedToBase (ios_base)>
| |             `-CXXThisExpr 0x7fd510858df8 <col:66> 'const class std::__1::basic_ios<char> *' this
| `-AlwaysInlineAttr 0x7fd50f23b588 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f23b8c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:634:97> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fd50f23b778 <col:52, col:93> col:93 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fd50f23b970 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f23baf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:636:5, col:46> col:16 copyfmt 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)'
| `-ParmVarDecl 0x7fd50f23ba28 <col:24, col:41> col:41 __rhs 'const class std::__1::basic_ios<char> &'
|-CXXMethodDecl 0x7fd50f23bbf0 <line:760:1, line:767:1> line:639:15 used fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (void) const'
| |-CompoundStmt 0x7fd510859470 <line:763:1, line:767:1>
| | |-IfStmt 0x7fd5108593a0 <line:764:5, line:765:28>
| | | |-<<<NULL>>>
| | | |-<<<NULL>>>
| | | |-CallExpr 0x7fd510859240 <line:764:9, col:61> '_Bool'
| | | | |-ImplicitCastExpr 0x7fd510859228 <col:9, col:22> '_Bool (*)(std::__1::char_traits<char>::int_type, std::__1::char_traits<char>::int_type) noexcept' <FunctionToPointerDecay>
| | | | | `-DeclRefExpr 0x7fd5108590e8 <col:9, col:22> '_Bool (std::__1::char_traits<char>::int_type, std::__1::char_traits<char>::int_type) noexcept' lvalue CXXMethod 0x7fd50ed16048 'eq_int_type' '_Bool (std::__1::char_traits<char>::int_type, std::__1::char_traits<char>::int_type) noexcept'
| | | | |-CallExpr 0x7fd5108591b0 <col:34, col:51> 'std::__1::char_traits<char>::int_type':'int'
| | | | | `-ImplicitCastExpr 0x7fd510859198 <col:34, col:47> 'std::__1::char_traits<char>::int_type (*)(void) noexcept' <FunctionToPointerDecay>
| | | | |   `-DeclRefExpr 0x7fd510859160 <col:34, col:47> 'std::__1::char_traits<char>::int_type (void) noexcept' lvalue CXXMethod 0x7fd50ed16148 'eof' 'std::__1::char_traits<char>::int_type (void) noexcept'
| | | | `-ImplicitCastExpr 0x7fd510859278 <col:54> 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' <LValueToRValue>
| | | |   `-MemberExpr 0x7fd5108591f0 <col:54> 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' lvalue ->__fill_ 0x7fd50f23d260
| | | |     `-CXXThisExpr 0x7fd5108591d8 <col:54> 'const class std::__1::basic_ios<char> *' this
| | | |-BinaryOperator 0x7fd510859378 <line:765:9, col:28> 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' lvalue '='
| | | | |-MemberExpr 0x7fd5108592a8 <col:9> 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' lvalue ->__fill_ 0x7fd50f23d260
| | | | | `-CXXThisExpr 0x7fd510859290 <col:9> 'const class std::__1::basic_ios<char> *' this
| | | | `-ImplicitCastExpr 0x7fd510859360 <col:19, col:28> 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' <IntegralCast>
| | | |   `-CXXMemberCallExpr 0x7fd510859330 <col:19, col:28> 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| | | |     |-MemberExpr 0x7fd5108592f8 <col:19> '<bound member function type>' ->widen 0x7fd50f23c370
| | | |     | `-CXXThisExpr 0x7fd5108592e0 <col:19> 'const class std::__1::basic_ios<char> *' this
| | | |     `-CharacterLiteral 0x7fd50f1ff248 <col:25> 'char' 32
| | | `-<<<NULL>>>
| | `-ReturnStmt 0x7fd510859458 <line:766:5, col:12>
| |   `-ImplicitCastExpr 0x7fd510859440 <col:12> 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char' <IntegralCast>
| |     `-ImplicitCastExpr 0x7fd510859428 <col:12> 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' <LValueToRValue>
| |       `-MemberExpr 0x7fd5108593f0 <col:12> 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' lvalue ->__fill_ 0x7fd50f23d260
| |         `-CXXThisExpr 0x7fd5108593d8 <col:12> 'const class std::__1::basic_ios<char> *' this
| `-AlwaysInlineAttr 0x7fd50f23bc98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f23bdf0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:641:34> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7fd50f23bcf0 <col:20, col:30> col:30 __ch 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7fd50f23bea0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f23bf70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:644:37> col:12 imbue 'class std::__1::locale (const class std::__1::locale &)'
| |-ParmVarDecl 0x7fd50f23bee8 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7fd50f23c020 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f23c1b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:647:47> col:10 narrow 'char (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, char) const'
| |-ParmVarDecl 0x7fd50f23c078 <col:17, col:27> col:27 __c 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| |-ParmVarDecl 0x7fd50f23c0d8 <col:32, col:37> col:37 __dfault 'char'
| `-AlwaysInlineAttr 0x7fd50f23c268 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f23c370 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:752:1, line:757:1> line:649:15 used widen 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (char) const'
| |-ParmVarDecl 0x7fd50f23c2b0 <col:21, col:26> col:26 used __c 'char'
| |-CompoundStmt 0x7fd510859e88 <line:755:1, line:757:1>
| | `-ReturnStmt 0x7fd510859e70 <line:756:5, col:60>
| |   `-ExprWithCleanups 0x7fd510859e58 <col:12, col:60> 'std::__1::ctype<char>::char_type':'char'
| |     `-CXXMemberCallExpr 0x7fd510859e10 <col:12, col:60> 'std::__1::ctype<char>::char_type':'char'
| |       |-MemberExpr 0x7fd510859dd8 <col:12, col:51> '<bound member function type>' .widen 0x7fd50db2cc60
| |       | `-CallExpr 0x7fd510859ce0 <col:12, col:49> 'const class std::__1::ctype<char>':'const class std::__1::ctype<char>' lvalue
| |       |   |-ImplicitCastExpr 0x7fd510859cc8 <col:12, col:39> 'const class std::__1::ctype<char> &(*)(const class std::__1::locale &)' <FunctionToPointerDecay>
| |       |   | `-DeclRefExpr 0x7fd510859c00 <col:12, col:39> 'const class std::__1::ctype<char> &(const class std::__1::locale &)' lvalue Function 0x7fd510859ac0 'use_facet' 'const class std::__1::ctype<char> &(const class std::__1::locale &)' (FunctionTemplate 0x7fd50db173d8 'use_facet')
| |       |   `-MaterializeTemporaryExpr 0x7fd510859d28 <col:41, col:48> 'const class std::__1::locale' lvalue
| |       |     `-ImplicitCastExpr 0x7fd510859d10 <col:41, col:48> 'const class std::__1::locale' <NoOp>
| |       |       `-CXXBindTemporaryExpr 0x7fd5108597e0 <col:41, col:48> 'class std::__1::locale' (CXXTemporary 0x7fd5108597d8)
| |       |         `-CXXMemberCallExpr 0x7fd510859790 <col:41, col:48> 'class std::__1::locale'
| |       |           `-MemberExpr 0x7fd510859758 <col:41> '<bound member function type>' ->getloc 0x7fd50f1e8b10
| |       |             `-ImplicitCastExpr 0x7fd5108597b8 <col:41> 'const class std::__1::ios_base *' <UncheckedDerivedToBase (ios_base)>
| |       |               `-CXXThisExpr 0x7fd510859740 <col:41> 'const class std::__1::basic_ios<char> *' this
| |       `-ImplicitCastExpr 0x7fd510859e40 <col:57> 'char' <LValueToRValue>
| |         `-DeclRefExpr 0x7fd510859db0 <col:57> 'char' lvalue ParmVar 0x7fd50f23c2b0 '__c' 'char'
| `-AlwaysInlineAttr 0x7fd50f23c420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-AccessSpecDecl 0x7fd50f23c468 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:651:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fd50f23c4b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:654:17> line:653:5 basic_ios 'void (void)'
| `-AlwaysInlineAttr 0x7fd50f23c568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f23c770 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:656:60> col:10 init 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fd50f23c6a8 <col:15, col:56> col:56 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fd50f23c820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f23c940 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:659:31> col:10 move 'void (class std::__1::basic_ios<char> &)'
| |-ParmVarDecl 0x7fd50f23c878 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7fd50f23c9f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f23cb40 <line:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:662:47> col:10 move 'void (class std::__1::basic_ios<char> &&)'
| |-ParmVarDecl 0x7fd50f23ca78 <col:15, col:27> col:27 __rhs 'class std::__1::basic_ios<char> &&'
| `-AlwaysInlineAttr 0x7fd50f23cbf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f23cd18 <line:709:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:665:10 swap 'void (class std::__1::basic_ios<char> &) noexcept'
| |-ParmVarDecl 0x7fd50f23cc48 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7fd50f23cdc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f23cfd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:667:65> col:10 set_rdbuf 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fd50f23cf08 <col:20, col:61> col:61 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fd50f23d080 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-AccessSpecDecl 0x7fd50f23d0c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:668:1, col:8> col:1 private
|-FieldDecl 0x7fd50f23d1e8 <line:669:5, col:44> col:44 __tie_ 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
|-FieldDecl 0x7fd50f23d260 <line:670:6, col:23> col:23 referenced __fill_ 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' mutable
|-CXXConstructorDecl 0x7fd50f23d2e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:482:64> col:64 implicit basic_ios 'void (const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7fd50f23d2e8
| `-ParmVarDecl 0x7fd50f23d410 <col:64> col:64 'const class std::__1::basic_ios<char> &'
`-CXXMethodDecl 0x7fd50f23d478 <col:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7fd50f23d478
  `-ParmVarDecl 0x7fd50f23d550 <col:64> col:64 'const class std::__1::basic_ios<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ios" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fd50e8cb6b8 parent 0x7fd50e8c2088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:1085:82> col:64 class basic_ostream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fd50f32b6d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7fd50f32b910 prev 0x7fd50e8cb6b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:151:1, col:28> col:28 implicit class basic_ostream
|-AccessSpecDecl 0x7fd50f32b9a8 <line:154:1, col:7> col:1 public
|-TypedefDecl 0x7fd50f32b9e0 <line:156:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fd50f32b7a0 'char' sugar
|   |-TemplateTypeParmType 0x7fd50f2f9330 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fd50f2f92e8 '_CharT'
|   `-BuiltinType 0x7fd50e02ed60 'char'
|-TypedefDecl 0x7fd50f32ba48 <line:157:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fd50f32b7e0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fd50f2f93a0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fd50f2f9358 '_Traits'
|   `-RecordType 0x7fd50e8ca560 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fd50ed13e88 'char_traits'
|-TypedefDecl 0x7fd50f32bb50 <line:158:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fd50f32bb00 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fd50ed159d0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fd50ed141e8 'int_type'
|     `-BuiltinType 0x7fd50e02edc0 'int'
|-TypedefDecl 0x7fd50f32bc20 <line:159:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fd50f32bbd0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fd50f230690 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fd50ed142b8 'pos_type'
|     `-TypedefType 0x7fd50ed09a40 'std::__1::streampos' sugar
|       |-Typedef 0x7fd50e8d07b8 'streampos'
|       `-TemplateSpecializationType 0x7fd50e8d0710 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fd50e8d06f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fd50e8d0600 'fpos'
|-TypedefDecl 0x7fd50f32bcf0 <line:160:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fd50f32bca0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fd50f230780 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fd50ed14250 'off_type'
|     `-TypedefType 0x7fd50ed099b0 'std::__1::streamoff' sugar
|       |-Typedef 0x7fd50e8d0b58 'streamoff'
|       `-BuiltinType 0x7fd50e02ee00 'long long'
|-CXXConstructorDecl 0x7fd50f32bf70 <line:163:5, line:165:25> line:164:14 basic_ostream 'void (basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7fd50f32be68 <col:28, col:69> col:69 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fd50f32c030 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXDestructorDecl 0x7fd50f32c0a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:166:5, col:28> col:13 ~basic_ostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fd50f32c158 <line:167:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fd50f32c2a0 <line:169:5, line:170:40> col:5 basic_ostream 'void (class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7fd50f32c1b8 <col:19, col:35> col:35 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7fd50f32c360 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7fd50f32c4b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:175:5, line:176:51> col:20 operator= 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7fd50f32c3e8 <col:30, col:46> col:46 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7fd50f32c560 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7fd50f32c680 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:178:5, line:180:55> line:179:10 swap 'void (class std::__1::basic_ostream<char> &)' inline
| |-ParmVarDecl 0x7fd50f32c5b8 <col:15, col:30> col:30 __rhs 'class std::__1::basic_ostream<char> &'
| `-AlwaysInlineAttr 0x7fd50f32c730 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXConstructorDecl 0x7fd50f32c8a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:183:5, col:65> col:5 basic_ostream 'void (const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7fd50f32c7b8 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-CXXMethodDecl 0x7fd50f32ca30 <line:184:5, col:65> col:20 operator= 'class std::__1::basic_ostream<char> &(const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7fd50f32c970 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-AccessSpecDecl 0x7fd50f32cae0 <line:189:1, col:7> col:1 public
|-CXXRecordDecl 0x7fd50f32cb08 <line:192:5, col:32> col:32 referenced class sentry definition
| |-CXXRecordDecl 0x7fd50f32f990 prev 0x7fd50f32cb08 <line:242:1, col:60> col:60 implicit class sentry
| |-FieldDecl 0x7fd50f32fa28 <line:244:5, col:10> col:10 referenced __ok_ '_Bool'
| |-FieldDecl 0x7fd50f32fbc8 <line:245:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXConstructorDecl 0x7fd50f32fd50 <line:247:5, col:25> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7fd50f32fc48 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x7fd50f32ff10 <line:248:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7fd50f32fe48 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x7fd50f32ffc0 <line:250:1, col:7> col:1 public
| |-CXXConstructorDecl 0x7fd50f3301d0 <line:251:5, col:57> col:14 used sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| | `-ParmVarDecl 0x7fd50f3300e8 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXDestructorDecl 0x7fd50f3302c0 <line:252:5, col:13> col:5 used ~sentry 'void (void) noexcept'
| `-CXXConversionDecl 0x7fd50f330370 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:256:45> col:9 used operator bool '_Bool (void) const'
|   |-CompoundStmt 0x7fd510858800 <col:31, col:45>
|   | `-ReturnStmt 0x7fd5108587e8 <col:32, col:39>
|   |   `-ImplicitCastExpr 0x7fd5108587d0 <col:39> '_Bool' <LValueToRValue>
|   |     `-MemberExpr 0x7fd510858798 <col:39> 'const _Bool' lvalue ->__ok_ 0x7fd50f32fa28
|   |       `-CXXThisExpr 0x7fd510858780 <col:39> 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry *' this
|   `-AlwaysInlineAttr 0x7fd50f330448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f32ce40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:195:5, line:197:27> line:196:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &))' inline
| |-ParmVarDecl 0x7fd50f32cd40 <col:31, col:68> col:48 __pf 'class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &)'
| `-AlwaysInlineAttr 0x7fd50f32cef0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f32d3d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:199:5, line:202:34> line:200:20 operator<< 'class std::__1::basic_ostream<char> &(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &))' inline
| |-ParmVarDecl 0x7fd50f32d2d0 <col:31, line:201:72> col:33 __pf 'basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &)'
| `-AlwaysInlineAttr 0x7fd50f32d480 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f32d5d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:204:5, line:206:34> line:205:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))' inline
| |-ParmVarDecl 0x7fd50f32d4c8 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x7fd50f32d680 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f32d790 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:208:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(_Bool)'
| `-ParmVarDecl 0x7fd50f32d6c8 <col:31, col:36> col:36 __n '_Bool'
|-CXXMethodDecl 0x7fd50f32d900 <line:209:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(short)'
| `-ParmVarDecl 0x7fd50f32d840 <col:31, col:37> col:37 __n 'short'
|-CXXMethodDecl 0x7fd50f32da70 <line:210:5, col:49> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned short)'
| `-ParmVarDecl 0x7fd50f32d9b0 <col:31, col:46> col:46 __n 'unsigned short'
|-CXXMethodDecl 0x7fd50f32dbe0 <line:211:5, col:38> col:20 operator<< 'class std::__1::basic_ostream<char> &(int)'
| `-ParmVarDecl 0x7fd50f32db20 <col:31, col:35> col:35 __n 'int'
|-CXXMethodDecl 0x7fd50f32dd50 <line:212:5, col:47> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned int)'
| `-ParmVarDecl 0x7fd50f32dc90 <col:31, col:44> col:44 __n 'unsigned int'
|-CXXMethodDecl 0x7fd50f32dec0 <line:213:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(long)'
| `-ParmVarDecl 0x7fd50f32de00 <col:31, col:36> col:36 __n 'long'
|-CXXMethodDecl 0x7fd50f32e030 <line:214:5, col:48> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long)'
| `-ParmVarDecl 0x7fd50f32df70 <col:31, col:45> col:45 __n 'unsigned long'
|-CXXMethodDecl 0x7fd50f32e1a0 <line:215:5, col:44> col:20 operator<< 'class std::__1::basic_ostream<char> &(long long)'
| `-ParmVarDecl 0x7fd50f32e0e0 <col:31, col:41> col:41 __n 'long long'
|-CXXMethodDecl 0x7fd50f32e310 <line:216:5, col:53> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long long)'
| `-ParmVarDecl 0x7fd50f32e250 <col:31, col:50> col:50 __n 'unsigned long long'
|-CXXMethodDecl 0x7fd50f32e480 <line:217:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(float)'
| `-ParmVarDecl 0x7fd50f32e3c0 <col:31, col:37> col:37 __f 'float'
|-CXXMethodDecl 0x7fd50f32e5f0 <line:218:5, col:41> col:20 operator<< 'class std::__1::basic_ostream<char> &(double)'
| `-ParmVarDecl 0x7fd50f32e530 <col:31, col:38> col:38 __f 'double'
|-CXXMethodDecl 0x7fd50f32e760 <line:219:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(long double)'
| `-ParmVarDecl 0x7fd50f32e6a0 <col:31, col:43> col:43 __f 'long double'
|-CXXMethodDecl 0x7fd50f32e8d0 <line:220:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(const void *)'
| `-ParmVarDecl 0x7fd50f32e810 <col:31, col:43> col:43 __p 'const void *'
|-CXXMethodDecl 0x7fd50f32eb80 <line:221:5, col:76> col:20 operator<< 'class std::__1::basic_ostream<char> &(basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)'
| `-ParmVarDecl 0x7fd50f32ea78 <col:31, col:72> col:72 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
|-CXXMethodDecl 0x7fd50f32ed40 <line:224:5, col:37> col:20 put 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type)'
| `-ParmVarDecl 0x7fd50f32ec40 <col:24, col:34> col:34 __c 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7fd50f32efa0 <line:225:5, col:62> col:20 write 'class std::__1::basic_ostream<char> &(const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7fd50f32ee28 <col:26, col:43> col:43 __s 'const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fd50f32ee88 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fd50f32f0b0 <line:226:5, col:26> col:20 flush 'class std::__1::basic_ostream<char> &(void)'
|-CXXMethodDecl 0x7fd50f32f200 <line:229:5, line:230:20> col:14 tellp 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type (void)' inline
| `-AlwaysInlineAttr 0x7fd50f32f2a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-CXXMethodDecl 0x7fd50f32f400 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:231:5, line:232:40> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type)' inline
| |-ParmVarDecl 0x7fd50f32f300 <col:26, col:35> col:35 __pos 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-AlwaysInlineAttr 0x7fd50f32f4b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-CXXMethodDecl 0x7fd50f32f6a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:233:5, line:234:65> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir)' inline
| |-ParmVarDecl 0x7fd50f32f530 <col:26, col:35> col:35 __off 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7fd50f32f590 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-AlwaysInlineAttr 0x7fd50f32f758 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-AccessSpecDecl 0x7fd50f32f7a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:236:1, col:10> col:1 protected
`-CXXConstructorDecl 0x7fd50f32f7e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:238:22> col:5 basic_ostream 'void (void)'
  `-AlwaysInlineAttr 0x7fd50f32f8a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream.base" = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry
         0 |   _Bool __ok_
         8 |   basic_ostream<char, struct std::__1::char_traits<char> > & __os_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd50f32cb08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:192:5, col:32> col:32 referenced class sentry definition
|-CXXRecordDecl 0x7fd50f32f990 prev 0x7fd50f32cb08 <line:242:1, col:60> col:60 implicit class sentry
|-FieldDecl 0x7fd50f32fa28 <line:244:5, col:10> col:10 referenced __ok_ '_Bool'
|-FieldDecl 0x7fd50f32fbc8 <line:245:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
|-CXXConstructorDecl 0x7fd50f32fd50 <line:247:5, col:25> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| `-ParmVarDecl 0x7fd50f32fc48 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
|-CXXMethodDecl 0x7fd50f32ff10 <line:248:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| `-ParmVarDecl 0x7fd50f32fe48 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
|-AccessSpecDecl 0x7fd50f32ffc0 <line:250:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fd50f3301d0 <line:251:5, col:57> col:14 used sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| `-ParmVarDecl 0x7fd50f3300e8 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
|-CXXDestructorDecl 0x7fd50f3302c0 <line:252:5, col:13> col:5 used ~sentry 'void (void) noexcept'
`-CXXConversionDecl 0x7fd50f330370 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:256:45> col:9 used operator bool '_Bool (void) const'
  |-CompoundStmt 0x7fd510858800 <col:31, col:45>
  | `-ReturnStmt 0x7fd5108587e8 <col:32, col:39>
  |   `-ImplicitCastExpr 0x7fd5108587d0 <col:39> '_Bool' <LValueToRValue>
  |     `-MemberExpr 0x7fd510858798 <col:39> 'const _Bool' lvalue ->__ok_ 0x7fd50f32fa28
  |       `-CXXThisExpr 0x7fd510858780 <col:39> 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry *' this
  `-AlwaysInlineAttr 0x7fd50f330448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream<char, std::__1::char_traits<char> >::sentry" = type { i8, %"class.std::__1::basic_ostream"* }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream<char, std::__1::char_traits<char> >::sentry" = type { i8, %"class.std::__1::basic_ostream"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fd50eb22e58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:520:1, line:529:1> line:522:29 struct iterator definition
|-TemplateArgument type 'struct std::__1::output_iterator_tag'
|-TemplateArgument type 'void'
|-TemplateArgument type 'void'
|-TemplateArgument type 'void'
|-TemplateArgument type 'void'
|-CXXRecordDecl 0x7fd50eb23160 prev 0x7fd50eb22e58 <col:1, col:29> col:29 implicit struct iterator
|-TypedefDecl 0x7fd50eb23238 <line:524:5, col:24> col:24 value_type 'void':'void'
| `-SubstTemplateTypeParmType 0x7fd50eb23200 'void' sugar
|   |-TemplateTypeParmType 0x7fd50eb0f4b0 '_Tp' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fd50eb0f468 '_Tp'
|   `-BuiltinType 0x7fd50e02ed20 'void'
|-TypedefDecl 0x7fd50eb232c8 <line:525:5, col:24> col:24 difference_type 'void':'void'
| `-SubstTemplateTypeParmType 0x7fd50eb23290 'void' sugar
|   |-TemplateTypeParmType 0x7fd50eb0f530 '_Distance' dependent depth 0 index 2
|   | `-TemplateTypeParm 0x7fd50eb0f4e8 '_Distance'
|   `-BuiltinType 0x7fd50e02ed20 'void'
|-TypedefDecl 0x7fd50eb23358 <line:526:5, col:24> col:24 pointer 'void':'void'
| `-SubstTemplateTypeParmType 0x7fd50eb23320 'void' sugar
|   |-TemplateTypeParmType 0x7fd50eb0f5e0 '_Pointer' dependent depth 0 index 3
|   | `-TemplateTypeParm 0x7fd50eb0f598 '_Pointer'
|   `-BuiltinType 0x7fd50e02ed20 'void'
|-TypedefDecl 0x7fd50eb233e8 <line:527:5, col:24> col:24 reference 'void':'void'
| `-SubstTemplateTypeParmType 0x7fd50eb233b0 'void' sugar
|   |-TemplateTypeParmType 0x7fd50eb0f690 '_Reference' dependent depth 0 index 4
|   | `-TemplateTypeParm 0x7fd50eb0f648 '_Reference'
|   `-BuiltinType 0x7fd50e02ed20 'void'
|-TypedefDecl 0x7fd50eb23478 <line:528:5, col:24> col:24 iterator_category 'struct std::__1::output_iterator_tag':'struct std::__1::output_iterator_tag'
| `-SubstTemplateTypeParmType 0x7fd50eb23440 'struct std::__1::output_iterator_tag' sugar
|   |-TemplateTypeParmType 0x7fd50eb0f440 '_Category' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fd50eb0f400 '_Category'
|   `-RecordType 0x7fd50e9dd5f0 'struct std::__1::output_iterator_tag'
|     `-CXXRecord 0x7fd50e9dd558 'output_iterator_tag'
|-CXXDestructorDecl 0x7fd50eff14e8 <line:522:29> col:29 implicit ~iterator 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fd50e35e858 <col:29> col:29 implicit constexpr iterator 'void (const struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &)' inline default trivial noexcept-unevaluated 0x7fd50e35e858
| `-ParmVarDecl 0x7fd50e35e980 <col:29> col:29 'const struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &'
|-CXXConstructorDecl 0x7fd50e35ea18 <col:29> col:29 implicit used constexpr iterator 'void (struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7fd50e35eb40 <col:29> col:29 'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &&'
| `-CompoundStmt 0x7fd510858088 <col:29>
`-CXXConstructorDecl 0x7fd510857fa0 <col:29> col:29 implicit used constexpr iterator 'void (void) noexcept' inline default trivial
  `-CompoundStmt 0x7fd510858990 <col:29>

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::iterator" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::iterator" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::locale
         0 |   class std::__1::locale::__imp * __locale_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_streambuf<char>
         0 |   (basic_streambuf vtable pointer)
         8 |   class std::__1::locale __loc_
         8 |     class std::__1::locale::__imp * __locale_
        16 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        24 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        32 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        40 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        48 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        56 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd50eec47c8 prev 0x7fd50eec4018 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:62:1, line:123:1> line:62:24 referenced class locale definition
|-VisibilityAttr 0x7fd50eec48c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7fd50eec4910 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:62:1, col:24> col:24 implicit referenced class locale
|-AccessSpecDecl 0x7fd50eec49a8 <line:64:1, col:7> col:1 public
|-CXXRecordDecl 0x7fd50eec4a00 <line:66:5, col:28> col:28 referenced class facet
| `-VisibilityAttr 0x7fd50eec4ac0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7fd50eec4b38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:67:5, col:28> col:28 referenced class id
| `-VisibilityAttr 0x7fd50eec4bf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-TypedefDecl 0x7fd50eec4c50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:69:5, col:17> col:17 referenced category 'int'
| `-BuiltinType 0x7fd50e02edc0 'int'
|-VarDecl 0x7fd50eec4ce0 <line:70:5, line:71:20> col:9 none 'const std::__1::locale::category':'const int' static cinit
| `-IntegerLiteral 0x7fd50eec4d40 <col:20> 'int' 0
|-VarDecl 0x7fd50eec4dc8 <line:70:5, /usr/include/xlocale.h:45:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:72:9 referenced collate 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7fd50eec4e90 </usr/include/xlocale.h:45:27, col:34> 'int'
|   `-BinaryOperator 0x7fd50eec4e68 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7fd50eec4e28 <col:28> 'int' 1
|     `-IntegerLiteral 0x7fd50eec4e48 <col:33> 'int' 0
|-VarDecl 0x7fd50eec4f18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:46:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:73:9 referenced ctype 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7fd50eec4fe0 </usr/include/xlocale.h:46:25, col:32> 'int'
|   `-BinaryOperator 0x7fd50eec4fb8 <col:26, col:31> 'int' '<<'
|     |-IntegerLiteral 0x7fd50eec4f78 <col:26> 'int' 1
|     `-IntegerLiteral 0x7fd50eec4f98 <col:31> 'int' 1
|-VarDecl 0x7fd50eec5068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:48:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:74:9 referenced monetary 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7fd50eec5130 </usr/include/xlocale.h:48:27, col:34> 'int'
|   `-BinaryOperator 0x7fd50eec5108 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7fd50eec50c8 <col:28> 'int' 1
|     `-IntegerLiteral 0x7fd50eec50e8 <col:33> 'int' 3
|-VarDecl 0x7fd50eec51b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:49:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:75:9 referenced numeric 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7fd50eec5280 </usr/include/xlocale.h:49:27, col:34> 'int'
|   `-BinaryOperator 0x7fd50eec5258 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7fd50eec5218 <col:28> 'int' 1
|     `-IntegerLiteral 0x7fd50eec5238 <col:33> 'int' 4
|-VarDecl 0x7fd50eec5308 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:50:31> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:76:9 referenced time 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7fd50eec53d0 </usr/include/xlocale.h:50:24, col:31> 'int'
|   `-BinaryOperator 0x7fd50eec53a8 <col:25, col:30> 'int' '<<'
|     |-IntegerLiteral 0x7fd50eec5368 <col:25> 'int' 1
|     `-IntegerLiteral 0x7fd50eec5388 <col:30> 'int' 5
|-VarDecl 0x7fd50eec5458 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:47:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:77:9 referenced messages 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7fd50eec5520 </usr/include/xlocale.h:47:27, col:34> 'int'
|   `-BinaryOperator 0x7fd50eec54f8 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7fd50eec54b8 <col:28> 'int' 1
|     `-IntegerLiteral 0x7fd50eec54d8 <col:33> 'int' 2
|-VarDecl 0x7fd50eec55a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, line:78:61> col:9 all 'const std::__1::locale::category':'const int' static cinit
| `-BinaryOperator 0x7fd50eec5828 <col:15, col:61> 'int' '|'
|   |-BinaryOperator 0x7fd50eec57c0 <col:15, col:54> 'int' '|'
|   | |-BinaryOperator 0x7fd50eec5758 <col:15, col:44> 'int' '|'
|   | | |-BinaryOperator 0x7fd50eec56f0 <col:15, col:33> 'int' '|'
|   | | | |-BinaryOperator 0x7fd50eec5688 <col:15, col:25> 'int' '|'
|   | | | | |-ImplicitCastExpr 0x7fd50eec5658 <col:15> 'std::__1::locale::category':'int' <LValueToRValue>
|   | | | | | `-DeclRefExpr 0x7fd50eec5608 <col:15> 'const std::__1::locale::category':'const int' lvalue Var 0x7fd50eec4dc8 'collate' 'const std::__1::locale::category':'const int'
|   | | | | `-ImplicitCastExpr 0x7fd50eec5670 <col:25> 'std::__1::locale::category':'int' <LValueToRValue>
|   | | | |   `-DeclRefExpr 0x7fd50eec5630 <col:25> 'const std::__1::locale::category':'const int' lvalue Var 0x7fd50eec4f18 'ctype' 'const std::__1::locale::category':'const int'
|   | | | `-ImplicitCastExpr 0x7fd50eec56d8 <col:33> 'std::__1::locale::category':'int' <LValueToRValue>
|   | | |   `-DeclRefExpr 0x7fd50eec56b0 <col:33> 'const std::__1::locale::category':'const int' lvalue Var 0x7fd50eec5068 'monetary' 'const std::__1::locale::category':'const int'
|   | | `-ImplicitCastExpr 0x7fd50eec5740 <col:44> 'std::__1::locale::category':'int' <LValueToRValue>
|   | |   `-DeclRefExpr 0x7fd50eec5718 <col:44> 'const std::__1::locale::category':'const int' lvalue Var 0x7fd50eec51b8 'numeric' 'const std::__1::locale::category':'const int'
|   | `-ImplicitCastExpr 0x7fd50eec57a8 <col:54> 'std::__1::locale::category':'int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7fd50eec5780 <col:54> 'const std::__1::locale::category':'const int' lvalue Var 0x7fd50eec5308 'time' 'const std::__1::locale::category':'const int'
|   `-ImplicitCastExpr 0x7fd50eec5810 <col:61> 'std::__1::locale::category':'int' <LValueToRValue>
|     `-DeclRefExpr 0x7fd50eec57e8 <col:61> 'const std::__1::locale::category':'const int' lvalue Var 0x7fd50eec5458 'messages' 'const std::__1::locale::category':'const int'
|-CXXConstructorDecl 0x7fd50eec5960 <line:81:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:81:5 locale 'void (void) noexcept'
|-CXXConstructorDecl 0x7fd50eec5b28 <line:82:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:82:5 referenced locale 'void (const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7fd50eec5a18 <col:12, col:24> col:25 'const class std::__1::locale &'
|-CXXConstructorDecl 0x7fd50eec5c78 <line:83:5, col:32> col:14 locale 'void (const char *)'
| `-ParmVarDecl 0x7fd50eec5bf0 <col:21, col:31> col:32 'const char *'
|-CXXConstructorDecl 0x7fd50eec5dc0 <line:84:5, col:34> col:14 locale 'void (const std::__1::string &)'
| `-ParmVarDecl 0x7fd50eec5d38 <col:21, col:33> col:34 'const std::__1::string &'
|-CXXConstructorDecl 0x7fd50eec60a0 <line:85:5, col:48> col:5 locale 'void (const class std::__1::locale &, const char *, std::__1::locale::category)'
| |-ParmVarDecl 0x7fd50eec5e80 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7fd50eec5ef8 <col:27, col:37> col:38 'const char *'
| `-ParmVarDecl 0x7fd50eec5f68 <col:40> col:48 'std::__1::locale::category':'int'
|-CXXConstructorDecl 0x7fd50eec6380 <line:86:5, col:50> col:5 locale 'void (const class std::__1::locale &, const std::__1::string &, std::__1::locale::category)'
| |-ParmVarDecl 0x7fd50eec6170 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7fd50eec61e0 <col:27, col:39> col:40 'const std::__1::string &'
| `-ParmVarDecl 0x7fd50eec6250 <col:42> col:50 'std::__1::locale::category':'int'
|-FunctionTemplateDecl 0x7fd50eec6758 <line:87:5, line:88:64> col:35 locale
| |-TemplateTypeParmDecl 0x7fd50eec6440 <line:87:15, col:21> col:21 referenced class depth 0 index 0 _Facet
| `-CXXConstructorDecl 0x7fd50eec66b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:88:64> col:35 locale 'void (const class std::__1::locale &, _Facet *)'
|   |-ParmVarDecl 0x7fd50eec6500 <col:42, col:54> col:55 'const class std::__1::locale &'
|   |-ParmVarDecl 0x7fd50eec6598 <col:57, col:63> col:64 '_Facet *'
|   |-AlwaysInlineAttr 0x7fd50eec67b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|   `-VisibilityAttr 0x7fd50eec6800 <col:51, col:74> Hidden
|-CXXConstructorDecl 0x7fd50eec6a30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:89:5, col:50> col:5 locale 'void (const class std::__1::locale &, const class std::__1::locale &, std::__1::locale::category)'
| |-ParmVarDecl 0x7fd50eec6820 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7fd50eec6890 <col:27, col:39> col:40 'const class std::__1::locale &'
| `-ParmVarDecl 0x7fd50eec6900 <col:42> col:50 'std::__1::locale::category':'int'
|-CXXDestructorDecl 0x7fd50eec6b40 <line:91:5, col:13> col:5 used ~locale 'void (void) noexcept'
|-CXXMethodDecl 0x7fd50eec6cf8 <line:93:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:93:19 operator= 'const class std::__1::locale &(const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7fd50eec6bf0 <col:29, col:41> col:42 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7fd50eec6fe8 <line:95:5, line:97:37> col:14 combine
| |-TemplateTypeParmDecl 0x7fd50eec6d98 <line:95:15, col:21> col:21 class depth 0 index 0 _Facet
| `-CXXMethodDecl 0x7fd50eec6f50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:97:37> col:14 combine 'class std::__1::locale (const class std::__1::locale &) const' inline
|   |-ParmVarDecl 0x7fd50eec6e60 <col:22, col:34> col:35 'const class std::__1::locale &'
|   `-VisibilityAttr 0x7fd50eec7040 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:624:40, col:63> Hidden
|-CXXMethodDecl 0x7fd50eec70a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:100:5, col:19> col:12 name 'std::__1::string (void) const'
|-CXXMethodDecl 0x7fd50eec7210 <line:101:5, col:36> col:10 used operator== '_Bool (const class std::__1::locale &) const'
| `-ParmVarDecl 0x7fd50eec7150 <col:21, col:33> col:34 'const class std::__1::locale &'
|-CXXMethodDecl 0x7fd50eec7348 <line:102:5, col:70> col:10 operator!= '_Bool (const class std::__1::locale &) const'
| |-ParmVarDecl 0x7fd50eec72c0 <col:21, col:35> col:35 used __y 'const class std::__1::locale &'
| `-CompoundStmt 0x7fd50db14660 <col:46, col:70>
|   `-ReturnStmt 0x7fd50db14648 <col:47, col:68>
|     `-UnaryOperator 0x7fd50db14628 <col:54, col:68> '_Bool' prefix '!'
|       `-ParenExpr 0x7fd50db14608 <col:55, col:68> '_Bool'
|         `-CXXOperatorCallExpr 0x7fd50db145c0 <col:56, col:65> '_Bool'
|           |-ImplicitCastExpr 0x7fd50db145a8 <col:62> '_Bool (*)(const class std::__1::locale &) const' <FunctionToPointerDecay>
|           | `-DeclRefExpr 0x7fd50db14550 <col:62> '_Bool (const class std::__1::locale &) const' lvalue CXXMethod 0x7fd50eec7210 'operator==' '_Bool (const class std::__1::locale &) const'
|           |-UnaryOperator 0x7fd50db13280 <col:56, col:57> 'const class std::__1::locale' lvalue prefix '*'
|           | `-CXXThisExpr 0x7fd50db13268 <col:57> 'const class std::__1::locale *' this
|           `-DeclRefExpr 0x7fd50db132a0 <col:65> 'const class std::__1::locale' lvalue ParmVar 0x7fd50eec72c0 '__y' 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7fd50eec7ad8 <line:103:5, line:106:73> line:105:12 operator()
| |-TemplateTypeParmDecl 0x7fd50eec73e8 <line:103:15, col:21> col:21 referenced class depth 0 index 0 _CharT
| |-TemplateTypeParmDecl 0x7fd50eec7458 <col:29, col:35> col:35 referenced class depth 0 index 1 _Traits
| |-TemplateTypeParmDecl 0x7fd50eec74c8 <col:44, col:50> col:50 referenced class depth 0 index 2 _Allocator
| `-CXXMethodDecl 0x7fd50eec7a40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:106:73> line:105:12 operator() '_Bool (const basic_string<_CharT, _Traits, _Allocator> &, const basic_string<_CharT, _Traits, _Allocator> &) const' inline
|   |-ParmVarDecl 0x7fd50eec7730 <col:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   |-ParmVarDecl 0x7fd50eec7930 <line:106:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   `-VisibilityAttr 0x7fd50eec7b38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:624:40, col:63> Hidden
|-CXXMethodDecl 0x7fd50eec7c50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:109:5, col:39> col:19 global 'class std::__1::locale (const class std::__1::locale &)' static
| `-ParmVarDecl 0x7fd50eec7b90 <col:26, col:38> col:39 'const class std::__1::locale &'
|-CXXMethodDecl 0x7fd50eec7d40 <line:110:5, col:34> col:26 classic 'const class std::__1::locale &(void)' static
|-AccessSpecDecl 0x7fd50eec7dd8 <line:112:1, col:8> col:1 private
|-CXXRecordDecl 0x7fd50eec7e00 <line:113:5, col:11> col:11 referenced class __imp
|-FieldDecl 0x7fd50eec7ef8 <line:114:5, col:12> col:12 __locale_ 'class std::__1::locale::__imp *'
|-CXXMethodDecl 0x7fd50eec8140 <line:116:5, col:52> col:10 referenced __install_ctor 'void (const class std::__1::locale &, class std::__1::locale::facet *, long)'
| |-ParmVarDecl 0x7fd50eec7f50 <col:25, col:37> col:38 'const class std::__1::locale &'
| |-ParmVarDecl 0x7fd50eec7fe8 <col:40, col:45> col:46 'class std::__1::locale::facet *'
| `-ParmVarDecl 0x7fd50eec8060 <col:48> col:52 'long'
|-CXXMethodDecl 0x7fd50eec8270 <line:117:5, col:29> col:20 __global 'class std::__1::locale &(void)' static
|-CXXMethodDecl 0x7fd50eec8410 <line:118:5, col:25> col:10 referenced has_facet '_Bool (class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7fd50eec8348 <col:20, col:22> col:23 'class std::__1::locale::id &'
|-CXXMethodDecl 0x7fd50eec85b0 <line:119:5, col:33> col:18 used use_facet 'const class std::__1::locale::facet *(class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7fd50eec84c0 <col:28, col:30> col:31 'class std::__1::locale::id &'
|-FriendDecl 0x7fd50eec88d8 <line:121:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:121:41
| `-FunctionTemplateDecl 0x7fd50eec8818 parent 0x7fd50eec3f80 prev 0x7fd50eec43b0 <col:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:121:41 has_facet
|   |-TemplateTypeParmDecl 0x7fd50eec8650 <col:15, col:21> col:21 class depth 0 index 0 _Facet
|   `-FunctionDecl 0x7fd50eec8770 parent 0x7fd50eec3f80 prev 0x7fd50eec4318 <col:29, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:121:41 has_facet '_Bool (const class std::__1::locale &) noexcept'
|     |-ParmVarDecl 0x7fd50eec86e0 <col:51, col:63> col:64 'const class std::__1::locale &'
|     |-AlwaysInlineAttr 0x7fd50eec88b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|     `-VisibilityAttr 0x7fd50eec88c8 <col:51, col:74> Inherited Hidden
`-FriendDecl 0x7fd50db131f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:122:5, col:73> col:50
  `-FunctionTemplateDecl 0x7fd50db13138 parent 0x7fd50eec3f80 prev 0x7fd50eec46e8 <col:5, col:73> col:50 use_facet
    |-TemplateTypeParmDecl 0x7fd50eec8910 <col:15, col:21> col:21 referenced class depth 0 index 0 _Facet
    |-FunctionDecl 0x7fd50db13090 parent 0x7fd50eec3f80 prev 0x7fd50eec4650 <col:29, col:73> col:50 use_facet 'const _Facet &(const class std::__1::locale &)'
    | |-ParmVarDecl 0x7fd50eec89a0 <col:60, col:72> col:73 'const class std::__1::locale &'
    | |-AlwaysInlineAttr 0x7fd50db131d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
    | `-VisibilityAttr 0x7fd50db131e8 <col:51, col:74> Inherited Hidden
    `-Function 0x7fd510859ac0 'use_facet' 'const class std::__1::ctype<char> &(const class std::__1::locale &)'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  NonVirtualBaseLLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fd50e8cacd8 parent 0x7fd50e8c2088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:479:84> col:64 class basic_streambuf definition
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fd50f2302b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7fd50f230378 prev 0x7fd50e8cacd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:122:1, col:28> col:28 implicit class basic_streambuf
|-AccessSpecDecl 0x7fd50f230410 <line:124:1, col:7> col:1 public
|-TypedefDecl 0x7fd50f230478 <line:126:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fd50f230440 'char' sugar
|   |-TemplateTypeParmType 0x7fd50f20a630 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fd50f20a5e8 '_CharT'
|   `-BuiltinType 0x7fd50e02ed60 'char'
|-TypedefDecl 0x7fd50f230508 <line:127:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fd50f2304d0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fd50f20a6a0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fd50f20a658 '_Traits'
|   `-RecordType 0x7fd50e8ca560 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fd50ed13e88 'char_traits'
|-TypedefDecl 0x7fd50f230610 <line:128:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fd50f2305c0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fd50ed159d0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fd50ed141e8 'int_type'
|     `-BuiltinType 0x7fd50e02edc0 'int'
|-TypedefDecl 0x7fd50f230700 <line:129:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fd50f2306b0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fd50f230690 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fd50ed142b8 'pos_type'
|     `-TypedefType 0x7fd50ed09a40 'std::__1::streampos' sugar
|       |-Typedef 0x7fd50e8d07b8 'streampos'
|       `-TemplateSpecializationType 0x7fd50e8d0710 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fd50e8d06f0 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fd50e8d0600 'fpos'
|-TypedefDecl 0x7fd50f2307f0 <line:130:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fd50f2307a0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fd50f230780 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fd50ed14250 'off_type'
|     `-TypedefType 0x7fd50ed099b0 'std::__1::streamoff' sugar
|       |-Typedef 0x7fd50e8d0b58 'streamoff'
|       `-BuiltinType 0x7fd50e02ee00 'long long'
|-CXXDestructorDecl 0x7fd50f230878 <line:132:5, col:30> col:13 ~basic_streambuf 'void (void)' virtual noexcept-unevaluated 0x7fd50f230878
|-CXXMethodDecl 0x7fd50f2309b0 <line:135:5, line:141:5> line:136:12 pubimbue 'class std::__1::locale (const class std::__1::locale &)' inline
| |-ParmVarDecl 0x7fd50f230928 <col:21, col:35> col:35 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7fd50f230a88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f230ad0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:143:5, line:144:44> col:12 getloc 'class std::__1::locale (void) const' inline
| `-AlwaysInlineAttr 0x7fd50f230b78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f230d90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:147:5, line:149:32> line:148:22 pubsetbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7fd50f230c18 <col:32, col:43> col:43 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fd50f230c78 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7fd50f230e48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f2310d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:151:5, line:154:46> line:152:14 referenced pubseekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7fd50f230ee0 <col:25, col:34> col:34 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7fd50f230f40 <col:41, col:59> col:59 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| |-ParmVarDecl 0x7fd50f230fa0 <line:153:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7fd50f231190 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f231360 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:156:5, line:159:38> line:157:14 referenced pubseekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7fd50f2311e8 <col:25, col:34> col:34 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| |-ParmVarDecl 0x7fd50f231248 <line:158:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7fd50f231418 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f231460 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:161:5, line:162:36> col:9 referenced pubsync 'int (void)' inline
| `-AlwaysInlineAttr 0x7fd50f231508 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f231550 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:166:5, line:171:5> line:167:16 in_avail 'std::__1::streamsize (void)' inline
| `-AlwaysInlineAttr 0x7fd50f2315f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f2316b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:173:5, line:178:5> line:174:14 snextc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7fd50f231758 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f2317c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:180:5, line:185:5> line:181:14 sbumpc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7fd50f231868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f2318d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:187:5, line:192:5> line:188:14 sgetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7fd50f231978 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f231b40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:194:5, line:196:32> line:195:16 referenced sgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7fd50f2319d0 <col:22, col:33> col:33 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fd50f231a30 <col:38, col:49> col:49 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7fd50f231bf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f231d10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:199:5, line:204:5> line:200:14 sputbackc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7fd50f231c50 <col:24, col:34> col:34 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7fd50f231dc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f231e28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:206:5, line:211:5> line:207:14 sungetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7fd50f231ed0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f231fb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:214:5, line:220:5> line:215:14 sputc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7fd50f231f28 <col:20, col:30> col:30 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7fd50f232060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f232260 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:222:5, line:224:32> line:223:16 used sputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7fd50f2320e8 <col:22, col:39> col:39 used __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fd50f232148 <col:44, col:55> col:55 used __n 'std::__1::streamsize':'long'
| |-CompoundStmt 0x7fd51085c260 <line:224:5, col:32>
| | `-ReturnStmt 0x7fd51085c248 <col:7, col:29>
| |   `-CXXMemberCallExpr 0x7fd51085c1e0 <col:14, col:29> 'std::__1::streamsize':'long'
| |     |-MemberExpr 0x7fd51085c158 <col:14> '<bound member function type>' ->xsputn 0x7fd50f234700
| |     | `-CXXThisExpr 0x7fd51085c140 <col:14> 'class std::__1::basic_streambuf<char> *' this
| |     |-ImplicitCastExpr 0x7fd51085c218 <col:21> 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7fd51085c190 <col:21> 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *' lvalue ParmVar 0x7fd50f2320e8 '__s' 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |     `-ImplicitCastExpr 0x7fd51085c230 <col:26> 'std::__1::streamsize':'long' <LValueToRValue>
| |       `-DeclRefExpr 0x7fd51085c1b8 <col:26> 'std::__1::streamsize':'long' lvalue ParmVar 0x7fd50f232148 '__n' 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7fd50f232318 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-AccessSpecDecl 0x7fd50f232360 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:226:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fd50f2323c8 <line:227:5, col:21> col:5 basic_streambuf 'void (void)'
|-CXXConstructorDecl 0x7fd50f2325a0 <line:228:5, col:49> col:5 basic_streambuf 'void (const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7fd50f2324b8 <col:21, col:44> col:44 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7fd50f232760 <line:229:5, col:60> col:22 operator= 'class std::__1::basic_streambuf<char> &(const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7fd50f232698 <col:32, col:55> col:55 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7fd50f2328e0 <line:230:5, col:37> col:10 swap 'void (class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7fd50f232820 <col:15, col:32> col:32 __rhs 'class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7fd50f232a10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:233:68> col:38 eback 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fd50f232ab8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f232b20 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:234:68> col:38 gptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fd50f232bc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f232c30 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:235:68> col:38 egptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fd50f232cd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f232da8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:237:5, line:238:43> col:10 gbump 'void (int)' inline
| |-ParmVarDecl 0x7fd50f232d20 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7fd50f232e58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f2330c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:240:5, line:245:5> line:241:10 setg 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7fd50f232eb0 <col:15, col:26> col:26 __gbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fd50f232f20 <col:34, col:45> col:45 __gnext 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fd50f232f90 <col:54, col:65> col:65 __gend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7fd50f233180 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f2331e8 <line:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:248:68> col:38 pbase 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fd50f233290 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f2332f8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:249:68> col:38 pptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fd50f2333a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f233408 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:250:68> col:38 epptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7fd50f2334b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fd50f233580 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:252:5, line:253:43> col:10 pbump 'void (int)' inline
| |-ParmVarDecl 0x7fd50f2334f8 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7fd50f233630 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f233810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:255:5, line:259:5> line:256:10 setp 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7fd50f233688 <col:15, col:26> col:26 __pbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7fd50f2336f8 <col:34, col:45> col:45 __pend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7fd50f2338c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fd50f233998 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:263:5, col:43> col:18 imbue 'void (const class std::__1::locale &)' virtual
| `-ParmVarDecl 0x7fd50f233910 <col:24, col:38> col:38 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7fd50f233b48 <line:266:5, col:67> col:30 setbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7fd50f233a58 <col:37, col:48> col:48 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fd50f233ab8 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fd50f233d68 <line:267:5, line:268:87> line:267:22 seekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7fd50f233c10 <col:30, col:39> col:39 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7fd50f233c70 <col:46, col:64> col:64 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-ParmVarDecl 0x7fd50f233cd0 <line:268:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fd50f233f28 <line:269:5, line:270:87> line:269:22 seekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7fd50f233e38 <col:30, col:39> col:39 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ParmVarDecl 0x7fd50f233e98 <line:270:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7fd50f233fe0 <line:271:5, col:22> col:17 sync 'int (void)' virtual
|-CXXMethodDecl 0x7fd50f234088 <line:274:5, col:34> col:24 showmanyc 'std::__1::streamsize (void)' virtual
|-CXXMethodDecl 0x7fd50f234230 <line:275:5, col:61> col:24 xsgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7fd50f234140 <col:31, col:42> col:42 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fd50f2341a0 <col:47, col:58> col:58 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fd50f234308 <line:276:5, col:32> col:22 underflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7fd50f2343d0 <line:277:5, col:28> col:22 uflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7fd50f234550 <line:280:5, col:65> col:22 pbackfail 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7fd50f234488 <col:32, col:64> col:41 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7fd50f234700 <line:283:5, col:67> col:24 used xsputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7fd50f234610 <col:31, col:48> col:48 __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fd50f234670 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fd50f234850 <line:284:5, col:64> col:22 overflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7fd50f2347c8 <col:31, col:63> col:40 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-AccessSpecDecl 0x7fd50f234900 <line:286:1, col:8> col:1 private
|-FieldDecl 0x7fd50f234928 <line:287:5, col:12> col:12 __loc_ 'class std::__1::locale'
|-FieldDecl 0x7fd50f234980 <line:288:5, col:16> col:16 __binp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fd50f2349d8 <line:289:5, col:16> col:16 __ninp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fd50f234a30 <line:290:5, col:16> col:16 __einp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fd50f234a88 <line:291:5, col:16> col:16 __bout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7fd50f234ae0 <line:292:5, col:16> col:16 __nout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
`-FieldDecl 0x7fd50f234b38 <line:293:5, col:16> col:16 __eout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fd50dbd5528 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:998:1, line:1037:1> line:999:28 class ostreambuf_iterator definition
|-public 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-CXXRecordDecl 0x7fd50e35ce90 prev 0x7fd50dbd5528 <col:1, col:28> col:28 implicit class ostreambuf_iterator
|-AccessSpecDecl 0x7fd50e35cf28 <line:1002:1, col:7> col:1 public
|-TypedefDecl 0x7fd50e35cf88 <line:1003:5, col:45> col:45 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fd50e35cf50 'char' sugar
|   |-TemplateTypeParmType 0x7fd50eb36580 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fd50eb36540 '_CharT'
|   `-BuiltinType 0x7fd50e02ed60 'char'
|-TypedefDecl 0x7fd50e35d018 <line:1004:5, col:45> col:45 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fd50e35cfe0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fd50eb365f0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fd50eb365a8 '_Traits'
|   `-RecordType 0x7fd50e8ca560 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fd50ed13e88 'char_traits'
|-TypedefDecl 0x7fd50e35d138 <line:1005:5, col:45> col:45 streambuf_type 'basic_streambuf<char, struct std::__1::char_traits<char> >':'class std::__1::basic_streambuf<char>'
| `-TemplateSpecializationType 0x7fd50e35d090 'basic_streambuf<char, struct std::__1::char_traits<char> >' sugar basic_streambuf
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7fd50e8cade0 'class std::__1::basic_streambuf<char>'
|     `-ClassTemplateSpecialization 0x7fd50e8cacd8 'basic_streambuf'
|-TypedefDecl 0x7fd50e35d258 <line:1006:5, col:45> col:45 ostream_type 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>'
| `-TemplateSpecializationType 0x7fd50e35d1b0 'basic_ostream<char, struct std::__1::char_traits<char> >' sugar basic_ostream
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7fd50e8cb7c0 'class std::__1::basic_ostream<char>'
|     `-ClassTemplateSpecialization 0x7fd50e8cb6b8 'basic_ostream'
|-AccessSpecDecl 0x7fd50e35d2b0 <line:1007:1, col:8> col:1 private
|-FieldDecl 0x7fd50e35d338 <line:1008:5, col:21> col:21 referenced __sbuf_ 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
|-AccessSpecDecl 0x7fd50e35d380 <line:1009:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fd50e35d518 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1011:33> line:1010:31 used ostreambuf_iterator 'void (std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type &) noexcept'
| |-ParmVarDecl 0x7fd50e35d408 <col:51, col:65> col:65 used __s 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type &'
| |-CXXCtorInitializer 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>'
| | `-CXXConstructExpr 0x7fd5108589a8 <col:31> 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7fd50e35d338 '__sbuf_' 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
| | `-CXXMemberCallExpr 0x7fd5108588f0 <line:1011:19, col:29> 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| |   `-MemberExpr 0x7fd5108588b8 <col:19, col:23> '<bound member function type>' .rdbuf 0x7fd50f23b4e0
| |     `-ImplicitCastExpr 0x7fd510858918 <col:19> 'const class std::__1::basic_ios<char>' lvalue <UncheckedDerivedToBase (virtual basic_ios)>
| |       `-DeclRefExpr 0x7fd510858820 <col:19> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type':'class std::__1::basic_ostream<char>' lvalue ParmVar 0x7fd50e35d408 '__s' 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type &'
| |-CompoundStmt 0x7fd50eb395b8 <col:32, col:33>
| `-AlwaysInlineAttr 0x7fd50e35d608 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fd50e35d748 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1013:25> line:1012:31 ostreambuf_iterator 'void (std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *) noexcept'
| |-ParmVarDecl 0x7fd50e35d660 <col:51, col:67> col:67 __s 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
| `-AlwaysInlineAttr 0x7fd50e35d808 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50e35d990 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1019:9> line:1014:52 operator= 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(char)'
| |-ParmVarDecl 0x7fd50e35d888 <col:62, col:69> col:69 __c 'char':'char'
| `-AlwaysInlineAttr 0x7fd50e35da40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50e35dae0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1020:82> col:52 operator* 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(void)'
| `-AlwaysInlineAttr 0x7fd50e35db88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50e35dbf0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1021:82> col:52 operator++ 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(void)'
| `-AlwaysInlineAttr 0x7fd50e35dc98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50e35dda0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1022:82> col:52 operator++ 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(int)'
| |-ParmVarDecl 0x7fd50e35dce0 <col:63> col:66 'int'
| `-AlwaysInlineAttr 0x7fd50e35de50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50e35de98 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1023:82> col:36 used failed '_Bool (void) const noexcept'
| |-CompoundStmt 0x7fd510861748 <col:61, col:82>
| | `-ReturnStmt 0x7fd510861730 <col:62, col:80>
| |   `-BinaryOperator 0x7fd510861708 <col:69, col:80> '_Bool' '=='
| |     |-ImplicitCastExpr 0x7fd5108616d8 <col:69> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' <LValueToRValue>
| |     | `-MemberExpr 0x7fd5108616a0 <col:69> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *const' lvalue ->__sbuf_ 0x7fd50e35d338
| |     |   `-CXXThisExpr 0x7fd510861688 <col:69> 'const class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > *' this
| |     `-ImplicitCastExpr 0x7fd5108616f0 <col:80> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' <NullToPointer>
| |       `-IntegerLiteral 0x7fd50eb39c88 <col:80> 'int' 0
| `-AlwaysInlineAttr 0x7fd50e35df40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FriendDecl 0x7fd50e35e780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1029:5, line:1035:47> line:1033:5
| `-FunctionTemplateDecl 0x7fd50e35e650 parent 0x7fd50e9dd268 prev 0x7fd50eeffb60 <line:1029:5, line:1035:47> line:1033:5 __pad_and_output
|   |-TemplateTypeParmDecl 0x7fd50e35df88 <line:1029:15, col:21> col:21 class depth 0 index 0 _Ch
|   |-TemplateTypeParmDecl 0x7fd50e35dff8 <col:26, col:32> col:32 class depth 0 index 1 _Tr
|   |-FunctionDecl 0x7fd50e35e578 parent 0x7fd50e9dd268 prev 0x7fd50eeffac8 <line:1030:5, line:1035:47> line:1033:5 __pad_and_output 'ostreambuf_iterator<_Ch, _Tr> (ostreambuf_iterator<_Ch, _Tr>, const _Ch *, const _Ch *, const _Ch *, class std::__1::ios_base &, _Ch)'
|   | |-ParmVarDecl 0x7fd50e35e1d8 <col:22, col:52> col:52 __s 'ostreambuf_iterator<_Ch, _Tr>'
|   | |-ParmVarDecl 0x7fd50e35e278 <line:1034:22, col:33> col:33 __ob 'const _Ch *'
|   | |-ParmVarDecl 0x7fd50e35e2e8 <col:39, col:50> col:50 __op 'const _Ch *'
|   | |-ParmVarDecl 0x7fd50e35e358 <col:56, col:67> col:67 __oe 'const _Ch *'
|   | |-ParmVarDecl 0x7fd50e35e3b8 <line:1035:22, col:32> col:32 __iob 'class std::__1::ios_base &'
|   | |-ParmVarDecl 0x7fd50e35e428 <col:39, col:43> col:43 __fl '_Ch'
|   | `-VisibilityAttr 0x7fd50e35e6e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:624:40, col:63> Inherited Hidden
|   `-Function 0x7fd510857c58 '__pad_and_output' 'ostreambuf_iterator<char, struct std::__1::char_traits<char> > (ostreambuf_iterator<char, struct std::__1::char_traits<char> >, const char *, const char *, const char *, class std::__1::ios_base &, char)'
|-CXXConstructorDecl 0x7fd50e35eba8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:999:28> col:28 implicit constexpr ostreambuf_iterator 'void (const class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &)' inline default trivial noexcept-unevaluated 0x7fd50e35eba8
| `-ParmVarDecl 0x7fd50e35ecd0 <col:28> col:28 'const class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &'
|-CXXConstructorDecl 0x7fd50e35ed68 <col:28> col:28 implicit used constexpr ostreambuf_iterator 'void (class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7fd50e35ee90 <col:28> col:28 used 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&'
| |-CXXCtorInitializer 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>'
| | `-CXXConstructExpr 0x7fd5108580a0 <col:28> 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>' 'void (struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &&) noexcept'
| |   `-ImplicitCastExpr 0x7fd510857f80 <col:28> 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>' xvalue <UncheckedDerivedToBase (iterator)>
| |     `-CXXStaticCastExpr 0x7fd510857f50 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' xvalue static_cast<class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&> <NoOp>
| |       `-DeclRefExpr 0x7fd510857f18 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' lvalue ParmVar 0x7fd50e35ee90 '' 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&'
| |-CXXCtorInitializer Field 0x7fd50e35d338 '__sbuf_' 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
| | `-ImplicitCastExpr 0x7fd510858298 <col:28> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' <LValueToRValue>
| |   `-MemberExpr 0x7fd510858248 <col:28> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' xvalue .__sbuf_ 0x7fd50e35d338
| |     `-CXXStaticCastExpr 0x7fd510858218 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' xvalue static_cast<class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&> <NoOp>
| |       `-DeclRefExpr 0x7fd5108581e0 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' lvalue ParmVar 0x7fd50e35ee90 '' 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&'
| `-CompoundStmt 0x7fd5108582e8 <col:28>
`-CXXDestructorDecl 0x7fd50e35ef30 <col:28> col:28 implicit referenced ~ostreambuf_iterator 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ostreambuf_iterator" = type { %"class.std::__1::basic_streambuf"* }
  NonVirtualBaseLLVMType:%"class.std::__1::ostreambuf_iterator" = type { %"class.std::__1::basic_streambuf"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fd50f018968 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:583:90> col:64 class __basic_string_common definition
|-TemplateArgument integral 1
|-VisibilityAttr 0x7fd50f018af8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7fd50f018ba8 prev 0x7fd50f018968 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:558:1, col:28> col:28 implicit class __basic_string_common
|-AccessSpecDecl 0x7fd50f018c40 <line:560:1, col:10> col:1 protected
|-CXXMethodDecl 0x7fd50f018c68 <line:561:22, col:50> col:27 used __throw_length_error 'void (void) const'
| `-CXX11NoReturnAttr 0x7fd50f018d38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:313:30> Inherited
|-CXXMethodDecl 0x7fd50f018d80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:562:22, col:50> col:27 __throw_out_of_range 'void (void) const'
| `-CXX11NoReturnAttr 0x7fd50f018e28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:313:30> Inherited
|-CXXDestructorDecl 0x7fd50f172d40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:583:64> col:64 implicit ~__basic_string_common 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fd50f3986a8 <col:64> col:64 implicit used constexpr __basic_string_common 'void (void) noexcept' inline default trivial
| `-CompoundStmt 0x7fd50f398b08 <col:64>
|-CXXConstructorDecl 0x7fd50f3987b8 <col:64> col:64 implicit constexpr __basic_string_common 'void (const class std::__1::__basic_string_common<true> &)' inline default trivial noexcept-unevaluated 0x7fd50f3987b8
| `-ParmVarDecl 0x7fd50f3988e0 <col:64> col:64 'const class std::__1::__basic_string_common<true> &'
`-CXXConstructorDecl 0x7fd50f398978 <col:64> col:64 implicit constexpr __basic_string_common 'void (class std::__1::__basic_string_common<true> &&)' inline default trivial noexcept-unevaluated 0x7fd50f398978
  `-ParmVarDecl 0x7fd50f398aa0 <col:64> col:64 'class std::__1::__basic_string_common<true> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fd50e8cbca8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:101:1, col:52> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1759:28 class allocator definition
|-TemplateArgument type 'char'
|-CXXRecordDecl 0x7fd50f114c48 prev 0x7fd50e8cbca8 <col:1, col:28> col:28 implicit class allocator
|-AccessSpecDecl 0x7fd50f114ce0 <line:1761:1, col:7> col:1 public
|-TypedefDecl 0x7fd50f114d08 <line:1762:5, col:31> col:31 referenced size_type 'size_t':'unsigned long'
| `-TypedefType 0x7fd50e870420 'size_t' sugar
|   |-Typedef 0x7fd50e80eb60 'size_t'
|   `-TypedefType 0x7fd50e80eb30 '__darwin_size_t' sugar
|     |-Typedef 0x7fd50e064430 '__darwin_size_t'
|     `-BuiltinType 0x7fd50e02ee80 'unsigned long'
|-TypedefDecl 0x7fd50f114d60 <line:1763:5, col:31> col:31 referenced difference_type 'ptrdiff_t':'long'
| `-TypedefType 0x7fd50eb0b4a0 'ptrdiff_t' sugar
|   |-Typedef 0x7fd50e8d5028 'ptrdiff_t'
|   `-BuiltinType 0x7fd50e02ede0 'long'
|-TypedefDecl 0x7fd50f114e28 <line:1764:5, col:31> col:31 referenced pointer 'char *'
| `-PointerType 0x7fd50f114df0 'char *'
|   `-SubstTemplateTypeParmType 0x7fd50f114dc0 'char' sugar
|     |-TemplateTypeParmType 0x7fd50d87a5d0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fd50d87a588 '_Tp'
|     `-BuiltinType 0x7fd50e02ed60 'char'
|-TypedefDecl 0x7fd50f114eb8 <line:1765:5, col:31> col:31 referenced const_pointer 'const char *'
| `-PointerType 0x7fd50f114e80 'const char *'
|   `-QualType 0x7fd50f114dc1 'const char' const
|     `-SubstTemplateTypeParmType 0x7fd50f114dc0 'char' sugar
|       |-TemplateTypeParmType 0x7fd50d87a5d0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fd50d87a588 '_Tp'
|       `-BuiltinType 0x7fd50e02ed60 'char'
|-TypedefDecl 0x7fd50f114f48 <line:1766:5, col:31> col:31 reference 'char &'
| `-LValueReferenceType 0x7fd50f114f10 'char &'
|   `-SubstTemplateTypeParmType 0x7fd50f114dc0 'char' sugar
|     |-TemplateTypeParmType 0x7fd50d87a5d0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fd50d87a588 '_Tp'
|     `-BuiltinType 0x7fd50e02ed60 'char'
|-TypedefDecl 0x7fd50f114fd8 <line:1767:5, col:31> col:31 const_reference 'const char &'
| `-LValueReferenceType 0x7fd50f114fa0 'const char &'
|   `-QualType 0x7fd50f114dc1 'const char' const
|     `-SubstTemplateTypeParmType 0x7fd50f114dc0 'char' sugar
|       |-TemplateTypeParmType 0x7fd50d87a5d0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fd50d87a588 '_Tp'
|       `-BuiltinType 0x7fd50e02ed60 'char'
|-TypedefDecl 0x7fd50f115040 <line:1768:5, col:31> col:31 referenced value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fd50f114dc0 'char' sugar
|   |-TemplateTypeParmType 0x7fd50d87a5d0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fd50d87a588 '_Tp'
|   `-BuiltinType 0x7fd50e02ed60 'char'
|-TypedefDecl 0x7fd50f115098 <line:1770:5, col:23> col:23 referenced propagate_on_container_move_assignment 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fd50e8f3000 'std::__1::true_type' sugar
|   |-Typedef 0x7fd50e8e46d0 'true_type'
|   `-TemplateSpecializationType 0x7fd50e8e45e0 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fd50e8e4448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:522:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fd50e8e4430 <line:525:31> '_Bool' true
|     `-RecordType 0x7fd50e8e45c0 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fd50e8e44b8 'integral_constant'
|-TypedefDecl 0x7fd50f1150f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1771:5, col:23> col:23 referenced is_always_equal 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fd50e8f3000 'std::__1::true_type' sugar
|   |-Typedef 0x7fd50e8e46d0 'true_type'
|   `-TemplateSpecializationType 0x7fd50e8e45e0 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fd50e8e4448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:522:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fd50e8e4430 <line:525:31> '_Bool' true
|     `-RecordType 0x7fd50e8e45c0 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fd50e8e44b8 'integral_constant'
|-ClassTemplateDecl 0x7fd50f115268 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1773:5, col:33> col:33 rebind
| |-TemplateTypeParmDecl 0x7fd50f115148 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXRecordDecl 0x7fd50f1151d0 <col:26, col:33> col:33 struct rebind
|-CXXConstructorDecl 0x7fd50f1154b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1775:54> col:31 used allocator 'void (void) noexcept'
| |-CompoundStmt 0x7fd50d87ccb0 <col:53, col:54>
| `-AlwaysInlineAttr 0x7fd50f115598 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7fd50f1158f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:5, col:96> col:52 allocator
| |-TemplateTypeParmDecl 0x7fd50f1155e0 <col:15, col:21> col:21 class depth 0 index 0 _Up
| |-CXXConstructorDecl 0x7fd50f115848 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:96> col:52 allocator 'void (const allocator<_Up> &) noexcept'
| | |-ParmVarDecl 0x7fd50f115720 <col:62, col:82> col:83 'const allocator<_Up> &'
| | `-AlwaysInlineAttr 0x7fd50f115948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-CXXConstructorDecl 0x7fd50f179f48 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:96> col:52 allocator 'void (const allocator<char> &) noexcept'
|   |-TemplateArgument type 'char'
|   |-ParmVarDecl 0x7fd50f179e80 <col:62, col:82> col:83 'const allocator<char> &'
|   `-AlwaysInlineAttr 0x7fd50f17a050 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f115b78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1778:39> line:1777:39 address 'std::__1::allocator<char>::pointer (std::__1::allocator<char>::reference) const noexcept'
| |-ParmVarDecl 0x7fd50f115a70 <col:47, col:57> col:57 __x 'std::__1::allocator<char>::reference':'char &'
| `-AlwaysInlineAttr 0x7fd50f115c28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f115dc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1780:39> line:1779:45 address 'std::__1::allocator<char>::const_pointer (std::__1::allocator<char>::const_reference) const noexcept'
| |-ParmVarDecl 0x7fd50f115cc0 <col:53, col:69> col:69 __x 'std::__1::allocator<char>::const_reference':'const char &'
| `-AlwaysInlineAttr 0x7fd50f115e78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f116030 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1787:9> line:1781:39 used allocate 'std::__1::allocator<char>::pointer (std::__1::allocator::size_type, allocator<void>::const_pointer)'
| |-ParmVarDecl 0x7fd50f115ec0 <col:48, col:58> col:58 used __n 'std::__1::allocator::size_type':'unsigned long'
| |-ParmVarDecl 0x7fd50f115f20 <col:63, col:96> col:94 'allocator<void>::const_pointer':'const void *' cinit
| | `-ImplicitCastExpr 0x7fd50f3a37d8 <col:96> 'allocator<void>::const_pointer':'const void *' <NullToPointer>
| |   `-IntegerLiteral 0x7fd50d87cc78 <col:96> 'int' 0
| |-CompoundStmt 0x7fd50f3a3b90 <line:1782:9, line:1787:9>
| | |-IfStmt 0x7fd50f3a3a20 <line:1783:9, line:1785:71>
| | | |-<<<NULL>>>
| | | |-<<<NULL>>>
| | | |-BinaryOperator 0x7fd50f3a3998 <line:1783:13, col:28> '_Bool' '>'
| | | | |-ImplicitCastExpr 0x7fd50f3a3980 <col:13> 'std::__1::allocator::size_type':'unsigned long' <LValueToRValue>
| | | | | `-DeclRefExpr 0x7fd50f3a38c8 <col:13> 'std::__1::allocator::size_type':'unsigned long' lvalue ParmVar 0x7fd50f115ec0 '__n' 'std::__1::allocator::size_type':'unsigned long'
| | | | `-CXXMemberCallExpr 0x7fd50f3a3940 <col:19, col:28> 'std::__1::allocator::size_type':'unsigned long'
| | | |   `-MemberExpr 0x7fd50f3a3908 <col:19> '<bound member function type>' ->max_size 0x7fd50f116378
| | | |     `-ImplicitCastExpr 0x7fd50f3a3968 <col:19> 'const class std::__1::allocator<char> *' <NoOp>
| | | |       `-CXXThisExpr 0x7fd50f3a38f0 <col:19> 'class std::__1::allocator<char> *' this
| | | |-CallExpr 0x7fd50f3a39d8 <line:1784:13, line:1785:71> 'void'
| | | | |-ImplicitCastExpr 0x7fd50f3a39c0 <line:1784:13> 'void (*)(const char *)' <FunctionToPointerDecay>
| | | | | `-DeclRefExpr 0x7fd50d87d1d0 <col:13> 'void (const char *)' lvalue Function 0x7fd50ec09680 '__throw_length_error' 'void (const char *)'
| | | | `-ImplicitCastExpr 0x7fd50f3a3a08 <col:34, line:1785:34> 'const char *' <ArrayToPointerDecay>
| | | |   `-StringLiteral 0x7fd50d87d158 <line:1784:34, line:1785:34> 'const char [68]' lvalue "allocator<T>::allocate(size_t n) 'n' exceeds maximum supported size"
| | | `-<<<NULL>>>
| | `-ReturnStmt 0x7fd50f3a3b78 <line:1786:9, col:73>
| |   `-CXXStaticCastExpr 0x7fd50f3a3b48 <col:16, col:73> 'std::__1::allocator<char>::pointer':'char *' static_cast<std::__1::allocator<char>::pointer> <BitCast>
| |     `-CallExpr 0x7fd50f3a3b18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1786:72> 'void *'
| |       |-ImplicitCastExpr 0x7fd50f3a3b00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1786:44> 'void *(*)(size_t)' <FunctionToPointerDecay>
| |       | `-DeclRefExpr 0x7fd50d87d2f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1786:44> 'void *(size_t)' lvalue Function 0x7fd50e1724b8 '__allocate' 'void *(size_t)'
| |       `-BinaryOperator 0x7fd50f3a3ad8 <col:55, col:71> 'unsigned long' '*'
| |         |-ImplicitCastExpr 0x7fd50f3a3ac0 <col:55> 'std::__1::allocator::size_type':'unsigned long' <LValueToRValue>
| |         | `-DeclRefExpr 0x7fd50f3a3a68 <col:55> 'std::__1::allocator::size_type':'unsigned long' lvalue ParmVar 0x7fd50f115ec0 '__n' 'std::__1::allocator::size_type':'unsigned long'
| |         `-UnaryExprOrTypeTraitExpr 0x7fd50f3a3aa0 <col:61, col:71> 'unsigned long' sizeof 'char':'char'
| `-AlwaysInlineAttr 0x7fd50f1160e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f116278 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:49> line:1788:36 used deallocate 'void (std::__1::allocator<char>::pointer, std::__1::allocator::size_type) noexcept'
| |-ParmVarDecl 0x7fd50f116140 <col:47, col:55> col:55 used __p 'std::__1::allocator<char>::pointer':'char *'
| |-ParmVarDecl 0x7fd50f1161a0 <col:60> col:69 'std::__1::allocator::size_type':'unsigned long'
| |-CompoundStmt 0x7fd50f3a5240 <line:1789:9, col:49>
| | `-CallExpr 0x7fd50f3a5210 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:47> 'void'
| |   |-ImplicitCastExpr 0x7fd50f3a51f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:17> 'void (*)(void *)' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7fd50d87d4e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:17> 'void (void *)' lvalue Function 0x7fd50e172940 '__libcpp_deallocate' 'void (void *)'
| |   `-CStyleCastExpr 0x7fd50f3a51d0 <col:37, col:44> 'void *' <NoOp>
| |     `-ImplicitCastExpr 0x7fd50f3a51b8 <col:44> 'void *' <BitCast>
| |       `-ImplicitCastExpr 0x7fd50f3a51a0 <col:44> 'std::__1::allocator<char>::pointer':'char *' <LValueToRValue>
| |         `-DeclRefExpr 0x7fd50f3a5178 <col:44> 'std::__1::allocator<char>::pointer':'char *' lvalue ParmVar 0x7fd50f116140 '__p' 'std::__1::allocator<char>::pointer':'char *'
| `-AlwaysInlineAttr 0x7fd50f116330 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f116378 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1791:45> line:1790:41 used max_size 'std::__1::allocator::size_type (void) const noexcept'
| |-CompoundStmt 0x7fd50f3a06c8 <line:1791:9, col:45>
| | `-ReturnStmt 0x7fd50f3a06b0 <col:10, col:43>
| |   `-BinaryOperator 0x7fd50f3a0688 <col:17, col:43> 'unsigned long' '/'
| |     |-CXXFunctionalCastExpr 0x7fd50f3a0630 <col:17, col:29> 'std::__1::allocator::size_type':'unsigned long' functional cast to std::__1::allocator::size_type <NoOp>
| |     | `-ImplicitCastExpr 0x7fd50f3a0618 <col:27, col:28> 'std::__1::allocator::size_type':'unsigned long' <IntegralCast>
| |     |   `-UnaryOperator 0x7fd50d87d618 <col:27, col:28> 'int' prefix '~'
| |     |     `-IntegerLiteral 0x7fd50d87d5f8 <col:28> 'int' 0
| |     `-UnaryExprOrTypeTraitExpr 0x7fd50f3a0668 <col:33, col:43> 'unsigned long' sizeof 'char':'char'
| `-AlwaysInlineAttr 0x7fd50f116420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7fd50f116848 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1793:5, line:1799:9> line:1796:9 construct
| |-TemplateTypeParmDecl 0x7fd50f116468 <line:1793:15, col:21> col:21 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fd50f1164d8 <col:26, col:35> col:35 class depth 0 index 1 ... _Args
| `-CXXMethodDecl 0x7fd50f1167b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1799:9> line:1796:9 construct 'void (_Up *, _Args &&...)'
|   |-ParmVarDecl 0x7fd50f1165a8 <col:19, col:24> col:24 __p '_Up *'
|   |-ParmVarDecl 0x7fd50f116698 <col:29, col:40> col:40 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7fd50f1168a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f116a90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1853:70> col:36 destroy 'void (std::__1::allocator<char>::pointer)'
| |-ParmVarDecl 0x7fd50f116988 <col:44, col:52> col:52 __p 'std::__1::allocator<char>::pointer':'char *'
| `-AlwaysInlineAttr 0x7fd50f116b40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fd50f171948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1759:28> col:28 implicit constexpr allocator 'void (const class std::__1::allocator<char> &)' inline default trivial noexcept-unevaluated 0x7fd50f171948
| `-ParmVarDecl 0x7fd50f171a30 <col:28> col:28 'const class std::__1::allocator<char> &'
|-CXXConstructorDecl 0x7fd50f171ac8 <col:28> col:28 implicit used constexpr allocator 'void (class std::__1::allocator<char> &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7fd50f171bf0 <col:28> col:28 'class std::__1::allocator<char> &&'
| `-CompoundStmt 0x7fd50f3a68d0 <col:28>
`-CXXDestructorDecl 0x7fd50f172fd8 <col:28> col:28 implicit referenced ~allocator 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd50f136460 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:699:5, line:704:5> line:699:12 struct __long definition
|-CXXRecordDecl 0x7fd50f1368d8 prev 0x7fd50f136460 <col:5, col:12> col:12 implicit struct __long
|-FieldDecl 0x7fd50f1369a0 <line:701:9, col:19> col:19 referenced __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7fd50f1369f8 <line:702:9, col:19> col:19 referenced __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7fd50f136a50 <line:703:9, col:19> col:19 referenced __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
|-CXXDestructorDecl 0x7fd50f173198 <line:699:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fd50f3991d8 <col:12> col:12 implicit constexpr __long 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &)' inline default trivial noexcept-unevaluated 0x7fd50f3991d8
| `-ParmVarDecl 0x7fd50f399300 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &'
|-CXXConstructorDecl 0x7fd50f399398 <col:12> col:12 implicit constexpr __long 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7fd50f3994c0 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &&'
`-CXXConstructorDecl 0x7fd50f39adb8 <col:12> col:12 implicit __long 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd50f138f58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9, line:723:9> line:719:9 union definition
|-FieldDecl 0x7fd50f1390d8 <line:721:13, col:27> col:27 referenced __size_ 'unsigned char'
|-FieldDecl 0x7fd50f139130 <line:722:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXDestructorDecl 0x7fd50f173518 <line:719:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fd50f3995c8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &)' inline default trivial noexcept-unevaluated 0x7fd50f3995c8
| `-ParmVarDecl 0x7fd50f3996f0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &'
|-CXXConstructorDecl 0x7fd50f399788 <col:9> col:9 implicit constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7fd50f3998b0 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&'
`-CXXConstructorDecl 0x7fd50f39b138 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon.0 = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd50f136e38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:717:5, line:725:5> line:717:12 struct __short definition
|-CXXRecordDecl 0x7fd50f138ec0 prev 0x7fd50f136e38 <col:5, col:12> col:12 implicit struct __short
|-CXXRecordDecl 0x7fd50f138f58 <line:719:9, line:723:9> line:719:9 union definition
| |-FieldDecl 0x7fd50f1390d8 <line:721:13, col:27> col:27 referenced __size_ 'unsigned char'
| |-FieldDecl 0x7fd50f139130 <line:722:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-CXXDestructorDecl 0x7fd50f173518 <line:719:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7fd50f3995c8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &)' inline default trivial noexcept-unevaluated 0x7fd50f3995c8
| | `-ParmVarDecl 0x7fd50f3996f0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &'
| |-CXXConstructorDecl 0x7fd50f399788 <col:9> col:9 implicit constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&) noexcept' inline default trivial
| | `-ParmVarDecl 0x7fd50f3998b0 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&'
| `-CXXConstructorDecl 0x7fd50f39b138 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial
|-FieldDecl 0x7fd50f139198 <col:9> col:9 implicit referenced 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
|-IndirectFieldDecl 0x7fd50f1391f0 <line:721:27> col:27 implicit __size_ 'unsigned char'
| |-Field 0x7fd50f139198 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| `-Field 0x7fd50f1390d8 '__size_' 'unsigned char'
|-IndirectFieldDecl 0x7fd50f139240 <line:722:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-Field 0x7fd50f139198 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| `-Field 0x7fd50f139130 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FieldDecl 0x7fd50f139308 <line:724:9, col:37> col:20 referenced __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
|-CXXDestructorDecl 0x7fd50f173278 <line:717:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fd50f399918 <col:12> col:12 implicit constexpr __short 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &)' inline default trivial noexcept-unevaluated 0x7fd50f399918
| `-ParmVarDecl 0x7fd50f399a40 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &'
|-CXXConstructorDecl 0x7fd50f399ad8 <col:12> col:12 implicit constexpr __short 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7fd50f399c00 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &&'
`-CXXConstructorDecl 0x7fd50f39ae98 <col:12> col:12 implicit __short 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd50f139710 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:733:5, line:736:5> line:733:12 struct __raw definition
|-CXXRecordDecl 0x7fd50f13be10 prev 0x7fd50f139710 <col:5, col:12> col:12 implicit struct __raw
|-FieldDecl 0x7fd50f13bf68 <line:735:9, col:36> col:19 referenced __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
|-CXXDestructorDecl 0x7fd50f173358 <line:733:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fd50f399cb8 <col:12> col:12 implicit constexpr __raw 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &)' inline default trivial noexcept-unevaluated 0x7fd50f399cb8
| `-ParmVarDecl 0x7fd50f399de0 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &'
|-CXXConstructorDecl 0x7fd50f399e78 <col:12> col:12 implicit constexpr __raw 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7fd50f399fa0 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &&'
`-CXXConstructorDecl 0x7fd50f39af78 <col:12> col:12 implicit __raw 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd50f13bb68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9, line:745:9> line:740:9 union definition
|-FieldDecl 0x7fd50f13bcf8 <line:742:13, col:21> col:21 referenced __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-FieldDecl 0x7fd50f13bd50 <line:743:13, col:21> col:21 referenced __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-FieldDecl 0x7fd50f13bfd0 <line:744:13, col:21> col:21 referenced __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
|-CXXDestructorDecl 0x7fd50f173438 <line:740:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fd50f398ca8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &)' inline default trivial noexcept-unevaluated 0x7fd50f398ca8
| `-ParmVarDecl 0x7fd50f398dd0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &'
|-CXXConstructorDecl 0x7fd50f398e68 <col:9> col:9 implicit used constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7fd50f398f90 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&'
| `-CompoundStmt 0x7fd50f3a6ab0 <col:9>
`-CXXConstructorDecl 0x7fd50f39b058 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fd50f1397e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:738:5, line:746:5> line:738:12 struct __rep definition
|-CXXRecordDecl 0x7fd50f13bad0 prev 0x7fd50f1397e0 <col:5, col:12> col:12 implicit struct __rep
|-CXXRecordDecl 0x7fd50f13bb68 <line:740:9, line:745:9> line:740:9 union definition
| |-FieldDecl 0x7fd50f13bcf8 <line:742:13, col:21> col:21 referenced __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-FieldDecl 0x7fd50f13bd50 <line:743:13, col:21> col:21 referenced __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-FieldDecl 0x7fd50f13bfd0 <line:744:13, col:21> col:21 referenced __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-CXXDestructorDecl 0x7fd50f173438 <line:740:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7fd50f398ca8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &)' inline default trivial noexcept-unevaluated 0x7fd50f398ca8
| | `-ParmVarDecl 0x7fd50f398dd0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &'
| |-CXXConstructorDecl 0x7fd50f398e68 <col:9> col:9 implicit used constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept' inline default trivial
| | |-ParmVarDecl 0x7fd50f398f90 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&'
| | `-CompoundStmt 0x7fd50f3a6ab0 <col:9>
| `-CXXConstructorDecl 0x7fd50f39b058 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial
|-FieldDecl 0x7fd50f13c038 <col:9> col:9 implicit referenced 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
|-IndirectFieldDecl 0x7fd50f13c090 <line:742:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-Field 0x7fd50f13c038 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| `-Field 0x7fd50f13bcf8 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-IndirectFieldDecl 0x7fd50f13c0e0 <line:743:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-Field 0x7fd50f13c038 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| `-Field 0x7fd50f13bd50 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-IndirectFieldDecl 0x7fd50f13c130 <line:744:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-Field 0x7fd50f13c038 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| `-Field 0x7fd50f13bfd0 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
|-CXXDestructorDecl 0x7fd50f1730b8 <line:738:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fd50f398ff8 <col:12> col:12 implicit constexpr __rep 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &)' inline default trivial noexcept-unevaluated 0x7fd50f398ff8
| `-ParmVarDecl 0x7fd50f399120 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
|-CXXConstructorDecl 0x7fd50f39a038 <col:12> col:12 implicit used constexpr __rep 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7fd50f39a160 <col:12> col:12 used 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&'
| |-CXXCtorInitializer Field 0x7fd50f13c038 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | `-CXXConstructExpr 0x7fd50f3a6ac8 <col:12> 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)' 'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept'
| |   `-MemberExpr 0x7fd50f3a6a78 <col:12> 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)' xvalue . 0x7fd50f13c038
| |     `-CXXStaticCastExpr 0x7fd50f3a6a48 <col:12> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' xvalue static_cast<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&> <NoOp>
| |       `-DeclRefExpr 0x7fd50f3a6a10 <col:12> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue ParmVar 0x7fd50f39a160 '' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&'
| `-CompoundStmt 0x7fd50f3a6b30 <col:12>
`-CXXConstructorDecl 0x7fd50f39acd0 <col:12> col:12 implicit referenced __rep 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fd50f13d8d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2209:1, line:2264:1> line:2210:7 class __libcpp_compressed_pair_imp definition
|-private 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-TemplateArgument integral 2
|-CXXRecordDecl 0x7fd50f13dcf8 prev 0x7fd50f13d8d8 <col:1, col:7> col:7 implicit class __libcpp_compressed_pair_imp
|-AccessSpecDecl 0x7fd50f13dd90 <line:2213:1, col:8> col:1 private
|-FieldDecl 0x7fd50f13ddc8 <line:2214:5, col:9> col:9 referenced __first_ 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-AccessSpecDecl 0x7fd50f13de10 <line:2215:1, col:7> col:1 public
|-TypedefDecl 0x7fd50f13de48 <line:2216:5, col:17> col:17 referenced _T1_param 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-SubstTemplateTypeParmType 0x7fd50f13db80 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|   |-TemplateTypeParmType 0x7fd50d89a1a0 '_T1' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fd50d89a160 '_T1'
|   `-RecordType 0x7fd50f139880 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|     `-CXXRecord 0x7fd50f1397e0 '__rep'
|-TypedefDecl 0x7fd50f13deb0 <line:2217:5, col:17> col:17 referenced _T2_param 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7fd50f13dbc0 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7fd50d89a210 '_T2' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fd50d89a1c8 '_T2'
|   `-RecordType 0x7fd50e8cbd90 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7fd50e8cbca8 'allocator'
|-TypedefDecl 0x7fd50f13e3a0 <line:2219:5, col:51> col:51 referenced _T1_reference 'typename remove_reference<struct __rep>::type &'
| `-LValueReferenceType 0x7fd50f13e350 'typename remove_reference<struct __rep>::type &'
|   `-ElaboratedType 0x7fd50f13e2f0 'typename remove_reference<struct __rep>::type' sugar
|     `-TypedefType 0x7fd50f13e2d0 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|       |-Typedef 0x7fd50f13e258 'type'
|       `-SubstTemplateTypeParmType 0x7fd50f13e220 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|         |-TemplateTypeParmType 0x7fd50e91e4b0 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7fd50e91e470 '_Tp'
|         `-RecordType 0x7fd50f139880 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|           `-CXXRecord 0x7fd50f1397e0 '__rep'
|-TypedefDecl 0x7fd50f13e438 <line:2220:5, col:57> col:57 referenced _T2_reference 'class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7fd50f13e400 'class std::__1::allocator<char> &'
|   `-SubstTemplateTypeParmType 0x7fd50f13dbc0 'class std::__1::allocator<char>' sugar
|     |-TemplateTypeParmType 0x7fd50d89a210 '_T2' dependent depth 0 index 1
|     | `-TemplateTypeParm 0x7fd50d89a1c8 '_T2'
|     `-RecordType 0x7fd50e8cbd90 'class std::__1::allocator<char>'
|       `-ClassTemplateSpecialization 0x7fd50e8cbca8 'allocator'
|-TypedefDecl 0x7fd50f13e5f0 <line:2222:5, col:57> col:57 referenced _T1_const_reference 'const typename remove_reference<struct __rep>::type &'
| `-LValueReferenceType 0x7fd50f13e5a0 'const typename remove_reference<struct __rep>::type &'
|   `-QualType 0x7fd50f13e541 'const typename remove_reference<struct __rep>::type' const
|     `-ElaboratedType 0x7fd50f13e540 'typename remove_reference<struct __rep>::type' sugar
|       `-TypedefType 0x7fd50f13e2d0 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|         |-Typedef 0x7fd50f13e258 'type'
|         `-SubstTemplateTypeParmType 0x7fd50f13e220 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|           |-TemplateTypeParmType 0x7fd50e91e4b0 '_Tp' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x7fd50e91e470 '_Tp'
|           `-RecordType 0x7fd50f139880 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|             `-CXXRecord 0x7fd50f1397e0 '__rep'
|-TypedefDecl 0x7fd50f13e688 <line:2223:5, col:63> col:63 referenced _T2_const_reference 'const class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7fd50f13e650 'const class std::__1::allocator<char> &'
|   `-QualType 0x7fd50f13dbc1 'const class std::__1::allocator<char>' const
|     `-SubstTemplateTypeParmType 0x7fd50f13dbc0 'class std::__1::allocator<char>' sugar
|       |-TemplateTypeParmType 0x7fd50d89a210 '_T2' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x7fd50d89a1c8 '_T2'
|       `-RecordType 0x7fd50e8cbd90 'class std::__1::allocator<char>'
|         `-ClassTemplateSpecialization 0x7fd50e8cbca8 'allocator'
|-CXXConstructorDecl 0x7fd50f13e720 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2225:76> col:31 used __libcpp_compressed_pair_imp 'void (void)'
| |-CXXCtorInitializer 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| | `-CXXConstructExpr 0x7fd50f39b270 <col:31> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7fd50f13ddc8 '__first_' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| | `-CXXConstructExpr 0x7fd50f39b218 <col:64, col:73> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' 'void (void) noexcept' zeroing
| |-CompoundStmt 0x7fd50d89f128 <col:75, col:76>
| `-AlwaysInlineAttr 0x7fd50f13e808 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fd50f13e9a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2227:54> line:2226:40 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param)'
| |-ParmVarDecl 0x7fd50f13e880 <col:69, col:79> col:79 __t1 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-AlwaysInlineAttr 0x7fd50f13ea60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fd50f13ec00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2229:61> line:2228:40 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param)'
| |-ParmVarDecl 0x7fd50f13eae0 <col:69, col:79> col:79 __t2 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7fd50f13ecc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fd50f13eed0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2233:92> line:2230:31 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param, std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param)' noexcept-uninstantiated 0x7fd50d89d5a8
| |-ParmVarDecl 0x7fd50f13ed18 <col:60, col:70> col:70 __t1 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| |-ParmVarDecl 0x7fd50f13ed88 <col:76, col:86> col:86 __t2 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7fd50f13eff0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7fd50f13f9f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2237:5, line:2247:14> line:2239:9 __libcpp_compressed_pair_imp
| |-TemplateTypeParmDecl 0x7fd50f13f038 <line:2237:15, col:24> col:24 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7fd50f13f0a8 <col:32, col:41> col:41 class depth 0 index 1 ... _Args2
| |-NonTypeTemplateParmDecl 0x7fd50f13f118 <col:49, col:59> col:59 referenced 'size_t':'unsigned long' depth 0 index 2 ... _I1
| |-NonTypeTemplateParmDecl 0x7fd50f13f170 <col:64, col:74> col:74 referenced 'size_t':'unsigned long' depth 0 index 3 ... _I2
| `-CXXConstructorDecl 0x7fd50f13f950 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2247:14> line:2239:9 __libcpp_compressed_pair_imp 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>, __tuple_indices<_I1...>, __tuple_indices<_I2...>)'
|   |-ParmVarDecl 0x7fd50f13f1f8 <col:38> col:59 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fd50f13f368 <line:2240:38, col:55> col:55 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7fd50f13f4d8 <line:2241:38, col:55> col:55 __second_args 'tuple<_Args2...>'
|   |-ParmVarDecl 0x7fd50f13f628 <line:2242:38, col:60> col:61 '__tuple_indices<_I1...>'
|   |-ParmVarDecl 0x7fd50f13f7c8 <line:2243:38, col:60> col:61 '__tuple_indices<_I2...>'
|   `-AlwaysInlineAttr 0x7fd50f13fa70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f13fbe8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2251:92> col:51 used first 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_reference (void) noexcept'
| |-CompoundStmt 0x7fd50f3a10a0 <col:75, col:92>
| | `-ReturnStmt 0x7fd50f3a1088 <col:76, col:83>
| |   `-MemberExpr 0x7fd50f3a1050 <col:83> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue ->__first_ 0x7fd50f13ddc8
| |     `-CXXThisExpr 0x7fd50f3a1038 <col:83> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7fd50f13fc90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f13fd88 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2252:92> col:51 used first 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_const_reference (void) const noexcept'
| |-CompoundStmt 0x7fd50f3a5020 <col:75, col:92>
| | `-ReturnStmt 0x7fd50f3a5008 <col:76, col:83>
| |   `-MemberExpr 0x7fd50f3a4fd0 <col:83> 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue ->__first_ 0x7fd50f13ddc8
| |     `-CXXThisExpr 0x7fd50f3a4fb8 <col:83> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7fd50f13fe30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f13ff28 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2254:90> col:51 used second 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_reference (void) noexcept'
| |-CompoundStmt 0x7fd50f3a36d0 <col:76, col:90>
| | `-ReturnStmt 0x7fd50f3a36b8 <col:77, col:85>
| |   `-ImplicitCastExpr 0x7fd50f3a3698 <col:84, col:85> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' lvalue <DerivedToBase (allocator)>
| |     `-UnaryOperator 0x7fd50f3a3678 <col:84, col:85> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue prefix '*'
| |       `-CXXThisExpr 0x7fd50f3a3660 <col:85> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7fd50f13ffd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f1400c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2255:90> col:51 used second 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_const_reference (void) const noexcept'
| |-CompoundStmt 0x7fd50f3a0ae8 <col:76, col:90>
| | `-ReturnStmt 0x7fd50f3a0ad0 <col:77, col:85>
| |   `-ImplicitCastExpr 0x7fd50f3a0ab0 <col:84, col:85> 'const class std::__1::allocator<char>':'const class std::__1::allocator<char>' lvalue <DerivedToBase (allocator)>
| |     `-UnaryOperator 0x7fd50f3a0a90 <col:84, col:85> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue prefix '*'
| |       `-CXXThisExpr 0x7fd50f3a0a78 <col:85> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7fd50f140170 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f140310 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2263:5> line:2257:36 swap 'void (class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &)' noexcept-uninstantiated 0x7fd50d89e9a8
| |-ParmVarDecl 0x7fd50f1401f8 <col:41, col:71> col:71 __x 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &'
| `-AlwaysInlineAttr 0x7fd50f140408 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7fd50f172ef8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2210:7> col:7 implicit ~__libcpp_compressed_pair_imp 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fd50f39a1c8 <col:7> col:7 implicit constexpr __libcpp_compressed_pair_imp 'void (const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &)' inline default trivial noexcept-unevaluated 0x7fd50f39a1c8
| `-ParmVarDecl 0x7fd50f39a2f0 <col:7> col:7 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &'
`-CXXConstructorDecl 0x7fd50f39a3c0 <col:7> col:7 implicit used constexpr __libcpp_compressed_pair_imp 'void (class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&) noexcept' inline default trivial
  |-ParmVarDecl 0x7fd50f39a4f0 <col:7> col:7 used 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&'
  |-CXXCtorInitializer 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
  | `-CXXConstructExpr 0x7fd50f3a68e8 <col:7> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' 'void (class std::__1::allocator<char> &&) noexcept'
  |   `-ImplicitCastExpr 0x7fd50f3a6878 <col:7> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' xvalue <UncheckedDerivedToBase (allocator)>
  |     `-CXXStaticCastExpr 0x7fd50f3a6848 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' xvalue static_cast<class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&> <NoOp>
  |       `-DeclRefExpr 0x7fd50f3a6810 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue ParmVar 0x7fd50f39a4f0 '' 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&'
  |-CXXCtorInitializer Field 0x7fd50f13ddc8 '__first_' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
  | `-CXXConstructExpr 0x7fd50f3a6b48 <col:7> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&) noexcept'
  |   `-MemberExpr 0x7fd50f3a69c0 <col:7> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' xvalue .__first_ 0x7fd50f13ddc8
  |     `-CXXStaticCastExpr 0x7fd50f3a6990 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' xvalue static_cast<class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&> <NoOp>
  |       `-DeclRefExpr 0x7fd50f3a6958 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue ParmVar 0x7fd50f39a4f0 '' 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&'
  `-CompoundStmt 0x7fd50f3a6bb8 <col:7>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__libcpp_compressed_pair_imp" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  NonVirtualBaseLLVMType:%"class.std::__1::__libcpp_compressed_pair_imp" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fd50f1398d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2317:1, line:2363:1> line:2318:7 class __compressed_pair definition
|-private '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-CXXRecordDecl 0x7fd50f1404a0 prev 0x7fd50f1398d0 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7fd50f142f08 <line:2321:5, col:52> col:52 base '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
| `-TemplateSpecializationType 0x7fd50f142e60 '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >' sugar __libcpp_compressed_pair_imp
|   |-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|   |-TemplateArgument type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|   `-RecordType 0x7fd50f13d9f0 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
|     `-ClassTemplateSpecialization 0x7fd50f13d8d8 '__libcpp_compressed_pair_imp'
|-AccessSpecDecl 0x7fd50f142f60 <line:2322:1, col:7> col:1 public
|-TypedefDecl 0x7fd50f143040 <line:2323:5, col:38> col:38 _T1_param 'typename base::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-ElaboratedType 0x7fd50f142ff0 'typename base::_T1_param' sugar
|   `-TypedefType 0x7fd50f13e850 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param' sugar
|     |-Typedef 0x7fd50f13de48 '_T1_param'
|     `-SubstTemplateTypeParmType 0x7fd50f13db80 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|       |-TemplateTypeParmType 0x7fd50d89a1a0 '_T1' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fd50d89a160 '_T1'
|       `-RecordType 0x7fd50f139880 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|         `-CXXRecord 0x7fd50f1397e0 '__rep'
|-TypedefDecl 0x7fd50f143110 <line:2324:5, col:38> col:38 _T2_param 'typename base::_T2_param':'class std::__1::allocator<char>'
| `-ElaboratedType 0x7fd50f1430c0 'typename base::_T2_param' sugar
|   `-TypedefType 0x7fd50f13eab0 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param' sugar
|     |-Typedef 0x7fd50f13deb0 '_T2_param'
|     `-SubstTemplateTypeParmType 0x7fd50f13dbc0 'class std::__1::allocator<char>' sugar
|       |-TemplateTypeParmType 0x7fd50d89a210 '_T2' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x7fd50d89a1c8 '_T2'
|       `-RecordType 0x7fd50e8cbd90 'class std::__1::allocator<char>'
|         `-ClassTemplateSpecialization 0x7fd50e8cbca8 'allocator'
|-TypedefDecl 0x7fd50f1431e0 <line:2326:5, col:42> col:42 _T1_reference 'typename base::_T1_reference':'typename remove_reference<struct __rep>::type &'
| `-ElaboratedType 0x7fd50f143190 'typename base::_T1_reference' sugar
|   `-TypedefType 0x7fd50f13fb40 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_reference' sugar
|     |-Typedef 0x7fd50f13e3a0 '_T1_reference'
|     `-LValueReferenceType 0x7fd50f13e350 'typename remove_reference<struct __rep>::type &'
|       `-ElaboratedType 0x7fd50f13e2f0 'typename remove_reference<struct __rep>::type' sugar
|         `-TypedefType 0x7fd50f13e2d0 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|           |-Typedef 0x7fd50f13e258 'type'
|           `-SubstTemplateTypeParmType 0x7fd50f13e220 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|             |-TemplateTypeParmType 0x7fd50e91e4b0 '_Tp' dependent depth 0 index 0
|             | `-TemplateTypeParm 0x7fd50e91e470 '_Tp'
|             `-RecordType 0x7fd50f139880 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|               `-CXXRecord 0x7fd50f1397e0 '__rep'
|-TypedefDecl 0x7fd50f1432b0 <line:2327:5, col:42> col:42 _T2_reference 'typename base::_T2_reference':'class std::__1::allocator<char> &'
| `-ElaboratedType 0x7fd50f143260 'typename base::_T2_reference' sugar
|   `-TypedefType 0x7fd50f13fe80 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_reference' sugar
|     |-Typedef 0x7fd50f13e438 '_T2_reference'
|     `-LValueReferenceType 0x7fd50f13e400 'class std::__1::allocator<char> &'
|       `-SubstTemplateTypeParmType 0x7fd50f13dbc0 'class std::__1::allocator<char>' sugar
|         |-TemplateTypeParmType 0x7fd50d89a210 '_T2' dependent depth 0 index 1
|         | `-TemplateTypeParm 0x7fd50d89a1c8 '_T2'
|         `-RecordType 0x7fd50e8cbd90 'class std::__1::allocator<char>'
|           `-ClassTemplateSpecialization 0x7fd50e8cbca8 'allocator'
|-TypedefDecl 0x7fd50f143380 <line:2329:5, col:48> col:48 _T1_const_reference 'typename base::_T1_const_reference':'const typename remove_reference<struct __rep>::type &'
| `-ElaboratedType 0x7fd50f143330 'typename base::_T1_const_reference' sugar
|   `-TypedefType 0x7fd50f13fce0 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_const_reference' sugar
|     |-Typedef 0x7fd50f13e5f0 '_T1_const_reference'
|     `-LValueReferenceType 0x7fd50f13e5a0 'const typename remove_reference<struct __rep>::type &'
|       `-QualType 0x7fd50f13e541 'const typename remove_reference<struct __rep>::type' const
|         `-ElaboratedType 0x7fd50f13e540 'typename remove_reference<struct __rep>::type' sugar
|           `-TypedefType 0x7fd50f13e2d0 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|             |-Typedef 0x7fd50f13e258 'type'
|             `-SubstTemplateTypeParmType 0x7fd50f13e220 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|               |-TemplateTypeParmType 0x7fd50e91e4b0 '_Tp' dependent depth 0 index 0
|               | `-TemplateTypeParm 0x7fd50e91e470 '_Tp'
|               `-RecordType 0x7fd50f139880 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|                 `-CXXRecord 0x7fd50f1397e0 '__rep'
|-TypedefDecl 0x7fd50f143450 <line:2330:5, col:48> col:48 _T2_const_reference 'typename base::_T2_const_reference':'const class std::__1::allocator<char> &'
| `-ElaboratedType 0x7fd50f143400 'typename base::_T2_const_reference' sugar
|   `-TypedefType 0x7fd50f140020 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_const_reference' sugar
|     |-Typedef 0x7fd50f13e688 '_T2_const_reference'
|     `-LValueReferenceType 0x7fd50f13e650 'const class std::__1::allocator<char> &'
|       `-QualType 0x7fd50f13dbc1 'const class std::__1::allocator<char>' const
|         `-SubstTemplateTypeParmType 0x7fd50f13dbc0 'class std::__1::allocator<char>' sugar
|           |-TemplateTypeParmType 0x7fd50d89a210 '_T2' dependent depth 0 index 1
|           | `-TemplateTypeParm 0x7fd50d89a1c8 '_T2'
|           `-RecordType 0x7fd50e8cbd90 'class std::__1::allocator<char>'
|             `-ClassTemplateSpecialization 0x7fd50e8cbca8 'allocator'
|-CXXConstructorDecl 0x7fd50f1434e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2332:52> col:31 used __compressed_pair 'void (void)'
| |-CXXCtorInitializer '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
| | `-CXXConstructExpr 0x7fd50f39abe0 <col:31> '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' 'void (void)'
| |-CompoundStmt 0x7fd50d8ad430 <col:51, col:52>
| `-AlwaysInlineAttr 0x7fd50f1435c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fd50f143720 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2334:50> line:2333:40 __compressed_pair 'void (std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param)'
| |-ParmVarDecl 0x7fd50f143640 <col:58, col:68> col:68 __t1 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-AlwaysInlineAttr 0x7fd50f1437e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fd50f143940 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2336:50> line:2335:40 __compressed_pair 'void (std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param)'
| |-ParmVarDecl 0x7fd50f143860 <col:58, col:68> col:68 __t2 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7fd50f143a00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fd50f143bc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2338:83> line:2337:31 __compressed_pair 'void (std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param, std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param)'
| |-ParmVarDecl 0x7fd50f143a58 <col:49, col:59> col:59 __t1 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| |-ParmVarDecl 0x7fd50f143ac8 <col:65, col:75> col:75 __t2 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7fd50f143c88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7fd50f1442a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2342:5, line:2349:14> line:2344:9 __compressed_pair
| |-TemplateTypeParmDecl 0x7fd50f143cd0 <line:2342:15, col:24> col:24 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7fd50f143d38 <col:32, col:41> col:41 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7fd50f144200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2349:14> line:2344:9 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7fd50f143dc8 <col:27, col:49> col:49 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fd50f143f38 <col:55, col:72> col:72 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7fd50f1440a8 <line:2345:55, col:72> col:72 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7fd50f144310 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f144458 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2353:97> col:51 used first 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_reference (void) noexcept'
| |-CompoundStmt 0x7fd50f3a1018 <col:75, col:97>
| | `-ReturnStmt 0x7fd50f3a1000 <col:76, col:95>
| |   `-CXXMemberCallExpr 0x7fd50f3a0fb8 <col:83, col:95> 'typename remove_reference<struct __rep>::type':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue
| |     `-MemberExpr 0x7fd50f3a0f68 <col:83, col:89> '<bound member function type>' ->first 0x7fd50f13fbe8
| |       `-ImplicitCastExpr 0x7fd50f3a0fe0 <col:83> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |         `-CXXThisExpr 0x7fd50f3a0f50 <col:83> 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7fd50f144500 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f1445c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2354:97> col:51 used first 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_const_reference (void) const noexcept'
| |-CompoundStmt 0x7fd50f3a4f98 <col:75, col:97>
| | `-ReturnStmt 0x7fd50f3a4f80 <col:76, col:95>
| |   `-CXXMemberCallExpr 0x7fd50f3a4f20 <col:83, col:95> 'const typename remove_reference<struct __rep>::type':'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue
| |     `-MemberExpr 0x7fd50f3a4ed0 <col:83, col:89> '<bound member function type>' ->first 0x7fd50f13fd88
| |       `-ImplicitCastExpr 0x7fd50f3a4f68 <col:83> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' <NoOp>
| |         `-ImplicitCastExpr 0x7fd50f3a4f48 <col:83> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |           `-CXXThisExpr 0x7fd50f3a4eb8 <col:83> 'const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7fd50f144670 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f144738 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2356:99> col:51 used second 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_reference (void) noexcept'
| |-CompoundStmt 0x7fd50f3a3640 <col:76, col:99>
| | `-ReturnStmt 0x7fd50f3a3628 <col:77, col:97>
| |   `-CXXMemberCallExpr 0x7fd50f3a35e0 <col:84, col:97> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' lvalue
| |     `-MemberExpr 0x7fd50f3a3590 <col:84, col:90> '<bound member function type>' ->second 0x7fd50f13ff28
| |       `-ImplicitCastExpr 0x7fd50f3a3608 <col:84> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |         `-CXXThisExpr 0x7fd50f3a3578 <col:84> 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7fd50f1447e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f1448a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2357:99> col:51 used second 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_const_reference (void) const noexcept'
| |-CompoundStmt 0x7fd50f3a0a58 <col:76, col:99>
| | `-ReturnStmt 0x7fd50f3a0a40 <col:77, col:97>
| |   `-CXXMemberCallExpr 0x7fd50f3a0988 <col:84, col:97> 'const class std::__1::allocator<char>':'const class std::__1::allocator<char>' lvalue
| |     `-MemberExpr 0x7fd50f3a0938 <col:84, col:90> '<bound member function type>' ->second 0x7fd50f1400c8
| |       `-ImplicitCastExpr 0x7fd50f3a0a28 <col:84> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' <NoOp>
| |         `-ImplicitCastExpr 0x7fd50f3a0a08 <col:84> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |           `-CXXThisExpr 0x7fd50f3a0920 <col:84> 'const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7fd50f144950 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fd50f144af0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2362:26> line:2359:36 swap 'void (class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &)' noexcept-uninstantiated 0x7fd50d8ad058
| |-ParmVarDecl 0x7fd50f1449d8 <col:41, col:60> col:60 __x 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &'
| `-AlwaysInlineAttr 0x7fd50f144be8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7fd50f172e18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2318:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fd50f39a558 <col:7> col:7 implicit constexpr __compressed_pair 'void (const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &)' inline default trivial noexcept-unevaluated 0x7fd50f39a558
| `-ParmVarDecl 0x7fd50f39a680 <col:7> col:7 'const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &'
`-CXXConstructorDecl 0x7fd50f39a718 <col:7> col:7 implicit used constexpr __compressed_pair 'void (class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &&) noexcept' inline default trivial
  |-ParmVarDecl 0x7fd50f39a840 <col:7> col:7 used 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &&'
  |-CXXCtorInitializer '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
  | `-CXXConstructExpr 0x7fd50f3a6bd0 <col:7> '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' 'void (class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&) noexcept'
  |   `-ImplicitCastExpr 0x7fd50f3a67f0 <col:7> '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' xvalue <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
