
*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__scalar_hash<struct std::__1::_PairT, 2> (empty)
         0 |   struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1509:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<unsigned long, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1000000000, 1>, false, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_mutex_t
         0 |   long __sig
         8 |   char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_cond_t
         0 |   long __sig
         8 |   char [40] __opaque
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1, 1>, true, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::once_flag
         0 |   unsigned long __state_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale::id
         0 |   struct std::__1::once_flag __flag_
         0 |     unsigned long __state_
         8 |   int32_t __id_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__basic_string_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (empty)
         0 |   class std::__1::allocator<char> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<char>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |       class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false>
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<wchar_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (empty)
         0 |   class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> >
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false> (base)
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |           union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<wchar_t>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> > __r_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false> (base)
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |             union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (base) (empty)
         0 |       class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::money_base::pattern
         0 |   char [4] field
           | [sizeof=4, dsize=4, align=1,
           |  nvsize=4, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<long, long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >
         0 |   std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >::__storage_pointer __seg_
         8 |   std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >::__storage_type __mask_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__bitset<0, 0> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct A
         0 |   class std::__1::basic_string<char> s1
         0 |     class std::__1::__basic_string_common<true> (base) (empty)
         0 |     class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |       struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |               union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |                 unsigned char __size_
         0 |                 std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |       struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |         class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f91ae25d1a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:585:90> col:64 class __basic_string_common definition
|-TemplateArgument integral 1
|-VisibilityAttr 0x7f91ae25d338 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7f91ae25d3e8 prev 0x7f91ae25d1a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:560:1, col:28> col:28 implicit class __basic_string_common
|-AccessSpecDecl 0x7f91ae25d480 <line:562:1, col:10> col:1 protected
|-CXXMethodDecl 0x7f91ae25d4a8 <line:563:22, col:50> col:27 __throw_length_error 'void (void) const'
| `-CXX11NoReturnAttr 0x7f91ae25d578 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
|-CXXMethodDecl 0x7f91ae25d5c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:564:22, col:50> col:27 __throw_out_of_range 'void (void) const'
| `-CXX11NoReturnAttr 0x7f91ae25d668 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
`-CXXDestructorDecl 0x7f91acba0990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:585:64> col:64 implicit ~__basic_string_common 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f91acb5c6f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:701:5, line:706:5> line:701:12 struct __long definition
|-CXXRecordDecl 0x7f91acb5cb68 prev 0x7f91acb5c6f0 <col:5, col:12> col:12 implicit struct __long
|-FieldDecl 0x7f91acb5cc30 <line:703:9, col:19> col:19 __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7f91acb5cc88 <line:704:9, col:19> col:19 __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7f91acb5cce0 <line:705:9, col:19> col:19 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
`-CXXDestructorDecl 0x7f91acba0d08 <line:701:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f91acb5d5a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9, line:725:9> line:721:9 union definition
|-FieldDecl 0x7f91acb5d728 <line:723:13, col:27> col:27 __size_ 'unsigned char'
|-FieldDecl 0x7f91acb5d780 <line:724:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
`-CXXDestructorDecl 0x7f91acba1168 <line:721:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon.0 = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f91acb5d0c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:5, line:727:5> line:719:12 struct __short definition
|-CXXRecordDecl 0x7f91acb5d510 prev 0x7f91acb5d0c0 <col:5, col:12> col:12 implicit struct __short
|-CXXRecordDecl 0x7f91acb5d5a8 <line:721:9, line:725:9> line:721:9 union definition
| |-FieldDecl 0x7f91acb5d728 <line:723:13, col:27> col:27 __size_ 'unsigned char'
| |-FieldDecl 0x7f91acb5d780 <line:724:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-CXXDestructorDecl 0x7f91acba1168 <line:721:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7f91acb5d7e8 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
|-IndirectFieldDecl 0x7f91acb5d840 <line:723:27> col:27 implicit __size_ 'unsigned char'
| |-Field 0x7f91acb5d7e8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| `-Field 0x7f91acb5d728 '__size_' 'unsigned char'
|-IndirectFieldDecl 0x7f91acb5d890 <line:724:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-Field 0x7f91acb5d7e8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| `-Field 0x7f91acb5d780 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FieldDecl 0x7f91acb5d958 <line:726:9, col:37> col:20 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
`-CXXDestructorDecl 0x7f91acba0de8 <line:719:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f91acb5dd58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:735:5, line:738:5> line:735:12 struct __raw definition
|-CXXRecordDecl 0x7f91acb5e7b0 prev 0x7f91acb5dd58 <col:5, col:12> col:12 implicit struct __raw
|-FieldDecl 0x7f91acb5e908 <line:737:9, col:36> col:19 __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
`-CXXDestructorDecl 0x7f91acba0ec8 <line:735:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f91acb5e508 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9, line:747:9> line:742:9 union definition
|-FieldDecl 0x7f91acb5e698 <line:744:13, col:21> col:21 __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-FieldDecl 0x7f91acb5e6f0 <line:745:13, col:21> col:21 __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-FieldDecl 0x7f91acb5e970 <line:746:13, col:21> col:21 __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
`-CXXDestructorDecl 0x7f91acba1088 <line:742:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f91acb5de20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:5, line:748:5> line:740:12 struct __rep definition
|-CXXRecordDecl 0x7f91acb5e470 prev 0x7f91acb5de20 <col:5, col:12> col:12 implicit struct __rep
|-CXXRecordDecl 0x7f91acb5e508 <line:742:9, line:747:9> line:742:9 union definition
| |-FieldDecl 0x7f91acb5e698 <line:744:13, col:21> col:21 __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-FieldDecl 0x7f91acb5e6f0 <line:745:13, col:21> col:21 __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-FieldDecl 0x7f91acb5e970 <line:746:13, col:21> col:21 __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| `-CXXDestructorDecl 0x7f91acba1088 <line:742:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7f91acb5e9d8 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
|-IndirectFieldDecl 0x7f91acb5ea30 <line:744:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-Field 0x7f91acb5e9d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| `-Field 0x7f91acb5e698 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-IndirectFieldDecl 0x7f91acb5ea80 <line:745:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-Field 0x7f91acb5e9d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| `-Field 0x7f91acb5e6f0 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-IndirectFieldDecl 0x7f91acb5ead0 <line:746:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-Field 0x7f91acb5e9d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| `-Field 0x7f91acb5e970 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
`-CXXDestructorDecl 0x7f91acba0c28 <line:740:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f91acb5f220 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2034:1, line:2067:1> line:2037:8 struct __compressed_pair_elem definition
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument integral 0
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7f91acb5f4a0 prev 0x7f91acb5f220 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7f91acb5f548 <line:2038:3, col:15> col:15 _ParamT 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-SubstTemplateTypeParmType 0x7f91acb5e180 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|   |-TemplateTypeParmType 0x7f91aca25f80 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f91aca25f38 '_Tp'
|   `-RecordType 0x7f91acb5dec0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|     `-CXXRecord 0x7f91acb5de20 '__rep'
|-TypedefDecl 0x7f91acb5f608 <line:2039:3, col:16> col:16 referenced reference 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
| `-LValueReferenceType 0x7f91acb5f5d0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
|   `-SubstTemplateTypeParmType 0x7f91acb5e180 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|     |-TemplateTypeParmType 0x7f91aca25f80 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f91aca25f38 '_Tp'
|     `-RecordType 0x7f91acb5dec0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|       `-CXXRecord 0x7f91acb5de20 '__rep'
|-TypedefDecl 0x7f91acb5f6c8 <line:2040:3, col:22> col:22 referenced const_reference 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
| `-LValueReferenceType 0x7f91acb5f690 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
|   `-QualType 0x7f91acb5e181 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' const
|     `-SubstTemplateTypeParmType 0x7f91acb5e180 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|       |-TemplateTypeParmType 0x7f91aca25f80 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f91aca25f38 '_Tp'
|       `-RecordType 0x7f91acb5dec0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|         `-CXXRecord 0x7f91acb5de20 '__rep'
|-CXXConstructorDecl 0x7f91acb5f760 <line:2043:3, col:52> col:13 constexpr __compressed_pair_elem 'void (void)'
|-FunctionTemplateDecl 0x7f91acb5ff48 <line:2045:3, line:2050:44> line:2049:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7f91acb5f818 <line:2045:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7f91acb5f888 <col:24, line:2047:6> line:2045:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<struct __rep, 0, false>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7f91acb5fea0 <line:2048:3, line:2050:44> line:2049:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7f91acb5fdb8 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7f91acb63a00 <line:2052:3, line:2056:75> line:2054:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7f91acb60028 <line:2052:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7f91acb60098 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7f91acb60520 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2056:75> line:2054:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7f91acb60110 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f91acb60278 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7f91acb603c8 <line:2055:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7f91acb63a98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb63c18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2062:3, col:50> col:13 __get 'std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>::reference (void) noexcept'
|-CXXMethodDecl 0x7f91acb63d68 <line:2063:3, col:62> col:19 __get 'std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>::const_reference (void) const noexcept'
|-AccessSpecDecl 0x7f91acb63e10 <line:2065:1, col:8> col:1 private
|-FieldDecl 0x7f91acb63e48 <line:2066:3, col:7> col:7 __value_ 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
`-CXXDestructorDecl 0x7f91acba0b48 <line:2037:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f91ac925fd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:101:1, col:52> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28 class allocator definition
|-TemplateArgument type 'char'
|-CXXRecordDecl 0x7f91acb45ff8 prev 0x7f91ac925fd8 <col:1, col:28> col:28 implicit class allocator
|-AccessSpecDecl 0x7f91acb46090 <line:1722:1, col:7> col:1 public
|-TypedefDecl 0x7f91acb460b8 <line:1723:5, col:31> col:31 referenced size_type 'size_t':'unsigned long'
| `-TypedefType 0x7f91ac858ec0 'size_t' sugar
|   |-Typedef 0x7f91ac8583b0 'size_t'
|   `-BuiltinType 0x7f91ac822280 'unsigned long'
|-TypedefDecl 0x7f91acb46110 <line:1724:5, col:31> col:31 referenced difference_type 'ptrdiff_t':'long'
| `-TypedefType 0x7f91ac967d70 'ptrdiff_t' sugar
|   |-Typedef 0x7f91ac858340 'ptrdiff_t'
|   `-BuiltinType 0x7f91ac8221e0 'long'
|-TypedefDecl 0x7f91acb461d8 <line:1725:5, col:31> col:31 referenced pointer 'char *'
| `-PointerType 0x7f91acb461a0 'char *'
|   `-SubstTemplateTypeParmType 0x7f91acb46170 'char' sugar
|     |-TemplateTypeParmType 0x7f91aca1d840 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f91aca1d7f8 '_Tp'
|     `-BuiltinType 0x7f91ac822160 'char'
|-TypedefDecl 0x7f91acb46268 <line:1726:5, col:31> col:31 referenced const_pointer 'const char *'
| `-PointerType 0x7f91acb46230 'const char *'
|   `-QualType 0x7f91acb46171 'const char' const
|     `-SubstTemplateTypeParmType 0x7f91acb46170 'char' sugar
|       |-TemplateTypeParmType 0x7f91aca1d840 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f91aca1d7f8 '_Tp'
|       `-BuiltinType 0x7f91ac822160 'char'
|-TypedefDecl 0x7f91acb462f8 <line:1727:5, col:31> col:31 reference 'char &'
| `-LValueReferenceType 0x7f91acb462c0 'char &'
|   `-SubstTemplateTypeParmType 0x7f91acb46170 'char' sugar
|     |-TemplateTypeParmType 0x7f91aca1d840 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f91aca1d7f8 '_Tp'
|     `-BuiltinType 0x7f91ac822160 'char'
|-TypedefDecl 0x7f91acb46388 <line:1728:5, col:31> col:31 const_reference 'const char &'
| `-LValueReferenceType 0x7f91acb46350 'const char &'
|   `-QualType 0x7f91acb46171 'const char' const
|     `-SubstTemplateTypeParmType 0x7f91acb46170 'char' sugar
|       |-TemplateTypeParmType 0x7f91aca1d840 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f91aca1d7f8 '_Tp'
|       `-BuiltinType 0x7f91ac822160 'char'
|-TypedefDecl 0x7f91acb463f0 <line:1729:5, col:31> col:31 referenced value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f91acb46170 'char' sugar
|   |-TemplateTypeParmType 0x7f91aca1d840 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f91aca1d7f8 '_Tp'
|   `-BuiltinType 0x7f91ac822160 'char'
|-TypedefDecl 0x7f91acb46448 <line:1731:5, col:23> col:23 referenced propagate_on_container_move_assignment 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7f91ad00ba10 'std::__1::true_type' sugar
|   |-Typedef 0x7f91ad0092f0 'true_type'
|   `-TemplateSpecializationType 0x7f91ad009200 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7f91ad009068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7f91ad009050 <line:528:31> '_Bool' true
|     `-RecordType 0x7f91ad0091e0 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7f91ad0090d8 'integral_constant'
|-TypedefDecl 0x7f91acb464a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1732:5, col:23> col:23 referenced is_always_equal 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7f91ad00ba10 'std::__1::true_type' sugar
|   |-Typedef 0x7f91ad0092f0 'true_type'
|   `-TemplateSpecializationType 0x7f91ad009200 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7f91ad009068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7f91ad009050 <line:528:31> '_Bool' true
|     `-RecordType 0x7f91ad0091e0 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7f91ad0090d8 'integral_constant'
|-ClassTemplateDecl 0x7f91acb46618 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1734:5, col:33> col:33 rebind
| |-TemplateTypeParmDecl 0x7f91acb464f8 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXRecordDecl 0x7f91acb46580 <col:26, col:33> col:33 struct rebind
|-CXXConstructorDecl 0x7f91acb46868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1736:54> col:31 referenced allocator 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7f91acb46948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f91acb46ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:5, col:96> col:52 allocator
| |-TemplateTypeParmDecl 0x7f91acb46990 <col:15, col:21> col:21 class depth 0 index 0 _Up
| |-CXXConstructorDecl 0x7f91acb46bf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:96> col:52 allocator 'void (const allocator<_Up> &) noexcept'
| | |-ParmVarDecl 0x7f91acb46ad0 <col:62, col:82> col:83 'const allocator<_Up> &'
| | `-AlwaysInlineAttr 0x7f91acb46cf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-CXXConstructorDecl 0x7f91acba3598 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:96> col:52 allocator 'void (const allocator<char> &) noexcept'
|   |-TemplateArgument type 'char'
|   |-ParmVarDecl 0x7f91acba34d0 <col:62, col:82> col:83 'const allocator<char> &'
|   `-AlwaysInlineAttr 0x7f91acba36a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb46f28 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1739:39> line:1738:39 address 'std::__1::allocator<char>::pointer (std::__1::allocator<char>::reference) const noexcept'
| |-ParmVarDecl 0x7f91acb46e20 <col:47, col:57> col:57 __x 'std::__1::allocator<char>::reference':'char &'
| `-AlwaysInlineAttr 0x7f91acb46fd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb47178 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1741:39> line:1740:45 address 'std::__1::allocator<char>::const_pointer (std::__1::allocator<char>::const_reference) const noexcept'
| |-ParmVarDecl 0x7f91acb47070 <col:53, col:69> col:69 __x 'std::__1::allocator<char>::const_reference':'const char &'
| `-AlwaysInlineAttr 0x7f91acb47228 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb473e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1748:9> line:1742:39 allocate 'std::__1::allocator<char>::pointer (std::__1::allocator::size_type, allocator<void>::const_pointer)'
| |-ParmVarDecl 0x7f91acb47270 <col:48, col:58> col:58 __n 'std::__1::allocator::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb472d0 <col:63, col:96> col:94 'allocator<void>::const_pointer':'const void *'
| `-AlwaysInlineAttr 0x7f91acb47498 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb48638 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1750:49> line:1749:36 deallocate 'void (std::__1::allocator<char>::pointer, std::__1::allocator::size_type) noexcept'
| |-ParmVarDecl 0x7f91acb474f0 <col:47, col:55> col:55 __p 'std::__1::allocator<char>::pointer':'char *'
| |-ParmVarDecl 0x7f91acb47550 <col:60> col:69 'std::__1::allocator::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb486f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb48738 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1752:45> line:1751:41 max_size 'std::__1::allocator::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb487e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f91acb48c08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1754:5, line:1760:9> line:1757:9 construct
| |-TemplateTypeParmDecl 0x7f91acb48828 <line:1754:15, col:21> col:21 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7f91acb48898 <col:26, col:35> col:35 class depth 0 index 1 ... _Args
| `-CXXMethodDecl 0x7f91acb48b70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1760:9> line:1757:9 construct 'void (_Up *, _Args &&...)'
|   |-ParmVarDecl 0x7f91acb48968 <col:19, col:24> col:24 __p '_Up *'
|   |-ParmVarDecl 0x7f91acb48a58 <col:29, col:40> col:40 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7f91acb48c68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb48e50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1814:70> col:36 destroy 'void (std::__1::allocator<char>::pointer)'
| |-ParmVarDecl 0x7f91acb48d48 <col:44, col:52> col:52 __p 'std::__1::allocator<char>::pointer':'char *'
| `-AlwaysInlineAttr 0x7f91acb48f00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7f91acb66168 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28> col:28 implicit referenced ~allocator 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f91acb9f598 <col:28> col:28 implicit constexpr allocator 'void (const class std::__1::allocator<char> &)' inline default trivial noexcept-unevaluated 0x7f91acb9f598
| `-ParmVarDecl 0x7f91acb9f680 <col:28> col:28 'const class std::__1::allocator<char> &'
|-CXXConstructorDecl 0x7f91acb9f718 <col:28> col:28 implicit referenced constexpr allocator 'void (class std::__1::allocator<char> &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7f91acb9f840 <col:28> col:28 'class std::__1::allocator<char> &&'
|-CXXMethodDecl 0x7f91ac4349a0 <col:28, <invalid sloc>> col:28 implicit operator= 'class std::__1::allocator<char> &(const class std::__1::allocator<char> &)' inline default trivial noexcept-unevaluated 0x7f91ac4349a0
| `-ParmVarDecl 0x7f91ac434ac0 <col:28> col:28 'const class std::__1::allocator<char> &'
`-CXXMethodDecl 0x7f91ac434b28 <col:28, <invalid sloc>> col:28 implicit referenced operator= 'class std::__1::allocator<char> &(class std::__1::allocator<char> &&) noexcept' inline default trivial
  `-ParmVarDecl 0x7f91ac434c40 <col:28> col:28 'class std::__1::allocator<char> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f91acb64890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2069:1, line:2099:1> line:2070:8 struct __compressed_pair_elem definition
|-private 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-TemplateArgument integral 1
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7f91acb64c28 prev 0x7f91acb64890 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7f91acb64cd0 <line:2071:3, col:15> col:15 _ParamT 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7f91acb64af0 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7f91aca283d0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f91aca28388 '_Tp'
|   `-RecordType 0x7f91ac9260c0 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7f91ac925fd8 'allocator'
|-TypedefDecl 0x7f91acb64d68 <line:2072:3, col:16> col:16 referenced reference 'class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7f91acb64d30 'class std::__1::allocator<char> &'
|   `-SubstTemplateTypeParmType 0x7f91acb64af0 'class std::__1::allocator<char>' sugar
|     |-TemplateTypeParmType 0x7f91aca283d0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f91aca28388 '_Tp'
|     `-RecordType 0x7f91ac9260c0 'class std::__1::allocator<char>'
|       `-ClassTemplateSpecialization 0x7f91ac925fd8 'allocator'
|-TypedefDecl 0x7f91acb64df8 <line:2073:3, col:22> col:22 referenced const_reference 'const class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7f91acb64dc0 'const class std::__1::allocator<char> &'
|   `-QualType 0x7f91acb64af1 'const class std::__1::allocator<char>' const
|     `-SubstTemplateTypeParmType 0x7f91acb64af0 'class std::__1::allocator<char>' sugar
|       |-TemplateTypeParmType 0x7f91aca283d0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f91aca28388 '_Tp'
|       `-RecordType 0x7f91ac9260c0 'class std::__1::allocator<char>'
|         `-ClassTemplateSpecialization 0x7f91ac925fd8 'allocator'
|-TypedefDecl 0x7f91acb64e60 <line:2074:3, col:15> col:15 __value_type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7f91acb64af0 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7f91aca283d0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f91aca28388 '_Tp'
|   `-RecordType 0x7f91ac9260c0 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7f91ac925fd8 'allocator'
|-CXXConstructorDecl 0x7f91acb64ef8 <line:2077:3, col:46> col:13 __compressed_pair_elem 'void (void)' default noexcept-unevaluated 0x7f91acb64ef8
|-FunctionTemplateDecl 0x7f91acb656d8 <line:2079:3, line:2084:48> line:2083:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7f91acb64fb0 <line:2079:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7f91acb65018 <col:24, line:2081:6> line:2079:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<class allocator<char>, 1, true>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7f91acb65630 <line:2082:3, line:2084:48> line:2083:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7f91acb65548 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7f91acb65d08 <line:2086:3, line:2090:79> line:2088:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7f91acb657b8 <line:2086:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7f91acb65828 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7f91acb65c60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2090:79> line:2088:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7f91acb658a0 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f91acb65a08 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7f91acb65b58 <line:2089:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7f91acb65d98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb65f18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2097:3, col:47> col:13 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>::reference (void) noexcept'
|-CXXMethodDecl 0x7f91acb66068 <line:2098:3, col:59> col:19 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>::const_reference (void) const noexcept'
`-CXXDestructorDecl 0x7f91acba0fa8 <line:2070:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem.1" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem.1" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f91acb5df10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2104:1, line:2201:1> line:2105:7 class __compressed_pair definition
|-private '__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0>':'struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>'
|-private '__compressed_pair_elem<class std::__1::allocator<char>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>'
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-CXXRecordDecl 0x7f91acb66290 prev 0x7f91acb5df10 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7f91acb66638 <line:2107:3, col:42> col:42 _Base1 '__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0>':'struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>'
| `-TemplateSpecializationType 0x7f91acb66590 '__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7f91aca2b408 <col:39> 'int' 0
|   `-RecordType 0x7f91acb5f340 'struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>'
|     `-ClassTemplateSpecialization 0x7f91acb5f220 '__compressed_pair_elem'
|-TypedefDecl 0x7f91acb66998 <line:2108:3, col:42> col:42 _Base2 '__compressed_pair_elem<class std::__1::allocator<char>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>'
| `-TemplateSpecializationType 0x7f91acb668f0 '__compressed_pair_elem<class std::__1::allocator<char>, 1>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7f91aca2b7b8 <col:39> 'int' 1
|   `-RecordType 0x7f91acb649b0 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>'
|     `-ClassTemplateSpecialization 0x7f91acb64890 '__compressed_pair_elem'
|-StaticAssertDecl 0x7f91acb66e18 <line:2114:3, line:2117:44> line:2114:3
| |-ParenExpr 0x7f91acb66df8 <col:17, col:43> '_Bool'
| | `-UnaryOperator 0x7f91acb66dd8 <col:18, col:38> '_Bool' prefix '!'
| |   `-ImplicitCastExpr 0x7f91acb66dc0 <col:19, col:38> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7f91acb66d88 <col:19, col:38> 'const _Bool':'const _Bool' lvalue Var 0x7f91ae1dc5b8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f91aca2bce8 <line:2115:5, line:2117:5> 'const char [179]' lvalue "__compressed_pair cannot be instantated when T1 and T2 are the same type; The current implementation is NOT ABI-compatible with the previous implementation for this configuration"
|-AccessSpecDecl 0x7f91acb66e50 <line:2119:1, col:7> col:1 public
|-FunctionTemplateDecl 0x7f91acb67898 <line:2121:3, line:2128:34> col:13 __compressed_pair
| |-NonTypeTemplateParmDecl 0x7f91acb66e78 <line:2121:13, col:27> col:18 referenced '_Bool' depth 0 index 0 _Dummy
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7f91aca2be30 <col:27> '_Bool' true
| |-TemplateTypeParmDecl 0x7f91acb66ed0 <line:2122:7, line:2125:10> line:2122:7 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<__dependent_type<is_default_constructible<struct __rep>, _Dummy>::value && __dependent_type<is_default_constructible<class allocator<char> >, _Dummy>::value>::type'
| `-CXXConstructorDecl 0x7f91acb677f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2128:34> col:13 constexpr __compressed_pair 'void (void)'
|   `-AlwaysInlineAttr 0x7f91acb67918 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f91acb68138 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2130:3, line:2135:51> line:2134:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f91acb679e8 <line:2130:13, col:19> col:19 class depth 0 index 0 _Tp
| |-NonTypeTemplateParmDecl 0x7f91acb67ef0 <col:24, line:2132:57> col:55 'typename enable_if<!is_same<typename decay<_Tp>::type, class __compressed_pair<struct __rep, class allocator<char> > >::value, _Bool>::type' depth 0 index 1
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7f91aca2cd50 <col:57> '_Bool' true
| `-CXXConstructorDecl 0x7f91acb68090 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2135:51> line:2134:3 constexpr __compressed_pair 'void (_Tp &&)'
|   |-ParmVarDecl 0x7f91acb67fa8 <col:21, col:27> col:27 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7f91acb68190 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f91acb68558 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2137:3, line:2140:51> line:2139:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f91acb68260 <line:2137:13, col:19> col:19 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7f91acb684b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2140:51> line:2139:3 constexpr __compressed_pair 'void (struct std::__1::__second_tag, _Tp &&)'
|   |-ParmVarDecl 0x7f91acb682e0 <col:21> col:33 'struct std::__1::__second_tag'
|   |-ParmVarDecl 0x7f91acb68378 <col:35, col:41> col:41 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7f91acb685b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f91acb68a48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2142:3, line:2145:75> line:2144:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f91acb68688 <line:2142:13, col:19> col:19 class depth 0 index 0 _U1
| |-TemplateTypeParmDecl 0x7f91acb686f8 <col:24, col:30> col:30 class depth 0 index 1 _U2
| `-CXXConstructorDecl 0x7f91acb689a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 constexpr __compressed_pair 'void (_U1 &&, _U2 &&)'
|   |-ParmVarDecl 0x7f91acb687c8 <col:21, col:27> col:27 __t1 '_U1 &&'
|   |-ParmVarDecl 0x7f91acb68868 <col:33, col:39> col:39 __t2 '_U2 &&'
|   `-AlwaysInlineAttr 0x7f91acb68aa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f91acb69158 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2147:3, line:2154:75> line:2149:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f91acb68b78 <line:2147:13, col:22> col:22 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7f91acb68be8 <col:30, col:39> col:39 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7f91acb690b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2154:75> line:2149:3 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7f91acb68c78 <col:21, col:43> col:43 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f91acb68de8 <col:49, col:66> col:66 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7f91acb68f58 <line:2150:21, col:38> col:38 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7f91acb691c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb69388 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2175:3> line:2173:30 first 'typename _Base1::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7f91acb69430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb69538 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2180:3> line:2178:36 first 'typename _Base1::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb695e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb69728 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2185:3> line:2183:30 second 'typename _Base2::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7f91acb697d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb698d8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2190:3> line:2188:36 second 'typename _Base2::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb69980 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb69b20 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2200:3> line:2193:8 swap 'void (class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &)' noexcept-uninstantiated 0x7f91aca2ee58
| |-ParmVarDecl 0x7f91acb69a08 <col:13, col:32> col:32 __x 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &'
| `-AlwaysInlineAttr 0x7f91acb69c18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
`-CXXDestructorDecl 0x7f91acba0a68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2105:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f91ac92c258 parent 0x7f91ac91af78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:4040:81> col:64 class basic_string definition
|-private '__basic_string_common<true>':'class std::__1::__basic_string_common<true>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-VisibilityAttr 0x7f91ae2cfbf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7f91acb456f8 prev 0x7f91ac92c258 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:635:1, col:28> col:28 implicit class basic_string
|-AccessSpecDecl 0x7f91acb45790 <line:638:1, col:7> col:1 public
|-TypedefDecl 0x7f91acb457c8 <line:639:5, col:58> col:58 __self 'class std::__1::basic_string<char>'
| `-RecordType 0x7f91ac92c370 'class std::__1::basic_string<char>'
|   `-ClassTemplateSpecialization 0x7f91ac92c258 'basic_string'
|-TypedefDecl 0x7f91acb45948 <line:640:5, col:58> col:58 __self_view 'basic_string_view<char, struct std::__1::char_traits<char> >':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-TemplateSpecializationType 0x7f91acb458a0 'basic_string_view<char, struct std::__1::char_traits<char> >' sugar basic_string_view
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7f91ac1ffd90 'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
|     `-ClassTemplateSpecialization 0x7f91ac1ffc88 'basic_string_view'
|-TypedefDecl 0x7f91acb459b0 <line:641:5, col:58> col:58 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f91acb45860 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f91ae2602b0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f91ae260268 '_Traits'
|   `-RecordType 0x7f91ac924c90 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f91ac1ca878 'char_traits'
|-TypedefDecl 0x7f91acb45a18 <line:642:5, col:58> col:58 referenced value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f91acb45820 'char' sugar
|   |-TemplateTypeParmType 0x7f91ae260240 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f91ae260200 '_CharT'
|   `-BuiltinType 0x7f91ac822160 'char'
|-TypedefDecl 0x7f91acb45aa8 <line:643:5, col:58> col:58 allocator_type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7f91acb45a70 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7f91ae260320 '_Allocator' dependent depth 0 index 2
|   | `-TemplateTypeParm 0x7f91ae2602d8 '_Allocator'
|   `-RecordType 0x7f91ac9260c0 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7f91ac925fd8 'allocator'
|-TypedefDecl 0x7f91acb45cb8 <line:644:5, col:58> col:58 __alloc_traits 'allocator_traits<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>':'struct std::__1::allocator_traits<class std::__1::allocator<char> >'
| `-TemplateSpecializationType 0x7f91acb45c40 'allocator_traits<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type':'class std::__1::allocator<char>'
|   `-RecordType 0x7f91acb45c20 'struct std::__1::allocator_traits<class std::__1::allocator<char> >'
|     `-ClassTemplateSpecialization 0x7f91acb45b30 'allocator_traits'
|-TypedefDecl 0x7f91acb5b430 <line:645:5, col:58> col:58 size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7f91acb5b3e0 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7f91acb542f0 'std::__1::allocator_traits<class std::__1::allocator<char> >::size_type' sugar
|     |-Typedef 0x7f91acb50970 'size_type'
|     `-ElaboratedType 0x7f91acb50920 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7f91acb50900 'std::__1::__size_type<class std::__1::allocator<char>, long, true>::type' sugar
|         |-Typedef 0x7f91acb50880 'type'
|         `-ElaboratedType 0x7f91acb50830 'typename class allocator<char>::size_type' sugar
|           `-TypedefType 0x7f91acb4fe30 'std::__1::allocator<char>::size_type' sugar
|             |-Typedef 0x7f91acb460b8 'size_type'
|             `-TypedefType 0x7f91ac858ec0 'size_t' sugar
|               |-Typedef 0x7f91ac8583b0 'size_t'
|               `-BuiltinType 0x7f91ac822280 'unsigned long'
|-TypedefDecl 0x7f91acb5b500 <line:646:5, col:58> col:58 difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7f91acb5b4b0 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7f91acb4fb50 'std::__1::allocator_traits<class std::__1::allocator<char> >::difference_type' sugar
|     |-Typedef 0x7f91acb4fae0 'difference_type'
|     `-ElaboratedType 0x7f91acb4fa90 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7f91acb4fa70 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<char>, char *, true>::type' sugar
|         |-Typedef 0x7f91acb4f9f0 'type'
|         `-ElaboratedType 0x7f91acb4f9a0 'typename class allocator<char>::difference_type' sugar
|           `-TypedefType 0x7f91acb4efa0 'std::__1::allocator<char>::difference_type' sugar
|             |-Typedef 0x7f91acb46110 'difference_type'
|             `-TypedefType 0x7f91ac967d70 'ptrdiff_t' sugar
|               |-Typedef 0x7f91ac858340 'ptrdiff_t'
|               `-BuiltinType 0x7f91ac8221e0 'long'
|-TypedefDecl 0x7f91acb5b5b8 <line:647:5, col:58> col:58 reference 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
| `-LValueReferenceType 0x7f91acb5b580 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
|   `-TypedefType 0x7f91acb5b560 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' sugar
|     |-Typedef 0x7f91acb45a18 'value_type'
|     `-SubstTemplateTypeParmType 0x7f91acb45820 'char' sugar
|       |-TemplateTypeParmType 0x7f91ae260240 '_CharT' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f91ae260200 '_CharT'
|       `-BuiltinType 0x7f91ac822160 'char'
|-TypedefDecl 0x7f91acb5b648 <line:648:5, col:58> col:58 const_reference 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
| `-LValueReferenceType 0x7f91acb5b610 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
|   `-QualType 0x7f91acb5b561 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' const
|     `-TypedefType 0x7f91acb5b560 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' sugar
|       |-Typedef 0x7f91acb45a18 'value_type'
|       `-SubstTemplateTypeParmType 0x7f91acb45820 'char' sugar
|         |-TemplateTypeParmType 0x7f91ae260240 '_CharT' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7f91ae260200 '_CharT'
|         `-BuiltinType 0x7f91ac822160 'char'
|-TypedefDecl 0x7f91acb5b710 <line:649:5, col:58> col:58 pointer 'typename __alloc_traits::pointer':'char *'
| `-ElaboratedType 0x7f91acb5b6c0 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7f91acb4a680 'std::__1::allocator_traits<class std::__1::allocator<char> >::pointer' sugar
|     |-Typedef 0x7f91acb4a610 'pointer'
|     `-ElaboratedType 0x7f91acb4a5c0 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7f91acb4a5a0 'std::__1::__pointer_type<char, class std::__1::allocator<char> >::type' sugar
|         |-Typedef 0x7f91acb4a520 'type'
|         `-ElaboratedType 0x7f91acb4a4d0 'typename __pointer_type_imp::__pointer_type<char, typename remove_reference<class allocator<char> >::type>::type' sugar
|           `-TypedefType 0x7f91acb4a4b0 'std::__1::__pointer_type_imp::__pointer_type<char, class std::__1::allocator<char>, true>::type' sugar
|             |-Typedef 0x7f91acb4a430 'type'
|             `-ElaboratedType 0x7f91acb4a3e0 'typename class allocator<char>::pointer' sugar
|               `-TypedefType 0x7f91acb46dd0 'std::__1::allocator<char>::pointer' sugar
|                 |-Typedef 0x7f91acb461d8 'pointer'
|                 `-PointerType 0x7f91acb461a0 'char *'
|                   `-SubstTemplateTypeParmType 0x7f91acb46170 'char' sugar
|                     |-TemplateTypeParmType 0x7f91aca1d840 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7f91aca1d7f8 '_Tp'
|                     `-BuiltinType 0x7f91ac822160 'char'
|-TypedefDecl 0x7f91acb5b800 <line:650:5, col:58> col:58 const_pointer 'typename __alloc_traits::const_pointer':'const char *'
| `-ElaboratedType 0x7f91acb5b7b0 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7f91acb5b790 'std::__1::allocator_traits<class std::__1::allocator<char> >::const_pointer' sugar
|     |-Typedef 0x7f91acb4b410 'const_pointer'
|     `-ElaboratedType 0x7f91acb4b3c0 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7f91acb4b3a0 'std::__1::__const_pointer<char, char *, class std::__1::allocator<char>, true>::type' sugar
|         |-Typedef 0x7f91acb4b320 'type'
|         `-ElaboratedType 0x7f91acb4b2d0 'typename class allocator<char>::const_pointer' sugar
|           `-TypedefType 0x7f91acb47020 'std::__1::allocator<char>::const_pointer' sugar
|             |-Typedef 0x7f91acb46268 'const_pointer'
|             `-PointerType 0x7f91acb46230 'const char *'
|               `-QualType 0x7f91acb46171 'const char' const
|                 `-SubstTemplateTypeParmType 0x7f91acb46170 'char' sugar
|                   |-TemplateTypeParmType 0x7f91aca1d840 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7f91aca1d7f8 '_Tp'
|                   `-BuiltinType 0x7f91ac822160 'char'
|-StaticAssertDecl 0x7f91acb5b960 <line:652:5, col:92> col:5
| |-DeclRefExpr 0x7f91acb5b910 <col:19, col:39> 'const _Bool':'const _Bool' lvalue Var 0x7f91ae1dbc68 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f91ae2612b8 <col:46> 'const char [45]' lvalue "Character type of basic_string must be a POD"
|-StaticAssertDecl 0x7f91acb5bba0 <line:653:5, line:654:74> line:653:5
| |-ParenExpr 0x7f91acb5bb68 <col:19, col:75> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7f91acb5bb30 <col:20, col:70> 'const _Bool':'const _Bool' lvalue Var 0x7f91ae1dbc68 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f91ae261580 <line:654:19> 'const char [54]' lvalue "traits_type::char_type must be the same type as CharT"
|-StaticAssertDecl 0x7f91acb5bdb0 <line:655:5, line:656:74> line:655:5
| |-ParenExpr 0x7f91acb5bd78 <col:19, col:83> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7f91acb5bd40 <col:20, col:78> 'const _Bool':'const _Bool' lvalue Var 0x7f91ae1dbc68 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f91ae2618c0 <line:656:19> 'const char [54]' lvalue "Allocator::value_type must be same type as value_type"
|-TypedefDecl 0x7f91acb5bfa8 <line:661:5, col:58> col:58 iterator '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer>':'class std::__1::__wrap_iter<char *>'
| `-TemplateSpecializationType 0x7f91acb5bf30 '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
|   `-RecordType 0x7f91acb5bf10 'class std::__1::__wrap_iter<char *>'
|     `-ClassTemplateSpecialization 0x7f91acb5be20 '__wrap_iter'
|-TypedefDecl 0x7f91acb5c1b8 <line:662:5, col:58> col:58 const_iterator '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer>':'class std::__1::__wrap_iter<const char *>'
| `-TemplateSpecializationType 0x7f91acb5c140 '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer':'const char *'
|   `-RecordType 0x7f91acb5c120 'class std::__1::__wrap_iter<const char *>'
|     `-ClassTemplateSpecialization 0x7f91acb5c030 '__wrap_iter'
|-TypedefDecl 0x7f91acb5c410 <line:664:5, col:59> col:59 reverse_iterator 'std::__1::reverse_iterator<iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<char *> >'
| `-ElaboratedType 0x7f91acb5c3a0 'std::__1::reverse_iterator<iterator>' sugar
|   `-TemplateSpecializationType 0x7f91acb5c350 'reverse_iterator<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator':'class std::__1::__wrap_iter<char *>'
|     `-RecordType 0x7f91acb5c330 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<char *> >'
|       `-ClassTemplateSpecialization 0x7f91acb5c240 'reverse_iterator'
|-TypedefDecl 0x7f91acb5c670 <line:665:5, col:59> col:59 const_reverse_iterator 'std::__1::reverse_iterator<const_iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const char *> >'
| `-ElaboratedType 0x7f91acb5c600 'std::__1::reverse_iterator<const_iterator>' sugar
|   `-TemplateSpecializationType 0x7f91acb5c5b0 'reverse_iterator<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|     `-RecordType 0x7f91acb5c590 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const char *> >'
|       `-ClassTemplateSpecialization 0x7f91acb5c4a0 'reverse_iterator'
|-AccessSpecDecl 0x7f91acb5c6c8 <line:667:1, col:8> col:1 private
|-CXXRecordDecl 0x7f91acb5c6f0 <line:701:5, line:706:5> line:701:12 struct __long definition
| |-CXXRecordDecl 0x7f91acb5cb68 prev 0x7f91acb5c6f0 <col:5, col:12> col:12 implicit struct __long
| |-FieldDecl 0x7f91acb5cc30 <line:703:9, col:19> col:19 __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-FieldDecl 0x7f91acb5cc88 <line:704:9, col:19> col:19 __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-FieldDecl 0x7f91acb5cce0 <line:705:9, col:19> col:19 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
| `-CXXDestructorDecl 0x7f91acba0d08 <line:701:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial
|-EnumDecl 0x7f91acb5c7c0 <line:712:5> col:5
| `-EnumConstantDecl 0x7f91acb5c890 <col:11, col:26> col:11 __short_mask 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:712:5)'
|   `-ImplicitCastExpr 0x7f91acb5c8d8 <col:26> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7f91ae262480 <col:26> 'int' 1
|-EnumDecl 0x7f91acb5c8f0 <line:713:5> col:5
| `-EnumConstantDecl 0x7f91acb5c9c0 <col:11, col:26> col:11 __long_mask 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:713:5)'
|   `-ImplicitCastExpr 0x7f91acb5ca08 <col:26> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7f91ae2625a0 <col:26> 'unsigned long' 1
|-EnumDecl 0x7f91acb5ca20 <line:716:5> col:5
| `-EnumConstantDecl 0x7f91acb5d060 <col:11, line:717:65> line:716:11 referenced __min_cap 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:716:5)'
|   `-ImplicitCastExpr 0x7f91acb5d0a8 <col:23, line:717:65> 'unsigned int' <IntegralCast>
|     `-ConditionalOperator 0x7f91acb5cf60 <line:716:23, line:717:65> 'unsigned long'
|       |-BinaryOperator 0x7f91acb5ce38 <line:716:23, col:65> '_Bool' '>'
|       | |-BinaryOperator 0x7f91acb5cdf8 <col:23, col:61> 'unsigned long' '/'
|       | | |-ParenExpr 0x7f91acb5cda8 <col:23, col:42> 'unsigned long'
|       | | | `-BinaryOperator 0x7f91acb5cd80 <col:24, col:41> 'unsigned long' '-'
|       | | |   |-UnaryExprOrTypeTraitExpr 0x7f91acb5cd48 <col:24, col:37> 'unsigned long' sizeof 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|       | | |   `-ImplicitCastExpr 0x7f91acb5cd68 <col:41> 'unsigned long' <IntegralCast>
|       | | |     `-IntegerLiteral 0x7f91ae2626f0 <col:41> 'int' 1
|       | | `-UnaryExprOrTypeTraitExpr 0x7f91acb5cdd8 <col:44, col:61> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|       | `-ImplicitCastExpr 0x7f91acb5ce20 <col:65> 'unsigned long' <IntegralCast>
|       |   `-IntegerLiteral 0x7f91ae2627c8 <col:65> 'int' 2
|       |-BinaryOperator 0x7f91acb5cf20 <line:717:23, col:61> 'unsigned long' '/'
|       | |-ParenExpr 0x7f91acb5ced0 <col:23, col:42> 'unsigned long'
|       | | `-BinaryOperator 0x7f91acb5cea8 <col:24, col:41> 'unsigned long' '-'
|       | |   |-UnaryExprOrTypeTraitExpr 0x7f91acb5ce70 <col:24, col:37> 'unsigned long' sizeof 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|       | |   `-ImplicitCastExpr 0x7f91acb5ce90 <col:41> 'unsigned long' <IntegralCast>
|       | |     `-IntegerLiteral 0x7f91ae262858 <col:41> 'int' 1
|       | `-UnaryExprOrTypeTraitExpr 0x7f91acb5cf00 <col:44, col:61> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|       `-ImplicitCastExpr 0x7f91acb5cf48 <col:65> 'unsigned long' <IntegralCast>
|         `-IntegerLiteral 0x7f91ae262930 <col:65> 'int' 2
|-CXXRecordDecl 0x7f91acb5d0c0 <line:719:5, line:727:5> line:719:12 struct __short definition
| |-CXXRecordDecl 0x7f91acb5d510 prev 0x7f91acb5d0c0 <col:5, col:12> col:12 implicit struct __short
| |-CXXRecordDecl 0x7f91acb5d5a8 <line:721:9, line:725:9> line:721:9 union definition
| | |-FieldDecl 0x7f91acb5d728 <line:723:13, col:27> col:27 __size_ 'unsigned char'
| | |-FieldDecl 0x7f91acb5d780 <line:724:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| | `-CXXDestructorDecl 0x7f91acba1168 <line:721:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-FieldDecl 0x7f91acb5d7e8 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| |-IndirectFieldDecl 0x7f91acb5d840 <line:723:27> col:27 implicit __size_ 'unsigned char'
| | |-Field 0x7f91acb5d7e8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| | `-Field 0x7f91acb5d728 '__size_' 'unsigned char'
| |-IndirectFieldDecl 0x7f91acb5d890 <line:724:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| | |-Field 0x7f91acb5d7e8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| | `-Field 0x7f91acb5d780 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-FieldDecl 0x7f91acb5d958 <line:726:9, col:37> col:20 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
| `-CXXDestructorDecl 0x7f91acba0de8 <line:719:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial
|-CXXRecordDecl 0x7f91acb5d190 <line:731:5, col:44> col:11 union __ulx definition
| |-CXXRecordDecl 0x7f91acb5d3a8 prev 0x7f91acb5d190 <col:5, col:11> col:11 implicit union __ulx
| |-FieldDecl 0x7f91acb5d450 <col:17, col:24> col:24 __lx 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| `-FieldDecl 0x7f91acb5d9c0 <col:30, col:38> col:38 __lxx 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-EnumDecl 0x7f91acb5d260 <line:733:5> col:5
| `-EnumConstantDecl 0x7f91acb5dcf8 <col:11, col:55> col:11 referenced __n_words 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:733:5)'
|   `-ImplicitCastExpr 0x7f91acb5dd40 <col:23, col:55> 'unsigned int' <IntegralCast>
|     `-BinaryOperator 0x7f91acb5da78 <col:23, col:55> 'unsigned long' '/'
|       |-UnaryExprOrTypeTraitExpr 0x7f91acb5da28 <col:23, col:35> 'unsigned long' sizeof 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx'
|       `-UnaryExprOrTypeTraitExpr 0x7f91acb5da58 <col:39, col:55> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXRecordDecl 0x7f91acb5dd58 <line:735:5, line:738:5> line:735:12 struct __raw definition
| |-CXXRecordDecl 0x7f91acb5e7b0 prev 0x7f91acb5dd58 <col:5, col:12> col:12 implicit struct __raw
| |-FieldDecl 0x7f91acb5e908 <line:737:9, col:36> col:19 __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
| `-CXXDestructorDecl 0x7f91acba0ec8 <line:735:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial
|-CXXRecordDecl 0x7f91acb5de20 <line:740:5, line:748:5> line:740:12 struct __rep definition
| |-CXXRecordDecl 0x7f91acb5e470 prev 0x7f91acb5de20 <col:5, col:12> col:12 implicit struct __rep
| |-CXXRecordDecl 0x7f91acb5e508 <line:742:9, line:747:9> line:742:9 union definition
| | |-FieldDecl 0x7f91acb5e698 <line:744:13, col:21> col:21 __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| | |-FieldDecl 0x7f91acb5e6f0 <line:745:13, col:21> col:21 __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| | |-FieldDecl 0x7f91acb5e970 <line:746:13, col:21> col:21 __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| | `-CXXDestructorDecl 0x7f91acba1088 <line:742:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-FieldDecl 0x7f91acb5e9d8 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| |-IndirectFieldDecl 0x7f91acb5ea30 <line:744:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| | |-Field 0x7f91acb5e9d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| | `-Field 0x7f91acb5e698 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-IndirectFieldDecl 0x7f91acb5ea80 <line:745:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| | |-Field 0x7f91acb5e9d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| | `-Field 0x7f91acb5e6f0 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-IndirectFieldDecl 0x7f91acb5ead0 <line:746:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| | |-Field 0x7f91acb5e9d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| | `-Field 0x7f91acb5e970 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| `-CXXDestructorDecl 0x7f91acba0c28 <line:740:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7f91acb69c80 <line:750:5, col:46> col:46 __r_ '__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>':'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >'
|-AccessSpecDecl 0x7f91acb69cc8 <line:752:1, col:7> col:1 public
|-VarDecl 0x7f91acb69d00 <line:753:5, col:36> col:28 npos 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'const unsigned long' static cinit
| `-ImplicitCastExpr 0x7f91acb69d70 <col:35, col:36> 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'const unsigned long' <IntegralCast>
|   `-UnaryOperator 0x7f91ae26bf70 <col:35, col:36> 'int' prefix '-'
|     `-IntegerLiteral 0x7f91ae26bf50 <col:36> 'int' 1
|-CXXConstructorDecl 0x7f91acb69e48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:755:31 referenced basic_string 'void (void) noexcept(is_nothrow_default_constructible<allocator_type>::value)'
| `-AlwaysInlineAttr 0x7f91acb69f68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f91acb6a120 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:758:40 basic_string 'void (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)' noexcept-uninstantiated 0x7f91ae26c2a8
| |-ParmVarDecl 0x7f91acb69fe8 <col:53, col:75> col:75 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
| `-AlwaysInlineAttr 0x7f91acb6a228 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f91acb6a328 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:765:5, col:43> col:5 used basic_string 'void (const class std::__1::basic_string<char> &)'
| `-ParmVarDecl 0x7f91acb6a280 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
|-CXXConstructorDecl 0x7f91acb6a5a0 <line:766:5, col:70> col:5 basic_string 'void (const class std::__1::basic_string<char> &, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)'
| |-ParmVarDecl 0x7f91acb6a3f8 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
| `-ParmVarDecl 0x7f91acb6a468 <col:45, col:67> col:67 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
|-CXXConstructorDecl 0x7f91acb6a7e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:770:5 used basic_string 'void (class std::__1::basic_string<char> &&) noexcept(is_nothrow_move_constructible<allocator_type>::value)'
| |-ParmVarDecl 0x7f91acb6a6a8 <col:18, col:33> col:33 __str 'class std::__1::basic_string<char> &&'
| `-AlwaysInlineAttr 0x7f91acb6a8e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f91acb6aae0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:778:65> col:5 basic_string 'void (class std::__1::basic_string<char> &&, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)'
| |-ParmVarDecl 0x7f91acb6a940 <col:18, col:33> col:33 __str 'class std::__1::basic_string<char> &&'
| |-ParmVarDecl 0x7f91acb6a9b0 <col:40, col:62> col:62 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
| `-AlwaysInlineAttr 0x7f91acb6aba8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f91acb6ad10 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:780:61> col:31 used basic_string 'void (const char *)'
| |-ParmVarDecl 0x7f91acb6ac28 <col:44, col:58> col:58 __s 'const char *'
| `-AlwaysInlineAttr 0x7f91acb6add0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f91acb6b000 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:782:58> col:5 basic_string 'void (const char *, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7f91acb6ae28 <col:18, col:32> col:32 __s 'const char *'
| |-ParmVarDecl 0x7f91acb6aec8 <col:37, col:55> col:55 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7f91acb6b0c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f91acb6b280 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:784:50> col:5 used basic_string 'void (const char *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f91acb6b120 <col:18, col:32> col:32 __s 'const char *'
| |-ParmVarDecl 0x7f91acb6b190 <col:37, col:47> col:47 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb6b348 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f91acb6b5d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:786:73> col:5 basic_string 'void (const char *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7f91acb6b3a0 <col:18, col:32> col:32 __s 'const char *'
| |-ParmVarDecl 0x7f91acb6b410 <col:37, col:47> col:47 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb6b480 <col:52, col:70> col:70 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7f91acb6b6a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f91acb6b8a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:788:43> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, char)'
| |-ParmVarDecl 0x7f91acb6b6f8 <col:18, col:28> col:28 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb6b768 <col:33, col:40> col:40 __c 'char':'char'
| `-AlwaysInlineAttr 0x7f91acb6b968 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f91acb73e30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:790:66> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, char, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7f91acb73c00 <col:18, col:28> col:28 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb73c70 <col:33, col:40> col:40 __c 'char':'char'
| |-ParmVarDecl 0x7f91acb73ce0 <col:45, col:63> col:63 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7f91acb73f00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f91acb74210 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:791:5, line:792:54> line:791:5 basic_string 'void (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7f91acb73f58 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb73fc8 <col:45, col:55> col:55 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb74038 <col:62, col:72> col:72 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb740a8 <line:792:18, col:53> col:36 __a 'const class std::__1::allocator<char> &'
|-CXXConstructorDecl 0x7f91acb74530 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:795:54> line:794:5 basic_string 'void (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7f91acb742f8 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb74368 <col:45, col:55> col:55 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb743d8 <line:795:18, col:53> col:36 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7f91acb74600 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f91acb74f28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:796:5, line:800:121> line:798:9 basic_string
| |-TemplateTypeParmDecl 0x7f91acb74648 <line:796:14, col:20> col:20 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7f91acb74e80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:800:121> line:798:9 basic_string 'void (const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &, typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, void>::type *)' inline
|   |-ParmVarDecl 0x7f91acb74708 <col:22, col:33> col:33 __t 'const _Tp &'
|   |-ParmVarDecl 0x7f91acb74778 <col:38, col:48> col:48 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7f91acb747e8 <col:55, col:65> col:65 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7f91acb74858 <line:799:22, col:65> col:44 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
|   `-ParmVarDecl 0x7f91acb74d00 <line:800:22, col:120> col:118 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, void>::type *'
|-CXXConstructorDecl 0x7f91acb75180 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:802:34> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7f91acb75060 <col:18, col:30> col:30 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7f91acb75240 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f91acb75440 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:804:57> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7f91acb75298 <col:18, col:30> col:30 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7f91acb75308 <col:36, col:54> col:54 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7f91acb75508 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f91acb757e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:805:5, line:807:67> col:9 basic_string
| |-TemplateTypeParmDecl 0x7f91acb75550 <line:805:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7f91acb75740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:807:67> col:9 basic_string 'void (_InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x7f91acb755e0 <col:22, col:37> col:37 __first '_InputIterator'
|   |-ParmVarDecl 0x7f91acb75650 <col:46, col:61> col:61 __last '_InputIterator'
|   `-AlwaysInlineAttr 0x7f91acb75848 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f91acb75c88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:808:5, line:810:94> col:9 basic_string
| |-TemplateTypeParmDecl 0x7f91acb75918 <line:808:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7f91acb75be0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:810:94> col:9 basic_string 'void (_InputIterator, _InputIterator, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)'
|   |-ParmVarDecl 0x7f91acb759b0 <col:22, col:37> col:37 __first '_InputIterator'
|   |-ParmVarDecl 0x7f91acb75a20 <col:46, col:61> col:61 __last '_InputIterator'
|   |-ParmVarDecl 0x7f91acb75a90 <col:69, col:91> col:91 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
|   `-AlwaysInlineAttr 0x7f91acb75cf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f91acb76080 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:813:47> col:5 basic_string 'void (initializer_list<char>)'
| |-ParmVarDecl 0x7f91acb75f58 <col:18, col:43> col:43 __il 'initializer_list<char>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7f91acb76140 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f91acb763c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:815:70> col:5 basic_string 'void (initializer_list<char>, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7f91acb76218 <col:18, col:43> col:43 __il 'initializer_list<char>':'class std::initializer_list<char>'
| |-ParmVarDecl 0x7f91acb76288 <col:49, col:67> col:67 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7f91acb76488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7f91acb76500 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:818:5, col:26> col:12 used ~basic_string 'void (void) noexcept' inline
|-CXXConversionDecl 0x7f91acb76668 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:821:82> col:5 operator basic_string_view 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb76710 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb76860 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:823:5, col:54> col:19 used operator= 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| `-ParmVarDecl 0x7f91acb76798 <col:29, col:49> col:49 __str 'const class std::__1::basic_string<char> &'
|-FunctionTemplateDecl 0x7f91acb76b38 <line:826:5, line:829:69> col:19 operator=
| |-TemplateTypeParmDecl 0x7f91acb76910 <line:826:15, col:23> col:15 class depth 0 index 0
| | `-TemplateArgument type 'void'
| |-CXXMethodDecl 0x7f91acb76aa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:829:69> col:19 operator= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| | |-ParmVarDecl 0x7f91acb769a0 <col:29, col:41> col:41 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| | `-AlwaysInlineAttr 0x7f91acb76b90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-CXXMethodDecl 0x7f91ac424730 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:829:69> col:19 operator= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
|   |-TemplateArgument type 'void'
|   |-ParmVarDecl 0x7f91ac4246a8 <col:29, col:41> col:41 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
|   `-AlwaysInlineAttr 0x7f91ac424828 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb76d80 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:832:19 used operator= 'class std::__1::basic_string<char> &(class std::__1::basic_string<char> &&) noexcept((__noexcept_move_assign_container<class allocator<char>, __alloc_traits>::value))'
| |-ParmVarDecl 0x7f91acb76c70 <col:29, col:44> col:44 __str 'class std::__1::basic_string<char> &&'
| `-AlwaysInlineAttr 0x7f91acb76e78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb77050 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:835:106> col:19 operator= 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7f91acb76f48 <col:29, col:58> col:58 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7f91acb77100 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb77290 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:837:98> col:45 operator= 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7f91acb77188 <col:55, col:73> col:73 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-AlwaysInlineAttr 0x7f91acb77340 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb774a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:838:5, col:43> col:19 operator= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| `-ParmVarDecl 0x7f91acb77398 <col:29, col:40> col:40 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7f91acb775d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:856:43> line:855:14 begin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f91acb77680 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb77758 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:859:49> line:858:20 begin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb77800 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb77870 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:862:52> line:861:14 end 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f91acb77918 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb77988 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:865:58> line:864:20 end 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb77a30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb77b28 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:869:41> line:868:22 rbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f91acb77bd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb77cc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:872:47> line:871:28 rbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb77d70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb77de0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:875:43> line:874:22 rend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f91acb77e88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb77ef8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:878:49> line:877:28 rend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb77fa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb78010 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:882:25> line:881:20 cbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb780b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb78128 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:885:23> line:884:20 cend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb781d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb78240 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:888:26> line:887:28 crbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb782e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb78358 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:891:24> line:890:28 crend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb78400 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb784a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:894:70> line:893:41 referenced size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb78550 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb785c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:895:81> col:41 length 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb78668 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb786d8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:896:41 max_size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb78780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb787f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:899:71> line:897:41 referenced capacity 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb78898 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb78a30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:901:5, col:46> col:10 resize 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7f91acb788f0 <col:17, col:27> col:27 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb78960 <col:32, col:43> col:43 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7f91acb78bc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:902:85> col:36 referenced resize 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f91acb78af8 <col:43, col:53> col:53 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb78c70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb78d50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:904:5, col:41> col:10 reserve 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| `-ParmVarDecl 0x7f91acb78cc8 <col:18, col:40> col:28 __res_arg 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb78e00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:906:47> col:10 shrink_to_fit 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7f91acb78ea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb78ef0 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:908:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7f91acb78f98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb78fe0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:909:80> col:36 referenced empty '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb79088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb791c8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:911:47 referenced operator[] 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb79100 <col:58, col:68> col:68 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb79278 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb793f8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:912:47 referenced operator[] 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7f91acb792f0 <col:58, col:68> col:68 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb794a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb795c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:914:5, col:39> col:21 at 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| `-ParmVarDecl 0x7f91acb79500 <col:24, col:34> col:34 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb79740 <line:915:5, col:37> col:21 at 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| `-ParmVarDecl 0x7f91acb79680 <col:24, col:34> col:34 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb79888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:917:105> col:45 operator+= 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7f91acb79800 <col:56, col:76> col:76 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f91acb79938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb79a18 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:918:104> col:45 operator+= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7f91acb79990 <col:56, col:68> col:68 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7f91acb79ac8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb79ba8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:919:103> col:45 operator+= 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7f91acb79b20 <col:56, col:74> col:74 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-AlwaysInlineAttr 0x7f91acb79c58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb79d38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:920:113> col:45 operator+= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7f91acb79cb0 <col:56, col:67> col:67 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-AlwaysInlineAttr 0x7f91acb79de8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb79f80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:922:112> col:45 operator+= 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7f91acb79eb8 <col:56, col:85> col:85 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7f91acb7a030 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb7a110 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:926:51> col:19 append 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7f91acb7a088 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f91acb7a1c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb7a2a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:928:87> col:19 append 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7f91acb7a218 <col:26, col:38> col:38 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7f91acb7a350 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb7a5c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:929:5, col:88> col:19 append 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f91acb7a3a8 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb7a418 <col:53, col:63> col:63 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb7a488 <col:70, col:84> col:80 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7f91acb7ad28 <line:930:5, line:937:77> col:19 append
| |-TemplateTypeParmDecl 0x7f91acb7a680 <line:930:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7f91acb7ac90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:937:77> col:19 append 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7f91acb7aa68 <col:26, col:37> col:37 __t 'const _Tp &'
|   |-ParmVarDecl 0x7f91acb7aad8 <col:42, col:52> col:52 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7f91acb7ab48 <col:59, col:73> col:69 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb7afb0 <line:938:5, col:62> col:19 append 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f91acb7ae28 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7f91acb7ae98 <col:49, col:59> col:59 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb7b100 <line:939:5, col:47> col:19 append 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| `-ParmVarDecl 0x7f91acb7b078 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7f91acb7b340 <line:940:5, col:55> col:19 append 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7f91acb7b1c0 <col:26, col:36> col:36 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb7b230 <col:41, col:52> col:52 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FunctionTemplateDecl 0x7f91acb7b6a8 <line:941:5, line:943:77> col:19 __append_forward_unsafe
| |-TemplateTypeParmDecl 0x7f91acb7b3f8 <line:941:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7f91acb7b610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:943:77> col:19 __append_forward_unsafe 'class std::__1::basic_string<char> &(_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7f91acb7b490 <col:43> col:59 '_ForwardIterator'
|   `-ParmVarDecl 0x7f91acb7b500 <col:61> col:77 '_ForwardIterator'
|-FunctionTemplateDecl 0x7f91acb7c668 <line:944:5, line:957:5> line:953:5 append
| |-TemplateTypeParmDecl 0x7f91acb7b790 <line:944:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7f91acb7c5d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:957:5> line:953:5 append 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value || !__libcpp_string_gets_noexcept_iterator<_InputIterator>::value, class basic_string<char> &>::type (_InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7f91acb7c440 <col:12, col:27> col:27 __first '_InputIterator'
|   |-ParmVarDecl 0x7f91acb7c4b0 <col:36, col:51> col:51 __last '_InputIterator'
|   `-AlwaysInlineAttr 0x7f91acb7c6c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f91acb7ce28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:958:5, line:969:5> line:967:5 append
| |-TemplateTypeParmDecl 0x7f91acb7c798 <line:958:14, col:20> col:20 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7f91acb7cd90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:969:5> line:967:5 append 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && __libcpp_string_gets_noexcept_iterator<_ForwardIterator>::value, class basic_string<char> &>::type (_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7f91acb7cc00 <col:12, col:29> col:29 __first '_ForwardIterator'
|   |-ParmVarDecl 0x7f91acb7cc70 <col:38, col:55> col:55 __last '_ForwardIterator'
|   `-AlwaysInlineAttr 0x7f91acb7ce88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb7d0b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:973:103> col:19 append 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7f91acb7cfe8 <col:26, col:55> col:55 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7f91acb7d160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb7d2c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:976:5, col:34> col:10 push_back 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| `-ParmVarDecl 0x7f91acb7d1b8 <col:20, col:31> col:31 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7f91acb7d370 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:978:19> col:10 pop_back 'void (void)'
| `-AlwaysInlineAttr 0x7f91acb7d418 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb7d4e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:979:53> col:47 front 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (void)'
| `-AlwaysInlineAttr 0x7f91acb7d588 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb7d620 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:980:55> col:47 front 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7f91acb7d6c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb7d730 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:981:52> col:47 back 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (void)'
| `-AlwaysInlineAttr 0x7f91acb7d7d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb7d840 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:982:54> col:47 back 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7f91acb7d8e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb7d9c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:985:87> col:19 assign 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7f91acb7d940 <col:26, col:38> col:38 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7f91acb7da78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb7db58 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:987:77> col:19 assign 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7f91acb7dad0 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f91acb7dc08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb7dd30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:992:51> line:990:19 assign 'class std::__1::basic_string<char> &(class std::__1::basic_string<char> &&)' noexcept-uninstantiated 0x7f91ae278d50
| |-ParmVarDecl 0x7f91acb7dc60 <col:26, col:41> col:41 __str 'class std::__1::basic_string<char> &&'
| `-AlwaysInlineAttr 0x7f91acb7de28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb7dff8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:994:5, col:88> col:19 assign 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f91acb7de80 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb7def0 <col:53, col:63> col:63 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb7df60 <col:70, col:84> col:80 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7f91acb7e668 <line:995:5, line:1002:78> col:19 assign
| |-TemplateTypeParmDecl 0x7f91acb7e0b8 <line:995:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7f91acb7e5d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1002:78> col:19 assign 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7f91acb7e3f8 <col:26, col:38> col:38 __t 'const _Tp &'
|   |-ParmVarDecl 0x7f91acb7e468 <col:43, col:53> col:53 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7f91acb7e4d8 <col:60, col:74> col:70 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb7e868 <line:1003:5, col:62> col:19 assign 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f91acb7e768 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7f91acb7e7d8 <col:49, col:59> col:59 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb7e9b8 <line:1004:5, col:47> col:19 assign 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| `-ParmVarDecl 0x7f91acb7e930 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7f91acb7eb78 <line:1005:5, col:55> col:19 assign 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7f91acb7ea78 <col:26, col:36> col:36 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb7eae8 <col:41, col:52> col:52 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FunctionTemplateDecl 0x7f91acb7f1e8 <line:1006:5, line:1014:61> col:9 assign
| |-TemplateTypeParmDecl 0x7f91acb7ec30 <line:1006:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7f91acb7f150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1014:61> col:9 assign 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value || !__libcpp_string_gets_noexcept_iterator<_InputIterator>::value, class basic_string<char> &>::type (_InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7f91acb7f000 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x7f91acb7f070 <col:40, col:55> col:55 __last '_InputIterator'
|-FunctionTemplateDecl 0x7f91acb7f868 <line:1015:5, line:1023:65> col:9 assign
| |-TemplateTypeParmDecl 0x7f91acb7f2d0 <line:1015:14, col:20> col:20 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7f91acb7f7d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1023:65> col:9 assign 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && __libcpp_string_gets_noexcept_iterator<_ForwardIterator>::value, class basic_string<char> &>::type (_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7f91acb7f680 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7f91acb7f6f0 <col:42, col:59> col:59 __last '_ForwardIterator'
|-CXXMethodDecl 0x7f91acb7faa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1026:103> col:19 assign 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7f91acb7f9d8 <col:26, col:55> col:55 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7f91acb7fb50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb7fd30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1030:69> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7f91acb7fba8 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb7fc18 <col:44, col:64> col:64 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f91acb7fde8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb7ffc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1032:113> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7f91acb7fe40 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb7feb0 <col:44, col:56> col:56 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7f91acb80078 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f91acb80738 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1033:5, line:1040:96> col:19 insert
| |-TemplateTypeParmDecl 0x7f91acb800c0 <line:1033:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7f91acb806a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1040:96> col:19 insert 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7f91acb803d0 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7f91acb80468 <col:44, col:55> col:55 __t 'const _Tp &'
|   |-ParmVarDecl 0x7f91acb804d8 <col:60, col:70> col:70 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7f91acb80548 <col:78, col:92> col:88 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb80ad0 <line:1041:5, col:107> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f91acb80840 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb808b0 <col:44, col:64> col:64 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb80920 <col:71, col:81> col:81 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb80990 <col:89, col:103> col:99 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb80dc0 <line:1042:5, col:79> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f91acb80ba8 <col:26, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb80c18 <col:43, col:61> col:61 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7f91acb80c88 <col:66, col:76> col:76 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb81010 <line:1043:5, col:64> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7f91acb80e90 <col:26, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb80f00 <col:43, col:61> col:61 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7f91acb812f0 <line:1044:5, col:72> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7f91acb810d8 <col:26, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb81148 <col:43, col:53> col:53 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb811b8 <col:58, col:69> col:69 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7f91acb81540 <line:1045:5, col:62> col:19 insert 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7f91acb813c0 <col:26, col:41> col:41 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| `-ParmVarDecl 0x7f91acb81430 <col:48, col:59> col:59 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7f91acb81820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1047:77> col:19 insert 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7f91acb81608 <col:26, col:41> col:41 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f91acb81678 <col:48, col:58> col:58 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb816e8 <col:63, col:74> col:74 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-AlwaysInlineAttr 0x7f91acb818e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f91acb82068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1048:5, line:1056:83> col:9 insert
| |-TemplateTypeParmDecl 0x7f91acb81928 <line:1048:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7f91acb81fd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1056:83> col:9 insert 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value || !__libcpp_string_gets_noexcept_iterator<_InputIterator>::value, iterator>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, _InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7f91acb81db0 <col:16, col:31> col:31 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7f91acb81e20 <col:38, col:53> col:53 __first '_InputIterator'
|   `-ParmVarDecl 0x7f91acb81e90 <col:62, col:77> col:77 __last '_InputIterator'
|-FunctionTemplateDecl 0x7f91acb82878 <line:1057:5, line:1065:87> col:9 insert
| |-TemplateTypeParmDecl 0x7f91acb82158 <line:1057:14, col:20> col:20 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7f91acb827e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1065:87> col:9 insert 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && __libcpp_string_gets_noexcept_iterator<_ForwardIterator>::value, iterator>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, _ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7f91acb825c0 <col:16, col:31> col:31 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7f91acb82630 <col:38, col:55> col:55 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7f91acb826a0 <col:64, col:81> col:81 __last '_ForwardIterator'
|-CXXMethodDecl 0x7f91acb82b80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1069:69> line:1068:14 insert 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7f91acb82978 <col:21, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f91acb82a68 <col:43, col:72> col:72 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7f91acb82c38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb82e10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1072:5, col:66> col:19 erase 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f91acb82c90 <col:25, col:43> col:35 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb82d00 <col:46, col:62> col:56 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb82fe0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1074:45> col:19 erase 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator)'
| |-ParmVarDecl 0x7f91acb82ed8 <col:25, col:40> col:40 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| `-AlwaysInlineAttr 0x7f91acb83090 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb83270 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1076:70> col:19 erase 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator)'
| |-ParmVarDecl 0x7f91acb830e8 <col:25, col:40> col:40 __first 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f91acb83158 <col:49, col:64> col:64 __last 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| `-AlwaysInlineAttr 0x7f91acb83328 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb83590 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1079:86> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7f91acb83380 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb833f0 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb83460 <col:61, col:81> col:81 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f91acb83650 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb838c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1081:137> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7f91acb836a8 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb83718 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb83788 <col:61, col:73> col:73 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7f91acb83980 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb83d00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1082:5, col:125> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f91acb839d8 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb83a48 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb83ab8 <col:61, col:81> col:81 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb83b28 <col:88, col:98> col:98 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb83b98 <col:106, col:121> col:116 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7f91acb844f0 <line:1083:5, line:1090:114> col:19 replace
| |-TemplateTypeParmDecl 0x7f91acb83dd0 <line:1083:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7f91acb84458 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1090:114> col:19 replace 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7f91acb840e0 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7f91acb84150 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7f91acb841e8 <col:61, col:72> col:72 __t 'const _Tp &'
|   |-ParmVarDecl 0x7f91acb84258 <col:77, col:87> col:87 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7f91acb842c8 <col:95, col:110> col:105 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb84890 <line:1091:5, col:97> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f91acb84600 <col:27, col:37> col:37 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb84670 <col:44, col:54> col:54 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb846e0 <col:60, col:78> col:78 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f91acb84750 <col:83, col:93> col:93 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-NoSanitizeAttr 0x7f91acb84958 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:453:69> unsigned-integer-overflow
|-CXXMethodDecl 0x7f91acb84c00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1092:5, col:81> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7f91acb849e8 <col:27, col:37> col:37 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb84a58 <col:44, col:54> col:54 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb84ac8 <col:60, col:78> col:78 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7f91acb84f60 <line:1093:5, col:90> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7f91acb84cd0 <col:27, col:37> col:37 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb84d40 <col:44, col:54> col:54 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb84db0 <col:60, col:70> col:70 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb84e20 <col:76, col:87> col:87 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-NoSanitizeAttr 0x7f91acb85028 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:453:69> unsigned-integer-overflow
|-CXXMethodDecl 0x7f91acb852d0 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1095:94> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7f91acb850b8 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f91acb85128 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f91acb85198 <col:69, col:89> col:89 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f91acb85390 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb85600 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1097:140> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7f91acb853e8 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f91acb85458 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f91acb854c8 <col:69, col:81> col:81 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7f91acb856c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb859b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1099:105> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f91acb85718 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f91acb85788 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f91acb857f8 <col:69, col:87> col:87 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f91acb85868 <col:92, col:102> col:102 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb85a78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb85ce0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1101:90> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7f91acb85ad0 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f91acb85b40 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f91acb85bb0 <col:69, col:87> col:87 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-AlwaysInlineAttr 0x7f91acb85da0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb86090 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1103:98> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7f91acb85df8 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f91acb85e68 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f91acb85ed8 <col:69, col:79> col:79 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb85f48 <col:84, col:95> col:95 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-AlwaysInlineAttr 0x7f91acb86158 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f91acb86818 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1104:5, line:1111:99> col:9 replace
| |-TemplateTypeParmDecl 0x7f91acb861a0 <line:1104:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7f91acb86780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1111:99> col:9 replace 'typename enable_if<__is_input_iterator<_InputIterator>::value, class basic_string<char> &>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, _InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7f91acb864e0 <col:17, col:32> col:32 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7f91acb86550 <col:38, col:53> col:53 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7f91acb865c0 <col:59, col:74> col:74 __j1 '_InputIterator'
|   `-ParmVarDecl 0x7f91acb86630 <col:80, col:95> col:95 __j2 '_InputIterator'
|-CXXMethodDecl 0x7f91acb86bb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1115:63> line:1114:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7f91acb86920 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f91acb86990 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7f91acb86a78 <col:69, col:98> col:98 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7f91acb86c70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb86ec0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1118:5, col:73> col:15 copy 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7f91acb86cf8 <col:20, col:32> col:32 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f91acb86d68 <col:37, col:47> col:47 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb86dd8 <col:52, col:70> col:62 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb87110 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1120:68> col:18 substr 'class std::__1::basic_string<char> (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7f91acb86f90 <col:25, col:43> col:35 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb87000 <col:46, col:62> col:56 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb871c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb87328 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1123:10 swap 'void (class std::__1::basic_string<char> &) noexcept'
| |-ParmVarDecl 0x7f91acb87220 <col:15, col:29> col:29 __str 'class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f91acb873d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb87478 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1132:62> col:23 referenced c_str 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb87520 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb87590 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1134:96> col:23 data 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb87638 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb87708 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1141:70> col:20 get_allocator 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb877b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb87998 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1144:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb87808 <col:20, col:40> col:40 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb87878 <col:47, col:65> col:57 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb87a50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb87bf8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1146:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb87aa8 <col:20, col:32> col:32 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7f91acb87b18 <col:38, col:56> col:48 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb87cb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb87ed8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1147:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1147:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb87d08 <col:20, col:38> col:38 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f91acb87d78 <col:43, col:53> col:53 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb87de8 <col:60, col:70> col:70 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb880f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1149:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb87fa8 <col:20, col:38> col:38 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f91acb88018 <col:43, col:61> col:53 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb881b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb88358 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1150:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1150:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb88208 <col:20, col:31> col:31 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-ParmVarDecl 0x7f91acb88278 <col:36, col:54> col:46 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb88528 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1153:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb88420 <col:21, col:41> col:41 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb88490 <col:48, col:66> col:58 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb885e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb88740 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1155:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb88638 <col:21, col:33> col:33 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7f91acb886a8 <col:39, col:57> col:49 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb887f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb889d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1156:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1156:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb88850 <col:21, col:39> col:39 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f91acb888c0 <col:44, col:54> col:54 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb88930 <col:61, col:71> col:71 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb88ba8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1158:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb88aa0 <col:21, col:39> col:39 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f91acb88b10 <col:44, col:62> col:54 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb88c60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb88dc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1159:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1159:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb88cb8 <col:21, col:32> col:32 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-ParmVarDecl 0x7f91acb88d28 <col:37, col:55> col:47 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb88f90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1162:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb88e88 <col:29, col:49> col:49 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb88ef8 <col:56, col:74> col:66 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb89048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb891a8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1164:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb890a0 <col:29, col:41> col:41 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7f91acb89110 <col:47, col:65> col:57 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb89260 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb89438 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1165:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1165:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb892b8 <col:29, col:47> col:47 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f91acb89328 <col:52, col:62> col:62 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb89398 <col:69, col:79> col:79 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb89610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1167:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb89508 <col:29, col:47> col:47 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f91acb89578 <col:52, col:70> col:62 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb896c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb89828 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1169:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb89720 <col:29, col:40> col:40 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7f91acb89790 <col:45, col:63> col:55 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb898e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb89a40 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1172:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb89938 <col:28, col:48> col:48 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb899a8 <col:55, col:73> col:65 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb89af8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb89c58 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1174:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb89b50 <col:28, col:40> col:40 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7f91acb89bc0 <col:46, col:64> col:56 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb89d10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb89ee8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1175:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1175:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb89d68 <col:28, col:46> col:46 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f91acb89dd8 <col:51, col:61> col:61 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb89e48 <col:68, col:78> col:78 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb8a0c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1177:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb89fb8 <col:28, col:46> col:46 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f91acb8a028 <col:51, col:69> col:61 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb8a178 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb8a2d8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1179:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb8a1d0 <col:28, col:39> col:39 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7f91acb8a240 <col:44, col:62> col:54 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb8a390 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb8a4f0 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1182:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb8a3e8 <col:33, col:53> col:53 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb8a458 <col:60, col:78> col:70 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb8a5a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb8a708 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1184:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb8a600 <col:33, col:45> col:45 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7f91acb8a670 <col:51, col:69> col:61 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb8a7c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb8a998 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1185:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1185:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb8a818 <col:33, col:51> col:51 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f91acb8a888 <col:56, col:66> col:66 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb8a8f8 <col:73, col:83> col:83 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb8ab70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1187:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb8aa68 <col:33, col:51> col:51 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f91acb8aad8 <col:56, col:74> col:66 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb8ac28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb8ad88 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1189:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb8ac80 <col:33, col:44> col:44 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7f91acb8acf0 <col:49, col:67> col:59 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb8ae40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb8afa0 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1192:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb8ae98 <col:32, col:52> col:52 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb8af08 <col:59, col:77> col:69 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb8b058 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb8b1b8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1194:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb8b0b0 <col:32, col:44> col:44 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7f91acb8b120 <col:50, col:68> col:60 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb8b270 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb8b448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1195:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1195:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb8b2c8 <col:32, col:50> col:50 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f91acb8b338 <col:55, col:65> col:65 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb8b3a8 <col:72, col:82> col:82 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb8b620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1197:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb8b518 <col:32, col:50> col:50 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f91acb8b588 <col:55, col:73> col:65 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb8b6d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb8b838 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1199:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7f91acb8b730 <col:32, col:43> col:43 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7f91acb8b7a0 <col:48, col:66> col:58 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb8b8f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb8ba60 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1202:9 compare 'int (const class std::__1::basic_string<char> &) const noexcept'
| |-ParmVarDecl 0x7f91acb8b948 <col:17, col:37> col:37 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f91acb8bb10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb8bc40 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1204:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view) const noexcept'
| |-ParmVarDecl 0x7f91acb8bb68 <col:17, col:29> col:29 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7f91acb8bcf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb8bf18 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1206:69> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view) const'
| |-ParmVarDecl 0x7f91acb8bd48 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb8bdb8 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb8be28 <col:51, col:63> col:63 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7f91acb8bfd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb8c248 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1208:78> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &) const'
| |-ParmVarDecl 0x7f91acb8c030 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb8c0a0 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb8c110 <col:51, col:71> col:71 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f91acb8c308 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb948b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1209:5, col:117> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7f91acb8c360 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb94600 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb94670 <col:51, col:71> col:71 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb946e0 <col:78, col:88> col:88 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb94750 <col:96, col:111> col:106 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7f91acb95138 <line:1210:5, line:1217:106> col:9 compare
| |-TemplateTypeParmDecl 0x7f91acb94988 <line:1210:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7f91acb950a0 <line:1211:5, line:1217:106> col:9 compare 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, int>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const' inline
|   |-ParmVarDecl 0x7f91acb94d40 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7f91acb94db0 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7f91acb94e48 <col:51, col:62> col:62 __t 'const _Tp &'
|   |-ParmVarDecl 0x7f91acb94eb8 <col:67, col:77> col:77 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7f91acb94f28 <col:85, col:100> col:95 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-AlwaysInlineAttr 0x7f91acb951b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f91acb95360 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1218:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1218:9 compare 'int (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *) const noexcept'
| `-ParmVarDecl 0x7f91acb95290 <col:17, col:35> col:35 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7f91acb955e8 <line:1219:5, col:74> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *) const'
| |-ParmVarDecl 0x7f91acb95420 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb95490 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb95500 <col:51, col:69> col:69 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7f91acb95908 <line:1220:5, col:90> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7f91acb956b8 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb95728 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb95798 <col:51, col:69> col:69 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7f91acb95808 <col:74, col:84> col:84 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb959d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1222:51> col:36 __invariants '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f91acb95a78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb95ac0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1226:63> line:1225:10 __is_long '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb95b68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7f91acb95bb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1237:1, col:8> col:1 private
|-CXXMethodDecl 0x7f91acb95c68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1240:31> line:1239:21 __alloc 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &(void) noexcept'
| `-AlwaysInlineAttr 0x7f91acb95d10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb95db8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1243:31> line:1242:27 __alloc 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &(void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb95e60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb95f88 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1270:63> line:1266:10 __set_short_size 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7f91acb95eb8 <col:27, col:37> col:37 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb96038 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb960a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1278:47> line:1274:15 __get_short_size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb96150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb96238 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1285:41> line:1284:10 __set_long_size 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7f91acb961a8 <col:26, col:36> col:36 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb962e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb96358 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1288:42> line:1287:15 __get_long_size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb96400 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb964e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1291:76> line:1290:10 __set_size 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7f91acb96458 <col:21, col:31> col:31 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb96598 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb96680 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1295:55> line:1294:10 __set_long_cap 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7f91acb965f0 <col:25, col:35> col:35 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb96730 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb967a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1298:67> line:1297:15 __get_long_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb96848 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb96968 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1302:41> line:1301:10 __set_long_pointer 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer) noexcept'
| |-ParmVarDecl 0x7f91acb968a0 <col:29, col:37> col:37 __p 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
| `-AlwaysInlineAttr 0x7f91acb96a18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb96ae8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1305:42> line:1304:13 __get_long_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer (void) noexcept'
| `-AlwaysInlineAttr 0x7f91acb96b90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb96c38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1308:42> line:1307:19 __get_long_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb96ce0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb96d50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1311:82> line:1310:13 __get_short_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer (void) noexcept'
| `-AlwaysInlineAttr 0x7f91acb96df8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb96e68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1314:88> line:1313:19 __get_short_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb96f10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb96f80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1317:76> line:1316:13 __get_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer (void) noexcept'
| `-AlwaysInlineAttr 0x7f91acb97028 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb97098 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1320:76> line:1319:19 __get_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer (void) const noexcept'
| `-AlwaysInlineAttr 0x7f91acb97140 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb97188 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1328:9> line:1323:10 __zero 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7f91acb97230 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f91acb97470 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1330:5, line:1333:48> line:1332:19 __align_it
| |-NonTypeTemplateParmDecl 0x7f91acb97288 <line:1330:15, col:25> col:25 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long' depth 0 index 0 __a
| `-CXXMethodDecl 0x7f91acb973d8 <col:30, line:1333:48> line:1332:19 __align_it 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept' static
|   |-ParmVarDecl 0x7f91acb97308 <col:30, col:40> col:40 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-AlwaysInlineAttr 0x7f91acb974c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-EnumDecl 0x7f91acb97598 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1334:5> col:5
| `-EnumConstantDecl 0x7f91acb97660 <col:11, col:25> col:11 __alignment 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1334:5)'
|   `-ImplicitCastExpr 0x7f91acb976a8 <col:25> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7f91ac224910 <col:25> 'int' 16
|-CXXMethodDecl 0x7f91acb97760 <line:1335:5, line:1339:79> line:1336:15 __recommend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept' static
| |-ParmVarDecl 0x7f91acb976d0 <col:27, col:37> col:37 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb97810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb97a80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1341:5, line:1342:75> col:10 __init 'void (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
| |-ParmVarDecl 0x7f91acb97868 <col:17, col:35> col:35 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7f91acb978d8 <col:40, col:50> col:50 __sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb97948 <col:56, col:66> col:66 __reserve 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb97c90 <line:1343:5, line:1344:54> col:10 __init 'void (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
| |-ParmVarDecl 0x7f91acb97b50 <col:17, col:35> col:35 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7f91acb97bc0 <col:40, col:50> col:50 __sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb97e58 <line:1345:5, line:1346:46> col:10 __init 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)' inline
| |-ParmVarDecl 0x7f91acb97d58 <col:17, col:27> col:27 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb97dc8 <col:32, col:43> col:43 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FunctionTemplateDecl 0x7f91acb98468 <line:1348:5, line:1355:57> col:5 __init
| |-TemplateTypeParmDecl 0x7f91acb97f10 <line:1348:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7f91acb983d0 <line:1349:5, line:1355:57> col:5 __init 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value, void>::type (_InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7f91acb98240 <col:12, col:27> col:27 __first '_InputIterator'
|   `-ParmVarDecl 0x7f91acb982b0 <col:36, col:51> col:51 __last '_InputIterator'
|-FunctionTemplateDecl 0x7f91acb98aa8 <line:1357:5, line:1364:61> col:5 __init
| |-TemplateTypeParmDecl 0x7f91acb98550 <line:1357:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7f91acb98a10 <line:1358:5, line:1364:61> col:5 __init 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value, void>::type (_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7f91acb98880 <col:12, col:29> col:29 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7f91acb988f0 <col:38, col:55> col:55 __last '_ForwardIterator'
|-CXXMethodDecl 0x7f91acb98f40 <line:1366:5, line:1367:85> line:1366:10 __grow_by 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f91acb98ba0 <col:20, col:30> col:30 __old_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb98c10 <col:41, col:51> col:51 __delta_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb98c80 <col:64, col:74> col:74 __old_sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb98cf0 <line:1367:20, col:30> col:30 __n_copy 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb98d60 <col:41, col:51> col:51 __n_del 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb98dd0 <col:64, col:84> col:74 __n_add 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f91acb99460 <line:1368:5, line:1370:82> line:1368:10 __grow_by_and_replace 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7f91acb99028 <col:32, col:42> col:42 __old_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb99098 <col:53, col:63> col:63 __delta_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb99108 <col:76, col:86> col:86 __old_sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb99178 <line:1369:32, col:42> col:42 __n_copy 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb991e8 <col:53, col:63> col:63 __n_del 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f91acb99258 <line:1370:32, col:42> col:42 __n_add 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f91acb992c8 <col:51, col:69> col:69 __p_new_stuff 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7f91acb995d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1373:40> col:10 __erase_to_end 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f91acb99550 <col:25, col:35> col:35 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb99688 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb99768 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1378:89> line:1376:10 __copy_assign_alloc 'void (const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7f91acb996e0 <col:30, col:50> col:50 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f91acb99818 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb999e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1405:9> line:1381:10 __copy_assign_alloc 'void (const class std::__1::basic_string<char> &, std::__1::true_type)'
| |-ParmVarDecl 0x7f91acb99870 <col:30, col:50> col:50 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb998d0 <col:57> col:66 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7f91acb99a98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb99c68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1409:10> line:1408:10 __copy_assign_alloc 'void (const class std::__1::basic_string<char> &, std::__1::false_type) noexcept'
| |-ParmVarDecl 0x7f91acb99af0 <col:30, col:48> col:49 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb99b50 <col:51> col:61 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7f91acb99d20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb99f00 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1413:10 __move_assign 'void (class std::__1::basic_string<char> &, std::__1::false_type)' noexcept-uninstantiated 0x7f91ac22aa98
| |-ParmVarDecl 0x7f91acb99d78 <col:24, col:38> col:38 __str 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb99dd8 <col:45> col:55 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7f91acb9a010 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb9a1f0 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1416:10 __move_assign 'void (class std::__1::basic_string<char> &, std::__1::true_type)' noexcept-uninstantiated 0x7f91ac22ad68
| |-ParmVarDecl 0x7f91acb9a068 <col:24, col:38> col:38 __str 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb9a0c8 <col:45> col:54 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7f91acb9a300 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb9a430 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1431:89> line:1426:5 __move_assign_alloc 'void (class std::__1::basic_string<char> &)' noexcept-uninstantiated 0x7f91ac22af78
| |-ParmVarDecl 0x7f91acb9a358 <col:25, col:39> col:39 __str 'class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7f91acb9a528 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb9a6c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1438:9> line:1434:10 __move_assign_alloc 'void (class std::__1::basic_string<char> &, std::__1::true_type)' noexcept-uninstantiated 0x7f91ac22b1b8
| |-ParmVarDecl 0x7f91acb9a580 <col:30, col:44> col:44 __c 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb9a5e0 <col:49> col:58 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7f91acb9a7d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb9a968 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1443:10> line:1441:10 __move_assign_alloc 'void (class std::__1::basic_string<char> &, std::__1::false_type) noexcept'
| |-ParmVarDecl 0x7f91acb9a828 <col:30, col:42> col:43 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7f91acb9a888 <col:45> col:55 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7f91acb9aa20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb9aa68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1445:63> col:36 __invalidate_all_iterators 'void (void)'
| `-AlwaysInlineAttr 0x7f91acb9ab10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f91acb9abf0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1446:73> col:36 __invalidate_iterators_past 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7f91acb9ab68 <col:64> col:73 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f91acb9aca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FriendDecl 0x7f91acb9b840 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1448:5, col:77> col:25
| `-FunctionDecl 0x7f91acb9ae40 parent 0x7f91ae2562d0 prev 0x7f91acb9b5e0 <col:5, col:77> col:25 operator+ 'class std::__1::basic_string<char> (const class std::__1::basic_string<char> &, const class std::__1::basic_string<char> &)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7f91acb9acf8 <col:37, col:55> col:56 'const class std::__1::basic_string<char> &'
|   `-ParmVarDecl 0x7f91acb9ad68 <col:58, col:76> col:77 'const class std::__1::basic_string<char> &'
|-FriendDecl 0x7f91acb9c308 <line:1449:5, col:75> col:25
| `-FunctionDecl 0x7f91acb9ba10 parent 0x7f91ae2562d0 prev 0x7f91acb9c0e0 <col:5, col:75> col:25 operator+ 'class std::__1::basic_string<char> (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, const class std::__1::basic_string<char> &)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7f91acb9b888 <col:37, col:53> col:54 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|   `-ParmVarDecl 0x7f91acb9b8f8 <col:56, col:74> col:75 'const class std::__1::basic_string<char> &'
|-FriendDecl 0x7f91acb9dda0 <line:1450:5, col:68> col:25
| `-FunctionDecl 0x7f91acb9c4d0 parent 0x7f91ae2562d0 prev 0x7f91acb9dbb0 <col:5, col:68> col:25 operator+ 'class std::__1::basic_string<char> (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, const class std::__1::basic_string<char> &)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7f91acb9c350 <col:37> col:47 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|   `-ParmVarDecl 0x7f91acb9c3c0 <col:49, col:67> col:68 'const class std::__1::basic_string<char> &'
|-FriendDecl 0x7f91acb9e868 <line:1451:5, col:75> col:25
| `-FunctionDecl 0x7f91acb9df70 parent 0x7f91ae2562d0 prev 0x7f91acb9e6a0 <col:5, col:75> col:25 operator+ 'class std::__1::basic_string<char> (const class std::__1::basic_string<char> &, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7f91acb9dde8 <col:37, col:55> col:56 'const class std::__1::basic_string<char> &'
|   `-ParmVarDecl 0x7f91acb9de58 <col:58, col:74> col:75 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
`-FriendDecl 0x7f91acb9f2f0 <line:1452:5, col:68> col:25
  `-FunctionDecl 0x7f91acb9ea30 parent 0x7f91ae2562d0 prev 0x7f91acb9f160 <col:5, col:68> col:25 operator+ 'class std::__1::basic_string<char> (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
    |-TemplateArgument type 'char'
    |-TemplateArgument type 'struct std::__1::char_traits<char>'
    |-TemplateArgument type 'class std::__1::allocator<char>'
    |-ParmVarDecl 0x7f91acb9e8b0 <col:37, col:55> col:56 'const class std::__1::basic_string<char> &'
    `-ParmVarDecl 0x7f91acb9e920 <col:58> col:68 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_string" = type { %"class.std::__1::__compressed_pair" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_string" = type { %"class.std::__1::__compressed_pair" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f91ac4225c8 </Users/tskull/Documents/Programming/Cpp/object_model_refined/5_ctor_dtor_semantics/05_object_copy_semantics.cpp:5:1, line:29:1> line:5:8 referenced struct A definition
|-CXXRecordDecl 0x7f91ac4226e8 <col:1, col:8> col:8 implicit referenced struct A
|-FieldDecl 0x7f91ac422820 <line:6:5, col:17> col:17 referenced s1 'std::string':'class std::__1::basic_string<char>'
|-CXXConstructorDecl 0x7f91ac4228d8 <line:8:5, col:23> col:5 A 'void (void)'
| |-CXXCtorInitializer Field 0x7f91ac422820 's1' 'std::string':'class std::__1::basic_string<char>'
| | `-CXXConstructExpr 0x7f91ac4234e8 <col:11, col:20> 'std::string':'class std::__1::basic_string<char>' 'void (const char *)'
| |   `-ImplicitCastExpr 0x7f91ac4234d0 <col:14> 'const char *' <ArrayToPointerDecay>
| |     `-StringLiteral 0x7f91ac423428 <col:14> 'const char [5]' lvalue "test"
| `-CompoundStmt 0x7f91ac423550 <col:22, col:23>
|-CXXConstructorDecl 0x7f91ac422ac0 <line:10:5, col:51> col:14 A 'void (const std::string &)'
| |-ParmVarDecl 0x7f91ac422a00 <col:16, col:35> col:35 used str 'const std::string &'
| |-CXXCtorInitializer Field 0x7f91ac422820 's1' 'std::string':'class std::__1::basic_string<char>'
| | `-CXXConstructExpr 0x7f91ac423628 <col:42, col:48> 'std::string':'class std::__1::basic_string<char>' 'void (const class std::__1::basic_string<char> &)'
| |   `-DeclRefExpr 0x7f91ac423568 <col:45> 'const std::string':'const class std::__1::basic_string<char>' lvalue ParmVar 0x7f91ac422a00 'str' 'const std::string &'
| `-CompoundStmt 0x7f91ac423690 <col:50, col:51>
|-CXXConstructorDecl 0x7f91ac422c70 <line:12:5, col:31> col:5 A 'void (const struct A &)'
| |-ParmVarDecl 0x7f91ac422ba8 <col:7, col:16> col:16 used c 'const struct A &'
| |-CXXCtorInitializer Field 0x7f91ac422820 's1' 'std::string':'class std::__1::basic_string<char>'
| | `-CXXConstructExpr 0x7f91ac4237a0 <col:21, col:28> 'std::string':'class std::__1::basic_string<char>' 'void (const class std::__1::basic_string<char> &)'
| |   `-MemberExpr 0x7f91ac4236d0 <col:24, col:26> 'const std::string':'const class std::__1::basic_string<char>' lvalue .s1 0x7f91ac422820
| |     `-DeclRefExpr 0x7f91ac4236a8 <col:24> 'const struct A' lvalue ParmVar 0x7f91ac422ba8 'c' 'const struct A &'
| `-CompoundStmt 0x7f91ac423808 <col:30, col:31>
|-CXXConstructorDecl 0x7f91ac422e68 <line:14:5, col:46> col:5 used A 'void (struct A &&) noexcept'
| |-ParmVarDecl 0x7f91ac422d58 <col:7, col:11> col:11 used o 'struct A &&'
| |-CXXCtorInitializer Field 0x7f91ac422820 's1' 'std::string':'class std::__1::basic_string<char>'
| | `-CXXConstructExpr 0x7f91ac424548 <col:25, col:43> 'std::string':'class std::__1::basic_string<char>' 'void (class std::__1::basic_string<char> &&) noexcept(is_nothrow_move_constructible<allocator_type>::value)'
| |   `-CallExpr 0x7f91ac424480 <col:28, col:42> 'typename remove_reference<class basic_string<char> &>::type':'class std::__1::basic_string<char>' xvalue
| |     |-ImplicitCastExpr 0x7f91ac424468 <col:28, col:33> 'typename remove_reference<class basic_string<char> &>::type &&(*)(class std::__1::basic_string<char> &&) noexcept' <FunctionToPointerDecay>
| |     | `-DeclRefExpr 0x7f91ac424170 <col:28, col:33> 'typename remove_reference<class basic_string<char> &>::type &&(class std::__1::basic_string<char> &&) noexcept' lvalue Function 0x7f91ac424030 'move' 'typename remove_reference<class basic_string<char> &>::type &&(class std::__1::basic_string<char> &&) noexcept' (FunctionTemplate 0x7f91ac0423b8 'move')
| |     `-MemberExpr 0x7f91ac4238d0 <col:38, col:40> 'std::string':'class std::__1::basic_string<char>' lvalue .s1 0x7f91ac422820
| |       `-DeclRefExpr 0x7f91ac4238a8 <col:38> 'struct A' lvalue ParmVar 0x7f91ac422d58 'o' 'struct A &&'
| `-CompoundStmt 0x7f91ac4245b0 <col:45, col:46>
|-CXXMethodDecl 0x7f91ac423020 <line:16:5, line:20:5> line:16:8 operator= 'struct A &(const struct A &)'
| |-ParmVarDecl 0x7f91ac422f28 <col:18, col:27> col:27 used c 'const struct A &'
| `-CompoundStmt 0x7f91ac424988 <line:17:5, line:20:5>
|   |-CXXOperatorCallExpr 0x7f91ac4248f0 <line:18:9, col:16> 'class std::__1::basic_string<char>' lvalue
|   | |-ImplicitCastExpr 0x7f91ac4248d8 <col:12> 'class std::__1::basic_string<char> &(*)(const class std::__1::basic_string<char> &)' <FunctionToPointerDecay>
|   | | `-DeclRefExpr 0x7f91ac424888 <col:12> 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)' lvalue CXXMethod 0x7f91acb76860 'operator=' 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
|   | |-MemberExpr 0x7f91ac4245e0 <col:9> 'std::string':'class std::__1::basic_string<char>' lvalue ->s1 0x7f91ac422820
|   | | `-CXXThisExpr 0x7f91ac4245c8 <col:9> 'struct A *' this
|   | `-MemberExpr 0x7f91ac424640 <col:14, col:16> 'const std::string':'const class std::__1::basic_string<char>' lvalue .s1 0x7f91ac422820
|   |   `-DeclRefExpr 0x7f91ac424618 <col:14> 'const struct A' lvalue ParmVar 0x7f91ac422f28 'c' 'const struct A &'
|   `-ReturnStmt 0x7f91ac424970 <line:19:9, col:17>
|     `-UnaryOperator 0x7f91ac424950 <col:16, col:17> 'struct A' lvalue prefix '*'
|       `-CXXThisExpr 0x7f91ac424938 <col:17> 'struct A *' this
|-CXXMethodDecl 0x7f91ac4231d8 <line:22:5, line:26:5> line:22:8 operator= 'struct A &(struct A &&) noexcept'
| |-ParmVarDecl 0x7f91ac4230d0 <col:18, col:22> col:22 used m 'struct A &&'
| `-CompoundStmt 0x7f91ac437e28 <line:23:5, line:26:5>
|   |-CXXOperatorCallExpr 0x7f91ac437d90 <line:24:9, col:28> 'class std::__1::basic_string<char>' lvalue
|   | |-ImplicitCastExpr 0x7f91ac437d78 <col:12> 'class std::__1::basic_string<char> &(*)(class std::__1::basic_string<char> &&) noexcept((__noexcept_move_assign_container<class allocator<char>, __alloc_traits>::value))' <FunctionToPointerDecay>
|   | | `-DeclRefExpr 0x7f91ac437cf0 <col:12> 'class std::__1::basic_string<char> &(class std::__1::basic_string<char> &&) noexcept((__noexcept_move_assign_container<class allocator<char>, __alloc_traits>::value))' lvalue CXXMethod 0x7f91acb76d80 'operator=' 'class std::__1::basic_string<char> &(class std::__1::basic_string<char> &&) noexcept((__noexcept_move_assign_container<class allocator<char>, __alloc_traits>::value))'
|   | |-MemberExpr 0x7f91ac4249c8 <col:9> 'std::string':'class std::__1::basic_string<char>' lvalue ->s1 0x7f91ac422820
|   | | `-CXXThisExpr 0x7f91ac4249b0 <col:9> 'struct A *' this
|   | `-CallExpr 0x7f91ac424b78 <col:14, col:28> 'typename remove_reference<class basic_string<char> &>::type':'class std::__1::basic_string<char>' xvalue
|   |   |-ImplicitCastExpr 0x7f91ac424b60 <col:14, col:19> 'typename remove_reference<class basic_string<char> &>::type &&(*)(class std::__1::basic_string<char> &&) noexcept' <FunctionToPointerDecay>
|   |   | `-DeclRefExpr 0x7f91ac424b20 <col:14, col:19> 'typename remove_reference<class basic_string<char> &>::type &&(class std::__1::basic_string<char> &&) noexcept' lvalue Function 0x7f91ac424030 'move' 'typename remove_reference<class basic_string<char> &>::type &&(class std::__1::basic_string<char> &&) noexcept' (FunctionTemplate 0x7f91ac0423b8 'move')
|   |   `-MemberExpr 0x7f91ac424ab0 <col:24, col:26> 'std::string':'class std::__1::basic_string<char>' lvalue .s1 0x7f91ac422820
|   |     `-DeclRefExpr 0x7f91ac424a88 <col:24> 'struct A' lvalue ParmVar 0x7f91ac4230d0 'm' 'struct A &&'
|   `-ReturnStmt 0x7f91ac437e10 <line:25:9, col:17>
|     `-UnaryOperator 0x7f91ac437df0 <col:16, col:17> 'struct A' lvalue prefix '*'
|       `-CXXThisExpr 0x7f91ac437dd8 <col:17> 'struct A *' this
`-CXXDestructorDecl 0x7f91ac4232c8 <line:28:5, col:18> col:5 ~A 'void (void) noexcept' default

Layout: <CGRecordLayout
  LLVMType:%struct.A = type { %"class.std::__1::basic_string" }
  NonVirtualBaseLLVMType:%struct.A = type { %"class.std::__1::basic_string" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct B
         0 |   struct A (base)
         0 |     class std::__1::basic_string<char> s1
         0 |       class std::__1::__basic_string_common<true> (base) (empty)
         0 |       class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |         struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |               struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |                 std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |                 std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |                 std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |               struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |                 union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |                   unsigned char __size_
         0 |                   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |                 std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |               struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |                 std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |         struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |           class std::__1::allocator<char> (base) (empty)
        24 |   class std::__1::basic_string<char> s2
        24 |     class std::__1::__basic_string_common<true> (base) (empty)
        24 |     class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
        24 |       struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
        24 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
        24 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
        24 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
        24 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
        32 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        40 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
        24 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
        24 |               union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
        24 |                 unsigned char __size_
        24 |                 std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
        25 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
        24 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
        24 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
        24 |       struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
        24 |         class std::__1::allocator<char> (base) (empty)
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class P
         0 |   (P vtable pointer)
         8 |   double _x
        16 |   double _y
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class P3
         0 |   (P3 vtable pointer)
         8 |   double _z
        16 |   class P (virtual base)
        16 |     (P vtable pointer)
        24 |     double _x
        32 |     double _y
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class V
         0 |   (V vtable pointer)
         8 |   class V * _n
        16 |   class P (virtual base)
        16 |     (P vtable pointer)
        24 |     double _x
        32 |     double _y
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class V3
         0 |   class P3 (primary base)
         0 |     (P3 vtable pointer)
         8 |     double _z
        16 |   class V (base)
        16 |     (V vtable pointer)
        24 |     class V * _n
        32 |   double _m
        40 |   class P (virtual base)
        40 |     (P vtable pointer)
        48 |     double _x
        56 |     double _y
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f91ac438588 </Users/tskull/Documents/Programming/Cpp/object_model_refined/5_ctor_dtor_semantics/05_object_copy_semantics.cpp:47:1, line:49:1> line:47:8 referenced struct B definition
|-public 'struct A'
|-CXXRecordDecl 0x7f91ac4386e8 <col:1, col:8> col:8 implicit struct B
|-FieldDecl 0x7f91ac4387d0 <line:48:5, col:17> col:17 referenced s2 'std::string':'class std::__1::basic_string<char>'
|-CXXConstructorDecl 0x7f91ac438868 <line:47:8> col:8 implicit B 'void (struct B &&)' inline default noexcept-unevaluated 0x7f91ac438868
| `-ParmVarDecl 0x7f91ac438990 <col:8> col:8 'struct B &&'
|-CXXMethodDecl 0x7f91ac438a28 <col:8, <invalid sloc>> col:8 implicit operator= 'struct B &(struct B &&)' inline default noexcept-unevaluated 0x7f91ac438a28
| `-ParmVarDecl 0x7f91ac438b40 <col:8> col:8 'struct B &&'
|-CXXDestructorDecl 0x7f91ac438bc8 <col:8> col:8 implicit used ~B 'void (void) noexcept' inline default
| `-CompoundStmt 0x7f91ac43db40 <col:8>
|-CXXConstructorDecl 0x7f91ac43d738 <col:8> col:8 implicit used B 'void (void) noexcept(false)' inline default
| |-CXXCtorInitializer 'struct A'
| | `-CXXConstructExpr 0x7f91ac43da28 <col:8> 'struct A' 'void (void)'
| |-CXXCtorInitializer Field 0x7f91ac4387d0 's2' 'std::string':'class std::__1::basic_string<char>'
| | `-CXXConstructExpr 0x7f91ac43da90 <col:8> 'std::string':'class std::__1::basic_string<char>' 'void (void) noexcept(is_nothrow_default_constructible<allocator_type>::value)'
| `-CompoundStmt 0x7f91ac43daf8 <col:8>
|-CXXConstructorDecl 0x7f91ac43d848 <col:8> col:8 implicit B 'void (const struct B &)' inline default noexcept-unevaluated 0x7f91ac43d848
| `-ParmVarDecl 0x7f91ac43d970 <col:8> col:8 'const struct B &'
`-CXXMethodDecl 0x7f91ac43e220 <col:8> col:8 implicit used operator= 'struct B &(const struct B &) noexcept(false)' inline default
  |-ParmVarDecl 0x7f91ac43e340 <col:8> col:8 used 'const struct B &'
  `-CompoundStmt 0x7f91ac43e8c0 <col:8>
    |-CXXMemberCallExpr 0x7f91ac43e600 <col:8> 'struct A' lvalue
    | |-MemberExpr 0x7f91ac43e5b0 <col:8> '<bound member function type>' .operator= 0x7f91ac423020
    | | `-ImplicitCastExpr 0x7f91ac43e4c8 <col:8> 'struct A' lvalue <UncheckedDerivedToBase (A)>
    | |   `-UnaryOperator 0x7f91ac43e4a8 <col:8> 'struct B' lvalue prefix '*'
    | |     `-CXXThisExpr 0x7f91ac43e490 <col:8> 'struct B *' this
    | `-ImplicitCastExpr 0x7f91ac43e590 <col:8> 'const struct A' lvalue <UncheckedDerivedToBase (A)>
    |   `-DeclRefExpr 0x7f91ac43e568 <col:8> 'const struct B' lvalue ParmVar 0x7f91ac43e340 '' 'const struct B &'
    |-CXXMemberCallExpr 0x7f91ac43e840 <col:8> 'class std::__1::basic_string<char>' lvalue
    | |-MemberExpr 0x7f91ac43e7f0 <col:8> '<bound member function type>' .operator= 0x7f91acb76860
    | | `-MemberExpr 0x7f91ac43e670 <col:8> 'std::string':'class std::__1::basic_string<char>' lvalue ->s2 0x7f91ac4387d0
    | |   `-CXXThisExpr 0x7f91ac43e658 <col:8> 'struct B *' this
    | `-MemberExpr 0x7f91ac43e770 <col:8> 'const std::string':'const class std::__1::basic_string<char>' lvalue .s2 0x7f91ac4387d0
    |   `-DeclRefExpr 0x7f91ac43e748 <col:8> 'const struct B' lvalue ParmVar 0x7f91ac43e340 '' 'const struct B &'
    `-ReturnStmt 0x7f91ac43e8a8 <col:8>
      `-UnaryOperator 0x7f91ac43e888 <col:8> 'struct B' lvalue prefix '*'
        `-CXXThisExpr 0x7f91ac43e870 <col:8> 'struct B *' this

Layout: <CGRecordLayout
  LLVMType:%struct.B = type { %struct.A, %"class.std::__1::basic_string" }
  NonVirtualBaseLLVMType:%struct.B = type { %struct.A, %"class.std::__1::basic_string" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
