
*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__scalar_hash<struct std::__1::_PairT, 2> (empty)
         0 |   struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1509:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<unsigned long, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1000000000, 1>, false, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_mutex_t
         0 |   long __sig
         8 |   char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_cond_t
         0 |   long __sig
         8 |   char [40] __opaque
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1, 1>, true, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::once_flag
         0 |   unsigned long __state_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale::id
         0 |   struct std::__1::once_flag __flag_
         0 |     unsigned long __state_
         8 |   int32_t __id_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__basic_string_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (empty)
         0 |   class std::__1::allocator<char> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<char>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |       class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false>
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<wchar_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (empty)
         0 |   class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> >
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false> (base)
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |           union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<wchar_t>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> > __r_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, 0, false> (base)
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __value_
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |             union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<wchar_t>, 1, true> (base) (empty)
         0 |       class std::__1::allocator<wchar_t> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::money_base::pattern
         0 |   char [4] field
           | [sizeof=4, dsize=4, align=1,
           |  nvsize=4, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<long, long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >
         0 |   std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >::__storage_pointer __seg_
         8 |   std::__1::__bit_const_reference<class std::__1::__bitset<0, 0> >::__storage_type __mask_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__bitset<0, 0> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct A
         0 |   class std::__1::basic_string<char> s1
         0 |     class std::__1::__basic_string_common<true> (base) (empty)
         0 |     class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |       struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |               union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |                 unsigned char __size_
         0 |                 std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |       struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |         class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fe070212da8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:585:90> col:64 class __basic_string_common definition
|-TemplateArgument integral 1
|-VisibilityAttr 0x7fe070212f38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fe070212fe8 prev 0x7fe070212da8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:560:1, col:28> col:28 implicit class __basic_string_common
|-AccessSpecDecl 0x7fe070213080 <line:562:1, col:10> col:1 protected
|-CXXMethodDecl 0x7fe0702130a8 <line:563:22, col:50> col:27 __throw_length_error 'void (void) const'
| `-CXX11NoReturnAttr 0x7fe070213178 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
|-CXXMethodDecl 0x7fe0702131c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:564:22, col:50> col:27 __throw_out_of_range 'void (void) const'
| `-CXX11NoReturnAttr 0x7fe070213268 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
`-CXXDestructorDecl 0x7fe06f34a790 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:585:64> col:64 implicit ~__basic_string_common 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fe06f30b0f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:701:5, line:706:5> line:701:12 struct __long definition
|-CXXRecordDecl 0x7fe06f30b568 prev 0x7fe06f30b0f0 <col:5, col:12> col:12 implicit struct __long
|-FieldDecl 0x7fe06f30b630 <line:703:9, col:19> col:19 __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7fe06f30b688 <line:704:9, col:19> col:19 __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7fe06f30b6e0 <line:705:9, col:19> col:19 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
`-CXXDestructorDecl 0x7fe06f34ab08 <line:701:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fe06f30bfa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9, line:725:9> line:721:9 union definition
|-FieldDecl 0x7fe06f30c128 <line:723:13, col:27> col:27 __size_ 'unsigned char'
|-FieldDecl 0x7fe06f30c180 <line:724:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
`-CXXDestructorDecl 0x7fe06f34af68 <line:721:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon.0 = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fe06f30bac0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:5, line:727:5> line:719:12 struct __short definition
|-CXXRecordDecl 0x7fe06f30bf10 prev 0x7fe06f30bac0 <col:5, col:12> col:12 implicit struct __short
|-CXXRecordDecl 0x7fe06f30bfa8 <line:721:9, line:725:9> line:721:9 union definition
| |-FieldDecl 0x7fe06f30c128 <line:723:13, col:27> col:27 __size_ 'unsigned char'
| |-FieldDecl 0x7fe06f30c180 <line:724:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-CXXDestructorDecl 0x7fe06f34af68 <line:721:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7fe06f30c1e8 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
|-IndirectFieldDecl 0x7fe06f30c240 <line:723:27> col:27 implicit __size_ 'unsigned char'
| |-Field 0x7fe06f30c1e8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| `-Field 0x7fe06f30c128 '__size_' 'unsigned char'
|-IndirectFieldDecl 0x7fe06f30c290 <line:724:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-Field 0x7fe06f30c1e8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| `-Field 0x7fe06f30c180 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FieldDecl 0x7fe06f30c358 <line:726:9, col:37> col:20 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
`-CXXDestructorDecl 0x7fe06f34abe8 <line:719:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fe06f30c758 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:735:5, line:738:5> line:735:12 struct __raw definition
|-CXXRecordDecl 0x7fe06f30d1b0 prev 0x7fe06f30c758 <col:5, col:12> col:12 implicit struct __raw
|-FieldDecl 0x7fe06f30d308 <line:737:9, col:36> col:19 __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
`-CXXDestructorDecl 0x7fe06f34acc8 <line:735:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fe06f30cf08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9, line:747:9> line:742:9 union definition
|-FieldDecl 0x7fe06f30d098 <line:744:13, col:21> col:21 __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-FieldDecl 0x7fe06f30d0f0 <line:745:13, col:21> col:21 __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-FieldDecl 0x7fe06f30d370 <line:746:13, col:21> col:21 __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
`-CXXDestructorDecl 0x7fe06f34ae88 <line:742:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fe06f30c820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:5, line:748:5> line:740:12 struct __rep definition
|-CXXRecordDecl 0x7fe06f30ce70 prev 0x7fe06f30c820 <col:5, col:12> col:12 implicit struct __rep
|-CXXRecordDecl 0x7fe06f30cf08 <line:742:9, line:747:9> line:742:9 union definition
| |-FieldDecl 0x7fe06f30d098 <line:744:13, col:21> col:21 __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-FieldDecl 0x7fe06f30d0f0 <line:745:13, col:21> col:21 __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-FieldDecl 0x7fe06f30d370 <line:746:13, col:21> col:21 __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| `-CXXDestructorDecl 0x7fe06f34ae88 <line:742:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7fe06f30d3d8 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
|-IndirectFieldDecl 0x7fe06f30d430 <line:744:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-Field 0x7fe06f30d3d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| `-Field 0x7fe06f30d098 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-IndirectFieldDecl 0x7fe06f30d480 <line:745:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-Field 0x7fe06f30d3d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| `-Field 0x7fe06f30d0f0 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-IndirectFieldDecl 0x7fe06f30d4d0 <line:746:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-Field 0x7fe06f30d3d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| `-Field 0x7fe06f30d370 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
`-CXXDestructorDecl 0x7fe06f34aa28 <line:740:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fe06f30dc20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2034:1, line:2067:1> line:2037:8 struct __compressed_pair_elem definition
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument integral 0
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7fe06f30dea0 prev 0x7fe06f30dc20 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7fe06f30df48 <line:2038:3, col:15> col:15 _ParamT 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-SubstTemplateTypeParmType 0x7fe06f30cb80 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|   |-TemplateTypeParmType 0x7fe06f89f580 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fe06f89f538 '_Tp'
|   `-RecordType 0x7fe06f30c8c0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|     `-CXXRecord 0x7fe06f30c820 '__rep'
|-TypedefDecl 0x7fe06f30e008 <line:2039:3, col:16> col:16 referenced reference 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
| `-LValueReferenceType 0x7fe06f30dfd0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
|   `-SubstTemplateTypeParmType 0x7fe06f30cb80 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|     |-TemplateTypeParmType 0x7fe06f89f580 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fe06f89f538 '_Tp'
|     `-RecordType 0x7fe06f30c8c0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|       `-CXXRecord 0x7fe06f30c820 '__rep'
|-TypedefDecl 0x7fe06f30e0c8 <line:2040:3, col:22> col:22 referenced const_reference 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
| `-LValueReferenceType 0x7fe06f30e090 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
|   `-QualType 0x7fe06f30cb81 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' const
|     `-SubstTemplateTypeParmType 0x7fe06f30cb80 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|       |-TemplateTypeParmType 0x7fe06f89f580 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fe06f89f538 '_Tp'
|       `-RecordType 0x7fe06f30c8c0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|         `-CXXRecord 0x7fe06f30c820 '__rep'
|-CXXConstructorDecl 0x7fe06f30e160 <line:2043:3, col:52> col:13 constexpr __compressed_pair_elem 'void (void)'
|-FunctionTemplateDecl 0x7fe06f30e948 <line:2045:3, line:2050:44> line:2049:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fe06f30e218 <line:2045:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fe06f30e288 <col:24, line:2047:6> line:2045:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<struct __rep, 0, false>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7fe06f30e8a0 <line:2048:3, line:2050:44> line:2049:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7fe06f30e7b8 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7fe06f30f000 <line:2052:3, line:2056:75> line:2054:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fe06f30ea28 <line:2052:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7fe06f30ea98 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7fe06f30ef20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2056:75> line:2054:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7fe06f30eb10 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fe06f30ec78 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7fe06f30edc8 <line:2055:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7fe06f30f098 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f30f218 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2062:3, col:50> col:13 __get 'std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>::reference (void) noexcept'
|-CXXMethodDecl 0x7fe06f30f368 <line:2063:3, col:62> col:19 __get 'std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>::const_reference (void) const noexcept'
|-AccessSpecDecl 0x7fe06f30f410 <line:2065:1, col:8> col:1 private
|-FieldDecl 0x7fe06f30f448 <line:2066:3, col:7> col:7 __value_ 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
`-CXXDestructorDecl 0x7fe06f34a948 <line:2037:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fe06f1e11d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:101:1, col:52> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28 class allocator definition
|-TemplateArgument type 'char'
|-CXXRecordDecl 0x7fe0702cfff8 prev 0x7fe06f1e11d8 <col:1, col:28> col:28 implicit class allocator
|-AccessSpecDecl 0x7fe0702d0090 <line:1722:1, col:7> col:1 public
|-TypedefDecl 0x7fe0702d00b8 <line:1723:5, col:31> col:31 referenced size_type 'size_t':'unsigned long'
| `-TypedefType 0x7fe06f06a8c0 'size_t' sugar
|   |-Typedef 0x7fe06f069db0 'size_t'
|   `-BuiltinType 0x7fe06f033c80 'unsigned long'
|-TypedefDecl 0x7fe0702d0110 <line:1724:5, col:31> col:31 referenced difference_type 'ptrdiff_t':'long'
| `-TypedefType 0x7fe06f271970 'ptrdiff_t' sugar
|   |-Typedef 0x7fe06f069d40 'ptrdiff_t'
|   `-BuiltinType 0x7fe06f033be0 'long'
|-TypedefDecl 0x7fe0702d01d8 <line:1725:5, col:31> col:31 referenced pointer 'char *'
| `-PointerType 0x7fe0702d01a0 'char *'
|   `-SubstTemplateTypeParmType 0x7fe0702d0170 'char' sugar
|     |-TemplateTypeParmType 0x7fe070151840 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fe0701517f8 '_Tp'
|     `-BuiltinType 0x7fe06f033b60 'char'
|-TypedefDecl 0x7fe0702d0268 <line:1726:5, col:31> col:31 referenced const_pointer 'const char *'
| `-PointerType 0x7fe0702d0230 'const char *'
|   `-QualType 0x7fe0702d0171 'const char' const
|     `-SubstTemplateTypeParmType 0x7fe0702d0170 'char' sugar
|       |-TemplateTypeParmType 0x7fe070151840 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fe0701517f8 '_Tp'
|       `-BuiltinType 0x7fe06f033b60 'char'
|-TypedefDecl 0x7fe0702d02f8 <line:1727:5, col:31> col:31 reference 'char &'
| `-LValueReferenceType 0x7fe0702d02c0 'char &'
|   `-SubstTemplateTypeParmType 0x7fe0702d0170 'char' sugar
|     |-TemplateTypeParmType 0x7fe070151840 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fe0701517f8 '_Tp'
|     `-BuiltinType 0x7fe06f033b60 'char'
|-TypedefDecl 0x7fe0702d0388 <line:1728:5, col:31> col:31 const_reference 'const char &'
| `-LValueReferenceType 0x7fe0702d0350 'const char &'
|   `-QualType 0x7fe0702d0171 'const char' const
|     `-SubstTemplateTypeParmType 0x7fe0702d0170 'char' sugar
|       |-TemplateTypeParmType 0x7fe070151840 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fe0701517f8 '_Tp'
|       `-BuiltinType 0x7fe06f033b60 'char'
|-TypedefDecl 0x7fe0702d03f0 <line:1729:5, col:31> col:31 referenced value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fe0702d0170 'char' sugar
|   |-TemplateTypeParmType 0x7fe070151840 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fe0701517f8 '_Tp'
|   `-BuiltinType 0x7fe06f033b60 'char'
|-TypedefDecl 0x7fe0702d0448 <line:1731:5, col:23> col:23 referenced propagate_on_container_move_assignment 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fe06f80ca10 'std::__1::true_type' sugar
|   |-Typedef 0x7fe06f80a2f0 'true_type'
|   `-TemplateSpecializationType 0x7fe06f80a200 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fe06f80a068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fe06f80a050 <line:528:31> '_Bool' true
|     `-RecordType 0x7fe06f80a1e0 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fe06f80a0d8 'integral_constant'
|-TypedefDecl 0x7fe0702d04a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1732:5, col:23> col:23 referenced is_always_equal 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fe06f80ca10 'std::__1::true_type' sugar
|   |-Typedef 0x7fe06f80a2f0 'true_type'
|   `-TemplateSpecializationType 0x7fe06f80a200 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fe06f80a068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fe06f80a050 <line:528:31> '_Bool' true
|     `-RecordType 0x7fe06f80a1e0 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fe06f80a0d8 'integral_constant'
|-ClassTemplateDecl 0x7fe0702d0618 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1734:5, col:33> col:33 rebind
| |-TemplateTypeParmDecl 0x7fe0702d04f8 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXRecordDecl 0x7fe0702d0580 <col:26, col:33> col:33 struct rebind
|-CXXConstructorDecl 0x7fe0702d0868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1736:54> col:31 referenced allocator 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fe0702d0948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fe0702d0ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:5, col:96> col:52 allocator
| |-TemplateTypeParmDecl 0x7fe0702d0990 <col:15, col:21> col:21 class depth 0 index 0 _Up
| |-CXXConstructorDecl 0x7fe0702d0bf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:96> col:52 allocator 'void (const allocator<_Up> &) noexcept'
| | |-ParmVarDecl 0x7fe0702d0ad0 <col:62, col:82> col:83 'const allocator<_Up> &'
| | `-AlwaysInlineAttr 0x7fe0702d0cf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-CXXConstructorDecl 0x7fe06f34d398 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:96> col:52 allocator 'void (const allocator<char> &) noexcept'
|   |-TemplateArgument type 'char'
|   |-ParmVarDecl 0x7fe06f34d2d0 <col:62, col:82> col:83 'const allocator<char> &'
|   `-AlwaysInlineAttr 0x7fe06f34d4a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe0702d0f28 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1739:39> line:1738:39 address 'std::__1::allocator<char>::pointer (std::__1::allocator<char>::reference) const noexcept'
| |-ParmVarDecl 0x7fe0702d0e20 <col:47, col:57> col:57 __x 'std::__1::allocator<char>::reference':'char &'
| `-AlwaysInlineAttr 0x7fe0702d0fd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe0702d1178 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1741:39> line:1740:45 address 'std::__1::allocator<char>::const_pointer (std::__1::allocator<char>::const_reference) const noexcept'
| |-ParmVarDecl 0x7fe0702d1070 <col:53, col:69> col:69 __x 'std::__1::allocator<char>::const_reference':'const char &'
| `-AlwaysInlineAttr 0x7fe0702d1228 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe0702d13e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1748:9> line:1742:39 allocate 'std::__1::allocator<char>::pointer (std::__1::allocator::size_type, allocator<void>::const_pointer)'
| |-ParmVarDecl 0x7fe0702d1270 <col:48, col:58> col:58 __n 'std::__1::allocator::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe0702d12d0 <col:63, col:96> col:94 'allocator<void>::const_pointer':'const void *'
| `-AlwaysInlineAttr 0x7fe0702d1498 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06fa7fa38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1750:49> line:1749:36 deallocate 'void (std::__1::allocator<char>::pointer, std::__1::allocator::size_type) noexcept'
| |-ParmVarDecl 0x7fe0702d14f0 <col:47, col:55> col:55 __p 'std::__1::allocator<char>::pointer':'char *'
| |-ParmVarDecl 0x7fe0702d1550 <col:60> col:69 'std::__1::allocator::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06fa7faf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06fa7fb38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1752:45> line:1751:41 max_size 'std::__1::allocator::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06fa7fbe0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fe06fa80008 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1754:5, line:1760:9> line:1757:9 construct
| |-TemplateTypeParmDecl 0x7fe06fa7fc28 <line:1754:15, col:21> col:21 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fe06fa7fc98 <col:26, col:35> col:35 class depth 0 index 1 ... _Args
| `-CXXMethodDecl 0x7fe06fa7ff70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1760:9> line:1757:9 construct 'void (_Up *, _Args &&...)'
|   |-ParmVarDecl 0x7fe06fa7fd68 <col:19, col:24> col:24 __p '_Up *'
|   |-ParmVarDecl 0x7fe06fa7fe58 <col:29, col:40> col:40 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7fe06fa80068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06fa80250 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1814:70> col:36 destroy 'void (std::__1::allocator<char>::pointer)'
| |-ParmVarDecl 0x7fe06fa80148 <col:44, col:52> col:52 __p 'std::__1::allocator<char>::pointer':'char *'
| `-AlwaysInlineAttr 0x7fe06fa80300 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fe06f311768 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28> col:28 implicit referenced ~allocator 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fe06f349398 <col:28> col:28 implicit constexpr allocator 'void (const class std::__1::allocator<char> &)' inline default trivial noexcept-unevaluated 0x7fe06f349398
| `-ParmVarDecl 0x7fe06f349480 <col:28> col:28 'const class std::__1::allocator<char> &'
|-CXXConstructorDecl 0x7fe06f349518 <col:28> col:28 implicit referenced constexpr allocator 'void (class std::__1::allocator<char> &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7fe06f349640 <col:28> col:28 'class std::__1::allocator<char> &&'
|-CXXMethodDecl 0x7fe070523da0 <col:28, <invalid sloc>> col:28 implicit operator= 'class std::__1::allocator<char> &(const class std::__1::allocator<char> &)' inline default trivial noexcept-unevaluated 0x7fe070523da0
| `-ParmVarDecl 0x7fe070523ec0 <col:28> col:28 'const class std::__1::allocator<char> &'
`-CXXMethodDecl 0x7fe070523f28 <col:28, <invalid sloc>> col:28 implicit referenced operator= 'class std::__1::allocator<char> &(class std::__1::allocator<char> &&) noexcept' inline default trivial
  `-ParmVarDecl 0x7fe070524040 <col:28> col:28 'class std::__1::allocator<char> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fe06f30fe90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2069:1, line:2099:1> line:2070:8 struct __compressed_pair_elem definition
|-private 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-TemplateArgument integral 1
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7fe06f310228 prev 0x7fe06f30fe90 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7fe06f3102d0 <line:2071:3, col:15> col:15 _ParamT 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7fe06f3100f0 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7fe06f8a1dd0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fe06f8a1d88 '_Tp'
|   `-RecordType 0x7fe06f1e12c0 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7fe06f1e11d8 'allocator'
|-TypedefDecl 0x7fe06f310368 <line:2072:3, col:16> col:16 referenced reference 'class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7fe06f310330 'class std::__1::allocator<char> &'
|   `-SubstTemplateTypeParmType 0x7fe06f3100f0 'class std::__1::allocator<char>' sugar
|     |-TemplateTypeParmType 0x7fe06f8a1dd0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fe06f8a1d88 '_Tp'
|     `-RecordType 0x7fe06f1e12c0 'class std::__1::allocator<char>'
|       `-ClassTemplateSpecialization 0x7fe06f1e11d8 'allocator'
|-TypedefDecl 0x7fe06f3103f8 <line:2073:3, col:22> col:22 referenced const_reference 'const class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7fe06f3103c0 'const class std::__1::allocator<char> &'
|   `-QualType 0x7fe06f3100f1 'const class std::__1::allocator<char>' const
|     `-SubstTemplateTypeParmType 0x7fe06f3100f0 'class std::__1::allocator<char>' sugar
|       |-TemplateTypeParmType 0x7fe06f8a1dd0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fe06f8a1d88 '_Tp'
|       `-RecordType 0x7fe06f1e12c0 'class std::__1::allocator<char>'
|         `-ClassTemplateSpecialization 0x7fe06f1e11d8 'allocator'
|-TypedefDecl 0x7fe06f310460 <line:2074:3, col:15> col:15 __value_type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7fe06f3100f0 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7fe06f8a1dd0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fe06f8a1d88 '_Tp'
|   `-RecordType 0x7fe06f1e12c0 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7fe06f1e11d8 'allocator'
|-CXXConstructorDecl 0x7fe06f3104f8 <line:2077:3, col:46> col:13 __compressed_pair_elem 'void (void)' default noexcept-unevaluated 0x7fe06f3104f8
|-FunctionTemplateDecl 0x7fe06f310cd8 <line:2079:3, line:2084:48> line:2083:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fe06f3105b0 <line:2079:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fe06f310618 <col:24, line:2081:6> line:2079:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<class allocator<char>, 1, true>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7fe06f310c30 <line:2082:3, line:2084:48> line:2083:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7fe06f310b48 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7fe06f311308 <line:2086:3, line:2090:79> line:2088:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fe06f310db8 <line:2086:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7fe06f310e28 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7fe06f311260 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2090:79> line:2088:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7fe06f310ea0 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fe06f311008 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7fe06f311158 <line:2089:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7fe06f311398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f311518 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2097:3, col:47> col:13 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>::reference (void) noexcept'
|-CXXMethodDecl 0x7fe06f311668 <line:2098:3, col:59> col:19 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>::const_reference (void) const noexcept'
`-CXXDestructorDecl 0x7fe06f34ada8 <line:2070:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem.1" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem.1" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fe06f30c910 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2104:1, line:2201:1> line:2105:7 class __compressed_pair definition
|-private '__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0>':'struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>'
|-private '__compressed_pair_elem<class std::__1::allocator<char>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>'
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-CXXRecordDecl 0x7fe06f311890 prev 0x7fe06f30c910 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7fe06f311c38 <line:2107:3, col:42> col:42 _Base1 '__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0>':'struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>'
| `-TemplateSpecializationType 0x7fe06f311b90 '__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fe06f8a4e08 <col:39> 'int' 0
|   `-RecordType 0x7fe06f30dd40 'struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>'
|     `-ClassTemplateSpecialization 0x7fe06f30dc20 '__compressed_pair_elem'
|-TypedefDecl 0x7fe06f311f98 <line:2108:3, col:42> col:42 _Base2 '__compressed_pair_elem<class std::__1::allocator<char>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>'
| `-TemplateSpecializationType 0x7fe06f311ef0 '__compressed_pair_elem<class std::__1::allocator<char>, 1>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fe06f8a51b8 <col:39> 'int' 1
|   `-RecordType 0x7fe06f30ffb0 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>'
|     `-ClassTemplateSpecialization 0x7fe06f30fe90 '__compressed_pair_elem'
|-StaticAssertDecl 0x7fe06f312418 <line:2114:3, line:2117:44> line:2114:3
| |-ParenExpr 0x7fe06f3123f8 <col:17, col:43> '_Bool'
| | `-UnaryOperator 0x7fe06f3123d8 <col:18, col:38> '_Bool' prefix '!'
| |   `-ImplicitCastExpr 0x7fe06f3123c0 <col:19, col:38> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7fe06f312388 <col:19, col:38> 'const _Bool':'const _Bool' lvalue Var 0x7fe07015a3b8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fe06f8a56e8 <line:2115:5, line:2117:5> 'const char [179]' lvalue "__compressed_pair cannot be instantated when T1 and T2 are the same type; The current implementation is NOT ABI-compatible with the previous implementation for this configuration"
|-AccessSpecDecl 0x7fe06f312450 <line:2119:1, col:7> col:1 public
|-FunctionTemplateDecl 0x7fe06f312e98 <line:2121:3, line:2128:34> col:13 __compressed_pair
| |-NonTypeTemplateParmDecl 0x7fe06f312478 <line:2121:13, col:27> col:18 referenced '_Bool' depth 0 index 0 _Dummy
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fe06f8a5830 <col:27> '_Bool' true
| |-TemplateTypeParmDecl 0x7fe06f3124d0 <line:2122:7, line:2125:10> line:2122:7 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<__dependent_type<is_default_constructible<struct __rep>, _Dummy>::value && __dependent_type<is_default_constructible<class allocator<char> >, _Dummy>::value>::type'
| `-CXXConstructorDecl 0x7fe06f312df0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2128:34> col:13 constexpr __compressed_pair 'void (void)'
|   `-AlwaysInlineAttr 0x7fe06f312f18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fe06f313738 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2130:3, line:2135:51> line:2134:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fe06f312fe8 <line:2130:13, col:19> col:19 class depth 0 index 0 _Tp
| |-NonTypeTemplateParmDecl 0x7fe06f3134f0 <col:24, line:2132:57> col:55 'typename enable_if<!is_same<typename decay<_Tp>::type, class __compressed_pair<struct __rep, class allocator<char> > >::value, _Bool>::type' depth 0 index 1
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fe06f8a6750 <col:57> '_Bool' true
| `-CXXConstructorDecl 0x7fe06f313690 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2135:51> line:2134:3 constexpr __compressed_pair 'void (_Tp &&)'
|   |-ParmVarDecl 0x7fe06f3135a8 <col:21, col:27> col:27 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fe06f313790 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fe06f313b58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2137:3, line:2140:51> line:2139:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fe06f313860 <line:2137:13, col:19> col:19 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7fe06f313ab0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2140:51> line:2139:3 constexpr __compressed_pair 'void (struct std::__1::__second_tag, _Tp &&)'
|   |-ParmVarDecl 0x7fe06f3138e0 <col:21> col:33 'struct std::__1::__second_tag'
|   |-ParmVarDecl 0x7fe06f313978 <col:35, col:41> col:41 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fe06f313bb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fe06f314048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2142:3, line:2145:75> line:2144:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fe06f313c88 <line:2142:13, col:19> col:19 class depth 0 index 0 _U1
| |-TemplateTypeParmDecl 0x7fe06f313cf8 <col:24, col:30> col:30 class depth 0 index 1 _U2
| `-CXXConstructorDecl 0x7fe06f313fa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 constexpr __compressed_pair 'void (_U1 &&, _U2 &&)'
|   |-ParmVarDecl 0x7fe06f313dc8 <col:21, col:27> col:27 __t1 '_U1 &&'
|   |-ParmVarDecl 0x7fe06f313e68 <col:33, col:39> col:39 __t2 '_U2 &&'
|   `-AlwaysInlineAttr 0x7fe06f3140a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fe06f314758 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2147:3, line:2154:75> line:2149:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fe06f314178 <line:2147:13, col:22> col:22 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7fe06f3141e8 <col:30, col:39> col:39 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7fe06f3146b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2154:75> line:2149:3 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7fe06f314278 <col:21, col:43> col:43 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fe06f3143e8 <col:49, col:66> col:66 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7fe06f314558 <line:2150:21, col:38> col:38 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7fe06f3147c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f314988 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2175:3> line:2173:30 first 'typename _Base1::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7fe06f314a30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f314b38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2180:3> line:2178:36 first 'typename _Base1::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f314be0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f314d28 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2185:3> line:2183:30 second 'typename _Base2::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7fe06f314dd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f314ed8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2190:3> line:2188:36 second 'typename _Base2::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f314f80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f315120 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2200:3> line:2193:8 swap 'void (class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &)' noexcept-uninstantiated 0x7fe06f8a8858
| |-ParmVarDecl 0x7fe06f315008 <col:13, col:32> col:32 __x 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &'
| `-AlwaysInlineAttr 0x7fe06f315218 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
`-CXXDestructorDecl 0x7fe06f34a868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2105:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fe06f24fa58 parent 0x7fe06f1da378 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:4040:81> col:64 class basic_string definition
|-private '__basic_string_common<true>':'class std::__1::__basic_string_common<true>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-VisibilityAttr 0x7fe07033fbf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fe0702cf6f8 prev 0x7fe06f24fa58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:635:1, col:28> col:28 implicit class basic_string
|-AccessSpecDecl 0x7fe0702cf790 <line:638:1, col:7> col:1 public
|-TypedefDecl 0x7fe0702cf7c8 <line:639:5, col:58> col:58 __self 'class std::__1::basic_string<char>'
| `-RecordType 0x7fe06f24fb70 'class std::__1::basic_string<char>'
|   `-ClassTemplateSpecialization 0x7fe06f24fa58 'basic_string'
|-TypedefDecl 0x7fe0702cf948 <line:640:5, col:58> col:58 __self_view 'basic_string_view<char, struct std::__1::char_traits<char> >':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-TemplateSpecializationType 0x7fe0702cf8a0 'basic_string_view<char, struct std::__1::char_traits<char> >' sugar basic_string_view
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7fe06f2fd590 'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
|     `-ClassTemplateSpecialization 0x7fe06f2fd488 'basic_string_view'
|-TypedefDecl 0x7fe0702cf9b0 <line:641:5, col:58> col:58 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fe0702cf860 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fe070215eb0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fe070215e68 '_Traits'
|   `-RecordType 0x7fe06f1dfe90 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fe0701ace78 'char_traits'
|-TypedefDecl 0x7fe0702cfa18 <line:642:5, col:58> col:58 referenced value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fe0702cf820 'char' sugar
|   |-TemplateTypeParmType 0x7fe070215e40 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fe070215e00 '_CharT'
|   `-BuiltinType 0x7fe06f033b60 'char'
|-TypedefDecl 0x7fe0702cfaa8 <line:643:5, col:58> col:58 allocator_type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7fe0702cfa70 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7fe070215f20 '_Allocator' dependent depth 0 index 2
|   | `-TemplateTypeParm 0x7fe070215ed8 '_Allocator'
|   `-RecordType 0x7fe06f1e12c0 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7fe06f1e11d8 'allocator'
|-TypedefDecl 0x7fe0702cfcb8 <line:644:5, col:58> col:58 __alloc_traits 'allocator_traits<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>':'struct std::__1::allocator_traits<class std::__1::allocator<char> >'
| `-TemplateSpecializationType 0x7fe0702cfc40 'allocator_traits<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type':'class std::__1::allocator<char>'
|   `-RecordType 0x7fe0702cfc20 'struct std::__1::allocator_traits<class std::__1::allocator<char> >'
|     `-ClassTemplateSpecialization 0x7fe0702cfb30 'allocator_traits'
|-TypedefDecl 0x7fe06f309e30 <line:645:5, col:58> col:58 size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7fe06f309de0 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7fe06f302cf0 'std::__1::allocator_traits<class std::__1::allocator<char> >::size_type' sugar
|     |-Typedef 0x7fe06f2ff370 'size_type'
|     `-ElaboratedType 0x7fe06f2ff320 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7fe06f2ff300 'std::__1::__size_type<class std::__1::allocator<char>, long, true>::type' sugar
|         |-Typedef 0x7fe06f2ff280 'type'
|         `-ElaboratedType 0x7fe06f2ff230 'typename class allocator<char>::size_type' sugar
|           `-TypedefType 0x7fe06fa87230 'std::__1::allocator<char>::size_type' sugar
|             |-Typedef 0x7fe0702d00b8 'size_type'
|             `-TypedefType 0x7fe06f06a8c0 'size_t' sugar
|               |-Typedef 0x7fe06f069db0 'size_t'
|               `-BuiltinType 0x7fe06f033c80 'unsigned long'
|-TypedefDecl 0x7fe06f309f00 <line:646:5, col:58> col:58 difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7fe06f309eb0 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7fe06fa86f50 'std::__1::allocator_traits<class std::__1::allocator<char> >::difference_type' sugar
|     |-Typedef 0x7fe06fa86ee0 'difference_type'
|     `-ElaboratedType 0x7fe06fa86e90 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7fe06fa86e70 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<char>, char *, true>::type' sugar
|         |-Typedef 0x7fe06fa86df0 'type'
|         `-ElaboratedType 0x7fe06fa86da0 'typename class allocator<char>::difference_type' sugar
|           `-TypedefType 0x7fe06fa863a0 'std::__1::allocator<char>::difference_type' sugar
|             |-Typedef 0x7fe0702d0110 'difference_type'
|             `-TypedefType 0x7fe06f271970 'ptrdiff_t' sugar
|               |-Typedef 0x7fe06f069d40 'ptrdiff_t'
|               `-BuiltinType 0x7fe06f033be0 'long'
|-TypedefDecl 0x7fe06f309fb8 <line:647:5, col:58> col:58 reference 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
| `-LValueReferenceType 0x7fe06f309f80 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
|   `-TypedefType 0x7fe06f309f60 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' sugar
|     |-Typedef 0x7fe0702cfa18 'value_type'
|     `-SubstTemplateTypeParmType 0x7fe0702cf820 'char' sugar
|       |-TemplateTypeParmType 0x7fe070215e40 '_CharT' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fe070215e00 '_CharT'
|       `-BuiltinType 0x7fe06f033b60 'char'
|-TypedefDecl 0x7fe06f30a048 <line:648:5, col:58> col:58 const_reference 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
| `-LValueReferenceType 0x7fe06f30a010 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
|   `-QualType 0x7fe06f309f61 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' const
|     `-TypedefType 0x7fe06f309f60 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' sugar
|       |-Typedef 0x7fe0702cfa18 'value_type'
|       `-SubstTemplateTypeParmType 0x7fe0702cf820 'char' sugar
|         |-TemplateTypeParmType 0x7fe070215e40 '_CharT' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7fe070215e00 '_CharT'
|         `-BuiltinType 0x7fe06f033b60 'char'
|-TypedefDecl 0x7fe06f30a110 <line:649:5, col:58> col:58 pointer 'typename __alloc_traits::pointer':'char *'
| `-ElaboratedType 0x7fe06f30a0c0 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7fe06fa81a80 'std::__1::allocator_traits<class std::__1::allocator<char> >::pointer' sugar
|     |-Typedef 0x7fe06fa81a10 'pointer'
|     `-ElaboratedType 0x7fe06fa819c0 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7fe06fa819a0 'std::__1::__pointer_type<char, class std::__1::allocator<char> >::type' sugar
|         |-Typedef 0x7fe06fa81920 'type'
|         `-ElaboratedType 0x7fe06fa818d0 'typename __pointer_type_imp::__pointer_type<char, typename remove_reference<class allocator<char> >::type>::type' sugar
|           `-TypedefType 0x7fe06fa818b0 'std::__1::__pointer_type_imp::__pointer_type<char, class std::__1::allocator<char>, true>::type' sugar
|             |-Typedef 0x7fe06fa81830 'type'
|             `-ElaboratedType 0x7fe06fa817e0 'typename class allocator<char>::pointer' sugar
|               `-TypedefType 0x7fe0702d0dd0 'std::__1::allocator<char>::pointer' sugar
|                 |-Typedef 0x7fe0702d01d8 'pointer'
|                 `-PointerType 0x7fe0702d01a0 'char *'
|                   `-SubstTemplateTypeParmType 0x7fe0702d0170 'char' sugar
|                     |-TemplateTypeParmType 0x7fe070151840 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fe0701517f8 '_Tp'
|                     `-BuiltinType 0x7fe06f033b60 'char'
|-TypedefDecl 0x7fe06f30a200 <line:650:5, col:58> col:58 const_pointer 'typename __alloc_traits::const_pointer':'const char *'
| `-ElaboratedType 0x7fe06f30a1b0 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7fe06f30a190 'std::__1::allocator_traits<class std::__1::allocator<char> >::const_pointer' sugar
|     |-Typedef 0x7fe06fa82810 'const_pointer'
|     `-ElaboratedType 0x7fe06fa827c0 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7fe06fa827a0 'std::__1::__const_pointer<char, char *, class std::__1::allocator<char>, true>::type' sugar
|         |-Typedef 0x7fe06fa82720 'type'
|         `-ElaboratedType 0x7fe06fa826d0 'typename class allocator<char>::const_pointer' sugar
|           `-TypedefType 0x7fe0702d1020 'std::__1::allocator<char>::const_pointer' sugar
|             |-Typedef 0x7fe0702d0268 'const_pointer'
|             `-PointerType 0x7fe0702d0230 'const char *'
|               `-QualType 0x7fe0702d0171 'const char' const
|                 `-SubstTemplateTypeParmType 0x7fe0702d0170 'char' sugar
|                   |-TemplateTypeParmType 0x7fe070151840 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7fe0701517f8 '_Tp'
|                   `-BuiltinType 0x7fe06f033b60 'char'
|-StaticAssertDecl 0x7fe06f30a360 <line:652:5, col:92> col:5
| |-DeclRefExpr 0x7fe06f30a310 <col:19, col:39> 'const _Bool':'const _Bool' lvalue Var 0x7fe070159a68 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fe070216eb8 <col:46> 'const char [45]' lvalue "Character type of basic_string must be a POD"
|-StaticAssertDecl 0x7fe06f30a5a0 <line:653:5, line:654:74> line:653:5
| |-ParenExpr 0x7fe06f30a568 <col:19, col:75> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7fe06f30a530 <col:20, col:70> 'const _Bool':'const _Bool' lvalue Var 0x7fe070159a68 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fe070217180 <line:654:19> 'const char [54]' lvalue "traits_type::char_type must be the same type as CharT"
|-StaticAssertDecl 0x7fe06f30a7b0 <line:655:5, line:656:74> line:655:5
| |-ParenExpr 0x7fe06f30a778 <col:19, col:83> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7fe06f30a740 <col:20, col:78> 'const _Bool':'const _Bool' lvalue Var 0x7fe070159a68 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fe0702174c0 <line:656:19> 'const char [54]' lvalue "Allocator::value_type must be same type as value_type"
|-TypedefDecl 0x7fe06f30a9a8 <line:661:5, col:58> col:58 iterator '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer>':'class std::__1::__wrap_iter<char *>'
| `-TemplateSpecializationType 0x7fe06f30a930 '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
|   `-RecordType 0x7fe06f30a910 'class std::__1::__wrap_iter<char *>'
|     `-ClassTemplateSpecialization 0x7fe06f30a820 '__wrap_iter'
|-TypedefDecl 0x7fe06f30abb8 <line:662:5, col:58> col:58 const_iterator '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer>':'class std::__1::__wrap_iter<const char *>'
| `-TemplateSpecializationType 0x7fe06f30ab40 '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer':'const char *'
|   `-RecordType 0x7fe06f30ab20 'class std::__1::__wrap_iter<const char *>'
|     `-ClassTemplateSpecialization 0x7fe06f30aa30 '__wrap_iter'
|-TypedefDecl 0x7fe06f30ae10 <line:664:5, col:59> col:59 reverse_iterator 'std::__1::reverse_iterator<iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<char *> >'
| `-ElaboratedType 0x7fe06f30ada0 'std::__1::reverse_iterator<iterator>' sugar
|   `-TemplateSpecializationType 0x7fe06f30ad50 'reverse_iterator<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator':'class std::__1::__wrap_iter<char *>'
|     `-RecordType 0x7fe06f30ad30 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<char *> >'
|       `-ClassTemplateSpecialization 0x7fe06f30ac40 'reverse_iterator'
|-TypedefDecl 0x7fe06f30b070 <line:665:5, col:59> col:59 const_reverse_iterator 'std::__1::reverse_iterator<const_iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const char *> >'
| `-ElaboratedType 0x7fe06f30b000 'std::__1::reverse_iterator<const_iterator>' sugar
|   `-TemplateSpecializationType 0x7fe06f30afb0 'reverse_iterator<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|     `-RecordType 0x7fe06f30af90 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const char *> >'
|       `-ClassTemplateSpecialization 0x7fe06f30aea0 'reverse_iterator'
|-AccessSpecDecl 0x7fe06f30b0c8 <line:667:1, col:8> col:1 private
|-CXXRecordDecl 0x7fe06f30b0f0 <line:701:5, line:706:5> line:701:12 struct __long definition
| |-CXXRecordDecl 0x7fe06f30b568 prev 0x7fe06f30b0f0 <col:5, col:12> col:12 implicit struct __long
| |-FieldDecl 0x7fe06f30b630 <line:703:9, col:19> col:19 __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-FieldDecl 0x7fe06f30b688 <line:704:9, col:19> col:19 __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-FieldDecl 0x7fe06f30b6e0 <line:705:9, col:19> col:19 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
| `-CXXDestructorDecl 0x7fe06f34ab08 <line:701:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial
|-EnumDecl 0x7fe06f30b1c0 <line:712:5> col:5
| `-EnumConstantDecl 0x7fe06f30b290 <col:11, col:26> col:11 __short_mask 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:712:5)'
|   `-ImplicitCastExpr 0x7fe06f30b2d8 <col:26> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7fe070218080 <col:26> 'int' 1
|-EnumDecl 0x7fe06f30b2f0 <line:713:5> col:5
| `-EnumConstantDecl 0x7fe06f30b3c0 <col:11, col:26> col:11 __long_mask 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:713:5)'
|   `-ImplicitCastExpr 0x7fe06f30b408 <col:26> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7fe0702181a0 <col:26> 'unsigned long' 1
|-EnumDecl 0x7fe06f30b420 <line:716:5> col:5
| `-EnumConstantDecl 0x7fe06f30ba60 <col:11, line:717:65> line:716:11 referenced __min_cap 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:716:5)'
|   `-ImplicitCastExpr 0x7fe06f30baa8 <col:23, line:717:65> 'unsigned int' <IntegralCast>
|     `-ConditionalOperator 0x7fe06f30b960 <line:716:23, line:717:65> 'unsigned long'
|       |-BinaryOperator 0x7fe06f30b838 <line:716:23, col:65> '_Bool' '>'
|       | |-BinaryOperator 0x7fe06f30b7f8 <col:23, col:61> 'unsigned long' '/'
|       | | |-ParenExpr 0x7fe06f30b7a8 <col:23, col:42> 'unsigned long'
|       | | | `-BinaryOperator 0x7fe06f30b780 <col:24, col:41> 'unsigned long' '-'
|       | | |   |-UnaryExprOrTypeTraitExpr 0x7fe06f30b748 <col:24, col:37> 'unsigned long' sizeof 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|       | | |   `-ImplicitCastExpr 0x7fe06f30b768 <col:41> 'unsigned long' <IntegralCast>
|       | | |     `-IntegerLiteral 0x7fe0702182f0 <col:41> 'int' 1
|       | | `-UnaryExprOrTypeTraitExpr 0x7fe06f30b7d8 <col:44, col:61> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|       | `-ImplicitCastExpr 0x7fe06f30b820 <col:65> 'unsigned long' <IntegralCast>
|       |   `-IntegerLiteral 0x7fe0702183c8 <col:65> 'int' 2
|       |-BinaryOperator 0x7fe06f30b920 <line:717:23, col:61> 'unsigned long' '/'
|       | |-ParenExpr 0x7fe06f30b8d0 <col:23, col:42> 'unsigned long'
|       | | `-BinaryOperator 0x7fe06f30b8a8 <col:24, col:41> 'unsigned long' '-'
|       | |   |-UnaryExprOrTypeTraitExpr 0x7fe06f30b870 <col:24, col:37> 'unsigned long' sizeof 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|       | |   `-ImplicitCastExpr 0x7fe06f30b890 <col:41> 'unsigned long' <IntegralCast>
|       | |     `-IntegerLiteral 0x7fe070218458 <col:41> 'int' 1
|       | `-UnaryExprOrTypeTraitExpr 0x7fe06f30b900 <col:44, col:61> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|       `-ImplicitCastExpr 0x7fe06f30b948 <col:65> 'unsigned long' <IntegralCast>
|         `-IntegerLiteral 0x7fe070218530 <col:65> 'int' 2
|-CXXRecordDecl 0x7fe06f30bac0 <line:719:5, line:727:5> line:719:12 struct __short definition
| |-CXXRecordDecl 0x7fe06f30bf10 prev 0x7fe06f30bac0 <col:5, col:12> col:12 implicit struct __short
| |-CXXRecordDecl 0x7fe06f30bfa8 <line:721:9, line:725:9> line:721:9 union definition
| | |-FieldDecl 0x7fe06f30c128 <line:723:13, col:27> col:27 __size_ 'unsigned char'
| | |-FieldDecl 0x7fe06f30c180 <line:724:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| | `-CXXDestructorDecl 0x7fe06f34af68 <line:721:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-FieldDecl 0x7fe06f30c1e8 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| |-IndirectFieldDecl 0x7fe06f30c240 <line:723:27> col:27 implicit __size_ 'unsigned char'
| | |-Field 0x7fe06f30c1e8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| | `-Field 0x7fe06f30c128 '__size_' 'unsigned char'
| |-IndirectFieldDecl 0x7fe06f30c290 <line:724:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| | |-Field 0x7fe06f30c1e8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| | `-Field 0x7fe06f30c180 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-FieldDecl 0x7fe06f30c358 <line:726:9, col:37> col:20 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
| `-CXXDestructorDecl 0x7fe06f34abe8 <line:719:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial
|-CXXRecordDecl 0x7fe06f30bb90 <line:731:5, col:44> col:11 union __ulx definition
| |-CXXRecordDecl 0x7fe06f30bda8 prev 0x7fe06f30bb90 <col:5, col:11> col:11 implicit union __ulx
| |-FieldDecl 0x7fe06f30be50 <col:17, col:24> col:24 __lx 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| `-FieldDecl 0x7fe06f30c3c0 <col:30, col:38> col:38 __lxx 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-EnumDecl 0x7fe06f30bc60 <line:733:5> col:5
| `-EnumConstantDecl 0x7fe06f30c6f8 <col:11, col:55> col:11 referenced __n_words 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:733:5)'
|   `-ImplicitCastExpr 0x7fe06f30c740 <col:23, col:55> 'unsigned int' <IntegralCast>
|     `-BinaryOperator 0x7fe06f30c478 <col:23, col:55> 'unsigned long' '/'
|       |-UnaryExprOrTypeTraitExpr 0x7fe06f30c428 <col:23, col:35> 'unsigned long' sizeof 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx'
|       `-UnaryExprOrTypeTraitExpr 0x7fe06f30c458 <col:39, col:55> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXRecordDecl 0x7fe06f30c758 <line:735:5, line:738:5> line:735:12 struct __raw definition
| |-CXXRecordDecl 0x7fe06f30d1b0 prev 0x7fe06f30c758 <col:5, col:12> col:12 implicit struct __raw
| |-FieldDecl 0x7fe06f30d308 <line:737:9, col:36> col:19 __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
| `-CXXDestructorDecl 0x7fe06f34acc8 <line:735:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial
|-CXXRecordDecl 0x7fe06f30c820 <line:740:5, line:748:5> line:740:12 struct __rep definition
| |-CXXRecordDecl 0x7fe06f30ce70 prev 0x7fe06f30c820 <col:5, col:12> col:12 implicit struct __rep
| |-CXXRecordDecl 0x7fe06f30cf08 <line:742:9, line:747:9> line:742:9 union definition
| | |-FieldDecl 0x7fe06f30d098 <line:744:13, col:21> col:21 __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| | |-FieldDecl 0x7fe06f30d0f0 <line:745:13, col:21> col:21 __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| | |-FieldDecl 0x7fe06f30d370 <line:746:13, col:21> col:21 __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| | `-CXXDestructorDecl 0x7fe06f34ae88 <line:742:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-FieldDecl 0x7fe06f30d3d8 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| |-IndirectFieldDecl 0x7fe06f30d430 <line:744:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| | |-Field 0x7fe06f30d3d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| | `-Field 0x7fe06f30d098 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-IndirectFieldDecl 0x7fe06f30d480 <line:745:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| | |-Field 0x7fe06f30d3d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| | `-Field 0x7fe06f30d0f0 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-IndirectFieldDecl 0x7fe06f30d4d0 <line:746:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| | |-Field 0x7fe06f30d3d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| | `-Field 0x7fe06f30d370 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| `-CXXDestructorDecl 0x7fe06f34aa28 <line:740:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7fe06f315280 <line:750:5, col:46> col:46 __r_ '__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>':'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >'
|-AccessSpecDecl 0x7fe06f3152c8 <line:752:1, col:7> col:1 public
|-VarDecl 0x7fe06f315300 <line:753:5, col:36> col:28 npos 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'const unsigned long' static cinit
| `-ImplicitCastExpr 0x7fe06f315370 <col:35, col:36> 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'const unsigned long' <IntegralCast>
|   `-UnaryOperator 0x7fe070221b70 <col:35, col:36> 'int' prefix '-'
|     `-IntegerLiteral 0x7fe070221b50 <col:36> 'int' 1
|-CXXConstructorDecl 0x7fe06f315448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:755:31 referenced basic_string 'void (void) noexcept(is_nothrow_default_constructible<allocator_type>::value)'
| `-AlwaysInlineAttr 0x7fe06f315568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fe06f315720 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:758:40 basic_string 'void (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)' noexcept-uninstantiated 0x7fe070221ea8
| |-ParmVarDecl 0x7fe06f3155e8 <col:53, col:75> col:75 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fe06f315828 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fe06f315928 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:765:5, col:43> col:5 used basic_string 'void (const class std::__1::basic_string<char> &)'
| `-ParmVarDecl 0x7fe06f315880 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
|-CXXConstructorDecl 0x7fe06f315ba0 <line:766:5, col:70> col:5 basic_string 'void (const class std::__1::basic_string<char> &, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)'
| |-ParmVarDecl 0x7fe06f3159f8 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
| `-ParmVarDecl 0x7fe06f315a68 <col:45, col:67> col:67 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
|-CXXConstructorDecl 0x7fe06f315de0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:770:5 used basic_string 'void (class std::__1::basic_string<char> &&) noexcept(is_nothrow_move_constructible<allocator_type>::value)'
| |-ParmVarDecl 0x7fe06f315ca8 <col:18, col:33> col:33 __str 'class std::__1::basic_string<char> &&'
| `-AlwaysInlineAttr 0x7fe06f315ee8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fe06f3160e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:778:65> col:5 basic_string 'void (class std::__1::basic_string<char> &&, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)'
| |-ParmVarDecl 0x7fe06f315f40 <col:18, col:33> col:33 __str 'class std::__1::basic_string<char> &&'
| |-ParmVarDecl 0x7fe06f315fb0 <col:40, col:62> col:62 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fe06f3161a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fe06f316310 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:780:61> col:31 used basic_string 'void (const char *)'
| |-ParmVarDecl 0x7fe06f316228 <col:44, col:58> col:58 __s 'const char *'
| `-AlwaysInlineAttr 0x7fe06f3163d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fe06f316600 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:782:58> col:5 basic_string 'void (const char *, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fe06f316428 <col:18, col:32> col:32 __s 'const char *'
| |-ParmVarDecl 0x7fe06f3164c8 <col:37, col:55> col:55 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fe06f3166c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fe06f316880 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:784:50> col:5 used basic_string 'void (const char *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fe06f316720 <col:18, col:32> col:32 __s 'const char *'
| |-ParmVarDecl 0x7fe06f316790 <col:37, col:47> col:47 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f316948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fe06f316bd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:786:73> col:5 basic_string 'void (const char *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fe06f3169a0 <col:18, col:32> col:32 __s 'const char *'
| |-ParmVarDecl 0x7fe06f316a10 <col:37, col:47> col:47 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f316a80 <col:52, col:70> col:70 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fe06f316ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fe06f316ea0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:788:43> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, char)'
| |-ParmVarDecl 0x7fe06f316cf8 <col:18, col:28> col:28 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f316d68 <col:33, col:40> col:40 __c 'char':'char'
| `-AlwaysInlineAttr 0x7fe06f316f68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fe06f31f430 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:790:66> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, char, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fe06f31f200 <col:18, col:28> col:28 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f31f270 <col:33, col:40> col:40 __c 'char':'char'
| |-ParmVarDecl 0x7fe06f31f2e0 <col:45, col:63> col:63 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fe06f31f500 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fe06f31f810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:791:5, line:792:54> line:791:5 basic_string 'void (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fe06f31f558 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f31f5c8 <col:45, col:55> col:55 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f31f638 <col:62, col:72> col:72 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f31f6a8 <line:792:18, col:53> col:36 __a 'const class std::__1::allocator<char> &'
|-CXXConstructorDecl 0x7fe06f31fb30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:795:54> line:794:5 basic_string 'void (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fe06f31f8f8 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f31f968 <col:45, col:55> col:55 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f31f9d8 <line:795:18, col:53> col:36 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fe06f31fc00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fe06f320528 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:796:5, line:800:121> line:798:9 basic_string
| |-TemplateTypeParmDecl 0x7fe06f31fc48 <line:796:14, col:20> col:20 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7fe06f320480 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:800:121> line:798:9 basic_string 'void (const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &, typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, void>::type *)' inline
|   |-ParmVarDecl 0x7fe06f31fd08 <col:22, col:33> col:33 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fe06f31fd78 <col:38, col:48> col:48 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fe06f31fde8 <col:55, col:65> col:65 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fe06f31fe58 <line:799:22, col:65> col:44 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
|   `-ParmVarDecl 0x7fe06f320300 <line:800:22, col:120> col:118 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, void>::type *'
|-CXXConstructorDecl 0x7fe06f320780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:802:34> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fe06f320660 <col:18, col:30> col:30 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fe06f320840 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fe06f320a40 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:804:57> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fe06f320898 <col:18, col:30> col:30 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fe06f320908 <col:36, col:54> col:54 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fe06f320b08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fe06f320de8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:805:5, line:807:67> col:9 basic_string
| |-TemplateTypeParmDecl 0x7fe06f320b50 <line:805:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7fe06f320d40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:807:67> col:9 basic_string 'void (_InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x7fe06f320be0 <col:22, col:37> col:37 __first '_InputIterator'
|   |-ParmVarDecl 0x7fe06f320c50 <col:46, col:61> col:61 __last '_InputIterator'
|   `-AlwaysInlineAttr 0x7fe06f320e48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fe06f321288 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:808:5, line:810:94> col:9 basic_string
| |-TemplateTypeParmDecl 0x7fe06f320f18 <line:808:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7fe06f3211e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:810:94> col:9 basic_string 'void (_InputIterator, _InputIterator, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)'
|   |-ParmVarDecl 0x7fe06f320fb0 <col:22, col:37> col:37 __first '_InputIterator'
|   |-ParmVarDecl 0x7fe06f321020 <col:46, col:61> col:61 __last '_InputIterator'
|   |-ParmVarDecl 0x7fe06f321090 <col:69, col:91> col:91 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
|   `-AlwaysInlineAttr 0x7fe06f3212f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fe06f321680 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:813:47> col:5 basic_string 'void (initializer_list<char>)'
| |-ParmVarDecl 0x7fe06f321558 <col:18, col:43> col:43 __il 'initializer_list<char>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fe06f321740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fe06f3219c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:815:70> col:5 basic_string 'void (initializer_list<char>, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fe06f321818 <col:18, col:43> col:43 __il 'initializer_list<char>':'class std::initializer_list<char>'
| |-ParmVarDecl 0x7fe06f321888 <col:49, col:67> col:67 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fe06f321a88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fe06f321b00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:818:5, col:26> col:12 used ~basic_string 'void (void) noexcept' inline
|-CXXConversionDecl 0x7fe06f321c68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:821:82> col:5 operator basic_string_view 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f321d10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f321e60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:823:5, col:54> col:19 used operator= 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| `-ParmVarDecl 0x7fe06f321d98 <col:29, col:49> col:49 __str 'const class std::__1::basic_string<char> &'
|-FunctionTemplateDecl 0x7fe06f322138 <line:826:5, line:829:69> col:19 operator=
| |-TemplateTypeParmDecl 0x7fe06f321f10 <line:826:15, col:23> col:15 class depth 0 index 0
| | `-TemplateArgument type 'void'
| |-CXXMethodDecl 0x7fe06f3220a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:829:69> col:19 operator= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| | |-ParmVarDecl 0x7fe06f321fa0 <col:29, col:41> col:41 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| | `-AlwaysInlineAttr 0x7fe06f322190 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-CXXMethodDecl 0x7fe07051e530 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:829:69> col:19 operator= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
|   |-TemplateArgument type 'void'
|   |-ParmVarDecl 0x7fe07051e4a8 <col:29, col:41> col:41 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
|   `-AlwaysInlineAttr 0x7fe07051e628 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f322380 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:832:19 used operator= 'class std::__1::basic_string<char> &(class std::__1::basic_string<char> &&) noexcept((__noexcept_move_assign_container<class allocator<char>, __alloc_traits>::value))'
| |-ParmVarDecl 0x7fe06f322270 <col:29, col:44> col:44 __str 'class std::__1::basic_string<char> &&'
| `-AlwaysInlineAttr 0x7fe06f322478 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f322650 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:835:106> col:19 operator= 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fe06f322548 <col:29, col:58> col:58 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fe06f322700 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f322890 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:837:98> col:45 operator= 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fe06f322788 <col:55, col:73> col:73 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-AlwaysInlineAttr 0x7fe06f322940 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f322aa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:838:5, col:43> col:19 operator= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| `-ParmVarDecl 0x7fe06f322998 <col:29, col:40> col:40 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fe06f322bd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:856:43> line:855:14 begin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fe06f322c80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f322d58 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:859:49> line:858:20 begin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f322e00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f322e70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:862:52> line:861:14 end 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fe06f322f18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f322f88 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:865:58> line:864:20 end 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f323030 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f323128 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:869:41> line:868:22 rbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fe06f3231d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3232c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:872:47> line:871:28 rbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f323370 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3233e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:875:43> line:874:22 rend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fe06f323488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3234f8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:878:49> line:877:28 rend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f3235a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f323610 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:882:25> line:881:20 cbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f3236b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f323728 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:885:23> line:884:20 cend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f3237d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f323840 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:888:26> line:887:28 crbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f3238e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f323958 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:891:24> line:890:28 crend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f323a00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f323aa8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:894:70> line:893:41 referenced size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f323b50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f323bc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:895:81> col:41 length 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f323c68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f323cd8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:896:41 max_size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f323d80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f323df0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:899:71> line:897:41 referenced capacity 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f323e98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f324030 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:901:5, col:46> col:10 resize 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fe06f323ef0 <col:17, col:27> col:27 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f323f60 <col:32, col:43> col:43 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fe06f3241c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:902:85> col:36 referenced resize 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fe06f3240f8 <col:43, col:53> col:53 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f324270 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f324350 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:904:5, col:41> col:10 reserve 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| `-ParmVarDecl 0x7fe06f3242c8 <col:18, col:40> col:28 __res_arg 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f324400 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:906:47> col:10 shrink_to_fit 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fe06f3244a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3244f0 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:908:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fe06f324598 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3245e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:909:80> col:36 referenced empty '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f324688 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3247c8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:911:47 referenced operator[] 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f324700 <col:58, col:68> col:68 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f324878 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3249f8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:912:47 referenced operator[] 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fe06f3248f0 <col:58, col:68> col:68 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f324aa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f324bc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:914:5, col:39> col:21 at 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| `-ParmVarDecl 0x7fe06f324b00 <col:24, col:34> col:34 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f324d40 <line:915:5, col:37> col:21 at 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| `-ParmVarDecl 0x7fe06f324c80 <col:24, col:34> col:34 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f324e88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:917:105> col:45 operator+= 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fe06f324e00 <col:56, col:76> col:76 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fe06f324f38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f325018 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:918:104> col:45 operator+= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fe06f324f90 <col:56, col:68> col:68 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fe06f3250c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3251a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:919:103> col:45 operator+= 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fe06f325120 <col:56, col:74> col:74 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-AlwaysInlineAttr 0x7fe06f325258 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f325338 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:920:113> col:45 operator+= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fe06f3252b0 <col:56, col:67> col:67 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-AlwaysInlineAttr 0x7fe06f3253e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f325580 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:922:112> col:45 operator+= 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fe06f3254b8 <col:56, col:85> col:85 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fe06f325630 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f325710 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:926:51> col:19 append 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fe06f325688 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fe06f3257c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3258a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:928:87> col:19 append 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fe06f325818 <col:26, col:38> col:38 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fe06f325950 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f325bc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:929:5, col:88> col:19 append 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fe06f3259a8 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f325a18 <col:53, col:63> col:63 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f325a88 <col:70, col:84> col:80 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7fe06f326328 <line:930:5, line:937:77> col:19 append
| |-TemplateTypeParmDecl 0x7fe06f325c80 <line:930:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fe06f326290 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:937:77> col:19 append 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7fe06f326068 <col:26, col:37> col:37 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fe06f3260d8 <col:42, col:52> col:52 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7fe06f326148 <col:59, col:73> col:69 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f3265b0 <line:938:5, col:62> col:19 append 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fe06f326428 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fe06f326498 <col:49, col:59> col:59 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f326700 <line:939:5, col:47> col:19 append 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| `-ParmVarDecl 0x7fe06f326678 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fe06f326940 <line:940:5, col:55> col:19 append 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fe06f3267c0 <col:26, col:36> col:36 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f326830 <col:41, col:52> col:52 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FunctionTemplateDecl 0x7fe06f326ca8 <line:941:5, line:943:77> col:19 __append_forward_unsafe
| |-TemplateTypeParmDecl 0x7fe06f3269f8 <line:941:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fe06f326c10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:943:77> col:19 __append_forward_unsafe 'class std::__1::basic_string<char> &(_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fe06f326a90 <col:43> col:59 '_ForwardIterator'
|   `-ParmVarDecl 0x7fe06f326b00 <col:61> col:77 '_ForwardIterator'
|-FunctionTemplateDecl 0x7fe06f327468 <line:944:5, line:957:5> line:953:5 append
| |-TemplateTypeParmDecl 0x7fe06f326d90 <line:944:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fe06f3273d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:957:5> line:953:5 append 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value || !__libcpp_string_gets_noexcept_iterator<_InputIterator>::value, class basic_string<char> &>::type (_InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fe06f327240 <col:12, col:27> col:27 __first '_InputIterator'
|   |-ParmVarDecl 0x7fe06f3272b0 <col:36, col:51> col:51 __last '_InputIterator'
|   `-AlwaysInlineAttr 0x7fe06f3274c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fe06f327c28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:958:5, line:969:5> line:967:5 append
| |-TemplateTypeParmDecl 0x7fe06f327598 <line:958:14, col:20> col:20 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fe06f327b90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:969:5> line:967:5 append 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && __libcpp_string_gets_noexcept_iterator<_ForwardIterator>::value, class basic_string<char> &>::type (_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fe06f327a00 <col:12, col:29> col:29 __first '_ForwardIterator'
|   |-ParmVarDecl 0x7fe06f327a70 <col:38, col:55> col:55 __last '_ForwardIterator'
|   `-AlwaysInlineAttr 0x7fe06f327c88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f327eb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:973:103> col:19 append 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fe06f327de8 <col:26, col:55> col:55 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fe06f327f60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3280c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:976:5, col:34> col:10 push_back 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| `-ParmVarDecl 0x7fe06f327fb8 <col:20, col:31> col:31 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fe06f328170 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:978:19> col:10 pop_back 'void (void)'
| `-AlwaysInlineAttr 0x7fe06f328218 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3282e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:979:53> col:47 front 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (void)'
| `-AlwaysInlineAttr 0x7fe06f328388 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f328420 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:980:55> col:47 front 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7fe06f3284c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f328530 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:981:52> col:47 back 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (void)'
| `-AlwaysInlineAttr 0x7fe06f3285d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f328640 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:982:54> col:47 back 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7fe06f3286e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3287c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:985:87> col:19 assign 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fe06f328740 <col:26, col:38> col:38 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fe06f328878 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f328958 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:987:77> col:19 assign 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fe06f3288d0 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fe06f328a08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f328b30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:992:51> line:990:19 assign 'class std::__1::basic_string<char> &(class std::__1::basic_string<char> &&)' noexcept-uninstantiated 0x7fe07022e950
| |-ParmVarDecl 0x7fe06f328a60 <col:26, col:41> col:41 __str 'class std::__1::basic_string<char> &&'
| `-AlwaysInlineAttr 0x7fe06f328c28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f328df8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:994:5, col:88> col:19 assign 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fe06f328c80 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f328cf0 <col:53, col:63> col:63 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f328d60 <col:70, col:84> col:80 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7fe06f329468 <line:995:5, line:1002:78> col:19 assign
| |-TemplateTypeParmDecl 0x7fe06f328eb8 <line:995:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fe06f3293d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1002:78> col:19 assign 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7fe06f3291f8 <col:26, col:38> col:38 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fe06f329268 <col:43, col:53> col:53 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7fe06f3292d8 <col:60, col:74> col:70 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f329668 <line:1003:5, col:62> col:19 assign 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fe06f329568 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fe06f3295d8 <col:49, col:59> col:59 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f3297b8 <line:1004:5, col:47> col:19 assign 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| `-ParmVarDecl 0x7fe06f329730 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fe06f329978 <line:1005:5, col:55> col:19 assign 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fe06f329878 <col:26, col:36> col:36 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f3298e8 <col:41, col:52> col:52 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FunctionTemplateDecl 0x7fe06f329fe8 <line:1006:5, line:1014:61> col:9 assign
| |-TemplateTypeParmDecl 0x7fe06f329a30 <line:1006:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fe06f329f50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1014:61> col:9 assign 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value || !__libcpp_string_gets_noexcept_iterator<_InputIterator>::value, class basic_string<char> &>::type (_InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fe06f329e00 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x7fe06f329e70 <col:40, col:55> col:55 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fe06f32a668 <line:1015:5, line:1023:65> col:9 assign
| |-TemplateTypeParmDecl 0x7fe06f32a0d0 <line:1015:14, col:20> col:20 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fe06f32a5d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1023:65> col:9 assign 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && __libcpp_string_gets_noexcept_iterator<_ForwardIterator>::value, class basic_string<char> &>::type (_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fe06f32a480 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fe06f32a4f0 <col:42, col:59> col:59 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fe06f32a8a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1026:103> col:19 assign 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fe06f32a7d8 <col:26, col:55> col:55 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fe06f32a950 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f32ab30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1030:69> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fe06f32a9a8 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f32aa18 <col:44, col:64> col:64 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fe06f32abe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f32adc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1032:113> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fe06f32ac40 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f32acb0 <col:44, col:56> col:56 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fe06f32ae78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fe06f32b538 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1033:5, line:1040:96> col:19 insert
| |-TemplateTypeParmDecl 0x7fe06f32aec0 <line:1033:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fe06f32b4a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1040:96> col:19 insert 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7fe06f32b1d0 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fe06f32b268 <col:44, col:55> col:55 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fe06f32b2d8 <col:60, col:70> col:70 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7fe06f32b348 <col:78, col:92> col:88 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f32b8d0 <line:1041:5, col:107> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fe06f32b640 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f32b6b0 <col:44, col:64> col:64 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f32b720 <col:71, col:81> col:81 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f32b790 <col:89, col:103> col:99 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f32bbc0 <line:1042:5, col:79> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fe06f32b9a8 <col:26, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f32ba18 <col:43, col:61> col:61 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fe06f32ba88 <col:66, col:76> col:76 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f32be10 <line:1043:5, col:64> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fe06f32bc90 <col:26, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f32bd00 <col:43, col:61> col:61 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fe06f32c0f0 <line:1044:5, col:72> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fe06f32bed8 <col:26, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f32bf48 <col:43, col:53> col:53 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f32bfb8 <col:58, col:69> col:69 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fe06f32c340 <line:1045:5, col:62> col:19 insert 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fe06f32c1c0 <col:26, col:41> col:41 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| `-ParmVarDecl 0x7fe06f32c230 <col:48, col:59> col:59 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fe06f32c620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1047:77> col:19 insert 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fe06f32c408 <col:26, col:41> col:41 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fe06f32c478 <col:48, col:58> col:58 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f32c4e8 <col:63, col:74> col:74 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-AlwaysInlineAttr 0x7fe06f32c6e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fe06f32ce68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1048:5, line:1056:83> col:9 insert
| |-TemplateTypeParmDecl 0x7fe06f32c728 <line:1048:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fe06f32cdd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1056:83> col:9 insert 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value || !__libcpp_string_gets_noexcept_iterator<_InputIterator>::value, iterator>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, _InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fe06f32cbb0 <col:16, col:31> col:31 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7fe06f32cc20 <col:38, col:53> col:53 __first '_InputIterator'
|   `-ParmVarDecl 0x7fe06f32cc90 <col:62, col:77> col:77 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fe06f32d678 <line:1057:5, line:1065:87> col:9 insert
| |-TemplateTypeParmDecl 0x7fe06f32cf58 <line:1057:14, col:20> col:20 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fe06f32d5e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1065:87> col:9 insert 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && __libcpp_string_gets_noexcept_iterator<_ForwardIterator>::value, iterator>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, _ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fe06f32d3c0 <col:16, col:31> col:31 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7fe06f32d430 <col:38, col:55> col:55 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fe06f32d4a0 <col:64, col:81> col:81 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fe06f32d980 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1069:69> line:1068:14 insert 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fe06f32d778 <col:21, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fe06f32d868 <col:43, col:72> col:72 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fe06f32da38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f32dc10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1072:5, col:66> col:19 erase 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fe06f32da90 <col:25, col:43> col:35 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f32db00 <col:46, col:62> col:56 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f32dde0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1074:45> col:19 erase 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator)'
| |-ParmVarDecl 0x7fe06f32dcd8 <col:25, col:40> col:40 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| `-AlwaysInlineAttr 0x7fe06f32de90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f32e070 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1076:70> col:19 erase 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator)'
| |-ParmVarDecl 0x7fe06f32dee8 <col:25, col:40> col:40 __first 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fe06f32df58 <col:49, col:64> col:64 __last 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| `-AlwaysInlineAttr 0x7fe06f32e128 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f32e390 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1079:86> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fe06f32e180 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f32e1f0 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f32e260 <col:61, col:81> col:81 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fe06f32e450 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f32e6c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1081:137> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fe06f32e4a8 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f32e518 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f32e588 <col:61, col:73> col:73 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fe06f32e780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f32eb00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1082:5, col:125> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fe06f32e7d8 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f32e848 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f32e8b8 <col:61, col:81> col:81 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f32e928 <col:88, col:98> col:98 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f32e998 <col:106, col:121> col:116 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7fe06f32f2f0 <line:1083:5, line:1090:114> col:19 replace
| |-TemplateTypeParmDecl 0x7fe06f32ebd0 <line:1083:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fe06f32f258 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1090:114> col:19 replace 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7fe06f32eee0 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fe06f32ef50 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fe06f32efe8 <col:61, col:72> col:72 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fe06f32f058 <col:77, col:87> col:87 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7fe06f32f0c8 <col:95, col:110> col:105 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f32f690 <line:1091:5, col:97> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fe06f32f400 <col:27, col:37> col:37 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f32f470 <col:44, col:54> col:54 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f32f4e0 <col:60, col:78> col:78 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fe06f32f550 <col:83, col:93> col:93 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-NoSanitizeAttr 0x7fe06f32f758 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:453:69> unsigned-integer-overflow
|-CXXMethodDecl 0x7fe06f32fa00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1092:5, col:81> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fe06f32f7e8 <col:27, col:37> col:37 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f32f858 <col:44, col:54> col:54 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f32f8c8 <col:60, col:78> col:78 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fe06f32fd60 <line:1093:5, col:90> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fe06f32fad0 <col:27, col:37> col:37 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f32fb40 <col:44, col:54> col:54 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f32fbb0 <col:60, col:70> col:70 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f32fc20 <col:76, col:87> col:87 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-NoSanitizeAttr 0x7fe06f32fe28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:453:69> unsigned-integer-overflow
|-CXXMethodDecl 0x7fe06f3300d0 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1095:94> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fe06f32feb8 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fe06f32ff28 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fe06f32ff98 <col:69, col:89> col:89 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fe06f330190 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f330400 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1097:140> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fe06f3301e8 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fe06f330258 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fe06f3302c8 <col:69, col:81> col:81 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fe06f3304c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3307b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1099:105> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fe06f330518 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fe06f330588 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fe06f3305f8 <col:69, col:87> col:87 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fe06f330668 <col:92, col:102> col:102 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f330878 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f330ae0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1101:90> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fe06f3308d0 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fe06f330940 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fe06f3309b0 <col:69, col:87> col:87 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-AlwaysInlineAttr 0x7fe06f330ba0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f330e90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1103:98> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fe06f330bf8 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fe06f330c68 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fe06f330cd8 <col:69, col:79> col:79 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f330d48 <col:84, col:95> col:95 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-AlwaysInlineAttr 0x7fe06f330f58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fe06f331618 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1104:5, line:1111:99> col:9 replace
| |-TemplateTypeParmDecl 0x7fe06f330fa0 <line:1104:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fe06f331580 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1111:99> col:9 replace 'typename enable_if<__is_input_iterator<_InputIterator>::value, class basic_string<char> &>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, _InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fe06f3312e0 <col:17, col:32> col:32 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7fe06f331350 <col:38, col:53> col:53 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7fe06f3313c0 <col:59, col:74> col:74 __j1 '_InputIterator'
|   `-ParmVarDecl 0x7fe06f331430 <col:80, col:95> col:95 __j2 '_InputIterator'
|-CXXMethodDecl 0x7fe06f3319b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1115:63> line:1114:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fe06f331720 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fe06f331790 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fe06f331878 <col:69, col:98> col:98 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fe06f331a70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f331cc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1118:5, col:73> col:15 copy 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7fe06f331af8 <col:20, col:32> col:32 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fe06f331b68 <col:37, col:47> col:47 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f331bd8 <col:52, col:70> col:62 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f331f10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1120:68> col:18 substr 'class std::__1::basic_string<char> (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7fe06f331d90 <col:25, col:43> col:35 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f331e00 <col:46, col:62> col:56 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f331fc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f332128 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1123:10 swap 'void (class std::__1::basic_string<char> &) noexcept'
| |-ParmVarDecl 0x7fe06f332020 <col:15, col:29> col:29 __str 'class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fe06f3321d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f332278 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1132:62> col:23 referenced c_str 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f332320 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f332390 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1134:96> col:23 data 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f332438 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f332508 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1141:70> col:20 get_allocator 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f3325b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f332798 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1144:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f332608 <col:20, col:40> col:40 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f332678 <col:47, col:65> col:57 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f332850 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3329f8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1146:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f3328a8 <col:20, col:32> col:32 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fe06f332918 <col:38, col:56> col:48 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f332ab0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f332cd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1147:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1147:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f332b08 <col:20, col:38> col:38 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fe06f332b78 <col:43, col:53> col:53 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f332be8 <col:60, col:70> col:70 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f332ef8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1149:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f332da8 <col:20, col:38> col:38 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fe06f332e18 <col:43, col:61> col:53 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f332fb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f333158 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1150:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1150:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f333008 <col:20, col:31> col:31 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-ParmVarDecl 0x7fe06f333078 <col:36, col:54> col:46 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f333328 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1153:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f333220 <col:21, col:41> col:41 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f333290 <col:48, col:66> col:58 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f3333e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f333540 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1155:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f333438 <col:21, col:33> col:33 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fe06f3334a8 <col:39, col:57> col:49 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f3335f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3337d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1156:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1156:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f333650 <col:21, col:39> col:39 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fe06f3336c0 <col:44, col:54> col:54 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f333730 <col:61, col:71> col:71 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f3339a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1158:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f3338a0 <col:21, col:39> col:39 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fe06f333910 <col:44, col:62> col:54 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f333a60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f333bc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1159:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1159:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f333ab8 <col:21, col:32> col:32 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-ParmVarDecl 0x7fe06f333b28 <col:37, col:55> col:47 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f333d90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1162:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f333c88 <col:29, col:49> col:49 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f333cf8 <col:56, col:74> col:66 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f333e48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f333fa8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1164:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f333ea0 <col:29, col:41> col:41 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fe06f333f10 <col:47, col:65> col:57 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f334060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f334238 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1165:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1165:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f3340b8 <col:29, col:47> col:47 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fe06f334128 <col:52, col:62> col:62 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f334198 <col:69, col:79> col:79 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f334410 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1167:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f334308 <col:29, col:47> col:47 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fe06f334378 <col:52, col:70> col:62 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f3344c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f334628 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1169:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f334520 <col:29, col:40> col:40 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7fe06f334590 <col:45, col:63> col:55 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f3346e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f334840 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1172:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f334738 <col:28, col:48> col:48 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f3347a8 <col:55, col:73> col:65 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f3348f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f334a58 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1174:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f334950 <col:28, col:40> col:40 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fe06f3349c0 <col:46, col:64> col:56 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f334b10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f334ce8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1175:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1175:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f334b68 <col:28, col:46> col:46 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fe06f334bd8 <col:51, col:61> col:61 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f334c48 <col:68, col:78> col:78 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f334ec0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1177:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f334db8 <col:28, col:46> col:46 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fe06f334e28 <col:51, col:69> col:61 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f334f78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3350d8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1179:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f334fd0 <col:28, col:39> col:39 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7fe06f335040 <col:44, col:62> col:54 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f335190 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3352f0 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1182:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f3351e8 <col:33, col:53> col:53 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f335258 <col:60, col:78> col:70 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f3353a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f335508 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1184:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f335400 <col:33, col:45> col:45 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fe06f335470 <col:51, col:69> col:61 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f3355c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f335798 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1185:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1185:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f335618 <col:33, col:51> col:51 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fe06f335688 <col:56, col:66> col:66 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f3356f8 <col:73, col:83> col:83 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f335970 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1187:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f335868 <col:33, col:51> col:51 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fe06f3358d8 <col:56, col:74> col:66 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f335a28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f335b88 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1189:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f335a80 <col:33, col:44> col:44 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7fe06f335af0 <col:49, col:67> col:59 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f335c40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f335da0 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1192:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f335c98 <col:32, col:52> col:52 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f335d08 <col:59, col:77> col:69 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f335e58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f335fb8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1194:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f335eb0 <col:32, col:44> col:44 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fe06f335f20 <col:50, col:68> col:60 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f336070 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f336248 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1195:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1195:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f3360c8 <col:32, col:50> col:50 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fe06f336138 <col:55, col:65> col:65 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f3361a8 <col:72, col:82> col:82 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f336420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1197:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f336318 <col:32, col:50> col:50 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fe06f336388 <col:55, col:73> col:65 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f3364d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f336638 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1199:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fe06f336530 <col:32, col:43> col:43 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7fe06f3365a0 <col:48, col:66> col:58 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f3366f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f336860 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1202:9 compare 'int (const class std::__1::basic_string<char> &) const noexcept'
| |-ParmVarDecl 0x7fe06f336748 <col:17, col:37> col:37 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fe06f336910 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f336a40 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1204:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view) const noexcept'
| |-ParmVarDecl 0x7fe06f336968 <col:17, col:29> col:29 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fe06f336af0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f336d18 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1206:69> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view) const'
| |-ParmVarDecl 0x7fe06f336b48 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f336bb8 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f336c28 <col:51, col:63> col:63 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fe06f336dd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f337048 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1208:78> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &) const'
| |-ParmVarDecl 0x7fe06f336e30 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f336ea0 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f336f10 <col:51, col:71> col:71 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fe06f337108 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f33f6b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1209:5, col:117> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7fe06f337160 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f33f400 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f33f470 <col:51, col:71> col:71 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f33f4e0 <col:78, col:88> col:88 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f33f550 <col:96, col:111> col:106 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7fe06f33ff38 <line:1210:5, line:1217:106> col:9 compare
| |-TemplateTypeParmDecl 0x7fe06f33f788 <line:1210:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fe06f33fea0 <line:1211:5, line:1217:106> col:9 compare 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, int>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const' inline
|   |-ParmVarDecl 0x7fe06f33fb40 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fe06f33fbb0 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fe06f33fc48 <col:51, col:62> col:62 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fe06f33fcb8 <col:67, col:77> col:77 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fe06f33fd28 <col:85, col:100> col:95 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-AlwaysInlineAttr 0x7fe06f33ffb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fe06f340160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1218:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1218:9 compare 'int (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *) const noexcept'
| `-ParmVarDecl 0x7fe06f340090 <col:17, col:35> col:35 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fe06f3403e8 <line:1219:5, col:74> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *) const'
| |-ParmVarDecl 0x7fe06f340220 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f340290 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f340300 <col:51, col:69> col:69 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fe06f340708 <line:1220:5, col:90> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7fe06f3404b8 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f340528 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f340598 <col:51, col:69> col:69 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fe06f340608 <col:74, col:84> col:84 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f3407d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1222:51> col:36 __invariants '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fe06f340878 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3408c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1226:63> line:1225:10 __is_long '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f340968 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7fe06f3409b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1237:1, col:8> col:1 private
|-CXXMethodDecl 0x7fe06f340a68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1240:31> line:1239:21 __alloc 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &(void) noexcept'
| `-AlwaysInlineAttr 0x7fe06f340b10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f340bb8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1243:31> line:1242:27 __alloc 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &(void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f340c60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f340d88 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1270:63> line:1266:10 __set_short_size 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fe06f340cb8 <col:27, col:37> col:37 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f340e38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f340ea8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1278:47> line:1274:15 __get_short_size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f340f50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f341038 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1285:41> line:1284:10 __set_long_size 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fe06f340fa8 <col:26, col:36> col:36 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f3410e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f341158 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1288:42> line:1287:15 __get_long_size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f341200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3412e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1291:76> line:1290:10 __set_size 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fe06f341258 <col:21, col:31> col:31 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f341398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f341480 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1295:55> line:1294:10 __set_long_cap 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fe06f3413f0 <col:25, col:35> col:35 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f341530 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3415a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1298:67> line:1297:15 __get_long_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f341648 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f341768 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1302:41> line:1301:10 __set_long_pointer 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer) noexcept'
| |-ParmVarDecl 0x7fe06f3416a0 <col:29, col:37> col:37 __p 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
| `-AlwaysInlineAttr 0x7fe06f341818 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3418e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1305:42> line:1304:13 __get_long_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer (void) noexcept'
| `-AlwaysInlineAttr 0x7fe06f341990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f341a38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1308:42> line:1307:19 __get_long_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f341ae0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f341b50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1311:82> line:1310:13 __get_short_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer (void) noexcept'
| `-AlwaysInlineAttr 0x7fe06f341bf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f341c68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1314:88> line:1313:19 __get_short_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f341d10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f341d80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1317:76> line:1316:13 __get_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer (void) noexcept'
| `-AlwaysInlineAttr 0x7fe06f341e28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f341e98 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1320:76> line:1319:19 __get_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer (void) const noexcept'
| `-AlwaysInlineAttr 0x7fe06f341f40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f341f88 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1328:9> line:1323:10 __zero 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fe06f342030 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fe06f342270 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1330:5, line:1333:48> line:1332:19 __align_it
| |-NonTypeTemplateParmDecl 0x7fe06f342088 <line:1330:15, col:25> col:25 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long' depth 0 index 0 __a
| `-CXXMethodDecl 0x7fe06f3421d8 <col:30, line:1333:48> line:1332:19 __align_it 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept' static
|   |-ParmVarDecl 0x7fe06f342108 <col:30, col:40> col:40 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-AlwaysInlineAttr 0x7fe06f3422c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-EnumDecl 0x7fe06f342398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1334:5> col:5
| `-EnumConstantDecl 0x7fe06f342460 <col:11, col:25> col:11 __alignment 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1334:5)'
|   `-ImplicitCastExpr 0x7fe06f3424a8 <col:25> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7fe070241910 <col:25> 'int' 16
|-CXXMethodDecl 0x7fe06f342560 <line:1335:5, line:1339:79> line:1336:15 __recommend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept' static
| |-ParmVarDecl 0x7fe06f3424d0 <col:27, col:37> col:37 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f342610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f342880 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1341:5, line:1342:75> col:10 __init 'void (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
| |-ParmVarDecl 0x7fe06f342668 <col:17, col:35> col:35 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fe06f3426d8 <col:40, col:50> col:50 __sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f342748 <col:56, col:66> col:66 __reserve 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f342a90 <line:1343:5, line:1344:54> col:10 __init 'void (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
| |-ParmVarDecl 0x7fe06f342950 <col:17, col:35> col:35 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fe06f3429c0 <col:40, col:50> col:50 __sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f342c58 <line:1345:5, line:1346:46> col:10 __init 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)' inline
| |-ParmVarDecl 0x7fe06f342b58 <col:17, col:27> col:27 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f342bc8 <col:32, col:43> col:43 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FunctionTemplateDecl 0x7fe06f343268 <line:1348:5, line:1355:57> col:5 __init
| |-TemplateTypeParmDecl 0x7fe06f342d10 <line:1348:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fe06f3431d0 <line:1349:5, line:1355:57> col:5 __init 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value, void>::type (_InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fe06f343040 <col:12, col:27> col:27 __first '_InputIterator'
|   `-ParmVarDecl 0x7fe06f3430b0 <col:36, col:51> col:51 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fe06f3438a8 <line:1357:5, line:1364:61> col:5 __init
| |-TemplateTypeParmDecl 0x7fe06f343350 <line:1357:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fe06f343810 <line:1358:5, line:1364:61> col:5 __init 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value, void>::type (_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fe06f343680 <col:12, col:29> col:29 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fe06f3436f0 <col:38, col:55> col:55 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fe06f343d40 <line:1366:5, line:1367:85> line:1366:10 __grow_by 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fe06f3439a0 <col:20, col:30> col:30 __old_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f343a10 <col:41, col:51> col:51 __delta_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f343a80 <col:64, col:74> col:74 __old_sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f343af0 <line:1367:20, col:30> col:30 __n_copy 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f343b60 <col:41, col:51> col:51 __n_del 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f343bd0 <col:64, col:84> col:74 __n_add 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fe06f344260 <line:1368:5, line:1370:82> line:1368:10 __grow_by_and_replace 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fe06f343e28 <col:32, col:42> col:42 __old_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f343e98 <col:53, col:63> col:63 __delta_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f343f08 <col:76, col:86> col:86 __old_sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f343f78 <line:1369:32, col:42> col:42 __n_copy 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f343fe8 <col:53, col:63> col:63 __n_del 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fe06f344058 <line:1370:32, col:42> col:42 __n_add 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fe06f3440c8 <col:51, col:69> col:69 __p_new_stuff 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fe06f3443d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1373:40> col:10 __erase_to_end 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fe06f344350 <col:25, col:35> col:35 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f344488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f344568 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1378:89> line:1376:10 __copy_assign_alloc 'void (const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fe06f3444e0 <col:30, col:50> col:50 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fe06f344618 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3447e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1405:9> line:1381:10 __copy_assign_alloc 'void (const class std::__1::basic_string<char> &, std::__1::true_type)'
| |-ParmVarDecl 0x7fe06f344670 <col:30, col:50> col:50 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f3446d0 <col:57> col:66 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fe06f344898 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f344a68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1409:10> line:1408:10 __copy_assign_alloc 'void (const class std::__1::basic_string<char> &, std::__1::false_type) noexcept'
| |-ParmVarDecl 0x7fe06f3448f0 <col:30, col:48> col:49 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f344950 <col:51> col:61 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7fe06f344b20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f344d00 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1413:10 __move_assign 'void (class std::__1::basic_string<char> &, std::__1::false_type)' noexcept-uninstantiated 0x7fe070248098
| |-ParmVarDecl 0x7fe06f344b78 <col:24, col:38> col:38 __str 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f344bd8 <col:45> col:55 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7fe06f344e10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f344ff0 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1416:10 __move_assign 'void (class std::__1::basic_string<char> &, std::__1::true_type)' noexcept-uninstantiated 0x7fe070248368
| |-ParmVarDecl 0x7fe06f344e68 <col:24, col:38> col:38 __str 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f344ec8 <col:45> col:54 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fe06f345100 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f345230 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1431:89> line:1426:5 __move_assign_alloc 'void (class std::__1::basic_string<char> &)' noexcept-uninstantiated 0x7fe070248578
| |-ParmVarDecl 0x7fe06f345158 <col:25, col:39> col:39 __str 'class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fe06f345328 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3454c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1438:9> line:1434:10 __move_assign_alloc 'void (class std::__1::basic_string<char> &, std::__1::true_type)' noexcept-uninstantiated 0x7fe0702487b8
| |-ParmVarDecl 0x7fe06f345380 <col:30, col:44> col:44 __c 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f3453e0 <col:49> col:58 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fe06f3455d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f345768 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1443:10> line:1441:10 __move_assign_alloc 'void (class std::__1::basic_string<char> &, std::__1::false_type) noexcept'
| |-ParmVarDecl 0x7fe06f345628 <col:30, col:42> col:43 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fe06f345688 <col:45> col:55 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7fe06f345820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f345868 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1445:63> col:36 __invalidate_all_iterators 'void (void)'
| `-AlwaysInlineAttr 0x7fe06f345910 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fe06f3459f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1446:73> col:36 __invalidate_iterators_past 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fe06f345968 <col:64> col:73 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fe06f345aa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FriendDecl 0x7fe06f346640 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1448:5, col:77> col:25
| `-FunctionDecl 0x7fe06f345c40 parent 0x7fe07020bed0 prev 0x7fe06f3463e0 <col:5, col:77> col:25 operator+ 'class std::__1::basic_string<char> (const class std::__1::basic_string<char> &, const class std::__1::basic_string<char> &)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7fe06f345af8 <col:37, col:55> col:56 'const class std::__1::basic_string<char> &'
|   `-ParmVarDecl 0x7fe06f345b68 <col:58, col:76> col:77 'const class std::__1::basic_string<char> &'
|-FriendDecl 0x7fe06f347108 <line:1449:5, col:75> col:25
| `-FunctionDecl 0x7fe06f346810 parent 0x7fe07020bed0 prev 0x7fe06f346ee0 <col:5, col:75> col:25 operator+ 'class std::__1::basic_string<char> (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, const class std::__1::basic_string<char> &)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7fe06f346688 <col:37, col:53> col:54 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|   `-ParmVarDecl 0x7fe06f3466f8 <col:56, col:74> col:75 'const class std::__1::basic_string<char> &'
|-FriendDecl 0x7fe06f347ba0 <line:1450:5, col:68> col:25
| `-FunctionDecl 0x7fe06f3472d0 parent 0x7fe07020bed0 prev 0x7fe06f3479b0 <col:5, col:68> col:25 operator+ 'class std::__1::basic_string<char> (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, const class std::__1::basic_string<char> &)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7fe06f347150 <col:37> col:47 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|   `-ParmVarDecl 0x7fe06f3471c0 <col:49, col:67> col:68 'const class std::__1::basic_string<char> &'
|-FriendDecl 0x7fe06f348668 <line:1451:5, col:75> col:25
| `-FunctionDecl 0x7fe06f347d70 parent 0x7fe07020bed0 prev 0x7fe06f3484a0 <col:5, col:75> col:25 operator+ 'class std::__1::basic_string<char> (const class std::__1::basic_string<char> &, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7fe06f347be8 <col:37, col:55> col:56 'const class std::__1::basic_string<char> &'
|   `-ParmVarDecl 0x7fe06f347c58 <col:58, col:74> col:75 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
`-FriendDecl 0x7fe06f3490f0 <line:1452:5, col:68> col:25
  `-FunctionDecl 0x7fe06f348830 parent 0x7fe07020bed0 prev 0x7fe06f348f60 <col:5, col:68> col:25 operator+ 'class std::__1::basic_string<char> (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
    |-TemplateArgument type 'char'
    |-TemplateArgument type 'struct std::__1::char_traits<char>'
    |-TemplateArgument type 'class std::__1::allocator<char>'
    |-ParmVarDecl 0x7fe06f3486b0 <col:37, col:55> col:56 'const class std::__1::basic_string<char> &'
    `-ParmVarDecl 0x7fe06f348720 <col:58> col:68 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_string" = type { %"class.std::__1::__compressed_pair" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_string" = type { %"class.std::__1::__compressed_pair" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fe07051c3c8 <object_model/5_ctor_dtor_semantics/05_object_copy_semantics.cpp:5:1, line:29:1> line:5:8 referenced struct A definition
|-CXXRecordDecl 0x7fe07051c4e8 <col:1, col:8> col:8 implicit referenced struct A
|-FieldDecl 0x7fe07051c620 <line:6:5, col:17> col:17 referenced s1 'std::string':'class std::__1::basic_string<char>'
|-CXXConstructorDecl 0x7fe07051c6d8 <line:8:5, col:23> col:5 A 'void (void)'
| |-CXXCtorInitializer Field 0x7fe07051c620 's1' 'std::string':'class std::__1::basic_string<char>'
| | `-CXXConstructExpr 0x7fe07051d2e8 <col:11, col:20> 'std::string':'class std::__1::basic_string<char>' 'void (const char *)'
| |   `-ImplicitCastExpr 0x7fe07051d2d0 <col:14> 'const char *' <ArrayToPointerDecay>
| |     `-StringLiteral 0x7fe07051d228 <col:14> 'const char [5]' lvalue "test"
| `-CompoundStmt 0x7fe07051d350 <col:22, col:23>
|-CXXConstructorDecl 0x7fe07051c8c0 <line:10:5, col:51> col:14 A 'void (const std::string &)'
| |-ParmVarDecl 0x7fe07051c800 <col:16, col:35> col:35 used str 'const std::string &'
| |-CXXCtorInitializer Field 0x7fe07051c620 's1' 'std::string':'class std::__1::basic_string<char>'
| | `-CXXConstructExpr 0x7fe07051d428 <col:42, col:48> 'std::string':'class std::__1::basic_string<char>' 'void (const class std::__1::basic_string<char> &)'
| |   `-DeclRefExpr 0x7fe07051d368 <col:45> 'const std::string':'const class std::__1::basic_string<char>' lvalue ParmVar 0x7fe07051c800 'str' 'const std::string &'
| `-CompoundStmt 0x7fe07051d490 <col:50, col:51>
|-CXXConstructorDecl 0x7fe07051ca70 <line:12:5, col:31> col:5 A 'void (const struct A &)'
| |-ParmVarDecl 0x7fe07051c9a8 <col:7, col:16> col:16 used c 'const struct A &'
| |-CXXCtorInitializer Field 0x7fe07051c620 's1' 'std::string':'class std::__1::basic_string<char>'
| | `-CXXConstructExpr 0x7fe07051d5a0 <col:21, col:28> 'std::string':'class std::__1::basic_string<char>' 'void (const class std::__1::basic_string<char> &)'
| |   `-MemberExpr 0x7fe07051d4d0 <col:24, col:26> 'const std::string':'const class std::__1::basic_string<char>' lvalue .s1 0x7fe07051c620
| |     `-DeclRefExpr 0x7fe07051d4a8 <col:24> 'const struct A' lvalue ParmVar 0x7fe07051c9a8 'c' 'const struct A &'
| `-CompoundStmt 0x7fe07051d608 <col:30, col:31>
|-CXXConstructorDecl 0x7fe07051cc68 <line:14:5, col:46> col:5 used A 'void (struct A &&) noexcept'
| |-ParmVarDecl 0x7fe07051cb58 <col:7, col:11> col:11 used o 'struct A &&'
| |-CXXCtorInitializer Field 0x7fe07051c620 's1' 'std::string':'class std::__1::basic_string<char>'
| | `-CXXConstructExpr 0x7fe07051e348 <col:25, col:43> 'std::string':'class std::__1::basic_string<char>' 'void (class std::__1::basic_string<char> &&) noexcept(is_nothrow_move_constructible<allocator_type>::value)'
| |   `-CallExpr 0x7fe07051e280 <col:28, col:42> 'typename remove_reference<class basic_string<char> &>::type':'class std::__1::basic_string<char>' xvalue
| |     |-ImplicitCastExpr 0x7fe07051e268 <col:28, col:33> 'typename remove_reference<class basic_string<char> &>::type &&(*)(class std::__1::basic_string<char> &&) noexcept' <FunctionToPointerDecay>
| |     | `-DeclRefExpr 0x7fe07051df70 <col:28, col:33> 'typename remove_reference<class basic_string<char> &>::type &&(class std::__1::basic_string<char> &&) noexcept' lvalue Function 0x7fe07051de30 'move' 'typename remove_reference<class basic_string<char> &>::type &&(class std::__1::basic_string<char> &&) noexcept' (FunctionTemplate 0x7fe06f1219b8 'move')
| |     `-MemberExpr 0x7fe07051d6d0 <col:38, col:40> 'std::string':'class std::__1::basic_string<char>' lvalue .s1 0x7fe07051c620
| |       `-DeclRefExpr 0x7fe07051d6a8 <col:38> 'struct A' lvalue ParmVar 0x7fe07051cb58 'o' 'struct A &&'
| `-CompoundStmt 0x7fe07051e3b0 <col:45, col:46>
|-CXXMethodDecl 0x7fe07051ce20 <line:16:5, line:20:5> line:16:8 operator= 'struct A &(const struct A &)'
| |-ParmVarDecl 0x7fe07051cd28 <col:18, col:27> col:27 used c 'const struct A &'
| `-CompoundStmt 0x7fe07051e788 <line:17:5, line:20:5>
|   |-CXXOperatorCallExpr 0x7fe07051e6f0 <line:18:9, col:16> 'class std::__1::basic_string<char>' lvalue
|   | |-ImplicitCastExpr 0x7fe07051e6d8 <col:12> 'class std::__1::basic_string<char> &(*)(const class std::__1::basic_string<char> &)' <FunctionToPointerDecay>
|   | | `-DeclRefExpr 0x7fe07051e688 <col:12> 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)' lvalue CXXMethod 0x7fe06f321e60 'operator=' 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
|   | |-MemberExpr 0x7fe07051e3e0 <col:9> 'std::string':'class std::__1::basic_string<char>' lvalue ->s1 0x7fe07051c620
|   | | `-CXXThisExpr 0x7fe07051e3c8 <col:9> 'struct A *' this
|   | `-MemberExpr 0x7fe07051e440 <col:14, col:16> 'const std::string':'const class std::__1::basic_string<char>' lvalue .s1 0x7fe07051c620
|   |   `-DeclRefExpr 0x7fe07051e418 <col:14> 'const struct A' lvalue ParmVar 0x7fe07051cd28 'c' 'const struct A &'
|   `-ReturnStmt 0x7fe07051e770 <line:19:9, col:17>
|     `-UnaryOperator 0x7fe07051e750 <col:16, col:17> 'struct A' lvalue prefix '*'
|       `-CXXThisExpr 0x7fe07051e738 <col:17> 'struct A *' this
|-CXXMethodDecl 0x7fe07051cfd8 <line:22:5, line:26:5> line:22:8 operator= 'struct A &(struct A &&) noexcept'
| |-ParmVarDecl 0x7fe07051ced0 <col:18, col:22> col:22 used m 'struct A &&'
| `-CompoundStmt 0x7fe070527228 <line:23:5, line:26:5>
|   |-CXXOperatorCallExpr 0x7fe070527190 <line:24:9, col:28> 'class std::__1::basic_string<char>' lvalue
|   | |-ImplicitCastExpr 0x7fe070527178 <col:12> 'class std::__1::basic_string<char> &(*)(class std::__1::basic_string<char> &&) noexcept((__noexcept_move_assign_container<class allocator<char>, __alloc_traits>::value))' <FunctionToPointerDecay>
|   | | `-DeclRefExpr 0x7fe0705270f0 <col:12> 'class std::__1::basic_string<char> &(class std::__1::basic_string<char> &&) noexcept((__noexcept_move_assign_container<class allocator<char>, __alloc_traits>::value))' lvalue CXXMethod 0x7fe06f322380 'operator=' 'class std::__1::basic_string<char> &(class std::__1::basic_string<char> &&) noexcept((__noexcept_move_assign_container<class allocator<char>, __alloc_traits>::value))'
|   | |-MemberExpr 0x7fe07051e7c8 <col:9> 'std::string':'class std::__1::basic_string<char>' lvalue ->s1 0x7fe07051c620
|   | | `-CXXThisExpr 0x7fe07051e7b0 <col:9> 'struct A *' this
|   | `-CallExpr 0x7fe07051e978 <col:14, col:28> 'typename remove_reference<class basic_string<char> &>::type':'class std::__1::basic_string<char>' xvalue
|   |   |-ImplicitCastExpr 0x7fe07051e960 <col:14, col:19> 'typename remove_reference<class basic_string<char> &>::type &&(*)(class std::__1::basic_string<char> &&) noexcept' <FunctionToPointerDecay>
|   |   | `-DeclRefExpr 0x7fe07051e920 <col:14, col:19> 'typename remove_reference<class basic_string<char> &>::type &&(class std::__1::basic_string<char> &&) noexcept' lvalue Function 0x7fe07051de30 'move' 'typename remove_reference<class basic_string<char> &>::type &&(class std::__1::basic_string<char> &&) noexcept' (FunctionTemplate 0x7fe06f1219b8 'move')
|   |   `-MemberExpr 0x7fe07051e8b0 <col:24, col:26> 'std::string':'class std::__1::basic_string<char>' lvalue .s1 0x7fe07051c620
|   |     `-DeclRefExpr 0x7fe07051e888 <col:24> 'struct A' lvalue ParmVar 0x7fe07051ced0 'm' 'struct A &&'
|   `-ReturnStmt 0x7fe070527210 <line:25:9, col:17>
|     `-UnaryOperator 0x7fe0705271f0 <col:16, col:17> 'struct A' lvalue prefix '*'
|       `-CXXThisExpr 0x7fe0705271d8 <col:17> 'struct A *' this
`-CXXDestructorDecl 0x7fe07051d0c8 <line:28:5, col:18> col:5 ~A 'void (void) noexcept' default

Layout: <CGRecordLayout
  LLVMType:%struct.A = type { %"class.std::__1::basic_string" }
  NonVirtualBaseLLVMType:%struct.A = type { %"class.std::__1::basic_string" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct B
         0 |   struct A (base)
         0 |     class std::__1::basic_string<char> s1
         0 |       class std::__1::__basic_string_common<true> (base) (empty)
         0 |       class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |         struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |               struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |                 std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |                 std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |                 std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |               struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |                 union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |                   unsigned char __size_
         0 |                   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |                 std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |               struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |                 std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |         struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |           class std::__1::allocator<char> (base) (empty)
        24 |   class std::__1::basic_string<char> s2
        24 |     class std::__1::__basic_string_common<true> (base) (empty)
        24 |     class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
        24 |       struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
        24 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
        24 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
        24 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
        24 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
        32 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        40 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
        24 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
        24 |               union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
        24 |                 unsigned char __size_
        24 |                 std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
        25 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
        24 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
        24 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
        24 |       struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
        24 |         class std::__1::allocator<char> (base) (empty)
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class P
         0 |   (P vtable pointer)
         8 |   double _x
        16 |   double _y
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class P3
         0 |   (P3 vtable pointer)
         8 |   double _z
        16 |   class P (virtual base)
        16 |     (P vtable pointer)
        24 |     double _x
        32 |     double _y
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class V
         0 |   (V vtable pointer)
         8 |   class V * _n
        16 |   class P (virtual base)
        16 |     (P vtable pointer)
        24 |     double _x
        32 |     double _y
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class V3
         0 |   class P3 (primary base)
         0 |     (P3 vtable pointer)
         8 |     double _z
        16 |   class V (base)
        16 |     (V vtable pointer)
        24 |     class V * _n
        32 |   double _m
        40 |   class P (virtual base)
        40 |     (P vtable pointer)
        48 |     double _x
        56 |     double _y
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fe070527988 <object_model/5_ctor_dtor_semantics/05_object_copy_semantics.cpp:47:1, line:49:1> line:47:8 referenced struct B definition
|-public 'struct A'
|-CXXRecordDecl 0x7fe070527ae8 <col:1, col:8> col:8 implicit struct B
|-FieldDecl 0x7fe070527bd0 <line:48:5, col:17> col:17 referenced s2 'std::string':'class std::__1::basic_string<char>'
|-CXXConstructorDecl 0x7fe070527c68 <line:47:8> col:8 implicit B 'void (struct B &&)' inline default noexcept-unevaluated 0x7fe070527c68
| `-ParmVarDecl 0x7fe070527d90 <col:8> col:8 'struct B &&'
|-CXXMethodDecl 0x7fe070527e28 <col:8, <invalid sloc>> col:8 implicit operator= 'struct B &(struct B &&)' inline default noexcept-unevaluated 0x7fe070527e28
| `-ParmVarDecl 0x7fe070527f40 <col:8> col:8 'struct B &&'
|-CXXDestructorDecl 0x7fe070527fc8 <col:8> col:8 implicit used ~B 'void (void) noexcept' inline default
| `-CompoundStmt 0x7fe07052cf40 <col:8>
|-CXXConstructorDecl 0x7fe07052cb38 <col:8> col:8 implicit used B 'void (void) noexcept(false)' inline default
| |-CXXCtorInitializer 'struct A'
| | `-CXXConstructExpr 0x7fe07052ce28 <col:8> 'struct A' 'void (void)'
| |-CXXCtorInitializer Field 0x7fe070527bd0 's2' 'std::string':'class std::__1::basic_string<char>'
| | `-CXXConstructExpr 0x7fe07052ce90 <col:8> 'std::string':'class std::__1::basic_string<char>' 'void (void) noexcept(is_nothrow_default_constructible<allocator_type>::value)'
| `-CompoundStmt 0x7fe07052cef8 <col:8>
|-CXXConstructorDecl 0x7fe07052cc48 <col:8> col:8 implicit B 'void (const struct B &)' inline default noexcept-unevaluated 0x7fe07052cc48
| `-ParmVarDecl 0x7fe07052cd70 <col:8> col:8 'const struct B &'
`-CXXMethodDecl 0x7fe07052d620 <col:8> col:8 implicit used operator= 'struct B &(const struct B &) noexcept(false)' inline default
  |-ParmVarDecl 0x7fe07052d740 <col:8> col:8 used 'const struct B &'
  `-CompoundStmt 0x7fe07052dcc0 <col:8>
    |-CXXMemberCallExpr 0x7fe07052da00 <col:8> 'struct A' lvalue
    | |-MemberExpr 0x7fe07052d9b0 <col:8> '<bound member function type>' .operator= 0x7fe07051ce20
    | | `-ImplicitCastExpr 0x7fe07052d8c8 <col:8> 'struct A' lvalue <UncheckedDerivedToBase (A)>
    | |   `-UnaryOperator 0x7fe07052d8a8 <col:8> 'struct B' lvalue prefix '*'
    | |     `-CXXThisExpr 0x7fe07052d890 <col:8> 'struct B *' this
    | `-ImplicitCastExpr 0x7fe07052d990 <col:8> 'const struct A' lvalue <UncheckedDerivedToBase (A)>
    |   `-DeclRefExpr 0x7fe07052d968 <col:8> 'const struct B' lvalue ParmVar 0x7fe07052d740 '' 'const struct B &'
    |-CXXMemberCallExpr 0x7fe07052dc40 <col:8> 'class std::__1::basic_string<char>' lvalue
    | |-MemberExpr 0x7fe07052dbf0 <col:8> '<bound member function type>' .operator= 0x7fe06f321e60
    | | `-MemberExpr 0x7fe07052da70 <col:8> 'std::string':'class std::__1::basic_string<char>' lvalue ->s2 0x7fe070527bd0
    | |   `-CXXThisExpr 0x7fe07052da58 <col:8> 'struct B *' this
    | `-MemberExpr 0x7fe07052db70 <col:8> 'const std::string':'const class std::__1::basic_string<char>' lvalue .s2 0x7fe070527bd0
    |   `-DeclRefExpr 0x7fe07052db48 <col:8> 'const struct B' lvalue ParmVar 0x7fe07052d740 '' 'const struct B &'
    `-ReturnStmt 0x7fe07052dca8 <col:8>
      `-UnaryOperator 0x7fe07052dc88 <col:8> 'struct B' lvalue prefix '*'
        `-CXXThisExpr 0x7fe07052dc70 <col:8> 'struct B *' this

Layout: <CGRecordLayout
  LLVMType:%struct.B = type { %struct.A, %"class.std::__1::basic_string" }
  NonVirtualBaseLLVMType:%struct.B = type { %struct.A, %"class.std::__1::basic_string" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
