
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__scalar_hash<struct std::__1::_PairT, 2> (empty)
         0 |   struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1509:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1000000000, 1>, false, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_mutex_t
         0 |   long __sig
         8 |   char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_cond_t
         0 |   long __sig
         8 |   char [40] __opaque
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1, 1>, true, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct _opaque_pthread_t *, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::hash<struct _opaque_pthread_t *> (empty)
         0 |   struct std::__1::unary_function<struct _opaque_pthread_t *, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__thread_struct
         0 |   class std::__1::__thread_struct_imp * __p_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<unsigned long, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__atomic_base<struct D *, false>
         0 |   _Atomic(struct D *) __a_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::atomic<struct D *>
         0 |   struct std::__1::__atomic_base<struct D *, false> (base)
         0 |     _Atomic(struct D *) __a_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__basic_string_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (empty)
         0 |   class std::__1::allocator<char> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<char>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |       class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct D
         0 |   int i
         8 |   double d
    16:0-9 |   unsigned int bf1
   20:0-24 |   int bf2
    23:1-1 |   int bf3
    24:0-8 |   int bf4
        28 |   int i2
        32 |   char c1
        33 |   char c2
        40 |   class std::__1::basic_string<char> s
        40 |     class std::__1::__basic_string_common<true> (base) (empty)
        40 |     class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
        40 |       struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
        40 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
        40 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
        40 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
        40 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
        48 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        56 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
        40 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
        40 |               union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
        40 |                 unsigned char __size_
        40 |                 std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
        41 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
        40 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
        40 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
        40 |       struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
        40 |         class std::__1::allocator<char> (base) (empty)
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc9811cc278 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:585:90> col:64 class __basic_string_common definition
|-TemplateArgument integral 1
|-VisibilityAttr 0x7fc981310010 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fc9813100c0 prev 0x7fc9811cc278 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:560:1, col:28> col:28 implicit class __basic_string_common
|-AccessSpecDecl 0x7fc981310158 <line:562:1, col:10> col:1 protected
|-CXXMethodDecl 0x7fc981310180 <line:563:22, col:50> col:27 __throw_length_error 'void (void) const'
| `-CXX11NoReturnAttr 0x7fc981310258 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
|-CXXMethodDecl 0x7fc9813102a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:564:22, col:50> col:27 __throw_out_of_range 'void (void) const'
| `-CXX11NoReturnAttr 0x7fc981310348 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
`-CXXDestructorDecl 0x7fc980d5fb90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:585:64> col:64 implicit ~__basic_string_common 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc980d2ea90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:701:5, line:706:5> line:701:12 struct __long definition
|-CXXRecordDecl 0x7fc980d2ef08 prev 0x7fc980d2ea90 <col:5, col:12> col:12 implicit struct __long
|-FieldDecl 0x7fc980d2efd0 <line:703:9, col:19> col:19 __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7fc980d2f028 <line:704:9, col:19> col:19 __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7fc980d2f080 <line:705:9, col:19> col:19 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
`-CXXDestructorDecl 0x7fc980d5ff08 <line:701:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc980d2f948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9, line:725:9> line:721:9 union definition
|-FieldDecl 0x7fc980d2fac8 <line:723:13, col:27> col:27 __size_ 'unsigned char'
|-FieldDecl 0x7fc980d2fb20 <line:724:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
`-CXXDestructorDecl 0x7fc980d60368 <line:721:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon.0 = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc980d2f460 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:5, line:727:5> line:719:12 struct __short definition
|-CXXRecordDecl 0x7fc980d2f8b0 prev 0x7fc980d2f460 <col:5, col:12> col:12 implicit struct __short
|-CXXRecordDecl 0x7fc980d2f948 <line:721:9, line:725:9> line:721:9 union definition
| |-FieldDecl 0x7fc980d2fac8 <line:723:13, col:27> col:27 __size_ 'unsigned char'
| |-FieldDecl 0x7fc980d2fb20 <line:724:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-CXXDestructorDecl 0x7fc980d60368 <line:721:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7fc980d2fb88 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
|-IndirectFieldDecl 0x7fc980d2fbe0 <line:723:27> col:27 implicit __size_ 'unsigned char'
| |-Field 0x7fc980d2fb88 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| `-Field 0x7fc980d2fac8 '__size_' 'unsigned char'
|-IndirectFieldDecl 0x7fc980d2fc30 <line:724:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-Field 0x7fc980d2fb88 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| `-Field 0x7fc980d2fb20 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FieldDecl 0x7fc980d2fcf8 <line:726:9, col:37> col:20 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
`-CXXDestructorDecl 0x7fc980d5ffe8 <line:719:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc980d300f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:735:5, line:738:5> line:735:12 struct __raw definition
|-CXXRecordDecl 0x7fc980d30b50 prev 0x7fc980d300f8 <col:5, col:12> col:12 implicit struct __raw
|-FieldDecl 0x7fc980d30ca8 <line:737:9, col:36> col:19 __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
`-CXXDestructorDecl 0x7fc980d600c8 <line:735:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc980d308a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9, line:747:9> line:742:9 union definition
|-FieldDecl 0x7fc980d30a38 <line:744:13, col:21> col:21 __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-FieldDecl 0x7fc980d30a90 <line:745:13, col:21> col:21 __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-FieldDecl 0x7fc980d30d10 <line:746:13, col:21> col:21 __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
`-CXXDestructorDecl 0x7fc980d60288 <line:742:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc980d301c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:5, line:748:5> line:740:12 struct __rep definition
|-CXXRecordDecl 0x7fc980d30810 prev 0x7fc980d301c0 <col:5, col:12> col:12 implicit struct __rep
|-CXXRecordDecl 0x7fc980d308a8 <line:742:9, line:747:9> line:742:9 union definition
| |-FieldDecl 0x7fc980d30a38 <line:744:13, col:21> col:21 __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-FieldDecl 0x7fc980d30a90 <line:745:13, col:21> col:21 __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-FieldDecl 0x7fc980d30d10 <line:746:13, col:21> col:21 __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| `-CXXDestructorDecl 0x7fc980d60288 <line:742:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7fc980d30d78 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
|-IndirectFieldDecl 0x7fc980d30dd0 <line:744:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-Field 0x7fc980d30d78 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| `-Field 0x7fc980d30a38 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-IndirectFieldDecl 0x7fc980d30e20 <line:745:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-Field 0x7fc980d30d78 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| `-Field 0x7fc980d30a90 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-IndirectFieldDecl 0x7fc980d30e70 <line:746:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-Field 0x7fc980d30d78 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| `-Field 0x7fc980d30d10 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
`-CXXDestructorDecl 0x7fc980d5fe28 <line:740:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc980d315c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2034:1, line:2067:1> line:2037:8 struct __compressed_pair_elem definition
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument integral 0
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7fc980d31840 prev 0x7fc980d315c0 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7fc980d318e8 <line:2038:3, col:15> col:15 _ParamT 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-SubstTemplateTypeParmType 0x7fc980d30520 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|   |-TemplateTypeParmType 0x7fc980a9ab80 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fc980a9ab38 '_Tp'
|   `-RecordType 0x7fc980d30260 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|     `-CXXRecord 0x7fc980d301c0 '__rep'
|-TypedefDecl 0x7fc980d319a8 <line:2039:3, col:16> col:16 referenced reference 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
| `-LValueReferenceType 0x7fc980d31970 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
|   `-SubstTemplateTypeParmType 0x7fc980d30520 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|     |-TemplateTypeParmType 0x7fc980a9ab80 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fc980a9ab38 '_Tp'
|     `-RecordType 0x7fc980d30260 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|       `-CXXRecord 0x7fc980d301c0 '__rep'
|-TypedefDecl 0x7fc980d31a68 <line:2040:3, col:22> col:22 referenced const_reference 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
| `-LValueReferenceType 0x7fc980d31a30 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
|   `-QualType 0x7fc980d30521 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' const
|     `-SubstTemplateTypeParmType 0x7fc980d30520 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|       |-TemplateTypeParmType 0x7fc980a9ab80 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fc980a9ab38 '_Tp'
|       `-RecordType 0x7fc980d30260 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|         `-CXXRecord 0x7fc980d301c0 '__rep'
|-CXXConstructorDecl 0x7fc980d31b00 <line:2043:3, col:52> col:13 constexpr __compressed_pair_elem 'void (void)'
|-FunctionTemplateDecl 0x7fc980d322e8 <line:2045:3, line:2050:44> line:2049:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fc980d31bb8 <line:2045:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fc980d31c28 <col:24, line:2047:6> line:2045:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<struct __rep, 0, false>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7fc980d32240 <line:2048:3, line:2050:44> line:2049:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7fc980d32158 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7fc980d32918 <line:2052:3, line:2056:75> line:2054:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fc980d323c8 <line:2052:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7fc980d32438 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7fc980d32870 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2056:75> line:2054:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7fc980d324b0 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fc980d32618 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7fc980d32768 <line:2055:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7fc980d329a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d32b28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2062:3, col:50> col:13 __get 'std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>::reference (void) noexcept'
|-CXXMethodDecl 0x7fc980d32c78 <line:2063:3, col:62> col:19 __get 'std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>::const_reference (void) const noexcept'
|-AccessSpecDecl 0x7fc980d32d20 <line:2065:1, col:8> col:1 private
|-FieldDecl 0x7fc980d32d58 <line:2066:3, col:7> col:7 __value_ 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
`-CXXDestructorDecl 0x7fc980d5fd48 <line:2037:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc981887078 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:101:1, col:52> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28 class allocator definition
|-TemplateArgument type 'char'
|-CXXRecordDecl 0x7fc982a83988 prev 0x7fc981887078 <col:1, col:28> col:28 implicit class allocator
|-AccessSpecDecl 0x7fc982a83a20 <line:1722:1, col:7> col:1 public
|-TypedefDecl 0x7fc982a83a48 <line:1723:5, col:31> col:31 referenced size_type 'size_t':'unsigned long'
| `-TypedefType 0x7fc980850810 'size_t' sugar
|   |-Typedef 0x7fc98104ddb0 'size_t'
|   `-BuiltinType 0x7fc981018880 'unsigned long'
|-TypedefDecl 0x7fc982a83aa0 <line:1724:5, col:31> col:31 referenced difference_type 'ptrdiff_t':'long'
| `-TypedefType 0x7fc981850550 'ptrdiff_t' sugar
|   |-Typedef 0x7fc98104dd40 'ptrdiff_t'
|   `-BuiltinType 0x7fc9810187e0 'long'
|-TypedefDecl 0x7fc982a83b68 <line:1725:5, col:31> col:31 referenced pointer 'char *'
| `-PointerType 0x7fc982a83b30 'char *'
|   `-SubstTemplateTypeParmType 0x7fc982a83b00 'char' sugar
|     |-TemplateTypeParmType 0x7fc981975060 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fc981975018 '_Tp'
|     `-BuiltinType 0x7fc981018760 'char'
|-TypedefDecl 0x7fc982a83bf8 <line:1726:5, col:31> col:31 referenced const_pointer 'const char *'
| `-PointerType 0x7fc982a83bc0 'const char *'
|   `-QualType 0x7fc982a83b01 'const char' const
|     `-SubstTemplateTypeParmType 0x7fc982a83b00 'char' sugar
|       |-TemplateTypeParmType 0x7fc981975060 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fc981975018 '_Tp'
|       `-BuiltinType 0x7fc981018760 'char'
|-TypedefDecl 0x7fc982a83c88 <line:1727:5, col:31> col:31 reference 'char &'
| `-LValueReferenceType 0x7fc982a83c50 'char &'
|   `-SubstTemplateTypeParmType 0x7fc982a83b00 'char' sugar
|     |-TemplateTypeParmType 0x7fc981975060 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fc981975018 '_Tp'
|     `-BuiltinType 0x7fc981018760 'char'
|-TypedefDecl 0x7fc982a83d18 <line:1728:5, col:31> col:31 const_reference 'const char &'
| `-LValueReferenceType 0x7fc982a83ce0 'const char &'
|   `-QualType 0x7fc982a83b01 'const char' const
|     `-SubstTemplateTypeParmType 0x7fc982a83b00 'char' sugar
|       |-TemplateTypeParmType 0x7fc981975060 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fc981975018 '_Tp'
|       `-BuiltinType 0x7fc981018760 'char'
|-TypedefDecl 0x7fc982a83d80 <line:1729:5, col:31> col:31 referenced value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fc982a83b00 'char' sugar
|   |-TemplateTypeParmType 0x7fc981975060 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fc981975018 '_Tp'
|   `-BuiltinType 0x7fc981018760 'char'
|-TypedefDecl 0x7fc982a83dd8 <line:1731:5, col:23> col:23 referenced propagate_on_container_move_assignment 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fc98083f940 'std::__1::true_type' sugar
|   |-Typedef 0x7fc98083ce48 'true_type'
|   `-TemplateSpecializationType 0x7fc98083cd30 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fc98083cb98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fc98083cb80 <line:528:31> '_Bool' true
|     `-RecordType 0x7fc98083cd10 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fc98083cc08 'integral_constant'
|-TypedefDecl 0x7fc982a83e30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1732:5, col:23> col:23 referenced is_always_equal 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fc98083f940 'std::__1::true_type' sugar
|   |-Typedef 0x7fc98083ce48 'true_type'
|   `-TemplateSpecializationType 0x7fc98083cd30 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fc98083cb98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fc98083cb80 <line:528:31> '_Bool' true
|     `-RecordType 0x7fc98083cd10 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fc98083cc08 'integral_constant'
|-ClassTemplateDecl 0x7fc982a83fa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1734:5, col:33> col:33 rebind
| |-TemplateTypeParmDecl 0x7fc982a83e88 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXRecordDecl 0x7fc982a83f10 <col:26, col:33> col:33 struct rebind
|-CXXConstructorDecl 0x7fc982a841f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1736:54> col:31 allocator 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fc982a842d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc982a84630 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:5, col:96> col:52 allocator
| |-TemplateTypeParmDecl 0x7fc982a84320 <col:15, col:21> col:21 class depth 0 index 0 _Up
| |-CXXConstructorDecl 0x7fc982a84588 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:96> col:52 allocator 'void (const allocator<_Up> &) noexcept'
| | |-ParmVarDecl 0x7fc982a84460 <col:62, col:82> col:83 'const allocator<_Up> &'
| | `-AlwaysInlineAttr 0x7fc982a84688 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-CXXConstructorDecl 0x7fc980d62688 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:96> col:52 allocator 'void (const allocator<char> &) noexcept'
|   |-TemplateArgument type 'char'
|   |-ParmVarDecl 0x7fc980d625c0 <col:62, col:82> col:83 'const allocator<char> &'
|   `-AlwaysInlineAttr 0x7fc980d62790 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc982a848b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1739:39> line:1738:39 address 'std::__1::allocator<char>::pointer (std::__1::allocator<char>::reference) const noexcept'
| |-ParmVarDecl 0x7fc982a847b0 <col:47, col:57> col:57 __x 'std::__1::allocator<char>::reference':'char &'
| `-AlwaysInlineAttr 0x7fc982a84968 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc982a84b08 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1741:39> line:1740:45 address 'std::__1::allocator<char>::const_pointer (std::__1::allocator<char>::const_reference) const noexcept'
| |-ParmVarDecl 0x7fc982a84a00 <col:53, col:69> col:69 __x 'std::__1::allocator<char>::const_reference':'const char &'
| `-AlwaysInlineAttr 0x7fc982a84bb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc982a84d70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1748:9> line:1742:39 allocate 'std::__1::allocator<char>::pointer (std::__1::allocator::size_type, allocator<void>::const_pointer)'
| |-ParmVarDecl 0x7fc982a84c00 <col:48, col:58> col:58 __n 'std::__1::allocator::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc982a84c60 <col:63, col:96> col:94 'allocator<void>::const_pointer':'const void *'
| `-AlwaysInlineAttr 0x7fc982a84e28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc982a84fb8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1750:49> line:1749:36 deallocate 'void (std::__1::allocator<char>::pointer, std::__1::allocator::size_type) noexcept'
| |-ParmVarDecl 0x7fc982a84e80 <col:47, col:55> col:55 __p 'std::__1::allocator<char>::pointer':'char *'
| |-ParmVarDecl 0x7fc982a84ee0 <col:60> col:69 'std::__1::allocator::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc982a85070 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc982a850b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1752:45> line:1751:41 max_size 'std::__1::allocator::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc982a85160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc982a85588 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1754:5, line:1760:9> line:1757:9 construct
| |-TemplateTypeParmDecl 0x7fc982a851a8 <line:1754:15, col:21> col:21 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fc982a85218 <col:26, col:35> col:35 class depth 0 index 1 ... _Args
| `-CXXMethodDecl 0x7fc982a854f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1760:9> line:1757:9 construct 'void (_Up *, _Args &&...)'
|   |-ParmVarDecl 0x7fc982a852e8 <col:19, col:24> col:24 __p '_Up *'
|   |-ParmVarDecl 0x7fc982a853d8 <col:29, col:40> col:40 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7fc982a855e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc982a857d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1814:70> col:36 destroy 'void (std::__1::allocator<char>::pointer)'
| |-ParmVarDecl 0x7fc982a856c8 <col:44, col:52> col:52 __p 'std::__1::allocator<char>::pointer':'char *'
| `-AlwaysInlineAttr 0x7fc982a85880 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fc980d35078 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28> col:28 implicit referenced ~allocator 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fc980d5e798 <col:28> col:28 implicit constexpr allocator 'void (const class std::__1::allocator<char> &)' inline default trivial noexcept-unevaluated 0x7fc980d5e798
| `-ParmVarDecl 0x7fc980d5e880 <col:28> col:28 'const class std::__1::allocator<char> &'
`-CXXConstructorDecl 0x7fc980d5e918 <col:28> col:28 implicit referenced constexpr allocator 'void (class std::__1::allocator<char> &&) noexcept' inline default trivial
  `-ParmVarDecl 0x7fc980d5ea40 <col:28> col:28 'class std::__1::allocator<char> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc980d337a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2069:1, line:2099:1> line:2070:8 struct __compressed_pair_elem definition
|-private 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-TemplateArgument integral 1
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7fc980d33b38 prev 0x7fc980d337a0 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7fc980d33be0 <line:2071:3, col:15> col:15 _ParamT 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7fc980d33a00 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7fc980a9cfb0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fc980a9cf70 '_Tp'
|   `-RecordType 0x7fc981887160 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7fc981887078 'allocator'
|-TypedefDecl 0x7fc980d33c78 <line:2072:3, col:16> col:16 referenced reference 'class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7fc980d33c40 'class std::__1::allocator<char> &'
|   `-SubstTemplateTypeParmType 0x7fc980d33a00 'class std::__1::allocator<char>' sugar
|     |-TemplateTypeParmType 0x7fc980a9cfb0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fc980a9cf70 '_Tp'
|     `-RecordType 0x7fc981887160 'class std::__1::allocator<char>'
|       `-ClassTemplateSpecialization 0x7fc981887078 'allocator'
|-TypedefDecl 0x7fc980d33d08 <line:2073:3, col:22> col:22 referenced const_reference 'const class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7fc980d33cd0 'const class std::__1::allocator<char> &'
|   `-QualType 0x7fc980d33a01 'const class std::__1::allocator<char>' const
|     `-SubstTemplateTypeParmType 0x7fc980d33a00 'class std::__1::allocator<char>' sugar
|       |-TemplateTypeParmType 0x7fc980a9cfb0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fc980a9cf70 '_Tp'
|       `-RecordType 0x7fc981887160 'class std::__1::allocator<char>'
|         `-ClassTemplateSpecialization 0x7fc981887078 'allocator'
|-TypedefDecl 0x7fc980d33d70 <line:2074:3, col:15> col:15 __value_type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7fc980d33a00 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7fc980a9cfb0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fc980a9cf70 '_Tp'
|   `-RecordType 0x7fc981887160 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7fc981887078 'allocator'
|-CXXConstructorDecl 0x7fc980d33e08 <line:2077:3, col:46> col:13 __compressed_pair_elem 'void (void)' default noexcept-unevaluated 0x7fc980d33e08
|-FunctionTemplateDecl 0x7fc980d345e8 <line:2079:3, line:2084:48> line:2083:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fc980d33ec0 <line:2079:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fc980d33f28 <col:24, line:2081:6> line:2079:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<class allocator<char>, 1, true>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7fc980d34540 <line:2082:3, line:2084:48> line:2083:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7fc980d34458 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7fc980d34c18 <line:2086:3, line:2090:79> line:2088:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fc980d346c8 <line:2086:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7fc980d34738 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7fc980d34b70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2090:79> line:2088:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7fc980d347b0 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fc980d34918 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7fc980d34a68 <line:2089:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7fc980d34ca8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d34e28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2097:3, col:47> col:13 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>::reference (void) noexcept'
|-CXXMethodDecl 0x7fc980d34f78 <line:2098:3, col:59> col:19 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>::const_reference (void) const noexcept'
`-CXXDestructorDecl 0x7fc980d601a8 <line:2070:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem.1" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem.1" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc980d302b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2104:1, line:2201:1> line:2105:7 class __compressed_pair definition
|-private '__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0>':'struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>'
|-private '__compressed_pair_elem<class std::__1::allocator<char>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>'
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-CXXRecordDecl 0x7fc980d351a0 prev 0x7fc980d302b0 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7fc980d35548 <line:2107:3, col:42> col:42 _Base1 '__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0>':'struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>'
| `-TemplateSpecializationType 0x7fc980d354a0 '__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fc980aa0400 <col:39> 'int' 0
|   `-RecordType 0x7fc980d316e0 'struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>'
|     `-ClassTemplateSpecialization 0x7fc980d315c0 '__compressed_pair_elem'
|-TypedefDecl 0x7fc980d358a8 <line:2108:3, col:42> col:42 _Base2 '__compressed_pair_elem<class std::__1::allocator<char>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>'
| `-TemplateSpecializationType 0x7fc980d35800 '__compressed_pair_elem<class std::__1::allocator<char>, 1>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fc980aa07a8 <col:39> 'int' 1
|   `-RecordType 0x7fc980d338c0 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>'
|     `-ClassTemplateSpecialization 0x7fc980d337a0 '__compressed_pair_elem'
|-StaticAssertDecl 0x7fc980d35d28 <line:2114:3, line:2117:44> line:2114:3
| |-ParenExpr 0x7fc980d35d08 <col:17, col:43> '_Bool'
| | `-UnaryOperator 0x7fc980d35ce8 <col:18, col:38> '_Bool' prefix '!'
| |   `-ImplicitCastExpr 0x7fc980d35cd0 <col:19, col:38> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7fc980d35c98 <col:19, col:38> 'const _Bool':'const _Bool' lvalue Var 0x7fc980bde478 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fc980aa0cd8 <line:2115:5, line:2117:5> 'const char [179]' lvalue "__compressed_pair cannot be instantated when T1 and T2 are the same type; The current implementation is NOT ABI-compatible with the previous implementation for this configuration"
|-AccessSpecDecl 0x7fc980d35d60 <line:2119:1, col:7> col:1 public
|-FunctionTemplateDecl 0x7fc980d367a8 <line:2121:3, line:2128:34> col:13 __compressed_pair
| |-NonTypeTemplateParmDecl 0x7fc980d35d88 <line:2121:13, col:27> col:18 referenced '_Bool' depth 0 index 0 _Dummy
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fc980aa0e20 <col:27> '_Bool' true
| |-TemplateTypeParmDecl 0x7fc980d35de0 <line:2122:7, line:2125:10> line:2122:7 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<__dependent_type<is_default_constructible<struct __rep>, _Dummy>::value && __dependent_type<is_default_constructible<class allocator<char> >, _Dummy>::value>::type'
| `-CXXConstructorDecl 0x7fc980d36700 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2128:34> col:13 constexpr __compressed_pair 'void (void)'
|   `-AlwaysInlineAttr 0x7fc980d36828 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc980d37048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2130:3, line:2135:51> line:2134:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fc980d368f8 <line:2130:13, col:19> col:19 class depth 0 index 0 _Tp
| |-NonTypeTemplateParmDecl 0x7fc980d36e00 <col:24, line:2132:57> col:55 'typename enable_if<!is_same<typename decay<_Tp>::type, class __compressed_pair<struct __rep, class allocator<char> > >::value, _Bool>::type' depth 0 index 1
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fc980aa1d40 <col:57> '_Bool' true
| `-CXXConstructorDecl 0x7fc980d36fa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2135:51> line:2134:3 constexpr __compressed_pair 'void (_Tp &&)'
|   |-ParmVarDecl 0x7fc980d36eb8 <col:21, col:27> col:27 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fc980d370a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc980d37428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2137:3, line:2140:51> line:2139:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fc980d37170 <line:2137:13, col:19> col:19 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7fc980d37380 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2140:51> line:2139:3 constexpr __compressed_pair 'void (struct std::__1::__second_tag, _Tp &&)'
|   |-ParmVarDecl 0x7fc980d371f0 <col:21> col:33 'struct std::__1::__second_tag'
|   |-ParmVarDecl 0x7fc980d37288 <col:35, col:41> col:41 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fc980d37488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc980d378d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2142:3, line:2145:75> line:2144:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fc980d37558 <line:2142:13, col:19> col:19 class depth 0 index 0 _U1
| |-TemplateTypeParmDecl 0x7fc980d375c8 <col:24, col:30> col:30 class depth 0 index 1 _U2
| `-CXXConstructorDecl 0x7fc980d37830 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 constexpr __compressed_pair 'void (_U1 &&, _U2 &&)'
|   |-ParmVarDecl 0x7fc980d37698 <col:21, col:27> col:27 __t1 '_U1 &&'
|   |-ParmVarDecl 0x7fc980d37738 <col:33, col:39> col:39 __t2 '_U2 &&'
|   `-AlwaysInlineAttr 0x7fc980d37938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc980d37f98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2147:3, line:2154:75> line:2149:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fc980d37a08 <line:2147:13, col:22> col:22 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7fc980d37a78 <col:30, col:39> col:39 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7fc980d37ef0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2154:75> line:2149:3 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7fc980d37b08 <col:21, col:43> col:43 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fc980d37c78 <col:49, col:66> col:66 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7fc980d37de8 <line:2150:21, col:38> col:38 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7fc980d38000 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d381c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2175:3> line:2173:30 first 'typename _Base1::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7fc980d38270 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d38378 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2180:3> line:2178:36 first 'typename _Base1::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d38420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d38568 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2185:3> line:2183:30 second 'typename _Base2::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7fc980d38610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d38718 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2190:3> line:2188:36 second 'typename _Base2::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d387c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d38960 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2200:3> line:2193:8 swap 'void (class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &)' noexcept-uninstantiated 0x7fc980aa3e48
| |-ParmVarDecl 0x7fc980d38848 <col:13, col:32> col:32 __x 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &'
| `-AlwaysInlineAttr 0x7fc980d38a58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
`-CXXDestructorDecl 0x7fc980d5fc68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2105:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc98188f2e8 parent 0x7fc98187e1a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:4040:81> col:64 class basic_string definition
|-private '__basic_string_common<true>':'class std::__1::__basic_string_common<true>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-VisibilityAttr 0x7fc980e589f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fc982a83088 prev 0x7fc98188f2e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:635:1, col:28> col:28 implicit class basic_string
|-AccessSpecDecl 0x7fc982a83120 <line:638:1, col:7> col:1 public
|-TypedefDecl 0x7fc982a83158 <line:639:5, col:58> col:58 __self 'class std::__1::basic_string<char>'
| `-RecordType 0x7fc98188f400 'class std::__1::basic_string<char>'
|   `-ClassTemplateSpecialization 0x7fc98188f2e8 'basic_string'
|-TypedefDecl 0x7fc982a832d8 <line:640:5, col:58> col:58 __self_view 'basic_string_view<char, struct std::__1::char_traits<char> >':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-TemplateSpecializationType 0x7fc982a83230 'basic_string_view<char, struct std::__1::char_traits<char> >' sugar basic_string_view
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7fc9812d1520 'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
|     `-ClassTemplateSpecialization 0x7fc9812d1418 'basic_string_view'
|-TypedefDecl 0x7fc982a83340 <line:641:5, col:58> col:58 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fc982a831f0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fc981312fc0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fc981312f78 '_Traits'
|   `-RecordType 0x7fc981885d30 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fc9829df108 'char_traits'
|-TypedefDecl 0x7fc982a833a8 <line:642:5, col:58> col:58 value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fc982a831b0 'char' sugar
|   |-TemplateTypeParmType 0x7fc981312f50 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fc981312f10 '_CharT'
|   `-BuiltinType 0x7fc981018760 'char'
|-TypedefDecl 0x7fc982a83438 <line:643:5, col:58> col:58 allocator_type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7fc982a83400 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7fc981313030 '_Allocator' dependent depth 0 index 2
|   | `-TemplateTypeParm 0x7fc981312fe8 '_Allocator'
|   `-RecordType 0x7fc981887160 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7fc981887078 'allocator'
|-TypedefDecl 0x7fc982a83648 <line:644:5, col:58> col:58 __alloc_traits 'allocator_traits<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>':'struct std::__1::allocator_traits<class std::__1::allocator<char> >'
| `-TemplateSpecializationType 0x7fc982a835d0 'allocator_traits<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type':'class std::__1::allocator<char>'
|   `-RecordType 0x7fc982a835b0 'struct std::__1::allocator_traits<class std::__1::allocator<char> >'
|     `-ClassTemplateSpecialization 0x7fc982a834c0 'allocator_traits'
|-TypedefDecl 0x7fc980d2d7d0 <line:645:5, col:58> col:58 size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7fc980d2d780 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7fc980d266a0 'std::__1::allocator_traits<class std::__1::allocator<char> >::size_type' sugar
|     |-Typedef 0x7fc980d22d20 'size_type'
|     `-ElaboratedType 0x7fc980d22cd0 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7fc980d22cb0 'std::__1::__size_type<class std::__1::allocator<char>, long, true>::type' sugar
|         |-Typedef 0x7fc980d22c30 'type'
|         `-ElaboratedType 0x7fc980d22be0 'typename class allocator<char>::size_type' sugar
|           `-TypedefType 0x7fc980d221e0 'std::__1::allocator<char>::size_type' sugar
|             |-Typedef 0x7fc982a83a48 'size_type'
|             `-TypedefType 0x7fc980850810 'size_t' sugar
|               |-Typedef 0x7fc98104ddb0 'size_t'
|               `-BuiltinType 0x7fc981018880 'unsigned long'
|-TypedefDecl 0x7fc980d2d8a0 <line:646:5, col:58> col:58 difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7fc980d2d850 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7fc980d21f00 'std::__1::allocator_traits<class std::__1::allocator<char> >::difference_type' sugar
|     |-Typedef 0x7fc980d21e90 'difference_type'
|     `-ElaboratedType 0x7fc980d21e40 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7fc980d21e20 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<char>, char *, true>::type' sugar
|         |-Typedef 0x7fc980d21da0 'type'
|         `-ElaboratedType 0x7fc980d21d50 'typename class allocator<char>::difference_type' sugar
|           `-TypedefType 0x7fc980d21350 'std::__1::allocator<char>::difference_type' sugar
|             |-Typedef 0x7fc982a83aa0 'difference_type'
|             `-TypedefType 0x7fc981850550 'ptrdiff_t' sugar
|               |-Typedef 0x7fc98104dd40 'ptrdiff_t'
|               `-BuiltinType 0x7fc9810187e0 'long'
|-TypedefDecl 0x7fc980d2d958 <line:647:5, col:58> col:58 reference 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
| `-LValueReferenceType 0x7fc980d2d920 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
|   `-TypedefType 0x7fc980d2d900 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' sugar
|     |-Typedef 0x7fc982a833a8 'value_type'
|     `-SubstTemplateTypeParmType 0x7fc982a831b0 'char' sugar
|       |-TemplateTypeParmType 0x7fc981312f50 '_CharT' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fc981312f10 '_CharT'
|       `-BuiltinType 0x7fc981018760 'char'
|-TypedefDecl 0x7fc980d2d9e8 <line:648:5, col:58> col:58 const_reference 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
| `-LValueReferenceType 0x7fc980d2d9b0 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
|   `-QualType 0x7fc980d2d901 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' const
|     `-TypedefType 0x7fc980d2d900 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' sugar
|       |-Typedef 0x7fc982a833a8 'value_type'
|       `-SubstTemplateTypeParmType 0x7fc982a831b0 'char' sugar
|         |-TemplateTypeParmType 0x7fc981312f50 '_CharT' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7fc981312f10 '_CharT'
|         `-BuiltinType 0x7fc981018760 'char'
|-TypedefDecl 0x7fc980d2dab0 <line:649:5, col:58> col:58 pointer 'typename __alloc_traits::pointer':'char *'
| `-ElaboratedType 0x7fc980d2da60 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7fc980d1ca30 'std::__1::allocator_traits<class std::__1::allocator<char> >::pointer' sugar
|     |-Typedef 0x7fc980d1c9c0 'pointer'
|     `-ElaboratedType 0x7fc980d1c970 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7fc980d1c950 'std::__1::__pointer_type<char, class std::__1::allocator<char> >::type' sugar
|         |-Typedef 0x7fc980d1c8d0 'type'
|         `-ElaboratedType 0x7fc980d1c880 'typename __pointer_type_imp::__pointer_type<char, typename remove_reference<class allocator<char> >::type>::type' sugar
|           `-TypedefType 0x7fc980d1c860 'std::__1::__pointer_type_imp::__pointer_type<char, class std::__1::allocator<char>, true>::type' sugar
|             |-Typedef 0x7fc980d1c7e0 'type'
|             `-ElaboratedType 0x7fc980d1c790 'typename class allocator<char>::pointer' sugar
|               `-TypedefType 0x7fc982a84760 'std::__1::allocator<char>::pointer' sugar
|                 |-Typedef 0x7fc982a83b68 'pointer'
|                 `-PointerType 0x7fc982a83b30 'char *'
|                   `-SubstTemplateTypeParmType 0x7fc982a83b00 'char' sugar
|                     |-TemplateTypeParmType 0x7fc981975060 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fc981975018 '_Tp'
|                     `-BuiltinType 0x7fc981018760 'char'
|-TypedefDecl 0x7fc980d2dba0 <line:650:5, col:58> col:58 const_pointer 'typename __alloc_traits::const_pointer':'const char *'
| `-ElaboratedType 0x7fc980d2db50 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7fc980d2db30 'std::__1::allocator_traits<class std::__1::allocator<char> >::const_pointer' sugar
|     |-Typedef 0x7fc980d1d7c0 'const_pointer'
|     `-ElaboratedType 0x7fc980d1d770 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7fc980d1d750 'std::__1::__const_pointer<char, char *, class std::__1::allocator<char>, true>::type' sugar
|         |-Typedef 0x7fc980d1d6d0 'type'
|         `-ElaboratedType 0x7fc980d1d680 'typename class allocator<char>::const_pointer' sugar
|           `-TypedefType 0x7fc982a849b0 'std::__1::allocator<char>::const_pointer' sugar
|             |-Typedef 0x7fc982a83bf8 'const_pointer'
|             `-PointerType 0x7fc982a83bc0 'const char *'
|               `-QualType 0x7fc982a83b01 'const char' const
|                 `-SubstTemplateTypeParmType 0x7fc982a83b00 'char' sugar
|                   |-TemplateTypeParmType 0x7fc981975060 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7fc981975018 '_Tp'
|                   `-BuiltinType 0x7fc981018760 'char'
|-StaticAssertDecl 0x7fc980d2dd00 <line:652:5, col:92> col:5
| |-DeclRefExpr 0x7fc980d2dcb0 <col:19, col:39> 'const _Bool':'const _Bool' lvalue Var 0x7fc982904a20 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fc981313f48 <col:46> 'const char [45]' lvalue "Character type of basic_string must be a POD"
|-StaticAssertDecl 0x7fc980d2df40 <line:653:5, line:654:74> line:653:5
| |-ParenExpr 0x7fc980d2df08 <col:19, col:75> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7fc980d2ded0 <col:20, col:70> 'const _Bool':'const _Bool' lvalue Var 0x7fc982904a20 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fc981314210 <line:654:19> 'const char [54]' lvalue "traits_type::char_type must be the same type as CharT"
|-StaticAssertDecl 0x7fc980d2e150 <line:655:5, line:656:74> line:655:5
| |-ParenExpr 0x7fc980d2e118 <col:19, col:83> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7fc980d2e0e0 <col:20, col:78> 'const _Bool':'const _Bool' lvalue Var 0x7fc982904a20 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fc981314550 <line:656:19> 'const char [54]' lvalue "Allocator::value_type must be same type as value_type"
|-TypedefDecl 0x7fc980d2e348 <line:661:5, col:58> col:58 iterator '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer>':'class std::__1::__wrap_iter<char *>'
| `-TemplateSpecializationType 0x7fc980d2e2d0 '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
|   `-RecordType 0x7fc980d2e2b0 'class std::__1::__wrap_iter<char *>'
|     `-ClassTemplateSpecialization 0x7fc980d2e1c0 '__wrap_iter'
|-TypedefDecl 0x7fc980d2e558 <line:662:5, col:58> col:58 const_iterator '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer>':'class std::__1::__wrap_iter<const char *>'
| `-TemplateSpecializationType 0x7fc980d2e4e0 '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer':'const char *'
|   `-RecordType 0x7fc980d2e4c0 'class std::__1::__wrap_iter<const char *>'
|     `-ClassTemplateSpecialization 0x7fc980d2e3d0 '__wrap_iter'
|-TypedefDecl 0x7fc980d2e7b0 <line:664:5, col:59> col:59 reverse_iterator 'std::__1::reverse_iterator<iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<char *> >'
| `-ElaboratedType 0x7fc980d2e740 'std::__1::reverse_iterator<iterator>' sugar
|   `-TemplateSpecializationType 0x7fc980d2e6f0 'reverse_iterator<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator':'class std::__1::__wrap_iter<char *>'
|     `-RecordType 0x7fc980d2e6d0 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<char *> >'
|       `-ClassTemplateSpecialization 0x7fc980d2e5e0 'reverse_iterator'
|-TypedefDecl 0x7fc980d2ea10 <line:665:5, col:59> col:59 const_reverse_iterator 'std::__1::reverse_iterator<const_iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const char *> >'
| `-ElaboratedType 0x7fc980d2e9a0 'std::__1::reverse_iterator<const_iterator>' sugar
|   `-TemplateSpecializationType 0x7fc980d2e950 'reverse_iterator<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|     `-RecordType 0x7fc980d2e930 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const char *> >'
|       `-ClassTemplateSpecialization 0x7fc980d2e840 'reverse_iterator'
|-AccessSpecDecl 0x7fc980d2ea68 <line:667:1, col:8> col:1 private
|-CXXRecordDecl 0x7fc980d2ea90 <line:701:5, line:706:5> line:701:12 struct __long definition
| |-CXXRecordDecl 0x7fc980d2ef08 prev 0x7fc980d2ea90 <col:5, col:12> col:12 implicit struct __long
| |-FieldDecl 0x7fc980d2efd0 <line:703:9, col:19> col:19 __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-FieldDecl 0x7fc980d2f028 <line:704:9, col:19> col:19 __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-FieldDecl 0x7fc980d2f080 <line:705:9, col:19> col:19 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
| `-CXXDestructorDecl 0x7fc980d5ff08 <line:701:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial
|-EnumDecl 0x7fc980d2eb60 <line:712:5> col:5
| `-EnumConstantDecl 0x7fc980d2ec30 <col:11, col:26> col:11 __short_mask 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:712:5)'
|   `-ImplicitCastExpr 0x7fc980d2ec78 <col:26> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7fc981315110 <col:26> 'int' 1
|-EnumDecl 0x7fc980d2ec90 <line:713:5> col:5
| `-EnumConstantDecl 0x7fc980d2ed60 <col:11, col:26> col:11 __long_mask 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:713:5)'
|   `-ImplicitCastExpr 0x7fc980d2eda8 <col:26> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7fc981315230 <col:26> 'unsigned long' 1
|-EnumDecl 0x7fc980d2edc0 <line:716:5> col:5
| `-EnumConstantDecl 0x7fc980d2f400 <col:11, line:717:65> line:716:11 referenced __min_cap 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:716:5)'
|   `-ImplicitCastExpr 0x7fc980d2f448 <col:23, line:717:65> 'unsigned int' <IntegralCast>
|     `-ConditionalOperator 0x7fc980d2f300 <line:716:23, line:717:65> 'unsigned long'
|       |-BinaryOperator 0x7fc980d2f1d8 <line:716:23, col:65> '_Bool' '>'
|       | |-BinaryOperator 0x7fc980d2f198 <col:23, col:61> 'unsigned long' '/'
|       | | |-ParenExpr 0x7fc980d2f148 <col:23, col:42> 'unsigned long'
|       | | | `-BinaryOperator 0x7fc980d2f120 <col:24, col:41> 'unsigned long' '-'
|       | | |   |-UnaryExprOrTypeTraitExpr 0x7fc980d2f0e8 <col:24, col:37> 'unsigned long' sizeof 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|       | | |   `-ImplicitCastExpr 0x7fc980d2f108 <col:41> 'unsigned long' <IntegralCast>
|       | | |     `-IntegerLiteral 0x7fc981315380 <col:41> 'int' 1
|       | | `-UnaryExprOrTypeTraitExpr 0x7fc980d2f178 <col:44, col:61> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|       | `-ImplicitCastExpr 0x7fc980d2f1c0 <col:65> 'unsigned long' <IntegralCast>
|       |   `-IntegerLiteral 0x7fc981315458 <col:65> 'int' 2
|       |-BinaryOperator 0x7fc980d2f2c0 <line:717:23, col:61> 'unsigned long' '/'
|       | |-ParenExpr 0x7fc980d2f270 <col:23, col:42> 'unsigned long'
|       | | `-BinaryOperator 0x7fc980d2f248 <col:24, col:41> 'unsigned long' '-'
|       | |   |-UnaryExprOrTypeTraitExpr 0x7fc980d2f210 <col:24, col:37> 'unsigned long' sizeof 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|       | |   `-ImplicitCastExpr 0x7fc980d2f230 <col:41> 'unsigned long' <IntegralCast>
|       | |     `-IntegerLiteral 0x7fc9813154e8 <col:41> 'int' 1
|       | `-UnaryExprOrTypeTraitExpr 0x7fc980d2f2a0 <col:44, col:61> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|       `-ImplicitCastExpr 0x7fc980d2f2e8 <col:65> 'unsigned long' <IntegralCast>
|         `-IntegerLiteral 0x7fc9813155c0 <col:65> 'int' 2
|-CXXRecordDecl 0x7fc980d2f460 <line:719:5, line:727:5> line:719:12 struct __short definition
| |-CXXRecordDecl 0x7fc980d2f8b0 prev 0x7fc980d2f460 <col:5, col:12> col:12 implicit struct __short
| |-CXXRecordDecl 0x7fc980d2f948 <line:721:9, line:725:9> line:721:9 union definition
| | |-FieldDecl 0x7fc980d2fac8 <line:723:13, col:27> col:27 __size_ 'unsigned char'
| | |-FieldDecl 0x7fc980d2fb20 <line:724:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| | `-CXXDestructorDecl 0x7fc980d60368 <line:721:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-FieldDecl 0x7fc980d2fb88 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| |-IndirectFieldDecl 0x7fc980d2fbe0 <line:723:27> col:27 implicit __size_ 'unsigned char'
| | |-Field 0x7fc980d2fb88 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| | `-Field 0x7fc980d2fac8 '__size_' 'unsigned char'
| |-IndirectFieldDecl 0x7fc980d2fc30 <line:724:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| | |-Field 0x7fc980d2fb88 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| | `-Field 0x7fc980d2fb20 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-FieldDecl 0x7fc980d2fcf8 <line:726:9, col:37> col:20 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
| `-CXXDestructorDecl 0x7fc980d5ffe8 <line:719:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial
|-CXXRecordDecl 0x7fc980d2f530 <line:731:5, col:44> col:11 union __ulx definition
| |-CXXRecordDecl 0x7fc980d2f748 prev 0x7fc980d2f530 <col:5, col:11> col:11 implicit union __ulx
| |-FieldDecl 0x7fc980d2f7f0 <col:17, col:24> col:24 __lx 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| `-FieldDecl 0x7fc980d2fd60 <col:30, col:38> col:38 __lxx 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-EnumDecl 0x7fc980d2f600 <line:733:5> col:5
| `-EnumConstantDecl 0x7fc980d30098 <col:11, col:55> col:11 referenced __n_words 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:733:5)'
|   `-ImplicitCastExpr 0x7fc980d300e0 <col:23, col:55> 'unsigned int' <IntegralCast>
|     `-BinaryOperator 0x7fc980d2fe18 <col:23, col:55> 'unsigned long' '/'
|       |-UnaryExprOrTypeTraitExpr 0x7fc980d2fdc8 <col:23, col:35> 'unsigned long' sizeof 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx'
|       `-UnaryExprOrTypeTraitExpr 0x7fc980d2fdf8 <col:39, col:55> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXRecordDecl 0x7fc980d300f8 <line:735:5, line:738:5> line:735:12 struct __raw definition
| |-CXXRecordDecl 0x7fc980d30b50 prev 0x7fc980d300f8 <col:5, col:12> col:12 implicit struct __raw
| |-FieldDecl 0x7fc980d30ca8 <line:737:9, col:36> col:19 __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
| `-CXXDestructorDecl 0x7fc980d600c8 <line:735:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial
|-CXXRecordDecl 0x7fc980d301c0 <line:740:5, line:748:5> line:740:12 struct __rep definition
| |-CXXRecordDecl 0x7fc980d30810 prev 0x7fc980d301c0 <col:5, col:12> col:12 implicit struct __rep
| |-CXXRecordDecl 0x7fc980d308a8 <line:742:9, line:747:9> line:742:9 union definition
| | |-FieldDecl 0x7fc980d30a38 <line:744:13, col:21> col:21 __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| | |-FieldDecl 0x7fc980d30a90 <line:745:13, col:21> col:21 __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| | |-FieldDecl 0x7fc980d30d10 <line:746:13, col:21> col:21 __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| | `-CXXDestructorDecl 0x7fc980d60288 <line:742:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-FieldDecl 0x7fc980d30d78 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| |-IndirectFieldDecl 0x7fc980d30dd0 <line:744:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| | |-Field 0x7fc980d30d78 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| | `-Field 0x7fc980d30a38 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-IndirectFieldDecl 0x7fc980d30e20 <line:745:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| | |-Field 0x7fc980d30d78 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| | `-Field 0x7fc980d30a90 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-IndirectFieldDecl 0x7fc980d30e70 <line:746:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| | |-Field 0x7fc980d30d78 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| | `-Field 0x7fc980d30d10 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| `-CXXDestructorDecl 0x7fc980d5fe28 <line:740:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7fc980d38ac0 <line:750:5, col:46> col:46 __r_ '__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>':'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >'
|-AccessSpecDecl 0x7fc980d38b08 <line:752:1, col:7> col:1 public
|-VarDecl 0x7fc980d38b40 <line:753:5, col:36> col:28 npos 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'const unsigned long' static cinit
| `-ImplicitCastExpr 0x7fc980d38bb0 <col:35, col:36> 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'const unsigned long' <IntegralCast>
|   `-UnaryOperator 0x7fc981316bd0 <col:35, col:36> 'int' prefix '-'
|     `-IntegerLiteral 0x7fc981316bb0 <col:36> 'int' 1
|-CXXConstructorDecl 0x7fc980d38c88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:755:31 basic_string 'void (void)' noexcept-uninstantiated 0x7fc981316c90
| `-AlwaysInlineAttr 0x7fc980d38da8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc980d38f60 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:758:40 basic_string 'void (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)' noexcept-uninstantiated 0x7fc981316f08
| |-ParmVarDecl 0x7fc980d38e28 <col:53, col:75> col:75 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fc980d39068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc980d39168 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:765:5, col:43> col:5 basic_string 'void (const class std::__1::basic_string<char> &)'
| `-ParmVarDecl 0x7fc980d390c0 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
|-CXXConstructorDecl 0x7fc980d393e0 <line:766:5, col:70> col:5 basic_string 'void (const class std::__1::basic_string<char> &, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)'
| |-ParmVarDecl 0x7fc980d39238 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
| `-ParmVarDecl 0x7fc980d392a8 <col:45, col:67> col:67 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
|-CXXConstructorDecl 0x7fc980d39620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:770:5 used basic_string 'void (class std::__1::basic_string<char> &&) noexcept(is_nothrow_move_constructible<allocator_type>::value)'
| |-ParmVarDecl 0x7fc980d394e8 <col:18, col:33> col:33 __str 'class std::__1::basic_string<char> &&'
| `-AlwaysInlineAttr 0x7fc980d39728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc980d39920 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:778:65> col:5 basic_string 'void (class std::__1::basic_string<char> &&, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)'
| |-ParmVarDecl 0x7fc980d39780 <col:18, col:33> col:33 __str 'class std::__1::basic_string<char> &&'
| |-ParmVarDecl 0x7fc980d397f0 <col:40, col:62> col:62 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fc980d399e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc980d39b50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:780:61> col:31 basic_string 'void (const char *)'
| |-ParmVarDecl 0x7fc980d39a68 <col:44, col:58> col:58 __s 'const char *'
| `-AlwaysInlineAttr 0x7fc980d39c10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc980d39e40 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:782:58> col:5 basic_string 'void (const char *, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fc980d39c68 <col:18, col:32> col:32 __s 'const char *'
| |-ParmVarDecl 0x7fc980d39d08 <col:37, col:55> col:55 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fc980d39f08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc980d3a0c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:784:50> col:5 used basic_string 'void (const char *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc980d39f60 <col:18, col:32> col:32 __s 'const char *'
| |-ParmVarDecl 0x7fc980d39fd0 <col:37, col:47> col:47 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d3a188 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc980d3a410 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:786:73> col:5 basic_string 'void (const char *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fc980d3a1e0 <col:18, col:32> col:32 __s 'const char *'
| |-ParmVarDecl 0x7fc980d3a250 <col:37, col:47> col:47 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d3a2c0 <col:52, col:70> col:70 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fc980d3a4e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc980d3a6e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:788:43> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, char)'
| |-ParmVarDecl 0x7fc980d3a538 <col:18, col:28> col:28 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d3a5a8 <col:33, col:40> col:40 __c 'char':'char'
| `-AlwaysInlineAttr 0x7fc980d3a7a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc980d3aa30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:790:66> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, char, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fc980d3a800 <col:18, col:28> col:28 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d3a870 <col:33, col:40> col:40 __c 'char':'char'
| |-ParmVarDecl 0x7fc980d3a8e0 <col:45, col:63> col:63 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fc980d3ab00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc980d3ae10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:791:5, line:792:54> line:791:5 basic_string 'void (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fc980d3ab58 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d3abc8 <col:45, col:55> col:55 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d3ac38 <col:62, col:72> col:72 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d3aca8 <line:792:18, col:53> col:36 __a 'const class std::__1::allocator<char> &'
|-CXXConstructorDecl 0x7fc980d3b130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:795:54> line:794:5 basic_string 'void (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fc980d3aef8 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d3af68 <col:45, col:55> col:55 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d3afd8 <line:795:18, col:53> col:36 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fc980d3b200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc980d3c368 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:796:5, line:800:121> line:798:9 basic_string
| |-TemplateTypeParmDecl 0x7fc980d3b248 <line:796:14, col:20> col:20 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7fc980d3c2c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:800:121> line:798:9 basic_string 'void (const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &, typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, void>::type *)' inline
|   |-ParmVarDecl 0x7fc980d3b308 <col:22, col:33> col:33 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fc980d3b378 <col:38, col:48> col:48 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fc980d3b3e8 <col:55, col:65> col:65 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fc980d3b458 <line:799:22, col:65> col:44 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
|   `-ParmVarDecl 0x7fc980d3b900 <line:800:22, col:120> col:118 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, void>::type *'
|-CXXConstructorDecl 0x7fc980d3c5c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:802:34> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fc980d3c4a0 <col:18, col:30> col:30 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fc980d3c680 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc980d3c880 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:804:57> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fc980d3c6d8 <col:18, col:30> col:30 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fc980d3c748 <col:36, col:54> col:54 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fc980d3c948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc980d3cc28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:805:5, line:807:67> col:9 basic_string
| |-TemplateTypeParmDecl 0x7fc980d3c990 <line:805:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7fc980d3cb80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:807:67> col:9 basic_string 'void (_InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x7fc980d3ca20 <col:22, col:37> col:37 __first '_InputIterator'
|   |-ParmVarDecl 0x7fc980d3ca90 <col:46, col:61> col:61 __last '_InputIterator'
|   `-AlwaysInlineAttr 0x7fc980d3cc88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc980d3d0c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:808:5, line:810:94> col:9 basic_string
| |-TemplateTypeParmDecl 0x7fc980d3cd58 <line:808:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7fc980d3d020 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:810:94> col:9 basic_string 'void (_InputIterator, _InputIterator, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)'
|   |-ParmVarDecl 0x7fc980d3cdf0 <col:22, col:37> col:37 __first '_InputIterator'
|   |-ParmVarDecl 0x7fc980d3ce60 <col:46, col:61> col:61 __last '_InputIterator'
|   |-ParmVarDecl 0x7fc980d3ced0 <col:69, col:91> col:91 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
|   `-AlwaysInlineAttr 0x7fc980d3d130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc980d3d4c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:813:47> col:5 basic_string 'void (initializer_list<char>)'
| |-ParmVarDecl 0x7fc980d3d398 <col:18, col:43> col:43 __il 'initializer_list<char>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fc980d3d580 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc980d3d800 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:815:70> col:5 basic_string 'void (initializer_list<char>, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fc980d3d658 <col:18, col:43> col:43 __il 'initializer_list<char>':'class std::initializer_list<char>'
| |-ParmVarDecl 0x7fc980d3d6c8 <col:49, col:67> col:67 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fc980d3d8c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fc980d3d940 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:818:5, col:26> col:12 used ~basic_string 'void (void) noexcept' inline
|-CXXConversionDecl 0x7fc980d3daa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:821:82> col:5 operator basic_string_view 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d3db50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3dca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:823:5, col:54> col:19 operator= 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| `-ParmVarDecl 0x7fc980d3dbd8 <col:29, col:49> col:49 __str 'const class std::__1::basic_string<char> &'
|-FunctionTemplateDecl 0x7fc980d3df78 <line:826:5, line:829:69> col:19 operator=
| |-TemplateTypeParmDecl 0x7fc980d3dd50 <line:826:15, col:23> col:15 class depth 0 index 0
| | `-TemplateArgument type 'void'
| `-CXXMethodDecl 0x7fc980d3dee0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:829:69> col:19 operator= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
|   |-ParmVarDecl 0x7fc980d3dde0 <col:29, col:41> col:41 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
|   `-AlwaysInlineAttr 0x7fc980d3dfd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3e1c0 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:832:19 operator= 'class std::__1::basic_string<char> &(class std::__1::basic_string<char> &&)' noexcept-uninstantiated 0x7fc98131b8a8
| |-ParmVarDecl 0x7fc980d3e0b0 <col:29, col:44> col:44 __str 'class std::__1::basic_string<char> &&'
| `-AlwaysInlineAttr 0x7fc980d3e2b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3e490 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:835:106> col:19 operator= 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fc980d3e388 <col:29, col:58> col:58 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fc980d3e540 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3e6d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:837:98> col:45 operator= 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fc980d3e5c8 <col:55, col:73> col:73 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-AlwaysInlineAttr 0x7fc980d3e780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3e8e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:838:5, col:43> col:19 operator= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| `-ParmVarDecl 0x7fc980d3e7d8 <col:29, col:40> col:40 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fc980d3ea18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:856:43> line:855:14 begin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fc980d3eac0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3eb98 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:859:49> line:858:20 begin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d3ec40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3ecb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:862:52> line:861:14 end 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fc980d3ed58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3edc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:865:58> line:864:20 end 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d3ee70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3ef68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:869:41> line:868:22 rbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fc980d3f010 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3f108 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:872:47> line:871:28 rbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d3f1b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3f220 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:875:43> line:874:22 rend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fc980d3f2c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3f338 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:878:49> line:877:28 rend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d3f3e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3f450 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:882:25> line:881:20 cbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d3f4f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3f568 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:885:23> line:884:20 cend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d3f610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3f680 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:888:26> line:887:28 crbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d3f728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3f798 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:891:24> line:890:28 crend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d3f840 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3f8e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:894:70> line:893:41 size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d3f990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3fa00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:895:81> col:41 length 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d3faa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3fb18 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:896:41 max_size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d3fbc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3fc30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:899:71> line:897:41 capacity 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d3fcd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d3fe70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:901:5, col:46> col:10 resize 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fc980d3fd30 <col:17, col:27> col:27 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d3fda0 <col:32, col:43> col:43 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fc980d40000 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:902:85> col:36 resize 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc980d3ff38 <col:43, col:53> col:53 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d400b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d40190 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:904:5, col:41> col:10 reserve 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| `-ParmVarDecl 0x7fc980d40108 <col:18, col:40> col:28 __res_arg 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d40240 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:906:47> col:10 shrink_to_fit 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fc980d402e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d40330 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:908:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fc980d403d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d40420 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:909:80> col:36 empty '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d404c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d40608 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:911:47 operator[] 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d40540 <col:58, col:68> col:68 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d406b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d40838 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:912:47 operator[] 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fc980d40730 <col:58, col:68> col:68 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d408e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d40a00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:914:5, col:39> col:21 at 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| `-ParmVarDecl 0x7fc980d40940 <col:24, col:34> col:34 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d40b80 <line:915:5, col:37> col:21 at 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| `-ParmVarDecl 0x7fc980d40ac0 <col:24, col:34> col:34 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d40cc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:917:105> col:45 operator+= 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fc980d40c40 <col:56, col:76> col:76 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc980d40d78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d40e58 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:918:104> col:45 operator+= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fc980d40dd0 <col:56, col:68> col:68 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fc980d40f08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d40fe8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:919:103> col:45 operator+= 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fc980d40f60 <col:56, col:74> col:74 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-AlwaysInlineAttr 0x7fc980d41098 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d41178 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:920:113> col:45 operator+= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fc980d410f0 <col:56, col:67> col:67 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-AlwaysInlineAttr 0x7fc980d41228 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d413c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:922:112> col:45 operator+= 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fc980d412f8 <col:56, col:85> col:85 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fc980d41470 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d41550 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:926:51> col:19 append 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fc980d414c8 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc980d41600 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d416e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:928:87> col:19 append 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fc980d41658 <col:26, col:38> col:38 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fc980d41790 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d41a00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:929:5, col:88> col:19 append 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc980d417e8 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d41858 <col:53, col:63> col:63 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d418c8 <col:70, col:84> col:80 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7fc980d42168 <line:930:5, line:937:77> col:19 append
| |-TemplateTypeParmDecl 0x7fc980d41ac0 <line:930:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fc980d420d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:937:77> col:19 append 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7fc980d41ea8 <col:26, col:37> col:37 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fc980d41f18 <col:42, col:52> col:52 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7fc980d41f88 <col:59, col:73> col:69 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d423f0 <line:938:5, col:62> col:19 append 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc980d42268 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fc980d422d8 <col:49, col:59> col:59 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d42540 <line:939:5, col:47> col:19 append 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| `-ParmVarDecl 0x7fc980d424b8 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fc980d42780 <line:940:5, col:55> col:19 append 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fc980d42600 <col:26, col:36> col:36 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d42670 <col:41, col:52> col:52 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FunctionTemplateDecl 0x7fc980d42ae8 <line:941:5, line:943:77> col:19 __append_forward_unsafe
| |-TemplateTypeParmDecl 0x7fc980d42838 <line:941:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fc980d42a50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:943:77> col:19 __append_forward_unsafe 'class std::__1::basic_string<char> &(_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fc980d428d0 <col:43> col:59 '_ForwardIterator'
|   `-ParmVarDecl 0x7fc980d42940 <col:61> col:77 '_ForwardIterator'
|-FunctionTemplateDecl 0x7fc980d432a8 <line:944:5, line:957:5> line:953:5 append
| |-TemplateTypeParmDecl 0x7fc980d42bd0 <line:944:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fc980d43210 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:957:5> line:953:5 append 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value || !__libcpp_string_gets_noexcept_iterator<_InputIterator>::value, class basic_string<char> &>::type (_InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fc980d43080 <col:12, col:27> col:27 __first '_InputIterator'
|   |-ParmVarDecl 0x7fc980d430f0 <col:36, col:51> col:51 __last '_InputIterator'
|   `-AlwaysInlineAttr 0x7fc980d43308 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc980d43a68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:958:5, line:969:5> line:967:5 append
| |-TemplateTypeParmDecl 0x7fc980d433d8 <line:958:14, col:20> col:20 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fc980d439d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:969:5> line:967:5 append 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && __libcpp_string_gets_noexcept_iterator<_ForwardIterator>::value, class basic_string<char> &>::type (_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fc980d43840 <col:12, col:29> col:29 __first '_ForwardIterator'
|   |-ParmVarDecl 0x7fc980d438b0 <col:38, col:55> col:55 __last '_ForwardIterator'
|   `-AlwaysInlineAttr 0x7fc980d43ac8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d43cf0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:973:103> col:19 append 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fc980d43c28 <col:26, col:55> col:55 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fc980d43da0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d43f00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:976:5, col:34> col:10 push_back 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| `-ParmVarDecl 0x7fc980d43df8 <col:20, col:31> col:31 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fc980d43fb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:978:19> col:10 pop_back 'void (void)'
| `-AlwaysInlineAttr 0x7fc980d44058 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d44120 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:979:53> col:47 front 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (void)'
| `-AlwaysInlineAttr 0x7fc980d441c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d44260 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:980:55> col:47 front 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7fc980d44308 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d44370 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:981:52> col:47 back 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (void)'
| `-AlwaysInlineAttr 0x7fc980d44418 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d44480 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:982:54> col:47 back 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7fc980d44528 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d44608 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:985:87> col:19 assign 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fc980d44580 <col:26, col:38> col:38 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fc980d446b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d44798 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:987:77> col:19 assign 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fc980d44710 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc980d44848 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d44970 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:992:51> line:990:19 assign 'class std::__1::basic_string<char> &(class std::__1::basic_string<char> &&)' noexcept-uninstantiated 0x7fc9813229c0
| |-ParmVarDecl 0x7fc980d448a0 <col:26, col:41> col:41 __str 'class std::__1::basic_string<char> &&'
| `-AlwaysInlineAttr 0x7fc980d44a68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d44c38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:994:5, col:88> col:19 assign 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc980d44ac0 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d44b30 <col:53, col:63> col:63 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d44ba0 <col:70, col:84> col:80 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7fc980d452a8 <line:995:5, line:1002:78> col:19 assign
| |-TemplateTypeParmDecl 0x7fc980d44cf8 <line:995:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fc980d45210 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1002:78> col:19 assign 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7fc980d45038 <col:26, col:38> col:38 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fc980d450a8 <col:43, col:53> col:53 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7fc980d45118 <col:60, col:74> col:70 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d454a8 <line:1003:5, col:62> col:19 assign 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc980d453a8 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fc980d45418 <col:49, col:59> col:59 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d455f8 <line:1004:5, col:47> col:19 assign 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| `-ParmVarDecl 0x7fc980d45570 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fc980d457b8 <line:1005:5, col:55> col:19 assign 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fc980d456b8 <col:26, col:36> col:36 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d45728 <col:41, col:52> col:52 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FunctionTemplateDecl 0x7fc980d45e28 <line:1006:5, line:1014:61> col:9 assign
| |-TemplateTypeParmDecl 0x7fc980d45870 <line:1006:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fc980d45d90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1014:61> col:9 assign 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value || !__libcpp_string_gets_noexcept_iterator<_InputIterator>::value, class basic_string<char> &>::type (_InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fc980d45c40 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x7fc980d45cb0 <col:40, col:55> col:55 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fc980d464a8 <line:1015:5, line:1023:65> col:9 assign
| |-TemplateTypeParmDecl 0x7fc980d45f10 <line:1015:14, col:20> col:20 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fc980d46410 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1023:65> col:9 assign 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && __libcpp_string_gets_noexcept_iterator<_ForwardIterator>::value, class basic_string<char> &>::type (_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fc980d462c0 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fc980d46330 <col:42, col:59> col:59 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fc980d466e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1026:103> col:19 assign 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fc980d46618 <col:26, col:55> col:55 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fc980d46790 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d46970 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1030:69> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fc980d467e8 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d46858 <col:44, col:64> col:64 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc980d46a28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d46c00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1032:113> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fc980d46a80 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d46af0 <col:44, col:56> col:56 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fc980d46cb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc980d47378 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1033:5, line:1040:96> col:19 insert
| |-TemplateTypeParmDecl 0x7fc980d46d00 <line:1033:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fc980d472e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1040:96> col:19 insert 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7fc980d47010 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fc980d470a8 <col:44, col:55> col:55 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fc980d47118 <col:60, col:70> col:70 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7fc980d47188 <col:78, col:92> col:88 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d47710 <line:1041:5, col:107> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc980d47480 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d474f0 <col:44, col:64> col:64 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d47560 <col:71, col:81> col:81 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d475d0 <col:89, col:103> col:99 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d47a00 <line:1042:5, col:79> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc980d477e8 <col:26, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d47858 <col:43, col:61> col:61 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fc980d478c8 <col:66, col:76> col:76 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d47c50 <line:1043:5, col:64> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fc980d47ad0 <col:26, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d47b40 <col:43, col:61> col:61 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fc980d47f30 <line:1044:5, col:72> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fc980d47d18 <col:26, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d47d88 <col:43, col:53> col:53 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d47df8 <col:58, col:69> col:69 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fc980d48180 <line:1045:5, col:62> col:19 insert 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fc980d48000 <col:26, col:41> col:41 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| `-ParmVarDecl 0x7fc980d48070 <col:48, col:59> col:59 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fc980d48460 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1047:77> col:19 insert 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fc980d48248 <col:26, col:41> col:41 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc980d482b8 <col:48, col:58> col:58 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d48328 <col:63, col:74> col:74 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-AlwaysInlineAttr 0x7fc980d48520 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc980d48ca8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1048:5, line:1056:83> col:9 insert
| |-TemplateTypeParmDecl 0x7fc980d48568 <line:1048:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fc980d48c10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1056:83> col:9 insert 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value || !__libcpp_string_gets_noexcept_iterator<_InputIterator>::value, iterator>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, _InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fc980d489f0 <col:16, col:31> col:31 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7fc980d48a60 <col:38, col:53> col:53 __first '_InputIterator'
|   `-ParmVarDecl 0x7fc980d48ad0 <col:62, col:77> col:77 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fc980d494b8 <line:1057:5, line:1065:87> col:9 insert
| |-TemplateTypeParmDecl 0x7fc980d48d98 <line:1057:14, col:20> col:20 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fc980d49420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1065:87> col:9 insert 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && __libcpp_string_gets_noexcept_iterator<_ForwardIterator>::value, iterator>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, _ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fc980d49200 <col:16, col:31> col:31 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7fc980d49270 <col:38, col:55> col:55 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fc980d492e0 <col:64, col:81> col:81 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fc980d497c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1069:69> line:1068:14 insert 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fc980d495b8 <col:21, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc980d496a8 <col:43, col:72> col:72 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fc980d49878 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d49a50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1072:5, col:66> col:19 erase 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc980d498d0 <col:25, col:43> col:35 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d49940 <col:46, col:62> col:56 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d49c20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1074:45> col:19 erase 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator)'
| |-ParmVarDecl 0x7fc980d49b18 <col:25, col:40> col:40 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| `-AlwaysInlineAttr 0x7fc980d49cd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d49eb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1076:70> col:19 erase 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator)'
| |-ParmVarDecl 0x7fc980d49d28 <col:25, col:40> col:40 __first 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc980d49d98 <col:49, col:64> col:64 __last 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| `-AlwaysInlineAttr 0x7fc980d49f68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d4a1d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1079:86> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fc980d49fc0 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d4a030 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d4a0a0 <col:61, col:81> col:81 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc980d4a290 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d4a500 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1081:137> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fc980d4a2e8 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d4a358 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d4a3c8 <col:61, col:73> col:73 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fc980d4a5c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d4a940 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1082:5, col:125> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc980d4a618 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d4a688 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d4a6f8 <col:61, col:81> col:81 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d4a768 <col:88, col:98> col:98 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d4a7d8 <col:106, col:121> col:116 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7fc980d4b118 <line:1083:5, line:1090:114> col:19 replace
| |-TemplateTypeParmDecl 0x7fc980d4aa10 <line:1083:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fc980d4b080 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1090:114> col:19 replace 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7fc980d4ad20 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fc980d4ad90 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fc980d4ae28 <col:61, col:72> col:72 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fc980d4ae98 <col:77, col:87> col:87 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7fc980d4af08 <col:95, col:110> col:105 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d4b4c0 <line:1091:5, col:97> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc980d4b228 <col:27, col:37> col:37 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d4b298 <col:44, col:54> col:54 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d4b308 <col:60, col:78> col:78 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc980d4b378 <col:83, col:93> col:93 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-NoSanitizeAttr 0x7fc980d4b588 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:453:69> unsigned-integer-overflow
|-CXXMethodDecl 0x7fc980d4b830 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1092:5, col:81> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fc980d4b618 <col:27, col:37> col:37 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d4b688 <col:44, col:54> col:54 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d4b6f8 <col:60, col:78> col:78 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fc980d4bb90 <line:1093:5, col:90> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fc980d4b900 <col:27, col:37> col:37 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d4b970 <col:44, col:54> col:54 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d4b9e0 <col:60, col:70> col:70 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d4ba50 <col:76, col:87> col:87 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-NoSanitizeAttr 0x7fc980d4bc58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:453:69> unsigned-integer-overflow
|-CXXMethodDecl 0x7fc980d4bf00 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1095:94> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fc980d4bce8 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc980d4bd58 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc980d4bdc8 <col:69, col:89> col:89 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc980d4bfc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d4ca38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1097:140> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fc980d4c018 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc980d4c088 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc980d4c0f8 <col:69, col:81> col:81 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fc980d4caf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d4cde0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1099:105> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc980d4cb50 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc980d4cbc0 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc980d4cc30 <col:69, col:87> col:87 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc980d4cca0 <col:92, col:102> col:102 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d4cea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d4d110 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1101:90> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fc980d4cf00 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc980d4cf70 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc980d4cfe0 <col:69, col:87> col:87 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-AlwaysInlineAttr 0x7fc980d4d1d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d4d4c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1103:98> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fc980d4d228 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc980d4d298 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc980d4d308 <col:69, col:79> col:79 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d4d378 <col:84, col:95> col:95 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-AlwaysInlineAttr 0x7fc980d4d588 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc980d4dc48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1104:5, line:1111:99> col:9 replace
| |-TemplateTypeParmDecl 0x7fc980d4d5d0 <line:1104:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fc980d4dbb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1111:99> col:9 replace 'typename enable_if<__is_input_iterator<_InputIterator>::value, class basic_string<char> &>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, _InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fc980d4d910 <col:17, col:32> col:32 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7fc980d4d980 <col:38, col:53> col:53 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7fc980d4d9f0 <col:59, col:74> col:74 __j1 '_InputIterator'
|   `-ParmVarDecl 0x7fc980d4da60 <col:80, col:95> col:95 __j2 '_InputIterator'
|-CXXMethodDecl 0x7fc980d4dfe0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1115:63> line:1114:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fc980d4dd50 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc980d4ddc0 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc980d4dea8 <col:69, col:98> col:98 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fc980d4e0a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d4e2f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1118:5, col:73> col:15 copy 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7fc980d4e128 <col:20, col:32> col:32 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc980d4e198 <col:37, col:47> col:47 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d4e208 <col:52, col:70> col:62 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d4e540 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1120:68> col:18 substr 'class std::__1::basic_string<char> (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7fc980d4e3c0 <col:25, col:43> col:35 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d4e430 <col:46, col:62> col:56 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d4e5f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d4e758 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1123:10 swap 'void (class std::__1::basic_string<char> &) noexcept'
| |-ParmVarDecl 0x7fc980d4e650 <col:15, col:29> col:29 __str 'class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc980d4e808 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d4e8a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1132:62> col:23 c_str 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d4e950 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d4e9c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1134:96> col:23 data 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d4ea68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d4eb38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1141:70> col:20 get_allocator 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d4ebe0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d4edc8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1144:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d4ec38 <col:20, col:40> col:40 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d4eca8 <col:47, col:65> col:57 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d4ee80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d4f028 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1146:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d4eed8 <col:20, col:32> col:32 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fc980d4ef48 <col:38, col:56> col:48 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d4f0e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d4f308 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1147:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1147:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d4f138 <col:20, col:38> col:38 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc980d4f1a8 <col:43, col:53> col:53 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d4f218 <col:60, col:70> col:70 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d4f528 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1149:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d4f3d8 <col:20, col:38> col:38 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc980d4f448 <col:43, col:61> col:53 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d4f5e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d4f788 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1150:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1150:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d4f638 <col:20, col:31> col:31 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-ParmVarDecl 0x7fc980d4f6a8 <col:36, col:54> col:46 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d4f958 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1153:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d4f850 <col:21, col:41> col:41 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d4f8c0 <col:48, col:66> col:58 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d4fa10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d4fb70 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1155:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d4fa68 <col:21, col:33> col:33 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fc980d4fad8 <col:39, col:57> col:49 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d4fc28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d4fe00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1156:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1156:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d4fc80 <col:21, col:39> col:39 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc980d4fcf0 <col:44, col:54> col:54 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d4fd60 <col:61, col:71> col:71 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d4ffd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1158:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d4fed0 <col:21, col:39> col:39 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc980d4ff40 <col:44, col:62> col:54 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d50090 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d501f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1159:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1159:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d500e8 <col:21, col:32> col:32 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-ParmVarDecl 0x7fc980d50158 <col:37, col:55> col:47 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d503c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1162:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d502b8 <col:29, col:49> col:49 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d50328 <col:56, col:74> col:66 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d50478 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d505d8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1164:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d504d0 <col:29, col:41> col:41 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fc980d50540 <col:47, col:65> col:57 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d50690 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d50868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1165:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1165:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d506e8 <col:29, col:47> col:47 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc980d50758 <col:52, col:62> col:62 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d507c8 <col:69, col:79> col:79 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d50a40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1167:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d50938 <col:29, col:47> col:47 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc980d509a8 <col:52, col:70> col:62 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d50af8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d50c58 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1169:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d50b50 <col:29, col:40> col:40 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7fc980d50bc0 <col:45, col:63> col:55 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d50d10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d50e70 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1172:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d50d68 <col:28, col:48> col:48 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d50dd8 <col:55, col:73> col:65 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d50f28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d51088 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1174:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d50f80 <col:28, col:40> col:40 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fc980d50ff0 <col:46, col:64> col:56 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d51140 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d51318 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1175:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1175:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d51198 <col:28, col:46> col:46 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc980d51208 <col:51, col:61> col:61 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d51278 <col:68, col:78> col:78 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d514f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1177:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d513e8 <col:28, col:46> col:46 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc980d51458 <col:51, col:69> col:61 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d515a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d51708 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1179:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d51600 <col:28, col:39> col:39 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7fc980d51670 <col:44, col:62> col:54 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d517c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d51920 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1182:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d51818 <col:33, col:53> col:53 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d51888 <col:60, col:78> col:70 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d519d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d51b38 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1184:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d51a30 <col:33, col:45> col:45 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fc980d51aa0 <col:51, col:69> col:61 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d51bf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d51dc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1185:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1185:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d51c48 <col:33, col:51> col:51 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc980d51cb8 <col:56, col:66> col:66 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d51d28 <col:73, col:83> col:83 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d51fa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1187:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d51e98 <col:33, col:51> col:51 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc980d51f08 <col:56, col:74> col:66 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d52058 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d521b8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1189:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d520b0 <col:33, col:44> col:44 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7fc980d52120 <col:49, col:67> col:59 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d52270 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d523d0 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1192:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d522c8 <col:32, col:52> col:52 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d52338 <col:59, col:77> col:69 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d52488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d525e8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1194:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d524e0 <col:32, col:44> col:44 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fc980d52550 <col:50, col:68> col:60 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d526a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d52878 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1195:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1195:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d526f8 <col:32, col:50> col:50 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc980d52768 <col:55, col:65> col:65 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d527d8 <col:72, col:82> col:82 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d52a50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1197:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d52948 <col:32, col:50> col:50 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc980d529b8 <col:55, col:73> col:65 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d52b08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d52c68 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1199:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc980d52b60 <col:32, col:43> col:43 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7fc980d52bd0 <col:48, col:66> col:58 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d52d20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d52e90 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1202:9 compare 'int (const class std::__1::basic_string<char> &) const noexcept'
| |-ParmVarDecl 0x7fc980d52d78 <col:17, col:37> col:37 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc980d52f40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d53070 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1204:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view) const noexcept'
| |-ParmVarDecl 0x7fc980d52f98 <col:17, col:29> col:29 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fc980d53120 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d53348 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1206:69> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view) const'
| |-ParmVarDecl 0x7fc980d53178 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d531e8 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d53258 <col:51, col:63> col:63 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fc980d53408 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d53678 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1208:78> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &) const'
| |-ParmVarDecl 0x7fc980d53460 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d534d0 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d53540 <col:51, col:71> col:71 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc980d53738 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d53ab8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1209:5, col:117> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7fc980d53790 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d53800 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d53870 <col:51, col:71> col:71 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d538e0 <col:78, col:88> col:88 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d53950 <col:96, col:111> col:106 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7fc980d54338 <line:1210:5, line:1217:106> col:9 compare
| |-TemplateTypeParmDecl 0x7fc980d53b88 <line:1210:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fc980d542a0 <line:1211:5, line:1217:106> col:9 compare 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, int>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const' inline
|   |-ParmVarDecl 0x7fc980d53f40 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fc980d53fb0 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fc980d54048 <col:51, col:62> col:62 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fc980d540b8 <col:67, col:77> col:77 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fc980d54128 <col:85, col:100> col:95 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-AlwaysInlineAttr 0x7fc980d543b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fc980d54560 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1218:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1218:9 compare 'int (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *) const noexcept'
| `-ParmVarDecl 0x7fc980d54490 <col:17, col:35> col:35 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fc980d547e8 <line:1219:5, col:74> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *) const'
| |-ParmVarDecl 0x7fc980d54620 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d54690 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d54700 <col:51, col:69> col:69 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fc980d54b08 <line:1220:5, col:90> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7fc980d548b8 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d54928 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d54998 <col:51, col:69> col:69 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fc980d54a08 <col:74, col:84> col:84 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d54bd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1222:51> col:36 __invariants '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fc980d54c78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d54cc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1226:63> line:1225:10 __is_long '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d54d68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7fc980d54db0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1237:1, col:8> col:1 private
|-CXXMethodDecl 0x7fc980d54e68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1240:31> line:1239:21 __alloc 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &(void) noexcept'
| `-AlwaysInlineAttr 0x7fc980d54f10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d54fb8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1243:31> line:1242:27 __alloc 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &(void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d55060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d55188 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1270:63> line:1266:10 __set_short_size 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fc980d550b8 <col:27, col:37> col:37 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d55238 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d552a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1278:47> line:1274:15 __get_short_size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d55350 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d55438 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1285:41> line:1284:10 __set_long_size 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fc980d553a8 <col:26, col:36> col:36 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d554e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d55558 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1288:42> line:1287:15 __get_long_size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d55600 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d556e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1291:76> line:1290:10 __set_size 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fc980d55658 <col:21, col:31> col:31 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d55798 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d55880 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1295:55> line:1294:10 __set_long_cap 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fc980d557f0 <col:25, col:35> col:35 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d55930 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d559a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1298:67> line:1297:15 __get_long_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d55a48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d55b68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1302:41> line:1301:10 __set_long_pointer 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer) noexcept'
| |-ParmVarDecl 0x7fc980d55aa0 <col:29, col:37> col:37 __p 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
| `-AlwaysInlineAttr 0x7fc980d55c18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d55ce8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1305:42> line:1304:13 __get_long_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer (void) noexcept'
| `-AlwaysInlineAttr 0x7fc980d55d90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d55e38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1308:42> line:1307:19 __get_long_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d55ee0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d55f50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1311:82> line:1310:13 __get_short_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer (void) noexcept'
| `-AlwaysInlineAttr 0x7fc980d55ff8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d56068 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1314:88> line:1313:19 __get_short_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d56110 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d56180 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1317:76> line:1316:13 __get_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer (void) noexcept'
| `-AlwaysInlineAttr 0x7fc980d56228 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d56298 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1320:76> line:1319:19 __get_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980d56340 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d56388 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1328:9> line:1323:10 __zero 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fc980d56430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc980d56670 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1330:5, line:1333:48> line:1332:19 __align_it
| |-NonTypeTemplateParmDecl 0x7fc980d56488 <line:1330:15, col:25> col:25 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long' depth 0 index 0 __a
| `-CXXMethodDecl 0x7fc980d565d8 <col:30, line:1333:48> line:1332:19 __align_it 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept' static
|   |-ParmVarDecl 0x7fc980d56508 <col:30, col:40> col:40 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-AlwaysInlineAttr 0x7fc980d566c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-EnumDecl 0x7fc980d56798 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1334:5> col:5
| `-EnumConstantDecl 0x7fc980d56860 <col:11, col:25> col:11 __alignment 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1334:5)'
|   `-ImplicitCastExpr 0x7fc980d568a8 <col:25> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7fc981335100 <col:25> 'int' 16
|-CXXMethodDecl 0x7fc980d56960 <line:1335:5, line:1339:79> line:1336:15 __recommend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept' static
| |-ParmVarDecl 0x7fc980d568d0 <col:27, col:37> col:37 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d56a10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d56c80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1341:5, line:1342:75> col:10 __init 'void (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
| |-ParmVarDecl 0x7fc980d56a68 <col:17, col:35> col:35 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc980d56ad8 <col:40, col:50> col:50 __sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d56b48 <col:56, col:66> col:66 __reserve 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d56e90 <line:1343:5, line:1344:54> col:10 __init 'void (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
| |-ParmVarDecl 0x7fc980d56d50 <col:17, col:35> col:35 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fc980d56dc0 <col:40, col:50> col:50 __sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d57058 <line:1345:5, line:1346:46> col:10 __init 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)' inline
| |-ParmVarDecl 0x7fc980d56f58 <col:17, col:27> col:27 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d56fc8 <col:32, col:43> col:43 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FunctionTemplateDecl 0x7fc980d57668 <line:1348:5, line:1355:57> col:5 __init
| |-TemplateTypeParmDecl 0x7fc980d57110 <line:1348:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fc980d575d0 <line:1349:5, line:1355:57> col:5 __init 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value, void>::type (_InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fc980d57440 <col:12, col:27> col:27 __first '_InputIterator'
|   `-ParmVarDecl 0x7fc980d574b0 <col:36, col:51> col:51 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fc980d57ca8 <line:1357:5, line:1364:61> col:5 __init
| |-TemplateTypeParmDecl 0x7fc980d57750 <line:1357:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fc980d57c10 <line:1358:5, line:1364:61> col:5 __init 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value, void>::type (_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fc980d57a80 <col:12, col:29> col:29 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fc980d57af0 <col:38, col:55> col:55 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fc980d58140 <line:1366:5, line:1367:85> line:1366:10 __grow_by 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc980d57da0 <col:20, col:30> col:30 __old_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d57e10 <col:41, col:51> col:51 __delta_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d57e80 <col:64, col:74> col:74 __old_sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d57ef0 <line:1367:20, col:30> col:30 __n_copy 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d57f60 <col:41, col:51> col:51 __n_del 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d57fd0 <col:64, col:84> col:74 __n_add 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc980d58660 <line:1368:5, line:1370:82> line:1368:10 __grow_by_and_replace 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fc980d58228 <col:32, col:42> col:42 __old_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d58298 <col:53, col:63> col:63 __delta_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d58308 <col:76, col:86> col:86 __old_sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d58378 <line:1369:32, col:42> col:42 __n_copy 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d583e8 <col:53, col:63> col:63 __n_del 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc980d58458 <line:1370:32, col:42> col:42 __n_add 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc980d584c8 <col:51, col:69> col:69 __p_new_stuff 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fc980d587d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1373:40> col:10 __erase_to_end 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc980d58750 <col:25, col:35> col:35 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d58888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d58968 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1378:89> line:1376:10 __copy_assign_alloc 'void (const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fc980d588e0 <col:30, col:50> col:50 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc980d58a18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d58be0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1405:9> line:1381:10 __copy_assign_alloc 'void (const class std::__1::basic_string<char> &, std::__1::true_type)'
| |-ParmVarDecl 0x7fc980d58a70 <col:30, col:50> col:50 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d58ad0 <col:57> col:66 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fc980d58c98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d58e68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1409:10> line:1408:10 __copy_assign_alloc 'void (const class std::__1::basic_string<char> &, std::__1::false_type) noexcept'
| |-ParmVarDecl 0x7fc980d58cf0 <col:30, col:48> col:49 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d58d50 <col:51> col:61 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7fc980d58f20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d59100 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1413:10 __move_assign 'void (class std::__1::basic_string<char> &, std::__1::false_type)' noexcept-uninstantiated 0x7fc981337a38
| |-ParmVarDecl 0x7fc980d58f78 <col:24, col:38> col:38 __str 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d58fd8 <col:45> col:55 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7fc980d59210 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d593f0 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1416:10 __move_assign 'void (class std::__1::basic_string<char> &, std::__1::true_type)' noexcept-uninstantiated 0x7fc981337d08
| |-ParmVarDecl 0x7fc980d59268 <col:24, col:38> col:38 __str 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d592c8 <col:45> col:54 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fc980d59500 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d59630 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1431:89> line:1426:5 __move_assign_alloc 'void (class std::__1::basic_string<char> &)' noexcept-uninstantiated 0x7fc981337f18
| |-ParmVarDecl 0x7fc980d59558 <col:25, col:39> col:39 __str 'class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc980d59728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d598c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1438:9> line:1434:10 __move_assign_alloc 'void (class std::__1::basic_string<char> &, std::__1::true_type)' noexcept-uninstantiated 0x7fc981338158
| |-ParmVarDecl 0x7fc980d59780 <col:30, col:44> col:44 __c 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d597e0 <col:49> col:58 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fc980d599d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d59b68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1443:10> line:1441:10 __move_assign_alloc 'void (class std::__1::basic_string<char> &, std::__1::false_type) noexcept'
| |-ParmVarDecl 0x7fc980d59a28 <col:30, col:42> col:43 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc980d59a88 <col:45> col:55 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7fc980d59c20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d59c68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1445:63> col:36 __invalidate_all_iterators 'void (void)'
| `-AlwaysInlineAttr 0x7fc980d59d10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980d59df0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1446:73> col:36 __invalidate_iterators_past 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc980d59d68 <col:64> col:73 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc980d59ea0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FriendDecl 0x7fc980d5aa40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1448:5, col:77> col:25
| `-FunctionDecl 0x7fc980d5a040 parent 0x7fc9811c5bd8 prev 0x7fc980d5a7e0 <col:5, col:77> col:25 operator+ 'class std::__1::basic_string<char> (const class std::__1::basic_string<char> &, const class std::__1::basic_string<char> &)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7fc980d59ef8 <col:37, col:55> col:56 'const class std::__1::basic_string<char> &'
|   `-ParmVarDecl 0x7fc980d59f68 <col:58, col:76> col:77 'const class std::__1::basic_string<char> &'
|-FriendDecl 0x7fc980d5b508 <line:1449:5, col:75> col:25
| `-FunctionDecl 0x7fc980d5ac10 parent 0x7fc9811c5bd8 prev 0x7fc980d5b2e0 <col:5, col:75> col:25 operator+ 'class std::__1::basic_string<char> (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, const class std::__1::basic_string<char> &)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7fc980d5aa88 <col:37, col:53> col:54 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|   `-ParmVarDecl 0x7fc980d5aaf8 <col:56, col:74> col:75 'const class std::__1::basic_string<char> &'
|-FriendDecl 0x7fc980d5bf90 <line:1450:5, col:68> col:25
| `-FunctionDecl 0x7fc980d5b6d0 parent 0x7fc9811c5bd8 prev 0x7fc980d5bda0 <col:5, col:68> col:25 operator+ 'class std::__1::basic_string<char> (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, const class std::__1::basic_string<char> &)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7fc980d5b550 <col:37> col:47 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|   `-ParmVarDecl 0x7fc980d5b5c0 <col:49, col:67> col:68 'const class std::__1::basic_string<char> &'
|-FriendDecl 0x7fc980d5da60 <line:1451:5, col:75> col:25
| `-FunctionDecl 0x7fc980d5c160 parent 0x7fc9811c5bd8 prev 0x7fc980d5c890 <col:5, col:75> col:25 operator+ 'class std::__1::basic_string<char> (const class std::__1::basic_string<char> &, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7fc980d5bfd8 <col:37, col:55> col:56 'const class std::__1::basic_string<char> &'
|   `-ParmVarDecl 0x7fc980d5c048 <col:58, col:74> col:75 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
`-FriendDecl 0x7fc980d5e4f0 <line:1452:5, col:68> col:25
  `-FunctionDecl 0x7fc980d5dc30 parent 0x7fc9811c5bd8 prev 0x7fc980d5e360 <col:5, col:68> col:25 operator+ 'class std::__1::basic_string<char> (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
    |-TemplateArgument type 'char'
    |-TemplateArgument type 'struct std::__1::char_traits<char>'
    |-TemplateArgument type 'class std::__1::allocator<char>'
    |-ParmVarDecl 0x7fc980d5daa8 <col:37, col:55> col:56 'const class std::__1::basic_string<char> &'
    `-ParmVarDecl 0x7fc980d5db18 <col:58> col:68 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_string" = type { %"class.std::__1::__compressed_pair" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_string" = type { %"class.std::__1::__compressed_pair" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc980e5d410 <object_model/8_memory_model/02_objects_memory_locations_and_concurrency.cpp:5:1, line:16:1> line:5:8 referenced struct D definition
|-CXXRecordDecl 0x7fc980e5d538 <col:1, col:8> col:8 implicit struct D
|-FieldDecl 0x7fc980e5d5e8 <line:6:5, col:9> col:9 i 'int'
|-FieldDecl 0x7fc980e5d648 <line:7:5, col:12> col:12 d 'double'
|-FieldDecl 0x7fc980e5d6c8 <line:8:5, col:18> col:14 bf1 'unsigned int'
| `-IntegerLiteral 0x7fc980e5d690 <col:18> 'int' 10
|-FieldDecl 0x7fc980e5d748 <line:9:5, col:13> col:9 bf2 'int'
| `-IntegerLiteral 0x7fc980e5d710 <col:13> 'int' 25
|-FieldDecl 0x7fc980e5d7c8 <line:10:5, col:13> col:9 bf3 'int'
| `-IntegerLiteral 0x7fc980e5d790 <col:13> 'int' 1
|-FieldDecl 0x7fc980e5d848 <line:11:5, col:13> col:9 bf4 'int'
| `-IntegerLiteral 0x7fc980e5d810 <col:13> 'int' 9
|-FieldDecl 0x7fc980e5d8a8 <line:12:5, col:9> col:9 i2 'int'
|-FieldDecl 0x7fc980e5d900 <line:13:5, col:10> col:10 c1 'char'
|-FieldDecl 0x7fc980e5d958 <line:14:5, col:10> col:10 c2 'char'
|-FieldDecl 0x7fc980e5da20 <line:15:5, col:17> col:17 s 'std::string':'class std::__1::basic_string<char>'
|-CXXConstructorDecl 0x7fc980e5dab8 <line:5:8> col:8 implicit D 'void (struct D &&)' inline default noexcept-unevaluated 0x7fc980e5dab8
| `-ParmVarDecl 0x7fc980e5dbe0 <col:8> col:8 'struct D &&'
|-CXXMethodDecl 0x7fc980e5dc78 <col:8, <invalid sloc>> col:8 implicit operator= 'struct D &(struct D &&)' inline default noexcept-unevaluated 0x7fc980e5dc78
| `-ParmVarDecl 0x7fc980e5dd90 <col:8> col:8 'struct D &&'
`-CXXDestructorDecl 0x7fc980e5de18 <col:8> col:8 implicit ~D 'void (void)' inline default noexcept-unevaluated 0x7fc980e5de18

Layout: <CGRecordLayout
  LLVMType:%struct.D = type { i32, double, i16, i32, i16, i32, i8, i8, %"class.std::__1::basic_string" }
  NonVirtualBaseLLVMType:%struct.D = type { i32, double, i16, i32, i16, i32, i8, i8, %"class.std::__1::basic_string" }
  IsZeroInitializable:1
  BitFields:[
    <CGBitFieldInfo Offset:0 Size:10 IsSigned:0 StorageSize:16 StorageOffset:16>
    <CGBitFieldInfo Offset:0 Size:25 IsSigned:1 StorageSize:32 StorageOffset:20>
    <CGBitFieldInfo Offset:25 Size:1 IsSigned:1 StorageSize:32 StorageOffset:20>
    <CGBitFieldInfo Offset:0 Size:9 IsSigned:1 StorageSize:16 StorageOffset:24>
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc980e5f9f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:890:1, line:993:1> line:891:8 struct __atomic_base definition
|-TemplateArgument type 'struct D *'
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7fc980e5fc30 prev 0x7fc980e5f9f8 <col:1, col:8> col:8 implicit struct __atomic_base
|-FieldDecl 0x7fc980e5fd40 <line:893:5, col:26> col:26 __a_ '_Atomic(struct D *)' mutable
|-CXXMethodDecl 0x7fc980e5fd88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:907:5> line:900:10 is_lock_free '_Bool (void) const volatile noexcept'
| `-AlwaysInlineAttr 0x7fc980e5fe58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980e5fea0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:910:82> line:909:10 is_lock_free '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980e5ff48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980e60118 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:914:46> line:912:10 store 'void (struct D *, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fc980e5ffa0 <col:16, col:20> col:20 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc980e60000 <col:25, col:44> col:38 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fc980e601d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fc980e61120 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fc980e60118 'store' 'void (struct D *, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7fc980e610f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:913:40, line:566:35> '_Bool' '||'
|     |-BinaryOperator 0x7fc980e60be8 <line:913:40, line:565:35> '_Bool' '||'
|     | |-BinaryOperator 0x7fc980e606d8 <line:913:40, line:564:35> '_Bool' '=='
|     | | |-ImplicitCastExpr 0x7fc980e606a8 <line:913:40> 'int' <IntegralCast>
|     | | | `-ImplicitCastExpr 0x7fc980e60690 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | | |   `-DeclRefExpr 0x7fc980e60218 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc980e60000 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | | `-ImplicitCastExpr 0x7fc980e606c0 <line:564:35> 'int' <IntegralCast>
|     | |   `-DeclRefExpr 0x7fc9818418d8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc981837338 'memory_order_consume' 'enum std::__1::memory_order'
|     | `-BinaryOperator 0x7fc980e60bc0 <line:913:40, line:565:35> '_Bool' '=='
|     |   |-ImplicitCastExpr 0x7fc980e60b90 <line:913:40> 'int' <IntegralCast>
|     |   | `-ImplicitCastExpr 0x7fc980e60b78 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     |   |   `-DeclRefExpr 0x7fc980e60700 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc980e60000 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     |   `-ImplicitCastExpr 0x7fc980e60ba8 <line:565:35> 'int' <IntegralCast>
|     |     `-DeclRefExpr 0x7fc981841998 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc981837380 'memory_order_acquire' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fc980e610d0 <line:913:40, line:566:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fc980e610a0 <line:913:40> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fc980e61088 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fc980e60c10 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc980e60000 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fc980e610b8 <line:566:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fc981841a80 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc981837410 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fc980e61318 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:918:46> line:916:10 store 'void (struct D *, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fc980e611a0 <col:16, col:20> col:20 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc980e61200 <col:25, col:44> col:38 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fc980e613d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fc980e62320 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fc980e61318 'store' 'void (struct D *, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7fc980e622f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:917:40, line:566:35> '_Bool' '||'
|     |-BinaryOperator 0x7fc980e61de8 <line:917:40, line:565:35> '_Bool' '||'
|     | |-BinaryOperator 0x7fc980e618d8 <line:917:40, line:564:35> '_Bool' '=='
|     | | |-ImplicitCastExpr 0x7fc980e618a8 <line:917:40> 'int' <IntegralCast>
|     | | | `-ImplicitCastExpr 0x7fc980e61890 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | | |   `-DeclRefExpr 0x7fc980e61418 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc980e61200 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | | `-ImplicitCastExpr 0x7fc980e618c0 <line:564:35> 'int' <IntegralCast>
|     | |   `-DeclRefExpr 0x7fc981841ce0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc981837338 'memory_order_consume' 'enum std::__1::memory_order'
|     | `-BinaryOperator 0x7fc980e61dc0 <line:917:40, line:565:35> '_Bool' '=='
|     |   |-ImplicitCastExpr 0x7fc980e61d90 <line:917:40> 'int' <IntegralCast>
|     |   | `-ImplicitCastExpr 0x7fc980e61d78 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     |   |   `-DeclRefExpr 0x7fc980e61900 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc980e61200 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     |   `-ImplicitCastExpr 0x7fc980e61da8 <line:565:35> 'int' <IntegralCast>
|     |     `-DeclRefExpr 0x7fc981841da0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc981837380 'memory_order_acquire' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fc980e622d0 <line:917:40, line:566:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fc980e622a0 <line:917:40> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fc980e62288 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fc980e61e10 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc980e61200 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fc980e622b8 <line:566:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fc981841e88 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc981837410 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fc980e62498 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:922:47> line:920:9 load 'struct D *(std::__1::memory_order) const volatile noexcept'
| |-ParmVarDecl 0x7fc980e62390 <col:14, col:33> col:27 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fc980e62548 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fc980e62f88 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fc980e62498 'load' 'struct D *(std::__1::memory_order) const volatile noexcept'
|   `-BinaryOperator 0x7fc980e62f60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:921:39, line:571:35> '_Bool' '||'
|     |-BinaryOperator 0x7fc980e62a50 <line:921:39, line:570:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fc980e62a20 <line:921:39> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fc980e62a08 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fc980e62590 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc980e62390 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fc980e62a38 <line:570:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fc981842070 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc9818373c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fc980e62f38 <line:921:39, line:571:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fc980e62f08 <line:921:39> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fc980e62ef0 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fc980e62a78 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc980e62390 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fc980e62f20 <line:571:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fc981842130 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc981837410 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fc980e63108 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:926:47> line:924:9 load 'struct D *(std::__1::memory_order) const noexcept'
| |-ParmVarDecl 0x7fc980e62ff8 <col:14, col:33> col:27 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fc980e631b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fc980e63bf8 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fc980e63108 'load' 'struct D *(std::__1::memory_order) const noexcept'
|   `-BinaryOperator 0x7fc980e63bd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:925:39, line:571:35> '_Bool' '||'
|     |-BinaryOperator 0x7fc980e636c0 <line:925:39, line:570:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fc980e63690 <line:925:39> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fc980e63678 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fc980e63200 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc980e62ff8 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fc980e636a8 <line:570:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fc981842318 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc9818373c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fc980e63ba8 <line:925:39, line:571:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fc980e63b78 <line:925:39> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fc980e63b60 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fc980e636e8 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc980e62ff8 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fc980e63b90 <line:571:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fc9818423d8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc981837410 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXConversionDecl 0x7fc980e63d28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:928:60> col:5 operator D * 'struct D *(void) const volatile noexcept'
| `-AlwaysInlineAttr 0x7fc980e63dd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConversionDecl 0x7fc980e63eb8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:930:60> col:5 operator D * 'struct D *(void) const noexcept'
| `-AlwaysInlineAttr 0x7fc980e63f60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980e64148 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:933:56> line:932:9 exchange 'struct D *(struct D *, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fc980e63fc8 <col:18, col:22> col:22 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc980e64028 <col:27, col:46> col:40 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fc980e64200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980e643d8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:936:56> line:935:9 exchange 'struct D *(struct D *, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fc980e64258 <col:18, col:22> col:22 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc980e642b8 <col:27, col:46> col:40 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fc980e64490 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc980e647c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:941:80> line:938:10 compare_exchange_weak '_Bool (struct D *&, struct D *, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fc980e64548 <col:32, col:37> col:37 __e 'struct D *&'
| |-ParmVarDecl 0x7fc980e645b8 <col:42, col:46> col:46 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc980e64618 <line:939:32, col:45> col:45 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fc980e64678 <col:50, col:63> col:63 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fc980e64890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fc980e652d0 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fc980e647c8 'compare_exchange_weak' '_Bool (struct D *&, struct D *, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7fc980e652a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:940:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fc980e64d98 <line:940:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fc980e64d68 <line:940:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fc980e64d50 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fc980e648d8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc980e64678 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fc980e64d80 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fc9818495c0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc9818373c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fc980e65280 <line:940:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fc980e65250 <line:940:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fc980e65238 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fc980e64dc0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc980e64678 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fc980e65268 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fc981849680 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc981837410 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fc980e655c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:946:80> line:943:10 compare_exchange_weak '_Bool (struct D *&, struct D *, std::__1::memory_order, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fc980e65350 <col:32, col:37> col:37 __e 'struct D *&'
| |-ParmVarDecl 0x7fc980e653c0 <col:42, col:46> col:46 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc980e65420 <line:944:32, col:45> col:45 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fc980e65480 <col:50, col:63> col:63 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fc980e65690 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fc982aa44f8 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fc980e655c8 'compare_exchange_weak' '_Bool (struct D *&, struct D *, std::__1::memory_order, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7fc982aa44d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:945:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fc980e65b98 <line:945:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fc980e65b68 <line:945:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fc980e65b50 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fc980e656d8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc980e65480 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fc980e65b80 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fc981849868 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc9818373c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fc982aa44a8 <line:945:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fc982aa4478 <line:945:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fc982aa4460 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fc980e65bc0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc980e65480 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fc982aa4490 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fc981849928 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc981837410 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fc982aa4750 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:951:82> line:948:10 compare_exchange_strong '_Bool (struct D *&, struct D *, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fc982aa4578 <col:34, col:39> col:39 __e 'struct D *&'
| |-ParmVarDecl 0x7fc982aa45e8 <col:44, col:48> col:48 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc982aa4648 <line:949:34, col:47> col:47 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fc982aa46a8 <col:52, col:65> col:65 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fc982aa4818 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fc982aa5258 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fc982aa4750 'compare_exchange_strong' '_Bool (struct D *&, struct D *, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7fc982aa5230 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:950:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fc982aa4d20 <line:950:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fc982aa4cf0 <line:950:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fc982aa4cd8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fc982aa4860 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc982aa46a8 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fc982aa4d08 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fc981849b10 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc9818373c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fc982aa5208 <line:950:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fc982aa51d8 <line:950:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fc982aa51c0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fc982aa4d48 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc982aa46a8 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fc982aa51f0 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fc981849bd0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc981837410 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fc982aa54b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:956:82> line:953:10 compare_exchange_strong '_Bool (struct D *&, struct D *, std::__1::memory_order, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fc982aa52d8 <col:34, col:39> col:39 __e 'struct D *&'
| |-ParmVarDecl 0x7fc982aa5348 <col:44, col:48> col:48 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc982aa53a8 <line:954:34, col:47> col:47 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fc982aa5408 <col:52, col:65> col:65 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fc982aa5578 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fc982aa5fb8 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fc982aa54b0 'compare_exchange_strong' '_Bool (struct D *&, struct D *, std::__1::memory_order, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7fc982aa5f90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:955:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fc982aa5a80 <line:955:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fc982aa5a50 <line:955:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fc982aa5a38 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fc982aa55c0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc982aa5408 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fc982aa5a68 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fc981849db8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc9818373c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fc982aa5f68 <line:955:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fc982aa5f38 <line:955:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fc982aa5f20 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fc982aa5aa8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc982aa5408 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fc982aa5f50 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fc981849e78 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc981837410 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fc982aa6248 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:960:80> line:958:10 compare_exchange_weak '_Bool (struct D *&, struct D *, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fc982aa6038 <col:32, col:37> col:37 __e 'struct D *&'
| |-ParmVarDecl 0x7fc982aa60a8 <col:42, col:46> col:46 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc982aa6108 <line:959:31, col:50> col:44 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fc982aa6308 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc982aa6568 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:964:80> line:962:10 compare_exchange_weak '_Bool (struct D *&, struct D *, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fc982aa6360 <col:32, col:37> col:37 __e 'struct D *&'
| |-ParmVarDecl 0x7fc982aa63d0 <col:42, col:46> col:46 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc982aa6430 <line:963:32, col:51> col:45 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fc982aa6628 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc982aa67f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:968:82> line:966:10 compare_exchange_strong '_Bool (struct D *&, struct D *, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fc982aa6680 <col:34, col:39> col:39 __e 'struct D *&'
| |-ParmVarDecl 0x7fc982aa66f0 <col:44, col:48> col:48 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc982aa6750 <line:967:31, col:50> col:44 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fc982aa68b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc982aa6a78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:972:82> line:970:10 compare_exchange_strong '_Bool (struct D *&, struct D *, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fc982aa6908 <col:34, col:39> col:39 __e 'struct D *&'
| |-ParmVarDecl 0x7fc982aa6978 <col:44, col:48> col:48 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc982aa69d8 <line:971:34, col:53> col:47 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fc982aa6b38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc982aa6bc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:976:39> col:5 __atomic_base 'void (void) noexcept' default trivial
| `-AlwaysInlineAttr 0x7fc982aa6c78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc982aa6df8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:982:69> col:23 used constexpr __atomic_base 'void (struct D *) noexcept'
| |-ParmVarDecl 0x7fc982aa6cd0 <col:37, col:41> col:41 used __d 'struct D *':'struct D *'
| |-CXXCtorInitializer Field 0x7fc980e5fd40 '__a_' '_Atomic(struct D *)'
| | `-ImplicitCastExpr 0x7fc982aaa578 <col:63> '_Atomic(struct D *)' <NonAtomicToAtomic>
| |   `-ImplicitCastExpr 0x7fc982aaa560 <col:63> 'struct D *':'struct D *' <LValueToRValue>
| |     `-DeclRefExpr 0x7fc982aaa508 <col:63> 'struct D *':'struct D *' lvalue ParmVar 0x7fc982aa6cd0 '__d' 'struct D *':'struct D *'
| |-CompoundStmt 0x7fc9818433d8 <col:68, col:69>
| `-AlwaysInlineAttr 0x7fc982aa6eb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc982aa7020 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:984:5, col:48> col:5 __atomic_base 'void (const struct std::__1::__atomic_base<struct D *, false> &)' delete trivial
| `-ParmVarDecl 0x7fc982aa6f38 <col:19, col:38> col:39 'const struct std::__1::__atomic_base<struct D *, false> &'
|-CXXMethodDecl 0x7fc982aa71e0 <line:985:5, col:59> col:20 operator= 'struct std::__1::__atomic_base<struct D *, false> &(const struct std::__1::__atomic_base<struct D *, false> &)' delete trivial
| `-ParmVarDecl 0x7fc982aa7118 <col:30, col:49> col:50 'const struct std::__1::__atomic_base<struct D *, false> &'
|-CXXMethodDecl 0x7fc982aa7360 <line:986:5, col:68> col:20 operator= 'struct std::__1::__atomic_base<struct D *, false> &(const struct std::__1::__atomic_base<struct D *, false> &) volatile' delete trivial
| `-ParmVarDecl 0x7fc982aa72a0 <col:30, col:49> col:50 'const struct std::__1::__atomic_base<struct D *, false> &'
`-CXXDestructorDecl 0x7fc982aaa368 <line:891:8> col:8 implicit ~__atomic_base 'void (void)' inline default trivial noexcept-unevaluated 0x7fc982aaa368

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__atomic_base" = type { %struct.D* }
  NonVirtualBaseLLVMType:%"struct.std::__1::__atomic_base" = type { %struct.D* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc980e5df58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1103:1, line:1159:1> line:1104:8 struct atomic definition
|-public '__atomic_base<struct D *>':'struct std::__1::__atomic_base<struct D *, false>'
|-TemplateArgument type 'struct D *'
|-CXXRecordDecl 0x7fc982aa7498 prev 0x7fc980e5df58 <col:1, col:8> col:8 implicit struct atomic
|-TypedefDecl 0x7fc982aa7838 <line:1107:5, col:33> col:33 __base '__atomic_base<struct D *>':'struct std::__1::__atomic_base<struct D *, false>'
| `-TemplateSpecializationType 0x7fc982aa77c0 '__atomic_base<struct D *>' sugar __atomic_base
|   |-TemplateArgument type 'struct D *'
|   `-RecordType 0x7fc980e5fb00 'struct std::__1::__atomic_base<struct D *, false>'
|     `-ClassTemplateSpecialization 0x7fc980e5f9f8 '__atomic_base'
|-CXXConstructorDecl 0x7fc982aa78d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:818:33> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1109:5 atomic 'void (void)' default trivial noexcept-unevaluated 0x7fc982aa78d0
