
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__scalar_hash<struct std::__1::_PairT, 2> (empty)
         0 |   struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1509:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1000000000, 1>, false, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_mutex_t
         0 |   long __sig
         8 |   char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_cond_t
         0 |   long __sig
         8 |   char [40] __opaque
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1, 1>, true, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct _opaque_pthread_t *, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::hash<struct _opaque_pthread_t *> (empty)
         0 |   struct std::__1::unary_function<struct _opaque_pthread_t *, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__thread_struct
         0 |   class std::__1::__thread_struct_imp * __p_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<unsigned long, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__atomic_base<struct D *, false>
         0 |   _Atomic(struct D *) __a_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::atomic<struct D *>
         0 |   struct std::__1::__atomic_base<struct D *, false> (base)
         0 |     _Atomic(struct D *) __a_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__basic_string_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (empty)
         0 |   class std::__1::allocator<char> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<char>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |       class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct D
         0 |   int i
         8 |   double d
    16:0-9 |   unsigned int bf1
   20:0-24 |   int bf2
    23:1-1 |   int bf3
    24:0-8 |   int bf4
        28 |   int i2
        32 |   char c1
        33 |   char c2
        40 |   class std::__1::basic_string<char> s
        40 |     class std::__1::__basic_string_common<true> (base) (empty)
        40 |     class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
        40 |       struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
        40 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
        40 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
        40 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
        40 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
        48 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        56 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
        40 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
        40 |               union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
        40 |                 unsigned char __size_
        40 |                 std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
        41 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
        40 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
        40 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
        40 |       struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
        40 |         class std::__1::allocator<char> (base) (empty)
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc41419f678 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:585:90> col:64 class __basic_string_common definition
|-TemplateArgument integral 1
|-VisibilityAttr 0x7fc4141b7010 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fc4141b70c0 prev 0x7fc41419f678 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:560:1, col:28> col:28 implicit class __basic_string_common
|-AccessSpecDecl 0x7fc4141b7158 <line:562:1, col:10> col:1 protected
|-CXXMethodDecl 0x7fc4141b7180 <line:563:22, col:50> col:27 __throw_length_error 'void (void) const'
| `-CXX11NoReturnAttr 0x7fc4141b7258 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
|-CXXMethodDecl 0x7fc4141b72a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:564:22, col:50> col:27 __throw_out_of_range 'void (void) const'
| `-CXX11NoReturnAttr 0x7fc4141b7348 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
`-CXXDestructorDecl 0x7fc413604390 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:585:64> col:64 implicit ~__basic_string_common 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc4135d1690 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:701:5, line:706:5> line:701:12 struct __long definition
|-CXXRecordDecl 0x7fc4135d1b08 prev 0x7fc4135d1690 <col:5, col:12> col:12 implicit struct __long
|-FieldDecl 0x7fc4135d1bd0 <line:703:9, col:19> col:19 __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7fc4135d1c28 <line:704:9, col:19> col:19 __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7fc4135d1c80 <line:705:9, col:19> col:19 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
`-CXXDestructorDecl 0x7fc413604708 <line:701:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc4135d2548 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9, line:725:9> line:721:9 union definition
|-FieldDecl 0x7fc4135d26c8 <line:723:13, col:27> col:27 __size_ 'unsigned char'
|-FieldDecl 0x7fc4135d2720 <line:724:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
`-CXXDestructorDecl 0x7fc413604b68 <line:721:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon.0 = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc4135d2060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:5, line:727:5> line:719:12 struct __short definition
|-CXXRecordDecl 0x7fc4135d24b0 prev 0x7fc4135d2060 <col:5, col:12> col:12 implicit struct __short
|-CXXRecordDecl 0x7fc4135d2548 <line:721:9, line:725:9> line:721:9 union definition
| |-FieldDecl 0x7fc4135d26c8 <line:723:13, col:27> col:27 __size_ 'unsigned char'
| |-FieldDecl 0x7fc4135d2720 <line:724:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-CXXDestructorDecl 0x7fc413604b68 <line:721:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7fc4135d2788 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
|-IndirectFieldDecl 0x7fc4135d27e0 <line:723:27> col:27 implicit __size_ 'unsigned char'
| |-Field 0x7fc4135d2788 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| `-Field 0x7fc4135d26c8 '__size_' 'unsigned char'
|-IndirectFieldDecl 0x7fc4135d2830 <line:724:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-Field 0x7fc4135d2788 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| `-Field 0x7fc4135d2720 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FieldDecl 0x7fc4135d28f8 <line:726:9, col:37> col:20 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
`-CXXDestructorDecl 0x7fc4136047e8 <line:719:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc4135d2cf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:735:5, line:738:5> line:735:12 struct __raw definition
|-CXXRecordDecl 0x7fc4135d3750 prev 0x7fc4135d2cf8 <col:5, col:12> col:12 implicit struct __raw
|-FieldDecl 0x7fc4135d38a8 <line:737:9, col:36> col:19 __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
`-CXXDestructorDecl 0x7fc4136048c8 <line:735:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc4135d34a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9, line:747:9> line:742:9 union definition
|-FieldDecl 0x7fc4135d3638 <line:744:13, col:21> col:21 __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-FieldDecl 0x7fc4135d3690 <line:745:13, col:21> col:21 __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-FieldDecl 0x7fc4135d3910 <line:746:13, col:21> col:21 __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
`-CXXDestructorDecl 0x7fc413604a88 <line:742:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc4135d2dc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:5, line:748:5> line:740:12 struct __rep definition
|-CXXRecordDecl 0x7fc4135d3410 prev 0x7fc4135d2dc0 <col:5, col:12> col:12 implicit struct __rep
|-CXXRecordDecl 0x7fc4135d34a8 <line:742:9, line:747:9> line:742:9 union definition
| |-FieldDecl 0x7fc4135d3638 <line:744:13, col:21> col:21 __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-FieldDecl 0x7fc4135d3690 <line:745:13, col:21> col:21 __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-FieldDecl 0x7fc4135d3910 <line:746:13, col:21> col:21 __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| `-CXXDestructorDecl 0x7fc413604a88 <line:742:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7fc4135d3978 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
|-IndirectFieldDecl 0x7fc4135d39d0 <line:744:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-Field 0x7fc4135d3978 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| `-Field 0x7fc4135d3638 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-IndirectFieldDecl 0x7fc4135d3a20 <line:745:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-Field 0x7fc4135d3978 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| `-Field 0x7fc4135d3690 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-IndirectFieldDecl 0x7fc4135d3a70 <line:746:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-Field 0x7fc4135d3978 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| `-Field 0x7fc4135d3910 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
`-CXXDestructorDecl 0x7fc413604628 <line:740:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc4135d41c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2034:1, line:2067:1> line:2037:8 struct __compressed_pair_elem definition
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument integral 0
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7fc4135d4440 prev 0x7fc4135d41c0 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7fc4135d44e8 <line:2038:3, col:15> col:15 _ParamT 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-SubstTemplateTypeParmType 0x7fc4135d3120 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|   |-TemplateTypeParmType 0x7fc412af7f80 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fc412af7f38 '_Tp'
|   `-RecordType 0x7fc4135d2e60 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|     `-CXXRecord 0x7fc4135d2dc0 '__rep'
|-TypedefDecl 0x7fc4135d45a8 <line:2039:3, col:16> col:16 referenced reference 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
| `-LValueReferenceType 0x7fc4135d4570 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
|   `-SubstTemplateTypeParmType 0x7fc4135d3120 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|     |-TemplateTypeParmType 0x7fc412af7f80 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fc412af7f38 '_Tp'
|     `-RecordType 0x7fc4135d2e60 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|       `-CXXRecord 0x7fc4135d2dc0 '__rep'
|-TypedefDecl 0x7fc4135d4668 <line:2040:3, col:22> col:22 referenced const_reference 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
| `-LValueReferenceType 0x7fc4135d4630 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
|   `-QualType 0x7fc4135d3121 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' const
|     `-SubstTemplateTypeParmType 0x7fc4135d3120 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|       |-TemplateTypeParmType 0x7fc412af7f80 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fc412af7f38 '_Tp'
|       `-RecordType 0x7fc4135d2e60 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|         `-CXXRecord 0x7fc4135d2dc0 '__rep'
|-CXXConstructorDecl 0x7fc4135d4700 <line:2043:3, col:52> col:13 constexpr __compressed_pair_elem 'void (void)'
|-FunctionTemplateDecl 0x7fc4135d4ee8 <line:2045:3, line:2050:44> line:2049:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fc4135d47b8 <line:2045:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fc4135d4828 <col:24, line:2047:6> line:2045:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<struct __rep, 0, false>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7fc4135d4e40 <line:2048:3, line:2050:44> line:2049:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7fc4135d4d58 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7fc4135d5518 <line:2052:3, line:2056:75> line:2054:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fc4135d4fc8 <line:2052:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7fc4135d5038 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7fc4135d5470 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2056:75> line:2054:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7fc4135d50b0 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fc4135d5218 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7fc4135d5368 <line:2055:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7fc4135d55a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135d5728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2062:3, col:50> col:13 __get 'std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>::reference (void) noexcept'
|-CXXMethodDecl 0x7fc4135d5878 <line:2063:3, col:62> col:19 __get 'std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>::const_reference (void) const noexcept'
|-AccessSpecDecl 0x7fc4135d5920 <line:2065:1, col:8> col:1 private
|-FieldDecl 0x7fc4135d5958 <line:2066:3, col:7> col:7 __value_ 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
`-CXXDestructorDecl 0x7fc413604548 <line:2037:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc413138878 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:101:1, col:52> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28 class allocator definition
|-TemplateArgument type 'char'
|-CXXRecordDecl 0x7fc4135bbf88 prev 0x7fc413138878 <col:1, col:28> col:28 implicit class allocator
|-AccessSpecDecl 0x7fc4135bc020 <line:1722:1, col:7> col:1 public
|-TypedefDecl 0x7fc4135bc048 <line:1723:5, col:31> col:31 referenced size_type 'size_t':'unsigned long'
| `-TypedefType 0x7fc413059a10 'size_t' sugar
|   |-Typedef 0x7fc4128691b0 'size_t'
|   `-BuiltinType 0x7fc412833c80 'unsigned long'
|-TypedefDecl 0x7fc4135bc0a0 <line:1724:5, col:31> col:31 referenced difference_type 'ptrdiff_t':'long'
| `-TypedefType 0x7fc41481f350 'ptrdiff_t' sugar
|   |-Typedef 0x7fc412869140 'ptrdiff_t'
|   `-BuiltinType 0x7fc412833be0 'long'
|-TypedefDecl 0x7fc4135bc168 <line:1725:5, col:31> col:31 referenced pointer 'char *'
| `-PointerType 0x7fc4135bc130 'char *'
|   `-SubstTemplateTypeParmType 0x7fc4135bc100 'char' sugar
|     |-TemplateTypeParmType 0x7fc412ae8060 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fc412ae8018 '_Tp'
|     `-BuiltinType 0x7fc412833b60 'char'
|-TypedefDecl 0x7fc4135bc1f8 <line:1726:5, col:31> col:31 referenced const_pointer 'const char *'
| `-PointerType 0x7fc4135bc1c0 'const char *'
|   `-QualType 0x7fc4135bc101 'const char' const
|     `-SubstTemplateTypeParmType 0x7fc4135bc100 'char' sugar
|       |-TemplateTypeParmType 0x7fc412ae8060 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fc412ae8018 '_Tp'
|       `-BuiltinType 0x7fc412833b60 'char'
|-TypedefDecl 0x7fc4135bc288 <line:1727:5, col:31> col:31 reference 'char &'
| `-LValueReferenceType 0x7fc4135bc250 'char &'
|   `-SubstTemplateTypeParmType 0x7fc4135bc100 'char' sugar
|     |-TemplateTypeParmType 0x7fc412ae8060 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fc412ae8018 '_Tp'
|     `-BuiltinType 0x7fc412833b60 'char'
|-TypedefDecl 0x7fc4135bc318 <line:1728:5, col:31> col:31 const_reference 'const char &'
| `-LValueReferenceType 0x7fc4135bc2e0 'const char &'
|   `-QualType 0x7fc4135bc101 'const char' const
|     `-SubstTemplateTypeParmType 0x7fc4135bc100 'char' sugar
|       |-TemplateTypeParmType 0x7fc412ae8060 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fc412ae8018 '_Tp'
|       `-BuiltinType 0x7fc412833b60 'char'
|-TypedefDecl 0x7fc4135bc380 <line:1729:5, col:31> col:31 referenced value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fc4135bc100 'char' sugar
|   |-TemplateTypeParmType 0x7fc412ae8060 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fc412ae8018 '_Tp'
|   `-BuiltinType 0x7fc412833b60 'char'
|-TypedefDecl 0x7fc4135bc3d8 <line:1731:5, col:23> col:23 referenced propagate_on_container_move_assignment 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fc41303bd40 'std::__1::true_type' sugar
|   |-Typedef 0x7fc413039248 'true_type'
|   `-TemplateSpecializationType 0x7fc413038d30 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fc413038b98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fc413038b80 <line:528:31> '_Bool' true
|     `-RecordType 0x7fc413038d10 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fc413038c08 'integral_constant'
|-TypedefDecl 0x7fc4135bc430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1732:5, col:23> col:23 referenced is_always_equal 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fc41303bd40 'std::__1::true_type' sugar
|   |-Typedef 0x7fc413039248 'true_type'
|   `-TemplateSpecializationType 0x7fc413038d30 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fc413038b98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fc413038b80 <line:528:31> '_Bool' true
|     `-RecordType 0x7fc413038d10 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fc413038c08 'integral_constant'
|-ClassTemplateDecl 0x7fc4135bc5a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1734:5, col:33> col:33 rebind
| |-TemplateTypeParmDecl 0x7fc4135bc488 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXRecordDecl 0x7fc4135bc510 <col:26, col:33> col:33 struct rebind
|-CXXConstructorDecl 0x7fc4135bc7f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1736:54> col:31 allocator 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fc4135bc8d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc4135bcc30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:5, col:96> col:52 allocator
| |-TemplateTypeParmDecl 0x7fc4135bc920 <col:15, col:21> col:21 class depth 0 index 0 _Up
| |-CXXConstructorDecl 0x7fc4135bcb88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:96> col:52 allocator 'void (const allocator<_Up> &) noexcept'
| | |-ParmVarDecl 0x7fc4135bca60 <col:62, col:82> col:83 'const allocator<_Up> &'
| | `-AlwaysInlineAttr 0x7fc4135bcc88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-CXXConstructorDecl 0x7fc413606e88 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:96> col:52 allocator 'void (const allocator<char> &) noexcept'
|   |-TemplateArgument type 'char'
|   |-ParmVarDecl 0x7fc413606dc0 <col:62, col:82> col:83 'const allocator<char> &'
|   `-AlwaysInlineAttr 0x7fc413606f90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135bceb8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1739:39> line:1738:39 address 'std::__1::allocator<char>::pointer (std::__1::allocator<char>::reference) const noexcept'
| |-ParmVarDecl 0x7fc4135bcdb0 <col:47, col:57> col:57 __x 'std::__1::allocator<char>::reference':'char &'
| `-AlwaysInlineAttr 0x7fc4135bcf68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135bd108 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1741:39> line:1740:45 address 'std::__1::allocator<char>::const_pointer (std::__1::allocator<char>::const_reference) const noexcept'
| |-ParmVarDecl 0x7fc4135bd000 <col:53, col:69> col:69 __x 'std::__1::allocator<char>::const_reference':'const char &'
| `-AlwaysInlineAttr 0x7fc4135bd1b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135bd370 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1748:9> line:1742:39 allocate 'std::__1::allocator<char>::pointer (std::__1::allocator::size_type, allocator<void>::const_pointer)'
| |-ParmVarDecl 0x7fc4135bd200 <col:48, col:58> col:58 __n 'std::__1::allocator::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135bd260 <col:63, col:96> col:94 'allocator<void>::const_pointer':'const void *'
| `-AlwaysInlineAttr 0x7fc4135bd428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135bd5b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1750:49> line:1749:36 deallocate 'void (std::__1::allocator<char>::pointer, std::__1::allocator::size_type) noexcept'
| |-ParmVarDecl 0x7fc4135bd480 <col:47, col:55> col:55 __p 'std::__1::allocator<char>::pointer':'char *'
| |-ParmVarDecl 0x7fc4135bd4e0 <col:60> col:69 'std::__1::allocator::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135bd670 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135bd6b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1752:45> line:1751:41 max_size 'std::__1::allocator::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135bd760 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc4135bdb88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1754:5, line:1760:9> line:1757:9 construct
| |-TemplateTypeParmDecl 0x7fc4135bd7a8 <line:1754:15, col:21> col:21 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fc4135bd818 <col:26, col:35> col:35 class depth 0 index 1 ... _Args
| `-CXXMethodDecl 0x7fc4135bdaf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1760:9> line:1757:9 construct 'void (_Up *, _Args &&...)'
|   |-ParmVarDecl 0x7fc4135bd8e8 <col:19, col:24> col:24 __p '_Up *'
|   |-ParmVarDecl 0x7fc4135bd9d8 <col:29, col:40> col:40 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7fc4135bdbe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135bddd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1814:70> col:36 destroy 'void (std::__1::allocator<char>::pointer)'
| |-ParmVarDecl 0x7fc4135bdcc8 <col:44, col:52> col:52 __p 'std::__1::allocator<char>::pointer':'char *'
| `-AlwaysInlineAttr 0x7fc4135bde80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fc4135d7c78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28> col:28 implicit referenced ~allocator 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fc413602f98 <col:28> col:28 implicit constexpr allocator 'void (const class std::__1::allocator<char> &)' inline default trivial noexcept-unevaluated 0x7fc413602f98
| `-ParmVarDecl 0x7fc413603080 <col:28> col:28 'const class std::__1::allocator<char> &'
`-CXXConstructorDecl 0x7fc413603118 <col:28> col:28 implicit referenced constexpr allocator 'void (class std::__1::allocator<char> &&) noexcept' inline default trivial
  `-ParmVarDecl 0x7fc413603240 <col:28> col:28 'class std::__1::allocator<char> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc4135d63a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2069:1, line:2099:1> line:2070:8 struct __compressed_pair_elem definition
|-private 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-TemplateArgument integral 1
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7fc4135d6738 prev 0x7fc4135d63a0 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7fc4135d67e0 <line:2071:3, col:15> col:15 _ParamT 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7fc4135d6600 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7fc412afa3b0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fc412afa370 '_Tp'
|   `-RecordType 0x7fc413138960 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7fc413138878 'allocator'
|-TypedefDecl 0x7fc4135d6878 <line:2072:3, col:16> col:16 referenced reference 'class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7fc4135d6840 'class std::__1::allocator<char> &'
|   `-SubstTemplateTypeParmType 0x7fc4135d6600 'class std::__1::allocator<char>' sugar
|     |-TemplateTypeParmType 0x7fc412afa3b0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fc412afa370 '_Tp'
|     `-RecordType 0x7fc413138960 'class std::__1::allocator<char>'
|       `-ClassTemplateSpecialization 0x7fc413138878 'allocator'
|-TypedefDecl 0x7fc4135d6908 <line:2073:3, col:22> col:22 referenced const_reference 'const class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7fc4135d68d0 'const class std::__1::allocator<char> &'
|   `-QualType 0x7fc4135d6601 'const class std::__1::allocator<char>' const
|     `-SubstTemplateTypeParmType 0x7fc4135d6600 'class std::__1::allocator<char>' sugar
|       |-TemplateTypeParmType 0x7fc412afa3b0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fc412afa370 '_Tp'
|       `-RecordType 0x7fc413138960 'class std::__1::allocator<char>'
|         `-ClassTemplateSpecialization 0x7fc413138878 'allocator'
|-TypedefDecl 0x7fc4135d6970 <line:2074:3, col:15> col:15 __value_type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7fc4135d6600 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7fc412afa3b0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fc412afa370 '_Tp'
|   `-RecordType 0x7fc413138960 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7fc413138878 'allocator'
|-CXXConstructorDecl 0x7fc4135d6a08 <line:2077:3, col:46> col:13 __compressed_pair_elem 'void (void)' default noexcept-unevaluated 0x7fc4135d6a08
|-FunctionTemplateDecl 0x7fc4135d71e8 <line:2079:3, line:2084:48> line:2083:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fc4135d6ac0 <line:2079:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fc4135d6b28 <col:24, line:2081:6> line:2079:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<class allocator<char>, 1, true>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7fc4135d7140 <line:2082:3, line:2084:48> line:2083:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7fc4135d7058 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7fc4135d7818 <line:2086:3, line:2090:79> line:2088:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fc4135d72c8 <line:2086:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7fc4135d7338 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7fc4135d7770 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2090:79> line:2088:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7fc4135d73b0 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fc4135d7518 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7fc4135d7668 <line:2089:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7fc4135d78a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135d7a28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2097:3, col:47> col:13 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>::reference (void) noexcept'
|-CXXMethodDecl 0x7fc4135d7b78 <line:2098:3, col:59> col:19 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>::const_reference (void) const noexcept'
`-CXXDestructorDecl 0x7fc4136049a8 <line:2070:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem.1" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem.1" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc4135d2eb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2104:1, line:2201:1> line:2105:7 class __compressed_pair definition
|-private '__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0>':'struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>'
|-private '__compressed_pair_elem<class std::__1::allocator<char>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>'
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-CXXRecordDecl 0x7fc4135d7da0 prev 0x7fc4135d2eb0 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7fc4135d8148 <line:2107:3, col:42> col:42 _Base1 '__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0>':'struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>'
| `-TemplateSpecializationType 0x7fc4135d80a0 '__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fc413088400 <col:39> 'int' 0
|   `-RecordType 0x7fc4135d42e0 'struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>'
|     `-ClassTemplateSpecialization 0x7fc4135d41c0 '__compressed_pair_elem'
|-TypedefDecl 0x7fc4135d84a8 <line:2108:3, col:42> col:42 _Base2 '__compressed_pair_elem<class std::__1::allocator<char>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>'
| `-TemplateSpecializationType 0x7fc4135d8400 '__compressed_pair_elem<class std::__1::allocator<char>, 1>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fc4130887a8 <col:39> 'int' 1
|   `-RecordType 0x7fc4135d64c0 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>'
|     `-ClassTemplateSpecialization 0x7fc4135d63a0 '__compressed_pair_elem'
|-StaticAssertDecl 0x7fc4135d8928 <line:2114:3, line:2117:44> line:2114:3
| |-ParenExpr 0x7fc4135d8908 <col:17, col:43> '_Bool'
| | `-UnaryOperator 0x7fc4135d88e8 <col:18, col:38> '_Bool' prefix '!'
| |   `-ImplicitCastExpr 0x7fc4135d88d0 <col:19, col:38> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7fc4135d8898 <col:19, col:38> 'const _Bool':'const _Bool' lvalue Var 0x7fc4132e7c78 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fc413088cd8 <line:2115:5, line:2117:5> 'const char [179]' lvalue "__compressed_pair cannot be instantated when T1 and T2 are the same type; The current implementation is NOT ABI-compatible with the previous implementation for this configuration"
|-AccessSpecDecl 0x7fc4135d8960 <line:2119:1, col:7> col:1 public
|-FunctionTemplateDecl 0x7fc4135d93a8 <line:2121:3, line:2128:34> col:13 __compressed_pair
| |-NonTypeTemplateParmDecl 0x7fc4135d8988 <line:2121:13, col:27> col:18 referenced '_Bool' depth 0 index 0 _Dummy
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fc413088e20 <col:27> '_Bool' true
| |-TemplateTypeParmDecl 0x7fc4135d89e0 <line:2122:7, line:2125:10> line:2122:7 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<__dependent_type<is_default_constructible<struct __rep>, _Dummy>::value && __dependent_type<is_default_constructible<class allocator<char> >, _Dummy>::value>::type'
| `-CXXConstructorDecl 0x7fc4135d9300 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2128:34> col:13 constexpr __compressed_pair 'void (void)'
|   `-AlwaysInlineAttr 0x7fc4135d9428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc4135d9c48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2130:3, line:2135:51> line:2134:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fc4135d94f8 <line:2130:13, col:19> col:19 class depth 0 index 0 _Tp
| |-NonTypeTemplateParmDecl 0x7fc4135d9a00 <col:24, line:2132:57> col:55 'typename enable_if<!is_same<typename decay<_Tp>::type, class __compressed_pair<struct __rep, class allocator<char> > >::value, _Bool>::type' depth 0 index 1
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fc413089d40 <col:57> '_Bool' true
| `-CXXConstructorDecl 0x7fc4135d9ba0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2135:51> line:2134:3 constexpr __compressed_pair 'void (_Tp &&)'
|   |-ParmVarDecl 0x7fc4135d9ab8 <col:21, col:27> col:27 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fc4135d9ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc4135da028 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2137:3, line:2140:51> line:2139:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fc4135d9d70 <line:2137:13, col:19> col:19 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7fc4135d9f80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2140:51> line:2139:3 constexpr __compressed_pair 'void (struct std::__1::__second_tag, _Tp &&)'
|   |-ParmVarDecl 0x7fc4135d9df0 <col:21> col:33 'struct std::__1::__second_tag'
|   |-ParmVarDecl 0x7fc4135d9e88 <col:35, col:41> col:41 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fc4135da088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc4135da4d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2142:3, line:2145:75> line:2144:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fc4135da158 <line:2142:13, col:19> col:19 class depth 0 index 0 _U1
| |-TemplateTypeParmDecl 0x7fc4135da1c8 <col:24, col:30> col:30 class depth 0 index 1 _U2
| `-CXXConstructorDecl 0x7fc4135da430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 constexpr __compressed_pair 'void (_U1 &&, _U2 &&)'
|   |-ParmVarDecl 0x7fc4135da298 <col:21, col:27> col:27 __t1 '_U1 &&'
|   |-ParmVarDecl 0x7fc4135da338 <col:33, col:39> col:39 __t2 '_U2 &&'
|   `-AlwaysInlineAttr 0x7fc4135da538 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc4135dab98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2147:3, line:2154:75> line:2149:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fc4135da608 <line:2147:13, col:22> col:22 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7fc4135da678 <col:30, col:39> col:39 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7fc4135daaf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2154:75> line:2149:3 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7fc4135da708 <col:21, col:43> col:43 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fc4135da878 <col:49, col:66> col:66 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7fc4135da9e8 <line:2150:21, col:38> col:38 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7fc4135dac00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135dadc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2175:3> line:2173:30 first 'typename _Base1::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7fc4135dae70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135daf78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2180:3> line:2178:36 first 'typename _Base1::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135db020 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135db168 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2185:3> line:2183:30 second 'typename _Base2::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7fc4135db210 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135db318 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2190:3> line:2188:36 second 'typename _Base2::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135db3c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135db560 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2200:3> line:2193:8 swap 'void (class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &)' noexcept-uninstantiated 0x7fc41308be48
| |-ParmVarDecl 0x7fc4135db448 <col:13, col:32> col:32 __x 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &'
| `-AlwaysInlineAttr 0x7fc4135db658 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
`-CXXDestructorDecl 0x7fc413604468 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2105:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc413146ae8 parent 0x7fc4130e9da8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:4040:81> col:64 class basic_string definition
|-private '__basic_string_common<true>':'class std::__1::__basic_string_common<true>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-VisibilityAttr 0x7fc41428cdf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fc4135bb688 prev 0x7fc413146ae8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:635:1, col:28> col:28 implicit class basic_string
|-AccessSpecDecl 0x7fc4135bb720 <line:638:1, col:7> col:1 public
|-TypedefDecl 0x7fc4135bb758 <line:639:5, col:58> col:58 __self 'class std::__1::basic_string<char>'
| `-RecordType 0x7fc413146c00 'class std::__1::basic_string<char>'
|   `-ClassTemplateSpecialization 0x7fc413146ae8 'basic_string'
|-TypedefDecl 0x7fc4135bb8d8 <line:640:5, col:58> col:58 __self_view 'basic_string_view<char, struct std::__1::char_traits<char> >':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-TemplateSpecializationType 0x7fc4135bb830 'basic_string_view<char, struct std::__1::char_traits<char> >' sugar basic_string_view
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7fc41416c720 'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
|     `-ClassTemplateSpecialization 0x7fc41416c618 'basic_string_view'
|-TypedefDecl 0x7fc4135bb940 <line:641:5, col:58> col:58 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fc4135bb7f0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fc4141b9fc0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fc4141b9f78 '_Traits'
|   `-RecordType 0x7fc413137530 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fc414a5c108 'char_traits'
|-TypedefDecl 0x7fc4135bb9a8 <line:642:5, col:58> col:58 value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fc4135bb7b0 'char' sugar
|   |-TemplateTypeParmType 0x7fc4141b9f50 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fc4141b9f10 '_CharT'
|   `-BuiltinType 0x7fc412833b60 'char'
|-TypedefDecl 0x7fc4135bba38 <line:643:5, col:58> col:58 allocator_type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7fc4135bba00 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7fc4141ba030 '_Allocator' dependent depth 0 index 2
|   | `-TemplateTypeParm 0x7fc4141b9fe8 '_Allocator'
|   `-RecordType 0x7fc413138960 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7fc413138878 'allocator'
|-TypedefDecl 0x7fc4135bbc48 <line:644:5, col:58> col:58 __alloc_traits 'allocator_traits<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>':'struct std::__1::allocator_traits<class std::__1::allocator<char> >'
| `-TemplateSpecializationType 0x7fc4135bbbd0 'allocator_traits<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type':'class std::__1::allocator<char>'
|   `-RecordType 0x7fc4135bbbb0 'struct std::__1::allocator_traits<class std::__1::allocator<char> >'
|     `-ClassTemplateSpecialization 0x7fc4135bbac0 'allocator_traits'
|-TypedefDecl 0x7fc4135d03d0 <line:645:5, col:58> col:58 size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7fc4135d0380 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7fc4135c92a0 'std::__1::allocator_traits<class std::__1::allocator<char> >::size_type' sugar
|     |-Typedef 0x7fc4135c5920 'size_type'
|     `-ElaboratedType 0x7fc4135c58d0 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7fc4135c58b0 'std::__1::__size_type<class std::__1::allocator<char>, long, true>::type' sugar
|         |-Typedef 0x7fc4135c5830 'type'
|         `-ElaboratedType 0x7fc4135c57e0 'typename class allocator<char>::size_type' sugar
|           `-TypedefType 0x7fc4135c4de0 'std::__1::allocator<char>::size_type' sugar
|             |-Typedef 0x7fc4135bc048 'size_type'
|             `-TypedefType 0x7fc413059a10 'size_t' sugar
|               |-Typedef 0x7fc4128691b0 'size_t'
|               `-BuiltinType 0x7fc412833c80 'unsigned long'
|-TypedefDecl 0x7fc4135d04a0 <line:646:5, col:58> col:58 difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7fc4135d0450 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7fc4135c4b00 'std::__1::allocator_traits<class std::__1::allocator<char> >::difference_type' sugar
|     |-Typedef 0x7fc4135c4a90 'difference_type'
|     `-ElaboratedType 0x7fc4135c4a40 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7fc4135c4a20 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<char>, char *, true>::type' sugar
|         |-Typedef 0x7fc4135c49a0 'type'
|         `-ElaboratedType 0x7fc4135c4950 'typename class allocator<char>::difference_type' sugar
|           `-TypedefType 0x7fc4135c3f50 'std::__1::allocator<char>::difference_type' sugar
|             |-Typedef 0x7fc4135bc0a0 'difference_type'
|             `-TypedefType 0x7fc41481f350 'ptrdiff_t' sugar
|               |-Typedef 0x7fc412869140 'ptrdiff_t'
|               `-BuiltinType 0x7fc412833be0 'long'
|-TypedefDecl 0x7fc4135d0558 <line:647:5, col:58> col:58 reference 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
| `-LValueReferenceType 0x7fc4135d0520 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
|   `-TypedefType 0x7fc4135d0500 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' sugar
|     |-Typedef 0x7fc4135bb9a8 'value_type'
|     `-SubstTemplateTypeParmType 0x7fc4135bb7b0 'char' sugar
|       |-TemplateTypeParmType 0x7fc4141b9f50 '_CharT' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fc4141b9f10 '_CharT'
|       `-BuiltinType 0x7fc412833b60 'char'
|-TypedefDecl 0x7fc4135d05e8 <line:648:5, col:58> col:58 const_reference 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
| `-LValueReferenceType 0x7fc4135d05b0 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
|   `-QualType 0x7fc4135d0501 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' const
|     `-TypedefType 0x7fc4135d0500 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' sugar
|       |-Typedef 0x7fc4135bb9a8 'value_type'
|       `-SubstTemplateTypeParmType 0x7fc4135bb7b0 'char' sugar
|         |-TemplateTypeParmType 0x7fc4141b9f50 '_CharT' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7fc4141b9f10 '_CharT'
|         `-BuiltinType 0x7fc412833b60 'char'
|-TypedefDecl 0x7fc4135d06b0 <line:649:5, col:58> col:58 pointer 'typename __alloc_traits::pointer':'char *'
| `-ElaboratedType 0x7fc4135d0660 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7fc4135bf630 'std::__1::allocator_traits<class std::__1::allocator<char> >::pointer' sugar
|     |-Typedef 0x7fc4135bf5c0 'pointer'
|     `-ElaboratedType 0x7fc4135bf570 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7fc4135bf550 'std::__1::__pointer_type<char, class std::__1::allocator<char> >::type' sugar
|         |-Typedef 0x7fc4135bf4d0 'type'
|         `-ElaboratedType 0x7fc4135bf480 'typename __pointer_type_imp::__pointer_type<char, typename remove_reference<class allocator<char> >::type>::type' sugar
|           `-TypedefType 0x7fc4135bf460 'std::__1::__pointer_type_imp::__pointer_type<char, class std::__1::allocator<char>, true>::type' sugar
|             |-Typedef 0x7fc4135bf3e0 'type'
|             `-ElaboratedType 0x7fc4135bf390 'typename class allocator<char>::pointer' sugar
|               `-TypedefType 0x7fc4135bcd60 'std::__1::allocator<char>::pointer' sugar
|                 |-Typedef 0x7fc4135bc168 'pointer'
|                 `-PointerType 0x7fc4135bc130 'char *'
|                   `-SubstTemplateTypeParmType 0x7fc4135bc100 'char' sugar
|                     |-TemplateTypeParmType 0x7fc412ae8060 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fc412ae8018 '_Tp'
|                     `-BuiltinType 0x7fc412833b60 'char'
|-TypedefDecl 0x7fc4135d07a0 <line:650:5, col:58> col:58 const_pointer 'typename __alloc_traits::const_pointer':'const char *'
| `-ElaboratedType 0x7fc4135d0750 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7fc4135d0730 'std::__1::allocator_traits<class std::__1::allocator<char> >::const_pointer' sugar
|     |-Typedef 0x7fc4135c03c0 'const_pointer'
|     `-ElaboratedType 0x7fc4135c0370 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7fc4135c0350 'std::__1::__const_pointer<char, char *, class std::__1::allocator<char>, true>::type' sugar
|         |-Typedef 0x7fc4135c02d0 'type'
|         `-ElaboratedType 0x7fc4135c0280 'typename class allocator<char>::const_pointer' sugar
|           `-TypedefType 0x7fc4135bcfb0 'std::__1::allocator<char>::const_pointer' sugar
|             |-Typedef 0x7fc4135bc1f8 'const_pointer'
|             `-PointerType 0x7fc4135bc1c0 'const char *'
|               `-QualType 0x7fc4135bc101 'const char' const
|                 `-SubstTemplateTypeParmType 0x7fc4135bc100 'char' sugar
|                   |-TemplateTypeParmType 0x7fc412ae8060 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7fc412ae8018 '_Tp'
|                   `-BuiltinType 0x7fc412833b60 'char'
|-StaticAssertDecl 0x7fc4135d0900 <line:652:5, col:92> col:5
| |-DeclRefExpr 0x7fc4135d08b0 <col:19, col:39> 'const _Bool':'const _Bool' lvalue Var 0x7fc413341820 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fc4141baf48 <col:46> 'const char [45]' lvalue "Character type of basic_string must be a POD"
|-StaticAssertDecl 0x7fc4135d0b40 <line:653:5, line:654:74> line:653:5
| |-ParenExpr 0x7fc4135d0b08 <col:19, col:75> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7fc4135d0ad0 <col:20, col:70> 'const _Bool':'const _Bool' lvalue Var 0x7fc413341820 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fc4141bb210 <line:654:19> 'const char [54]' lvalue "traits_type::char_type must be the same type as CharT"
|-StaticAssertDecl 0x7fc4135d0d50 <line:655:5, line:656:74> line:655:5
| |-ParenExpr 0x7fc4135d0d18 <col:19, col:83> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7fc4135d0ce0 <col:20, col:78> 'const _Bool':'const _Bool' lvalue Var 0x7fc413341820 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fc4141bb550 <line:656:19> 'const char [54]' lvalue "Allocator::value_type must be same type as value_type"
|-TypedefDecl 0x7fc4135d0f48 <line:661:5, col:58> col:58 iterator '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer>':'class std::__1::__wrap_iter<char *>'
| `-TemplateSpecializationType 0x7fc4135d0ed0 '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
|   `-RecordType 0x7fc4135d0eb0 'class std::__1::__wrap_iter<char *>'
|     `-ClassTemplateSpecialization 0x7fc4135d0dc0 '__wrap_iter'
|-TypedefDecl 0x7fc4135d1158 <line:662:5, col:58> col:58 const_iterator '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer>':'class std::__1::__wrap_iter<const char *>'
| `-TemplateSpecializationType 0x7fc4135d10e0 '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer':'const char *'
|   `-RecordType 0x7fc4135d10c0 'class std::__1::__wrap_iter<const char *>'
|     `-ClassTemplateSpecialization 0x7fc4135d0fd0 '__wrap_iter'
|-TypedefDecl 0x7fc4135d13b0 <line:664:5, col:59> col:59 reverse_iterator 'std::__1::reverse_iterator<iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<char *> >'
| `-ElaboratedType 0x7fc4135d1340 'std::__1::reverse_iterator<iterator>' sugar
|   `-TemplateSpecializationType 0x7fc4135d12f0 'reverse_iterator<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator':'class std::__1::__wrap_iter<char *>'
|     `-RecordType 0x7fc4135d12d0 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<char *> >'
|       `-ClassTemplateSpecialization 0x7fc4135d11e0 'reverse_iterator'
|-TypedefDecl 0x7fc4135d1610 <line:665:5, col:59> col:59 const_reverse_iterator 'std::__1::reverse_iterator<const_iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const char *> >'
| `-ElaboratedType 0x7fc4135d15a0 'std::__1::reverse_iterator<const_iterator>' sugar
|   `-TemplateSpecializationType 0x7fc4135d1550 'reverse_iterator<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|     `-RecordType 0x7fc4135d1530 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const char *> >'
|       `-ClassTemplateSpecialization 0x7fc4135d1440 'reverse_iterator'
|-AccessSpecDecl 0x7fc4135d1668 <line:667:1, col:8> col:1 private
|-CXXRecordDecl 0x7fc4135d1690 <line:701:5, line:706:5> line:701:12 struct __long definition
| |-CXXRecordDecl 0x7fc4135d1b08 prev 0x7fc4135d1690 <col:5, col:12> col:12 implicit struct __long
| |-FieldDecl 0x7fc4135d1bd0 <line:703:9, col:19> col:19 __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-FieldDecl 0x7fc4135d1c28 <line:704:9, col:19> col:19 __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-FieldDecl 0x7fc4135d1c80 <line:705:9, col:19> col:19 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
| `-CXXDestructorDecl 0x7fc413604708 <line:701:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial
|-EnumDecl 0x7fc4135d1760 <line:712:5> col:5
| `-EnumConstantDecl 0x7fc4135d1830 <col:11, col:26> col:11 __short_mask 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:712:5)'
|   `-ImplicitCastExpr 0x7fc4135d1878 <col:26> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7fc4141bc110 <col:26> 'int' 1
|-EnumDecl 0x7fc4135d1890 <line:713:5> col:5
| `-EnumConstantDecl 0x7fc4135d1960 <col:11, col:26> col:11 __long_mask 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:713:5)'
|   `-ImplicitCastExpr 0x7fc4135d19a8 <col:26> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7fc4141bc230 <col:26> 'unsigned long' 1
|-EnumDecl 0x7fc4135d19c0 <line:716:5> col:5
| `-EnumConstantDecl 0x7fc4135d2000 <col:11, line:717:65> line:716:11 referenced __min_cap 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:716:5)'
|   `-ImplicitCastExpr 0x7fc4135d2048 <col:23, line:717:65> 'unsigned int' <IntegralCast>
|     `-ConditionalOperator 0x7fc4135d1f00 <line:716:23, line:717:65> 'unsigned long'
|       |-BinaryOperator 0x7fc4135d1dd8 <line:716:23, col:65> '_Bool' '>'
|       | |-BinaryOperator 0x7fc4135d1d98 <col:23, col:61> 'unsigned long' '/'
|       | | |-ParenExpr 0x7fc4135d1d48 <col:23, col:42> 'unsigned long'
|       | | | `-BinaryOperator 0x7fc4135d1d20 <col:24, col:41> 'unsigned long' '-'
|       | | |   |-UnaryExprOrTypeTraitExpr 0x7fc4135d1ce8 <col:24, col:37> 'unsigned long' sizeof 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|       | | |   `-ImplicitCastExpr 0x7fc4135d1d08 <col:41> 'unsigned long' <IntegralCast>
|       | | |     `-IntegerLiteral 0x7fc4141bc380 <col:41> 'int' 1
|       | | `-UnaryExprOrTypeTraitExpr 0x7fc4135d1d78 <col:44, col:61> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|       | `-ImplicitCastExpr 0x7fc4135d1dc0 <col:65> 'unsigned long' <IntegralCast>
|       |   `-IntegerLiteral 0x7fc4141bc458 <col:65> 'int' 2
|       |-BinaryOperator 0x7fc4135d1ec0 <line:717:23, col:61> 'unsigned long' '/'
|       | |-ParenExpr 0x7fc4135d1e70 <col:23, col:42> 'unsigned long'
|       | | `-BinaryOperator 0x7fc4135d1e48 <col:24, col:41> 'unsigned long' '-'
|       | |   |-UnaryExprOrTypeTraitExpr 0x7fc4135d1e10 <col:24, col:37> 'unsigned long' sizeof 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|       | |   `-ImplicitCastExpr 0x7fc4135d1e30 <col:41> 'unsigned long' <IntegralCast>
|       | |     `-IntegerLiteral 0x7fc4141bc4e8 <col:41> 'int' 1
|       | `-UnaryExprOrTypeTraitExpr 0x7fc4135d1ea0 <col:44, col:61> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|       `-ImplicitCastExpr 0x7fc4135d1ee8 <col:65> 'unsigned long' <IntegralCast>
|         `-IntegerLiteral 0x7fc4141bc5c0 <col:65> 'int' 2
|-CXXRecordDecl 0x7fc4135d2060 <line:719:5, line:727:5> line:719:12 struct __short definition
| |-CXXRecordDecl 0x7fc4135d24b0 prev 0x7fc4135d2060 <col:5, col:12> col:12 implicit struct __short
| |-CXXRecordDecl 0x7fc4135d2548 <line:721:9, line:725:9> line:721:9 union definition
| | |-FieldDecl 0x7fc4135d26c8 <line:723:13, col:27> col:27 __size_ 'unsigned char'
| | |-FieldDecl 0x7fc4135d2720 <line:724:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| | `-CXXDestructorDecl 0x7fc413604b68 <line:721:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-FieldDecl 0x7fc4135d2788 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| |-IndirectFieldDecl 0x7fc4135d27e0 <line:723:27> col:27 implicit __size_ 'unsigned char'
| | |-Field 0x7fc4135d2788 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| | `-Field 0x7fc4135d26c8 '__size_' 'unsigned char'
| |-IndirectFieldDecl 0x7fc4135d2830 <line:724:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| | |-Field 0x7fc4135d2788 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| | `-Field 0x7fc4135d2720 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-FieldDecl 0x7fc4135d28f8 <line:726:9, col:37> col:20 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
| `-CXXDestructorDecl 0x7fc4136047e8 <line:719:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial
|-CXXRecordDecl 0x7fc4135d2130 <line:731:5, col:44> col:11 union __ulx definition
| |-CXXRecordDecl 0x7fc4135d2348 prev 0x7fc4135d2130 <col:5, col:11> col:11 implicit union __ulx
| |-FieldDecl 0x7fc4135d23f0 <col:17, col:24> col:24 __lx 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| `-FieldDecl 0x7fc4135d2960 <col:30, col:38> col:38 __lxx 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-EnumDecl 0x7fc4135d2200 <line:733:5> col:5
| `-EnumConstantDecl 0x7fc4135d2c98 <col:11, col:55> col:11 referenced __n_words 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:733:5)'
|   `-ImplicitCastExpr 0x7fc4135d2ce0 <col:23, col:55> 'unsigned int' <IntegralCast>
|     `-BinaryOperator 0x7fc4135d2a18 <col:23, col:55> 'unsigned long' '/'
|       |-UnaryExprOrTypeTraitExpr 0x7fc4135d29c8 <col:23, col:35> 'unsigned long' sizeof 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx'
|       `-UnaryExprOrTypeTraitExpr 0x7fc4135d29f8 <col:39, col:55> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXRecordDecl 0x7fc4135d2cf8 <line:735:5, line:738:5> line:735:12 struct __raw definition
| |-CXXRecordDecl 0x7fc4135d3750 prev 0x7fc4135d2cf8 <col:5, col:12> col:12 implicit struct __raw
| |-FieldDecl 0x7fc4135d38a8 <line:737:9, col:36> col:19 __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
| `-CXXDestructorDecl 0x7fc4136048c8 <line:735:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial
|-CXXRecordDecl 0x7fc4135d2dc0 <line:740:5, line:748:5> line:740:12 struct __rep definition
| |-CXXRecordDecl 0x7fc4135d3410 prev 0x7fc4135d2dc0 <col:5, col:12> col:12 implicit struct __rep
| |-CXXRecordDecl 0x7fc4135d34a8 <line:742:9, line:747:9> line:742:9 union definition
| | |-FieldDecl 0x7fc4135d3638 <line:744:13, col:21> col:21 __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| | |-FieldDecl 0x7fc4135d3690 <line:745:13, col:21> col:21 __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| | |-FieldDecl 0x7fc4135d3910 <line:746:13, col:21> col:21 __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| | `-CXXDestructorDecl 0x7fc413604a88 <line:742:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-FieldDecl 0x7fc4135d3978 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| |-IndirectFieldDecl 0x7fc4135d39d0 <line:744:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| | |-Field 0x7fc4135d3978 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| | `-Field 0x7fc4135d3638 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-IndirectFieldDecl 0x7fc4135d3a20 <line:745:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| | |-Field 0x7fc4135d3978 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| | `-Field 0x7fc4135d3690 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-IndirectFieldDecl 0x7fc4135d3a70 <line:746:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| | |-Field 0x7fc4135d3978 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| | `-Field 0x7fc4135d3910 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| `-CXXDestructorDecl 0x7fc413604628 <line:740:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7fc4135db6c0 <line:750:5, col:46> col:46 __r_ '__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>':'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >'
|-AccessSpecDecl 0x7fc4135db708 <line:752:1, col:7> col:1 public
|-VarDecl 0x7fc4135db740 <line:753:5, col:36> col:28 npos 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'const unsigned long' static cinit
| `-ImplicitCastExpr 0x7fc4135db7b0 <col:35, col:36> 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'const unsigned long' <IntegralCast>
|   `-UnaryOperator 0x7fc4141bdbd0 <col:35, col:36> 'int' prefix '-'
|     `-IntegerLiteral 0x7fc4141bdbb0 <col:36> 'int' 1
|-CXXConstructorDecl 0x7fc4135db888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:755:31 basic_string 'void (void)' noexcept-uninstantiated 0x7fc4141bdc90
| `-AlwaysInlineAttr 0x7fc4135db9a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc4135dbb60 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:758:40 basic_string 'void (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)' noexcept-uninstantiated 0x7fc4141bdf08
| |-ParmVarDecl 0x7fc4135dba28 <col:53, col:75> col:75 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fc4135dbc68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc4135dbd68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:765:5, col:43> col:5 basic_string 'void (const class std::__1::basic_string<char> &)'
| `-ParmVarDecl 0x7fc4135dbcc0 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
|-CXXConstructorDecl 0x7fc4135dbfe0 <line:766:5, col:70> col:5 basic_string 'void (const class std::__1::basic_string<char> &, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)'
| |-ParmVarDecl 0x7fc4135dbe38 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
| `-ParmVarDecl 0x7fc4135dbea8 <col:45, col:67> col:67 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
|-CXXConstructorDecl 0x7fc4135dc220 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:770:5 used basic_string 'void (class std::__1::basic_string<char> &&) noexcept(is_nothrow_move_constructible<allocator_type>::value)'
| |-ParmVarDecl 0x7fc4135dc0e8 <col:18, col:33> col:33 __str 'class std::__1::basic_string<char> &&'
| `-AlwaysInlineAttr 0x7fc4135dc328 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc4135dc520 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:778:65> col:5 basic_string 'void (class std::__1::basic_string<char> &&, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)'
| |-ParmVarDecl 0x7fc4135dc380 <col:18, col:33> col:33 __str 'class std::__1::basic_string<char> &&'
| |-ParmVarDecl 0x7fc4135dc3f0 <col:40, col:62> col:62 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fc4135dc5e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc4135dc750 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:780:61> col:31 basic_string 'void (const char *)'
| |-ParmVarDecl 0x7fc4135dc668 <col:44, col:58> col:58 __s 'const char *'
| `-AlwaysInlineAttr 0x7fc4135dc810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc4135dca40 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:782:58> col:5 basic_string 'void (const char *, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fc4135dc868 <col:18, col:32> col:32 __s 'const char *'
| |-ParmVarDecl 0x7fc4135dc908 <col:37, col:55> col:55 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fc4135dcb08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc4135dccc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:784:50> col:5 used basic_string 'void (const char *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc4135dcb60 <col:18, col:32> col:32 __s 'const char *'
| |-ParmVarDecl 0x7fc4135dcbd0 <col:37, col:47> col:47 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135dcd88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc4135dd010 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:786:73> col:5 basic_string 'void (const char *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fc4135dcde0 <col:18, col:32> col:32 __s 'const char *'
| |-ParmVarDecl 0x7fc4135dce50 <col:37, col:47> col:47 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135dcec0 <col:52, col:70> col:70 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fc4135dd0e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc4135dd2e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:788:43> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, char)'
| |-ParmVarDecl 0x7fc4135dd138 <col:18, col:28> col:28 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135dd1a8 <col:33, col:40> col:40 __c 'char':'char'
| `-AlwaysInlineAttr 0x7fc4135dd3a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc4135dd630 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:790:66> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, char, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fc4135dd400 <col:18, col:28> col:28 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135dd470 <col:33, col:40> col:40 __c 'char':'char'
| |-ParmVarDecl 0x7fc4135dd4e0 <col:45, col:63> col:63 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fc4135dd700 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc4135dda10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:791:5, line:792:54> line:791:5 basic_string 'void (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fc4135dd758 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135dd7c8 <col:45, col:55> col:55 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135dd838 <col:62, col:72> col:72 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135dd8a8 <line:792:18, col:53> col:36 __a 'const class std::__1::allocator<char> &'
|-CXXConstructorDecl 0x7fc4135ddd30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:795:54> line:794:5 basic_string 'void (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fc4135ddaf8 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135ddb68 <col:45, col:55> col:55 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135ddbd8 <line:795:18, col:53> col:36 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fc4135dde00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc4135e0b68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:796:5, line:800:121> line:798:9 basic_string
| |-TemplateTypeParmDecl 0x7fc4135dde48 <line:796:14, col:20> col:20 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7fc4135e0ac0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:800:121> line:798:9 basic_string 'void (const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &, typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, void>::type *)' inline
|   |-ParmVarDecl 0x7fc4135ddf08 <col:22, col:33> col:33 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fc4135ddf78 <col:38, col:48> col:48 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fc4135ddfe8 <col:55, col:65> col:65 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fc4135de058 <line:799:22, col:65> col:44 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
|   `-ParmVarDecl 0x7fc4135de500 <line:800:22, col:120> col:118 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, void>::type *'
|-CXXConstructorDecl 0x7fc4135e0dc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:802:34> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fc4135e0ca0 <col:18, col:30> col:30 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fc4135e0e80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc4135e1080 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:804:57> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fc4135e0ed8 <col:18, col:30> col:30 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fc4135e0f48 <col:36, col:54> col:54 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fc4135e1148 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc4135e1428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:805:5, line:807:67> col:9 basic_string
| |-TemplateTypeParmDecl 0x7fc4135e1190 <line:805:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7fc4135e1380 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:807:67> col:9 basic_string 'void (_InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x7fc4135e1220 <col:22, col:37> col:37 __first '_InputIterator'
|   |-ParmVarDecl 0x7fc4135e1290 <col:46, col:61> col:61 __last '_InputIterator'
|   `-AlwaysInlineAttr 0x7fc4135e1488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc4135e18c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:808:5, line:810:94> col:9 basic_string
| |-TemplateTypeParmDecl 0x7fc4135e1558 <line:808:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7fc4135e1820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:810:94> col:9 basic_string 'void (_InputIterator, _InputIterator, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)'
|   |-ParmVarDecl 0x7fc4135e15f0 <col:22, col:37> col:37 __first '_InputIterator'
|   |-ParmVarDecl 0x7fc4135e1660 <col:46, col:61> col:61 __last '_InputIterator'
|   |-ParmVarDecl 0x7fc4135e16d0 <col:69, col:91> col:91 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
|   `-AlwaysInlineAttr 0x7fc4135e1930 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc4135e1cc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:813:47> col:5 basic_string 'void (initializer_list<char>)'
| |-ParmVarDecl 0x7fc4135e1b98 <col:18, col:43> col:43 __il 'initializer_list<char>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fc4135e1d80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc4135e2000 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:815:70> col:5 basic_string 'void (initializer_list<char>, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fc4135e1e58 <col:18, col:43> col:43 __il 'initializer_list<char>':'class std::initializer_list<char>'
| |-ParmVarDecl 0x7fc4135e1ec8 <col:49, col:67> col:67 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fc4135e20c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fc4135e2140 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:818:5, col:26> col:12 used ~basic_string 'void (void) noexcept' inline
|-CXXConversionDecl 0x7fc4135e22a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:821:82> col:5 operator basic_string_view 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135e2350 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e24a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:823:5, col:54> col:19 operator= 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| `-ParmVarDecl 0x7fc4135e23d8 <col:29, col:49> col:49 __str 'const class std::__1::basic_string<char> &'
|-FunctionTemplateDecl 0x7fc4135e2778 <line:826:5, line:829:69> col:19 operator=
| |-TemplateTypeParmDecl 0x7fc4135e2550 <line:826:15, col:23> col:15 class depth 0 index 0
| | `-TemplateArgument type 'void'
| `-CXXMethodDecl 0x7fc4135e26e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:829:69> col:19 operator= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
|   |-ParmVarDecl 0x7fc4135e25e0 <col:29, col:41> col:41 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
|   `-AlwaysInlineAttr 0x7fc4135e27d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e29c0 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:832:19 operator= 'class std::__1::basic_string<char> &(class std::__1::basic_string<char> &&)' noexcept-uninstantiated 0x7fc4141c28a8
| |-ParmVarDecl 0x7fc4135e28b0 <col:29, col:44> col:44 __str 'class std::__1::basic_string<char> &&'
| `-AlwaysInlineAttr 0x7fc4135e2ab8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e2c90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:835:106> col:19 operator= 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fc4135e2b88 <col:29, col:58> col:58 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fc4135e2d40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e2ed0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:837:98> col:45 operator= 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fc4135e2dc8 <col:55, col:73> col:73 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-AlwaysInlineAttr 0x7fc4135e2f80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e30e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:838:5, col:43> col:19 operator= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| `-ParmVarDecl 0x7fc4135e2fd8 <col:29, col:40> col:40 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fc4135e3218 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:856:43> line:855:14 begin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fc4135e32c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e3398 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:859:49> line:858:20 begin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135e3440 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e34b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:862:52> line:861:14 end 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fc4135e3558 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e35c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:865:58> line:864:20 end 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135e3670 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e3768 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:869:41> line:868:22 rbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fc4135e3810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e3908 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:872:47> line:871:28 rbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135e39b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e3a20 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:875:43> line:874:22 rend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fc4135e3ac8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e3b38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:878:49> line:877:28 rend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135e3be0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e3c50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:882:25> line:881:20 cbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135e3cf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e3d68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:885:23> line:884:20 cend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135e3e10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e3e80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:888:26> line:887:28 crbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135e3f28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e3f98 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:891:24> line:890:28 crend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135e4040 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e40e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:894:70> line:893:41 size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135e4190 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e4200 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:895:81> col:41 length 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135e42a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e4318 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:896:41 max_size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135e43c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e4430 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:899:71> line:897:41 capacity 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135e44d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e4670 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:901:5, col:46> col:10 resize 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fc4135e4530 <col:17, col:27> col:27 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135e45a0 <col:32, col:43> col:43 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fc4135e4800 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:902:85> col:36 resize 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc4135e4738 <col:43, col:53> col:53 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135e48b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e4990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:904:5, col:41> col:10 reserve 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| `-ParmVarDecl 0x7fc4135e4908 <col:18, col:40> col:28 __res_arg 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135e4a40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:906:47> col:10 shrink_to_fit 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fc4135e4ae8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e4b30 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:908:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fc4135e4bd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e4c20 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:909:80> col:36 empty '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135e4cc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e4e08 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:911:47 operator[] 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135e4d40 <col:58, col:68> col:68 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135e4eb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e5038 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:912:47 operator[] 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fc4135e4f30 <col:58, col:68> col:68 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135e50e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e5200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:914:5, col:39> col:21 at 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| `-ParmVarDecl 0x7fc4135e5140 <col:24, col:34> col:34 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135e5380 <line:915:5, col:37> col:21 at 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| `-ParmVarDecl 0x7fc4135e52c0 <col:24, col:34> col:34 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135e54c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:917:105> col:45 operator+= 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fc4135e5440 <col:56, col:76> col:76 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc4135e5578 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e5658 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:918:104> col:45 operator+= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fc4135e55d0 <col:56, col:68> col:68 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fc4135e5708 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e57e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:919:103> col:45 operator+= 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fc4135e5760 <col:56, col:74> col:74 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-AlwaysInlineAttr 0x7fc4135e5898 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e5978 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:920:113> col:45 operator+= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fc4135e58f0 <col:56, col:67> col:67 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-AlwaysInlineAttr 0x7fc4135e5a28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e5bc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:922:112> col:45 operator+= 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fc4135e5af8 <col:56, col:85> col:85 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fc4135e5c70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e5d50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:926:51> col:19 append 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fc4135e5cc8 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc4135e5e00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e5ee0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:928:87> col:19 append 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fc4135e5e58 <col:26, col:38> col:38 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fc4135e5f90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e6200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:929:5, col:88> col:19 append 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc4135e5fe8 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135e6058 <col:53, col:63> col:63 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135e60c8 <col:70, col:84> col:80 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7fc4135e6968 <line:930:5, line:937:77> col:19 append
| |-TemplateTypeParmDecl 0x7fc4135e62c0 <line:930:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fc4135e68d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:937:77> col:19 append 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7fc4135e66a8 <col:26, col:37> col:37 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fc4135e6718 <col:42, col:52> col:52 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7fc4135e6788 <col:59, col:73> col:69 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135e6bf0 <line:938:5, col:62> col:19 append 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc4135e6a68 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fc4135e6ad8 <col:49, col:59> col:59 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135e6d40 <line:939:5, col:47> col:19 append 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| `-ParmVarDecl 0x7fc4135e6cb8 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fc4135e6f80 <line:940:5, col:55> col:19 append 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fc4135e6e00 <col:26, col:36> col:36 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135e6e70 <col:41, col:52> col:52 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FunctionTemplateDecl 0x7fc4135e72e8 <line:941:5, line:943:77> col:19 __append_forward_unsafe
| |-TemplateTypeParmDecl 0x7fc4135e7038 <line:941:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fc4135e7250 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:943:77> col:19 __append_forward_unsafe 'class std::__1::basic_string<char> &(_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fc4135e70d0 <col:43> col:59 '_ForwardIterator'
|   `-ParmVarDecl 0x7fc4135e7140 <col:61> col:77 '_ForwardIterator'
|-FunctionTemplateDecl 0x7fc4135e7aa8 <line:944:5, line:957:5> line:953:5 append
| |-TemplateTypeParmDecl 0x7fc4135e73d0 <line:944:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fc4135e7a10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:957:5> line:953:5 append 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value || !__libcpp_string_gets_noexcept_iterator<_InputIterator>::value, class basic_string<char> &>::type (_InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fc4135e7880 <col:12, col:27> col:27 __first '_InputIterator'
|   |-ParmVarDecl 0x7fc4135e78f0 <col:36, col:51> col:51 __last '_InputIterator'
|   `-AlwaysInlineAttr 0x7fc4135e7b08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc4135e8268 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:958:5, line:969:5> line:967:5 append
| |-TemplateTypeParmDecl 0x7fc4135e7bd8 <line:958:14, col:20> col:20 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fc4135e81d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:969:5> line:967:5 append 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && __libcpp_string_gets_noexcept_iterator<_ForwardIterator>::value, class basic_string<char> &>::type (_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fc4135e8040 <col:12, col:29> col:29 __first '_ForwardIterator'
|   |-ParmVarDecl 0x7fc4135e80b0 <col:38, col:55> col:55 __last '_ForwardIterator'
|   `-AlwaysInlineAttr 0x7fc4135e82c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e84f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:973:103> col:19 append 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fc4135e8428 <col:26, col:55> col:55 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fc4135e85a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e8700 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:976:5, col:34> col:10 push_back 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| `-ParmVarDecl 0x7fc4135e85f8 <col:20, col:31> col:31 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fc4135e87b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:978:19> col:10 pop_back 'void (void)'
| `-AlwaysInlineAttr 0x7fc4135e8858 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e8920 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:979:53> col:47 front 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (void)'
| `-AlwaysInlineAttr 0x7fc4135e89c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e8a60 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:980:55> col:47 front 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7fc4135e8b08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e8b70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:981:52> col:47 back 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (void)'
| `-AlwaysInlineAttr 0x7fc4135e8c18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e8c80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:982:54> col:47 back 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7fc4135e8d28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e8e08 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:985:87> col:19 assign 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fc4135e8d80 <col:26, col:38> col:38 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fc4135e8eb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e8f98 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:987:77> col:19 assign 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fc4135e8f10 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc4135e9048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e9170 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:992:51> line:990:19 assign 'class std::__1::basic_string<char> &(class std::__1::basic_string<char> &&)' noexcept-uninstantiated 0x7fc4141c99c0
| |-ParmVarDecl 0x7fc4135e90a0 <col:26, col:41> col:41 __str 'class std::__1::basic_string<char> &&'
| `-AlwaysInlineAttr 0x7fc4135e9268 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135e9438 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:994:5, col:88> col:19 assign 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc4135e92c0 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135e9330 <col:53, col:63> col:63 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135e93a0 <col:70, col:84> col:80 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7fc4135e9aa8 <line:995:5, line:1002:78> col:19 assign
| |-TemplateTypeParmDecl 0x7fc4135e94f8 <line:995:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fc4135e9a10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1002:78> col:19 assign 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7fc4135e9838 <col:26, col:38> col:38 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fc4135e98a8 <col:43, col:53> col:53 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7fc4135e9918 <col:60, col:74> col:70 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135e9ca8 <line:1003:5, col:62> col:19 assign 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc4135e9ba8 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fc4135e9c18 <col:49, col:59> col:59 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135e9df8 <line:1004:5, col:47> col:19 assign 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| `-ParmVarDecl 0x7fc4135e9d70 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fc4135e9fb8 <line:1005:5, col:55> col:19 assign 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fc4135e9eb8 <col:26, col:36> col:36 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135e9f28 <col:41, col:52> col:52 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FunctionTemplateDecl 0x7fc4135ea628 <line:1006:5, line:1014:61> col:9 assign
| |-TemplateTypeParmDecl 0x7fc4135ea070 <line:1006:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fc4135ea590 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1014:61> col:9 assign 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value || !__libcpp_string_gets_noexcept_iterator<_InputIterator>::value, class basic_string<char> &>::type (_InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fc4135ea440 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x7fc4135ea4b0 <col:40, col:55> col:55 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fc4135eaca8 <line:1015:5, line:1023:65> col:9 assign
| |-TemplateTypeParmDecl 0x7fc4135ea710 <line:1015:14, col:20> col:20 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fc4135eac10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1023:65> col:9 assign 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && __libcpp_string_gets_noexcept_iterator<_ForwardIterator>::value, class basic_string<char> &>::type (_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fc4135eaac0 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fc4135eab30 <col:42, col:59> col:59 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fc4135eaee0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1026:103> col:19 assign 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fc4135eae18 <col:26, col:55> col:55 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fc4135eaf90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135eb170 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1030:69> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fc4135eafe8 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135eb058 <col:44, col:64> col:64 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc4135eb228 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135eb400 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1032:113> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fc4135eb280 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135eb2f0 <col:44, col:56> col:56 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fc4135eb4b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc4135ebb78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1033:5, line:1040:96> col:19 insert
| |-TemplateTypeParmDecl 0x7fc4135eb500 <line:1033:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fc4135ebae0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1040:96> col:19 insert 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7fc4135eb810 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fc4135eb8a8 <col:44, col:55> col:55 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fc4135eb918 <col:60, col:70> col:70 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7fc4135eb988 <col:78, col:92> col:88 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135ebf10 <line:1041:5, col:107> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc4135ebc80 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135ebcf0 <col:44, col:64> col:64 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135ebd60 <col:71, col:81> col:81 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135ebdd0 <col:89, col:103> col:99 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135ec200 <line:1042:5, col:79> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc4135ebfe8 <col:26, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135ec058 <col:43, col:61> col:61 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fc4135ec0c8 <col:66, col:76> col:76 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135ec450 <line:1043:5, col:64> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fc4135ec2d0 <col:26, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135ec340 <col:43, col:61> col:61 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fc4135ec730 <line:1044:5, col:72> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fc4135ec518 <col:26, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135ec588 <col:43, col:53> col:53 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135ec5f8 <col:58, col:69> col:69 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fc4135ec980 <line:1045:5, col:62> col:19 insert 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fc4135ec800 <col:26, col:41> col:41 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| `-ParmVarDecl 0x7fc4135ec870 <col:48, col:59> col:59 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fc4135ecc60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1047:77> col:19 insert 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fc4135eca48 <col:26, col:41> col:41 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc4135ecab8 <col:48, col:58> col:58 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135ecb28 <col:63, col:74> col:74 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-AlwaysInlineAttr 0x7fc4135ecd20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc4135ed4a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1048:5, line:1056:83> col:9 insert
| |-TemplateTypeParmDecl 0x7fc4135ecd68 <line:1048:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fc4135ed410 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1056:83> col:9 insert 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value || !__libcpp_string_gets_noexcept_iterator<_InputIterator>::value, iterator>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, _InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fc4135ed1f0 <col:16, col:31> col:31 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7fc4135ed260 <col:38, col:53> col:53 __first '_InputIterator'
|   `-ParmVarDecl 0x7fc4135ed2d0 <col:62, col:77> col:77 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fc4135edcb8 <line:1057:5, line:1065:87> col:9 insert
| |-TemplateTypeParmDecl 0x7fc4135ed598 <line:1057:14, col:20> col:20 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fc4135edc20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1065:87> col:9 insert 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && __libcpp_string_gets_noexcept_iterator<_ForwardIterator>::value, iterator>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, _ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fc4135eda00 <col:16, col:31> col:31 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7fc4135eda70 <col:38, col:55> col:55 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fc4135edae0 <col:64, col:81> col:81 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fc4135edfc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1069:69> line:1068:14 insert 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fc4135eddb8 <col:21, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc4135edea8 <col:43, col:72> col:72 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fc4135ee078 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135ee250 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1072:5, col:66> col:19 erase 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc4135ee0d0 <col:25, col:43> col:35 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135ee140 <col:46, col:62> col:56 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135ee420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1074:45> col:19 erase 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator)'
| |-ParmVarDecl 0x7fc4135ee318 <col:25, col:40> col:40 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| `-AlwaysInlineAttr 0x7fc4135ee4d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135ee6b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1076:70> col:19 erase 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator)'
| |-ParmVarDecl 0x7fc4135ee528 <col:25, col:40> col:40 __first 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc4135ee598 <col:49, col:64> col:64 __last 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| `-AlwaysInlineAttr 0x7fc4135ee768 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135ee9d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1079:86> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fc4135ee7c0 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135ee830 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135ee8a0 <col:61, col:81> col:81 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc4135eea90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135eed00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1081:137> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fc4135eeae8 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135eeb58 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135eebc8 <col:61, col:73> col:73 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fc4135eedc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135ef140 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1082:5, col:125> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc4135eee18 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135eee88 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135eeef8 <col:61, col:81> col:81 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135eef68 <col:88, col:98> col:98 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135eefd8 <col:106, col:121> col:116 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7fc4135ef918 <line:1083:5, line:1090:114> col:19 replace
| |-TemplateTypeParmDecl 0x7fc4135ef210 <line:1083:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fc4135ef880 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1090:114> col:19 replace 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7fc4135ef520 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fc4135ef590 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fc4135ef628 <col:61, col:72> col:72 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fc4135ef698 <col:77, col:87> col:87 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7fc4135ef708 <col:95, col:110> col:105 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135efcc0 <line:1091:5, col:97> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc4135efa28 <col:27, col:37> col:37 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135efa98 <col:44, col:54> col:54 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135efb08 <col:60, col:78> col:78 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc4135efb78 <col:83, col:93> col:93 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-NoSanitizeAttr 0x7fc4135efd88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:453:69> unsigned-integer-overflow
|-CXXMethodDecl 0x7fc4135f0030 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1092:5, col:81> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fc4135efe18 <col:27, col:37> col:37 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135efe88 <col:44, col:54> col:54 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135efef8 <col:60, col:78> col:78 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fc4135f0390 <line:1093:5, col:90> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fc4135f0100 <col:27, col:37> col:37 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135f0170 <col:44, col:54> col:54 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135f01e0 <col:60, col:70> col:70 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135f0250 <col:76, col:87> col:87 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-NoSanitizeAttr 0x7fc4135f0458 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:453:69> unsigned-integer-overflow
|-CXXMethodDecl 0x7fc4135f0700 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1095:94> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fc4135f04e8 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc4135f0558 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc4135f05c8 <col:69, col:89> col:89 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc4135f07c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f1238 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1097:140> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fc4135f0818 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc4135f0888 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc4135f08f8 <col:69, col:81> col:81 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fc4135f12f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f15e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1099:105> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc4135f1350 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc4135f13c0 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc4135f1430 <col:69, col:87> col:87 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc4135f14a0 <col:92, col:102> col:102 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f16a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f1910 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1101:90> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fc4135f1700 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc4135f1770 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc4135f17e0 <col:69, col:87> col:87 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-AlwaysInlineAttr 0x7fc4135f19d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f1cc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1103:98> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fc4135f1a28 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc4135f1a98 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc4135f1b08 <col:69, col:79> col:79 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135f1b78 <col:84, col:95> col:95 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-AlwaysInlineAttr 0x7fc4135f1d88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc4135f2448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1104:5, line:1111:99> col:9 replace
| |-TemplateTypeParmDecl 0x7fc4135f1dd0 <line:1104:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fc4135f23b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1111:99> col:9 replace 'typename enable_if<__is_input_iterator<_InputIterator>::value, class basic_string<char> &>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, _InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fc4135f2110 <col:17, col:32> col:32 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7fc4135f2180 <col:38, col:53> col:53 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7fc4135f21f0 <col:59, col:74> col:74 __j1 '_InputIterator'
|   `-ParmVarDecl 0x7fc4135f2260 <col:80, col:95> col:95 __j2 '_InputIterator'
|-CXXMethodDecl 0x7fc4135f27e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1115:63> line:1114:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fc4135f2550 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc4135f25c0 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fc4135f26a8 <col:69, col:98> col:98 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fc4135f28a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f2af0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1118:5, col:73> col:15 copy 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7fc4135f2928 <col:20, col:32> col:32 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc4135f2998 <col:37, col:47> col:47 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135f2a08 <col:52, col:70> col:62 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135f2d40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1120:68> col:18 substr 'class std::__1::basic_string<char> (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7fc4135f2bc0 <col:25, col:43> col:35 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135f2c30 <col:46, col:62> col:56 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f2df8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f2f58 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1123:10 swap 'void (class std::__1::basic_string<char> &) noexcept'
| |-ParmVarDecl 0x7fc4135f2e50 <col:15, col:29> col:29 __str 'class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc4135f3008 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f30a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1132:62> col:23 c_str 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135f3150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f31c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1134:96> col:23 data 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135f3268 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f3338 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1141:70> col:20 get_allocator 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135f33e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f35c8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1144:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f3438 <col:20, col:40> col:40 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135f34a8 <col:47, col:65> col:57 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f3680 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f3828 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1146:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f36d8 <col:20, col:32> col:32 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fc4135f3748 <col:38, col:56> col:48 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f38e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f3b08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1147:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1147:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f3938 <col:20, col:38> col:38 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc4135f39a8 <col:43, col:53> col:53 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135f3a18 <col:60, col:70> col:70 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135f3d28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1149:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f3bd8 <col:20, col:38> col:38 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc4135f3c48 <col:43, col:61> col:53 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f3de0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f3f88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1150:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1150:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f3e38 <col:20, col:31> col:31 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-ParmVarDecl 0x7fc4135f3ea8 <col:36, col:54> col:46 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135f4158 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1153:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f4050 <col:21, col:41> col:41 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135f40c0 <col:48, col:66> col:58 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f4210 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f4370 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1155:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f4268 <col:21, col:33> col:33 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fc4135f42d8 <col:39, col:57> col:49 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f4428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f4600 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1156:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1156:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f4480 <col:21, col:39> col:39 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc4135f44f0 <col:44, col:54> col:54 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135f4560 <col:61, col:71> col:71 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135f47d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1158:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f46d0 <col:21, col:39> col:39 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc4135f4740 <col:44, col:62> col:54 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f4890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f49f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1159:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1159:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f48e8 <col:21, col:32> col:32 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-ParmVarDecl 0x7fc4135f4958 <col:37, col:55> col:47 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135f4bc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1162:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f4ab8 <col:29, col:49> col:49 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135f4b28 <col:56, col:74> col:66 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f4c78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f4dd8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1164:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f4cd0 <col:29, col:41> col:41 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fc4135f4d40 <col:47, col:65> col:57 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f4e90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f5068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1165:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1165:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f4ee8 <col:29, col:47> col:47 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc4135f4f58 <col:52, col:62> col:62 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135f4fc8 <col:69, col:79> col:79 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135f5240 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1167:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f5138 <col:29, col:47> col:47 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc4135f51a8 <col:52, col:70> col:62 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f52f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f5458 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1169:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f5350 <col:29, col:40> col:40 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7fc4135f53c0 <col:45, col:63> col:55 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f5510 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f5670 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1172:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f5568 <col:28, col:48> col:48 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135f55d8 <col:55, col:73> col:65 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f5728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f5888 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1174:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f5780 <col:28, col:40> col:40 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fc4135f57f0 <col:46, col:64> col:56 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f5940 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f5b18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1175:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1175:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f5998 <col:28, col:46> col:46 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc4135f5a08 <col:51, col:61> col:61 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135f5a78 <col:68, col:78> col:78 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135f5cf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1177:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f5be8 <col:28, col:46> col:46 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc4135f5c58 <col:51, col:69> col:61 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f5da8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f5f08 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1179:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f5e00 <col:28, col:39> col:39 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7fc4135f5e70 <col:44, col:62> col:54 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f5fc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f6120 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1182:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f6018 <col:33, col:53> col:53 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135f6088 <col:60, col:78> col:70 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f61d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f6338 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1184:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f6230 <col:33, col:45> col:45 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fc4135f62a0 <col:51, col:69> col:61 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f63f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f65c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1185:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1185:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f6448 <col:33, col:51> col:51 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc4135f64b8 <col:56, col:66> col:66 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135f6528 <col:73, col:83> col:83 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135f67a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1187:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f6698 <col:33, col:51> col:51 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc4135f6708 <col:56, col:74> col:66 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f6858 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f69b8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1189:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f68b0 <col:33, col:44> col:44 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7fc4135f6920 <col:49, col:67> col:59 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f6a70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f6bd0 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1192:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f6ac8 <col:32, col:52> col:52 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135f6b38 <col:59, col:77> col:69 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f6c88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f6de8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1194:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f6ce0 <col:32, col:44> col:44 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fc4135f6d50 <col:50, col:68> col:60 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f6ea0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f7078 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1195:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1195:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f6ef8 <col:32, col:50> col:50 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc4135f6f68 <col:55, col:65> col:65 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135f6fd8 <col:72, col:82> col:82 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135f7250 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1197:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f7148 <col:32, col:50> col:50 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc4135f71b8 <col:55, col:73> col:65 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f7308 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f7468 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1199:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fc4135f7360 <col:32, col:43> col:43 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7fc4135f73d0 <col:48, col:66> col:58 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f7520 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f7690 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1202:9 compare 'int (const class std::__1::basic_string<char> &) const noexcept'
| |-ParmVarDecl 0x7fc4135f7578 <col:17, col:37> col:37 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc4135f7740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f7870 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1204:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view) const noexcept'
| |-ParmVarDecl 0x7fc4135f7798 <col:17, col:29> col:29 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fc4135f7920 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f7b48 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1206:69> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view) const'
| |-ParmVarDecl 0x7fc4135f7978 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135f79e8 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135f7a58 <col:51, col:63> col:63 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fc4135f7c08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f7e78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1208:78> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &) const'
| |-ParmVarDecl 0x7fc4135f7c60 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135f7cd0 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135f7d40 <col:51, col:71> col:71 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc4135f7f38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f82b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1209:5, col:117> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7fc4135f7f90 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135f8000 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135f8070 <col:51, col:71> col:71 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135f80e0 <col:78, col:88> col:88 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135f8150 <col:96, col:111> col:106 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7fc4135f8b38 <line:1210:5, line:1217:106> col:9 compare
| |-TemplateTypeParmDecl 0x7fc4135f8388 <line:1210:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fc4135f8aa0 <line:1211:5, line:1217:106> col:9 compare 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, int>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const' inline
|   |-ParmVarDecl 0x7fc4135f8740 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fc4135f87b0 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fc4135f8848 <col:51, col:62> col:62 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fc4135f88b8 <col:67, col:77> col:77 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fc4135f8928 <col:85, col:100> col:95 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-AlwaysInlineAttr 0x7fc4135f8bb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fc4135f8d60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1218:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1218:9 compare 'int (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *) const noexcept'
| `-ParmVarDecl 0x7fc4135f8c90 <col:17, col:35> col:35 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fc4135f8fe8 <line:1219:5, col:74> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *) const'
| |-ParmVarDecl 0x7fc4135f8e20 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135f8e90 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135f8f00 <col:51, col:69> col:69 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fc4135f9308 <line:1220:5, col:90> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7fc4135f90b8 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135f9128 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135f9198 <col:51, col:69> col:69 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fc4135f9208 <col:74, col:84> col:84 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135f93d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1222:51> col:36 __invariants '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fc4135f9478 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f94c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1226:63> line:1225:10 __is_long '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135f9568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7fc4135f95b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1237:1, col:8> col:1 private
|-CXXMethodDecl 0x7fc4135f9668 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1240:31> line:1239:21 __alloc 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &(void) noexcept'
| `-AlwaysInlineAttr 0x7fc4135f9710 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f97b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1243:31> line:1242:27 __alloc 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &(void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135f9860 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f9988 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1270:63> line:1266:10 __set_short_size 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fc4135f98b8 <col:27, col:37> col:37 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f9a38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f9aa8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1278:47> line:1274:15 __get_short_size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135f9b50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f9c38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1285:41> line:1284:10 __set_long_size 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fc4135f9ba8 <col:26, col:36> col:36 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f9ce8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f9d58 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1288:42> line:1287:15 __get_long_size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135f9e00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135f9ee8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1291:76> line:1290:10 __set_size 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fc4135f9e58 <col:21, col:31> col:31 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135f9f98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fa080 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1295:55> line:1294:10 __set_long_cap 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fc4135f9ff0 <col:25, col:35> col:35 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135fa130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fa1a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1298:67> line:1297:15 __get_long_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135fa248 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fa368 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1302:41> line:1301:10 __set_long_pointer 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer) noexcept'
| |-ParmVarDecl 0x7fc4135fa2a0 <col:29, col:37> col:37 __p 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
| `-AlwaysInlineAttr 0x7fc4135fa418 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fa4e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1305:42> line:1304:13 __get_long_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer (void) noexcept'
| `-AlwaysInlineAttr 0x7fc4135fa590 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fa638 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1308:42> line:1307:19 __get_long_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135fa6e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fa750 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1311:82> line:1310:13 __get_short_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer (void) noexcept'
| `-AlwaysInlineAttr 0x7fc4135fa7f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fa868 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1314:88> line:1313:19 __get_short_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135fa910 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fa980 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1317:76> line:1316:13 __get_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer (void) noexcept'
| `-AlwaysInlineAttr 0x7fc4135faa28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135faa98 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1320:76> line:1319:19 __get_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc4135fab40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fab88 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1328:9> line:1323:10 __zero 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fc4135fac30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fc4135fae70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1330:5, line:1333:48> line:1332:19 __align_it
| |-NonTypeTemplateParmDecl 0x7fc4135fac88 <line:1330:15, col:25> col:25 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long' depth 0 index 0 __a
| `-CXXMethodDecl 0x7fc4135fadd8 <col:30, line:1333:48> line:1332:19 __align_it 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept' static
|   |-ParmVarDecl 0x7fc4135fad08 <col:30, col:40> col:40 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-AlwaysInlineAttr 0x7fc4135faec8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-EnumDecl 0x7fc4135faf98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1334:5> col:5
| `-EnumConstantDecl 0x7fc4135fb060 <col:11, col:25> col:11 __alignment 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1334:5)'
|   `-ImplicitCastExpr 0x7fc4135fb0a8 <col:25> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7fc4141dc100 <col:25> 'int' 16
|-CXXMethodDecl 0x7fc4135fb160 <line:1335:5, line:1339:79> line:1336:15 __recommend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept' static
| |-ParmVarDecl 0x7fc4135fb0d0 <col:27, col:37> col:37 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135fb210 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fb480 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1341:5, line:1342:75> col:10 __init 'void (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
| |-ParmVarDecl 0x7fc4135fb268 <col:17, col:35> col:35 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fc4135fb2d8 <col:40, col:50> col:50 __sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135fb348 <col:56, col:66> col:66 __reserve 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135fb690 <line:1343:5, line:1344:54> col:10 __init 'void (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
| |-ParmVarDecl 0x7fc4135fb550 <col:17, col:35> col:35 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fc4135fb5c0 <col:40, col:50> col:50 __sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135fb858 <line:1345:5, line:1346:46> col:10 __init 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)' inline
| |-ParmVarDecl 0x7fc4135fb758 <col:17, col:27> col:27 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135fb7c8 <col:32, col:43> col:43 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FunctionTemplateDecl 0x7fc4135fbe68 <line:1348:5, line:1355:57> col:5 __init
| |-TemplateTypeParmDecl 0x7fc4135fb910 <line:1348:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fc4135fbdd0 <line:1349:5, line:1355:57> col:5 __init 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value, void>::type (_InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fc4135fbc40 <col:12, col:27> col:27 __first '_InputIterator'
|   `-ParmVarDecl 0x7fc4135fbcb0 <col:36, col:51> col:51 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fc4135fc4a8 <line:1357:5, line:1364:61> col:5 __init
| |-TemplateTypeParmDecl 0x7fc4135fbf50 <line:1357:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fc4135fc410 <line:1358:5, line:1364:61> col:5 __init 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value, void>::type (_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fc4135fc280 <col:12, col:29> col:29 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fc4135fc2f0 <col:38, col:55> col:55 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fc4135fc940 <line:1366:5, line:1367:85> line:1366:10 __grow_by 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc4135fc5a0 <col:20, col:30> col:30 __old_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135fc610 <col:41, col:51> col:51 __delta_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135fc680 <col:64, col:74> col:74 __old_sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135fc6f0 <line:1367:20, col:30> col:30 __n_copy 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135fc760 <col:41, col:51> col:51 __n_del 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135fc7d0 <col:64, col:84> col:74 __n_add 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fc4135fce60 <line:1368:5, line:1370:82> line:1368:10 __grow_by_and_replace 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fc4135fca28 <col:32, col:42> col:42 __old_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135fca98 <col:53, col:63> col:63 __delta_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135fcb08 <col:76, col:86> col:86 __old_sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135fcb78 <line:1369:32, col:42> col:42 __n_copy 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135fcbe8 <col:53, col:63> col:63 __n_del 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fc4135fcc58 <line:1370:32, col:42> col:42 __n_add 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fc4135fccc8 <col:51, col:69> col:69 __p_new_stuff 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fc4135fcfd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1373:40> col:10 __erase_to_end 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc4135fcf50 <col:25, col:35> col:35 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135fd088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fd168 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1378:89> line:1376:10 __copy_assign_alloc 'void (const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fc4135fd0e0 <col:30, col:50> col:50 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc4135fd218 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fd3e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1405:9> line:1381:10 __copy_assign_alloc 'void (const class std::__1::basic_string<char> &, std::__1::true_type)'
| |-ParmVarDecl 0x7fc4135fd270 <col:30, col:50> col:50 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135fd2d0 <col:57> col:66 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fc4135fd498 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fd668 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1409:10> line:1408:10 __copy_assign_alloc 'void (const class std::__1::basic_string<char> &, std::__1::false_type) noexcept'
| |-ParmVarDecl 0x7fc4135fd4f0 <col:30, col:48> col:49 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135fd550 <col:51> col:61 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7fc4135fd720 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fd900 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1413:10 __move_assign 'void (class std::__1::basic_string<char> &, std::__1::false_type)' noexcept-uninstantiated 0x7fc4141dea38
| |-ParmVarDecl 0x7fc4135fd778 <col:24, col:38> col:38 __str 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135fd7d8 <col:45> col:55 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7fc4135fda10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fdbf0 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1416:10 __move_assign 'void (class std::__1::basic_string<char> &, std::__1::true_type)' noexcept-uninstantiated 0x7fc4141ded08
| |-ParmVarDecl 0x7fc4135fda68 <col:24, col:38> col:38 __str 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135fdac8 <col:45> col:54 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fc4135fdd00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fde30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1431:89> line:1426:5 __move_assign_alloc 'void (class std::__1::basic_string<char> &)' noexcept-uninstantiated 0x7fc4141def18
| |-ParmVarDecl 0x7fc4135fdd58 <col:25, col:39> col:39 __str 'class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fc4135fdf28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fe0c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1438:9> line:1434:10 __move_assign_alloc 'void (class std::__1::basic_string<char> &, std::__1::true_type)' noexcept-uninstantiated 0x7fc4141df158
| |-ParmVarDecl 0x7fc4135fdf80 <col:30, col:44> col:44 __c 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135fdfe0 <col:49> col:58 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fc4135fe1d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fe368 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1443:10> line:1441:10 __move_assign_alloc 'void (class std::__1::basic_string<char> &, std::__1::false_type) noexcept'
| |-ParmVarDecl 0x7fc4135fe228 <col:30, col:42> col:43 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fc4135fe288 <col:45> col:55 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7fc4135fe420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fe468 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1445:63> col:36 __invalidate_all_iterators 'void (void)'
| `-AlwaysInlineAttr 0x7fc4135fe510 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4135fe5f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1446:73> col:36 __invalidate_iterators_past 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fc4135fe568 <col:64> col:73 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fc4135fe6a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FriendDecl 0x7fc4135ff240 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1448:5, col:77> col:25
| `-FunctionDecl 0x7fc4135fe840 parent 0x7fc414198fd8 prev 0x7fc4135fefe0 <col:5, col:77> col:25 operator+ 'class std::__1::basic_string<char> (const class std::__1::basic_string<char> &, const class std::__1::basic_string<char> &)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7fc4135fe6f8 <col:37, col:55> col:56 'const class std::__1::basic_string<char> &'
|   `-ParmVarDecl 0x7fc4135fe768 <col:58, col:76> col:77 'const class std::__1::basic_string<char> &'
|-FriendDecl 0x7fc4135ffd08 <line:1449:5, col:75> col:25
| `-FunctionDecl 0x7fc4135ff410 parent 0x7fc414198fd8 prev 0x7fc4135ffae0 <col:5, col:75> col:25 operator+ 'class std::__1::basic_string<char> (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, const class std::__1::basic_string<char> &)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7fc4135ff288 <col:37, col:53> col:54 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|   `-ParmVarDecl 0x7fc4135ff2f8 <col:56, col:74> col:75 'const class std::__1::basic_string<char> &'
|-FriendDecl 0x7fc413600790 <line:1450:5, col:68> col:25
| `-FunctionDecl 0x7fc4135ffed0 parent 0x7fc414198fd8 prev 0x7fc4136005a0 <col:5, col:68> col:25 operator+ 'class std::__1::basic_string<char> (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, const class std::__1::basic_string<char> &)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7fc4135ffd50 <col:37> col:47 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|   `-ParmVarDecl 0x7fc4135ffdc0 <col:49, col:67> col:68 'const class std::__1::basic_string<char> &'
|-FriendDecl 0x7fc413602260 <line:1451:5, col:75> col:25
| `-FunctionDecl 0x7fc413600960 parent 0x7fc414198fd8 prev 0x7fc413601090 <col:5, col:75> col:25 operator+ 'class std::__1::basic_string<char> (const class std::__1::basic_string<char> &, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7fc4136007d8 <col:37, col:55> col:56 'const class std::__1::basic_string<char> &'
|   `-ParmVarDecl 0x7fc413600848 <col:58, col:74> col:75 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
`-FriendDecl 0x7fc413602cf0 <line:1452:5, col:68> col:25
  `-FunctionDecl 0x7fc413602430 parent 0x7fc414198fd8 prev 0x7fc413602b60 <col:5, col:68> col:25 operator+ 'class std::__1::basic_string<char> (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
    |-TemplateArgument type 'char'
    |-TemplateArgument type 'struct std::__1::char_traits<char>'
    |-TemplateArgument type 'class std::__1::allocator<char>'
    |-ParmVarDecl 0x7fc4136022a8 <col:37, col:55> col:56 'const class std::__1::basic_string<char> &'
    `-ParmVarDecl 0x7fc413602318 <col:58> col:68 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_string" = type { %"class.std::__1::__compressed_pair" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_string" = type { %"class.std::__1::__compressed_pair" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fc414291810 <object_model/8_memory_model/02_objects_memory_locations_and_concurrency.cpp:5:1, line:16:1> line:5:8 referenced struct D definition
|-CXXRecordDecl 0x7fc414291938 <col:1, col:8> col:8 implicit struct D
|-FieldDecl 0x7fc4142919e8 <line:6:5, col:9> col:9 i 'int'
|-FieldDecl 0x7fc414291a48 <line:7:5, col:12> col:12 d 'double'
|-FieldDecl 0x7fc414291ac8 <line:8:5, col:18> col:14 bf1 'unsigned int'
| `-IntegerLiteral 0x7fc414291a90 <col:18> 'int' 10
|-FieldDecl 0x7fc414291b48 <line:9:5, col:13> col:9 bf2 'int'
| `-IntegerLiteral 0x7fc414291b10 <col:13> 'int' 25
|-FieldDecl 0x7fc414291bc8 <line:10:5, col:13> col:9 bf3 'int'
| `-IntegerLiteral 0x7fc414291b90 <col:13> 'int' 1
|-FieldDecl 0x7fc414291c48 <line:11:5, col:13> col:9 bf4 'int'
| `-IntegerLiteral 0x7fc414291c10 <col:13> 'int' 9
|-FieldDecl 0x7fc414291ca8 <line:12:5, col:9> col:9 i2 'int'
|-FieldDecl 0x7fc414291d00 <line:13:5, col:10> col:10 c1 'char'
|-FieldDecl 0x7fc414291d58 <line:14:5, col:10> col:10 c2 'char'
|-FieldDecl 0x7fc414291e20 <line:15:5, col:17> col:17 s 'std::string':'class std::__1::basic_string<char>'
|-CXXConstructorDecl 0x7fc414291eb8 <line:5:8> col:8 implicit D 'void (struct D &&)' inline default noexcept-unevaluated 0x7fc414291eb8
| `-ParmVarDecl 0x7fc414291fe0 <col:8> col:8 'struct D &&'
|-CXXMethodDecl 0x7fc414292078 <col:8, <invalid sloc>> col:8 implicit operator= 'struct D &(struct D &&)' inline default noexcept-unevaluated 0x7fc414292078
| `-ParmVarDecl 0x7fc414292190 <col:8> col:8 'struct D &&'
`-CXXDestructorDecl 0x7fc414292218 <col:8> col:8 implicit ~D 'void (void)' inline default noexcept-unevaluated 0x7fc414292218

Layout: <CGRecordLayout
  LLVMType:%struct.D = type { i32, double, i16, i32, i16, i32, i8, i8, %"class.std::__1::basic_string" }
  NonVirtualBaseLLVMType:%struct.D = type { i32, double, i16, i32, i16, i32, i8, i8, %"class.std::__1::basic_string" }
  IsZeroInitializable:1
  BitFields:[
    <CGBitFieldInfo Offset:0 Size:10 IsSigned:0 StorageSize:16 StorageOffset:16>
    <CGBitFieldInfo Offset:0 Size:25 IsSigned:1 StorageSize:32 StorageOffset:20>
    <CGBitFieldInfo Offset:25 Size:1 IsSigned:1 StorageSize:32 StorageOffset:20>
    <CGBitFieldInfo Offset:0 Size:9 IsSigned:1 StorageSize:16 StorageOffset:24>
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc414293df8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:890:1, line:993:1> line:891:8 struct __atomic_base definition
|-TemplateArgument type 'struct D *'
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7fc414294030 prev 0x7fc414293df8 <col:1, col:8> col:8 implicit struct __atomic_base
|-FieldDecl 0x7fc414294140 <line:893:5, col:26> col:26 __a_ '_Atomic(struct D *)' mutable
|-CXXMethodDecl 0x7fc414294188 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:907:5> line:900:10 is_lock_free '_Bool (void) const volatile noexcept'
| `-AlwaysInlineAttr 0x7fc414294258 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4142942a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:910:82> line:909:10 is_lock_free '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fc414294348 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc414294518 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:914:46> line:912:10 store 'void (struct D *, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fc4142943a0 <col:16, col:20> col:20 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc414294400 <col:25, col:44> col:38 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fc4142945d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fc414295520 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fc414294518 'store' 'void (struct D *, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7fc4142954f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:913:40, line:566:35> '_Bool' '||'
|     |-BinaryOperator 0x7fc414294fe8 <line:913:40, line:565:35> '_Bool' '||'
|     | |-BinaryOperator 0x7fc414294ad8 <line:913:40, line:564:35> '_Bool' '=='
|     | | |-ImplicitCastExpr 0x7fc414294aa8 <line:913:40> 'int' <IntegralCast>
|     | | | `-ImplicitCastExpr 0x7fc414294a90 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | | |   `-DeclRefExpr 0x7fc414294618 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc414294400 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | | `-ImplicitCastExpr 0x7fc414294ac0 <line:564:35> 'int' <IntegralCast>
|     | |   `-DeclRefExpr 0x7fc4148c2cd8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc4148b8738 'memory_order_consume' 'enum std::__1::memory_order'
|     | `-BinaryOperator 0x7fc414294fc0 <line:913:40, line:565:35> '_Bool' '=='
|     |   |-ImplicitCastExpr 0x7fc414294f90 <line:913:40> 'int' <IntegralCast>
|     |   | `-ImplicitCastExpr 0x7fc414294f78 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     |   |   `-DeclRefExpr 0x7fc414294b00 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc414294400 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     |   `-ImplicitCastExpr 0x7fc414294fa8 <line:565:35> 'int' <IntegralCast>
|     |     `-DeclRefExpr 0x7fc4148c2d98 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc4148b8780 'memory_order_acquire' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fc4142954d0 <line:913:40, line:566:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fc4142954a0 <line:913:40> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fc414295488 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fc414295010 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc414294400 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fc4142954b8 <line:566:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fc4148c2e80 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc4148b8810 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fc414295718 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:918:46> line:916:10 store 'void (struct D *, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fc4142955a0 <col:16, col:20> col:20 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc414295600 <col:25, col:44> col:38 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fc4142957d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fc414296720 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fc414295718 'store' 'void (struct D *, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7fc4142966f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:917:40, line:566:35> '_Bool' '||'
|     |-BinaryOperator 0x7fc4142961e8 <line:917:40, line:565:35> '_Bool' '||'
|     | |-BinaryOperator 0x7fc414295cd8 <line:917:40, line:564:35> '_Bool' '=='
|     | | |-ImplicitCastExpr 0x7fc414295ca8 <line:917:40> 'int' <IntegralCast>
|     | | | `-ImplicitCastExpr 0x7fc414295c90 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | | |   `-DeclRefExpr 0x7fc414295818 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc414295600 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | | `-ImplicitCastExpr 0x7fc414295cc0 <line:564:35> 'int' <IntegralCast>
|     | |   `-DeclRefExpr 0x7fc4148c30e0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc4148b8738 'memory_order_consume' 'enum std::__1::memory_order'
|     | `-BinaryOperator 0x7fc4142961c0 <line:917:40, line:565:35> '_Bool' '=='
|     |   |-ImplicitCastExpr 0x7fc414296190 <line:917:40> 'int' <IntegralCast>
|     |   | `-ImplicitCastExpr 0x7fc414296178 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     |   |   `-DeclRefExpr 0x7fc414295d00 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc414295600 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     |   `-ImplicitCastExpr 0x7fc4142961a8 <line:565:35> 'int' <IntegralCast>
|     |     `-DeclRefExpr 0x7fc4148c31a0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc4148b8780 'memory_order_acquire' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fc4142966d0 <line:917:40, line:566:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fc4142966a0 <line:917:40> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fc414296688 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fc414296210 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc414295600 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fc4142966b8 <line:566:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fc4148c3288 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc4148b8810 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fc414296898 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:922:47> line:920:9 load 'struct D *(std::__1::memory_order) const volatile noexcept'
| |-ParmVarDecl 0x7fc414296790 <col:14, col:33> col:27 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fc414296948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fc414297388 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fc414296898 'load' 'struct D *(std::__1::memory_order) const volatile noexcept'
|   `-BinaryOperator 0x7fc414297360 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:921:39, line:571:35> '_Bool' '||'
|     |-BinaryOperator 0x7fc414296e50 <line:921:39, line:570:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fc414296e20 <line:921:39> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fc414296e08 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fc414296990 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc414296790 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fc414296e38 <line:570:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fc4148c3470 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc4148b87c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fc414297338 <line:921:39, line:571:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fc414297308 <line:921:39> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fc4142972f0 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fc414296e78 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc414296790 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fc414297320 <line:571:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fc4148c3530 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc4148b8810 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fc414297508 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:926:47> line:924:9 load 'struct D *(std::__1::memory_order) const noexcept'
| |-ParmVarDecl 0x7fc4142973f8 <col:14, col:33> col:27 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fc4142975b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fc414297ff8 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fc414297508 'load' 'struct D *(std::__1::memory_order) const noexcept'
|   `-BinaryOperator 0x7fc414297fd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:925:39, line:571:35> '_Bool' '||'
|     |-BinaryOperator 0x7fc414297ac0 <line:925:39, line:570:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fc414297a90 <line:925:39> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fc414297a78 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fc414297600 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc4142973f8 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fc414297aa8 <line:570:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fc4148c3718 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc4148b87c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fc414297fa8 <line:925:39, line:571:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fc414297f78 <line:925:39> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fc414297f60 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fc414297ae8 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc4142973f8 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fc414297f90 <line:571:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fc4148c37d8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc4148b8810 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXConversionDecl 0x7fc414298128 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:928:60> col:5 operator D * 'struct D *(void) const volatile noexcept'
| `-AlwaysInlineAttr 0x7fc4142981d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConversionDecl 0x7fc4142982b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:930:60> col:5 operator D * 'struct D *(void) const noexcept'
| `-AlwaysInlineAttr 0x7fc414298360 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc414298548 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:933:56> line:932:9 exchange 'struct D *(struct D *, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fc4142983c8 <col:18, col:22> col:22 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc414298428 <col:27, col:46> col:40 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fc414298600 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc4142987d8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:936:56> line:935:9 exchange 'struct D *(struct D *, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fc414298658 <col:18, col:22> col:22 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc4142986b8 <col:27, col:46> col:40 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fc414298890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc414298bc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:941:80> line:938:10 compare_exchange_weak '_Bool (struct D *&, struct D *, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fc414298948 <col:32, col:37> col:37 __e 'struct D *&'
| |-ParmVarDecl 0x7fc4142989b8 <col:42, col:46> col:46 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc414298a18 <line:939:32, col:45> col:45 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fc414298a78 <col:50, col:63> col:63 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fc414298c90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fc4142996d0 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fc414298bc8 'compare_exchange_weak' '_Bool (struct D *&, struct D *, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7fc4142996a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:940:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fc414299198 <line:940:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fc414299168 <line:940:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fc414299150 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fc414298cd8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc414298a78 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fc414299180 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fc4148ca9c0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc4148b87c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fc414299680 <line:940:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fc414299650 <line:940:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fc414299638 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fc4142991c0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc414298a78 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fc414299668 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fc4148caa80 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc4148b8810 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fc4142999c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:946:80> line:943:10 compare_exchange_weak '_Bool (struct D *&, struct D *, std::__1::memory_order, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fc414299750 <col:32, col:37> col:37 __e 'struct D *&'
| |-ParmVarDecl 0x7fc4142997c0 <col:42, col:46> col:46 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc414299820 <line:944:32, col:45> col:45 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fc414299880 <col:50, col:63> col:63 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fc414299a90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fc414a8b0f8 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fc4142999c8 'compare_exchange_weak' '_Bool (struct D *&, struct D *, std::__1::memory_order, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7fc414a8b0d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:945:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fc414299f98 <line:945:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fc414299f68 <line:945:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fc414299f50 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fc414299ad8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc414299880 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fc414299f80 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fc4148cac68 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc4148b87c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fc414a8b0a8 <line:945:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fc414a8b078 <line:945:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fc414a8b060 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fc414299fc0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc414299880 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fc414a8b090 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fc4148cad28 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc4148b8810 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fc414a8b350 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:951:82> line:948:10 compare_exchange_strong '_Bool (struct D *&, struct D *, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fc414a8b178 <col:34, col:39> col:39 __e 'struct D *&'
| |-ParmVarDecl 0x7fc414a8b1e8 <col:44, col:48> col:48 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc414a8b248 <line:949:34, col:47> col:47 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fc414a8b2a8 <col:52, col:65> col:65 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fc414a8b418 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fc414a8be58 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fc414a8b350 'compare_exchange_strong' '_Bool (struct D *&, struct D *, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7fc414a8be30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:950:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fc414a8b920 <line:950:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fc414a8b8f0 <line:950:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fc414a8b8d8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fc414a8b460 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc414a8b2a8 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fc414a8b908 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fc4148caf10 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc4148b87c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fc414a8be08 <line:950:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fc414a8bdd8 <line:950:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fc414a8bdc0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fc414a8b948 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc414a8b2a8 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fc414a8bdf0 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fc4148cafd0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc4148b8810 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fc414a8c0b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:956:82> line:953:10 compare_exchange_strong '_Bool (struct D *&, struct D *, std::__1::memory_order, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fc414a8bed8 <col:34, col:39> col:39 __e 'struct D *&'
| |-ParmVarDecl 0x7fc414a8bf48 <col:44, col:48> col:48 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc414a8bfa8 <line:954:34, col:47> col:47 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fc414a8c008 <col:52, col:65> col:65 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fc414a8c178 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fc414a8cbb8 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fc414a8c0b0 'compare_exchange_strong' '_Bool (struct D *&, struct D *, std::__1::memory_order, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7fc414a8cb90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:955:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fc414a8c680 <line:955:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fc414a8c650 <line:955:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fc414a8c638 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fc414a8c1c0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc414a8c008 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fc414a8c668 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fc4148cb1b8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc4148b87c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fc414a8cb68 <line:955:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fc414a8cb38 <line:955:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fc414a8cb20 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fc414a8c6a8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fc414a8c008 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fc414a8cb50 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fc4148cb278 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fc4148b8810 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fc414a8ce48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:960:80> line:958:10 compare_exchange_weak '_Bool (struct D *&, struct D *, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fc414a8cc38 <col:32, col:37> col:37 __e 'struct D *&'
| |-ParmVarDecl 0x7fc414a8cca8 <col:42, col:46> col:46 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc414a8cd08 <line:959:31, col:50> col:44 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fc414a8cf08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc414a8d168 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:964:80> line:962:10 compare_exchange_weak '_Bool (struct D *&, struct D *, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fc414a8cf60 <col:32, col:37> col:37 __e 'struct D *&'
| |-ParmVarDecl 0x7fc414a8cfd0 <col:42, col:46> col:46 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc414a8d030 <line:963:32, col:51> col:45 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fc414a8d228 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc414a8d3f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:968:82> line:966:10 compare_exchange_strong '_Bool (struct D *&, struct D *, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fc414a8d280 <col:34, col:39> col:39 __e 'struct D *&'
| |-ParmVarDecl 0x7fc414a8d2f0 <col:44, col:48> col:48 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc414a8d350 <line:967:31, col:50> col:44 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fc414a8d4b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fc414a8d678 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:972:82> line:970:10 compare_exchange_strong '_Bool (struct D *&, struct D *, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fc414a8d508 <col:34, col:39> col:39 __e 'struct D *&'
| |-ParmVarDecl 0x7fc414a8d578 <col:44, col:48> col:48 __d 'struct D *':'struct D *'
| |-ParmVarDecl 0x7fc414a8d5d8 <line:971:34, col:53> col:47 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fc414a8d738 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc414a8d7c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:976:39> col:5 __atomic_base 'void (void) noexcept' default trivial
| `-AlwaysInlineAttr 0x7fc414a8d878 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc414a8d9f8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:982:69> col:23 used constexpr __atomic_base 'void (struct D *) noexcept'
| |-ParmVarDecl 0x7fc414a8d8d0 <col:37, col:41> col:41 used __d 'struct D *':'struct D *'
| |-CXXCtorInitializer Field 0x7fc414294140 '__a_' '_Atomic(struct D *)'
| | `-ImplicitCastExpr 0x7fc414a91178 <col:63> '_Atomic(struct D *)' <NonAtomicToAtomic>
| |   `-ImplicitCastExpr 0x7fc414a91160 <col:63> 'struct D *':'struct D *' <LValueToRValue>
| |     `-DeclRefExpr 0x7fc414a91108 <col:63> 'struct D *':'struct D *' lvalue ParmVar 0x7fc414a8d8d0 '__d' 'struct D *':'struct D *'
| |-CompoundStmt 0x7fc4148c47d8 <col:68, col:69>
| `-AlwaysInlineAttr 0x7fc414a8dab8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fc414a8dc20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:984:5, col:48> col:5 __atomic_base 'void (const struct std::__1::__atomic_base<struct D *, false> &)' delete trivial
| `-ParmVarDecl 0x7fc414a8db38 <col:19, col:38> col:39 'const struct std::__1::__atomic_base<struct D *, false> &'
|-CXXMethodDecl 0x7fc414a8dde0 <line:985:5, col:59> col:20 operator= 'struct std::__1::__atomic_base<struct D *, false> &(const struct std::__1::__atomic_base<struct D *, false> &)' delete trivial
| `-ParmVarDecl 0x7fc414a8dd18 <col:30, col:49> col:50 'const struct std::__1::__atomic_base<struct D *, false> &'
|-CXXMethodDecl 0x7fc414a8df60 <line:986:5, col:68> col:20 operator= 'struct std::__1::__atomic_base<struct D *, false> &(const struct std::__1::__atomic_base<struct D *, false> &) volatile' delete trivial
| `-ParmVarDecl 0x7fc414a8dea0 <col:30, col:49> col:50 'const struct std::__1::__atomic_base<struct D *, false> &'
`-CXXDestructorDecl 0x7fc414a90f68 <line:891:8> col:8 implicit ~__atomic_base 'void (void)' inline default trivial noexcept-unevaluated 0x7fc414a90f68

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__atomic_base" = type { %struct.D* }
  NonVirtualBaseLLVMType:%"struct.std::__1::__atomic_base" = type { %struct.D* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fc414292358 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1103:1, line:1159:1> line:1104:8 struct atomic definition
|-public '__atomic_base<struct D *>':'struct std::__1::__atomic_base<struct D *, false>'
|-TemplateArgument type 'struct D *'
|-CXXRecordDecl 0x7fc414a8e098 prev 0x7fc414292358 <col:1, col:8> col:8 implicit struct atomic
|-TypedefDecl 0x7fc414a8e438 <line:1107:5, col:33> col:33 __base '__atomic_base<struct D *>':'struct std::__1::__atomic_base<struct D *, false>'
| `-TemplateSpecializationType 0x7fc414a8e3c0 '__atomic_base<struct D *>' sugar __atomic_base
|   |-TemplateArgument type 'struct D *'
|   `-RecordType 0x7fc414293f00 'struct std::__1::__atomic_base<struct D *, false>'
|     `-ClassTemplateSpecialization 0x7fc414293df8 '__atomic_base'
|-CXXConstructorDecl 0x7fc414a8e4d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:818:33> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1109:5 atomic 'void (void)' default trivial noexcept-unevaluated 0x7fc414a8e4d0
