
*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__scalar_hash<struct std::__1::_PairT, 2> (empty)
         0 |   struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1509:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<unsigned long, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1000000000, 1>, false, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_mutex_t
         0 |   long __sig
         8 |   char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_cond_t
         0 |   long __sig
         8 |   char [40] __opaque
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1, 1>, true, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct _opaque_pthread_t *, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::hash<struct _opaque_pthread_t *> (empty)
         0 |   struct std::__1::unary_function<struct _opaque_pthread_t *, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__thread_struct
         0 |   class std::__1::__thread_struct_imp * __p_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::shared_ptr<struct D1>
         0 |   std::__1::shared_ptr<struct D1>::element_type * __ptr_
         8 |   class std::__1::__shared_weak_count * __cntrl_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__basic_string_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (empty)
         0 |   class std::__1::allocator<char> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<char>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |       class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct D1
         0 |   class std::__1::basic_string<char> s
         0 |     class std::__1::__basic_string_common<true> (base) (empty)
         0 |     class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |       struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false> (base)
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __value_
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |               union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |                 unsigned char __size_
         0 |                 std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |             struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
         0 |       struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true> (base) (empty)
         0 |         class std::__1::allocator<char> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fcfd4aec728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:585:90> col:64 class __basic_string_common definition
|-TemplateArgument integral 1
|-VisibilityAttr 0x7fcfd4aec8b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fcfd4aec968 prev 0x7fcfd4aec728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:560:1, col:28> col:28 implicit class __basic_string_common
|-AccessSpecDecl 0x7fcfd4aeca00 <line:562:1, col:10> col:1 protected
|-CXXMethodDecl 0x7fcfd4aeca28 <line:563:22, col:50> col:27 __throw_length_error 'void (void) const'
| `-CXX11NoReturnAttr 0x7fcfd4aecaf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
|-CXXMethodDecl 0x7fcfd4aecb40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:564:22, col:50> col:27 __throw_out_of_range 'void (void) const'
| `-CXX11NoReturnAttr 0x7fcfd4aecbe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
`-CXXDestructorDecl 0x7fcfd4283d70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:585:64> col:64 implicit ~__basic_string_common 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fcfd423f6f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:701:5, line:706:5> line:701:12 struct __long definition
|-CXXRecordDecl 0x7fcfd423fb68 prev 0x7fcfd423f6f0 <col:5, col:12> col:12 implicit struct __long
|-FieldDecl 0x7fcfd423fc30 <line:703:9, col:19> col:19 __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7fcfd423fc88 <line:704:9, col:19> col:19 __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7fcfd423fce0 <line:705:9, col:19> col:19 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
`-CXXDestructorDecl 0x7fcfd42840e8 <line:701:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fcfd42405a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9, line:725:9> line:721:9 union definition
|-FieldDecl 0x7fcfd4240728 <line:723:13, col:27> col:27 __size_ 'unsigned char'
|-FieldDecl 0x7fcfd4240780 <line:724:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
`-CXXDestructorDecl 0x7fcfd4284548 <line:721:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon.0 = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fcfd42400c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:5, line:727:5> line:719:12 struct __short definition
|-CXXRecordDecl 0x7fcfd4240510 prev 0x7fcfd42400c0 <col:5, col:12> col:12 implicit struct __short
|-CXXRecordDecl 0x7fcfd42405a8 <line:721:9, line:725:9> line:721:9 union definition
| |-FieldDecl 0x7fcfd4240728 <line:723:13, col:27> col:27 __size_ 'unsigned char'
| |-FieldDecl 0x7fcfd4240780 <line:724:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-CXXDestructorDecl 0x7fcfd4284548 <line:721:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7fcfd42407e8 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
|-IndirectFieldDecl 0x7fcfd4240840 <line:723:27> col:27 implicit __size_ 'unsigned char'
| |-Field 0x7fcfd42407e8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| `-Field 0x7fcfd4240728 '__size_' 'unsigned char'
|-IndirectFieldDecl 0x7fcfd4240890 <line:724:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-Field 0x7fcfd42407e8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| `-Field 0x7fcfd4240780 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FieldDecl 0x7fcfd4240958 <line:726:9, col:37> col:20 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
`-CXXDestructorDecl 0x7fcfd42841c8 <line:719:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fcfd4240d58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:735:5, line:738:5> line:735:12 struct __raw definition
|-CXXRecordDecl 0x7fcfd42417b0 prev 0x7fcfd4240d58 <col:5, col:12> col:12 implicit struct __raw
|-FieldDecl 0x7fcfd4241908 <line:737:9, col:36> col:19 __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
`-CXXDestructorDecl 0x7fcfd42842a8 <line:735:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fcfd4241508 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9, line:747:9> line:742:9 union definition
|-FieldDecl 0x7fcfd4241698 <line:744:13, col:21> col:21 __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-FieldDecl 0x7fcfd42416f0 <line:745:13, col:21> col:21 __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-FieldDecl 0x7fcfd4241970 <line:746:13, col:21> col:21 __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
`-CXXDestructorDecl 0x7fcfd4284468 <line:742:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fcfd4240e20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:5, line:748:5> line:740:12 struct __rep definition
|-CXXRecordDecl 0x7fcfd4241470 prev 0x7fcfd4240e20 <col:5, col:12> col:12 implicit struct __rep
|-CXXRecordDecl 0x7fcfd4241508 <line:742:9, line:747:9> line:742:9 union definition
| |-FieldDecl 0x7fcfd4241698 <line:744:13, col:21> col:21 __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-FieldDecl 0x7fcfd42416f0 <line:745:13, col:21> col:21 __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-FieldDecl 0x7fcfd4241970 <line:746:13, col:21> col:21 __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| `-CXXDestructorDecl 0x7fcfd4284468 <line:742:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7fcfd42419d8 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
|-IndirectFieldDecl 0x7fcfd4241a30 <line:744:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-Field 0x7fcfd42419d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| `-Field 0x7fcfd4241698 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-IndirectFieldDecl 0x7fcfd4241a80 <line:745:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-Field 0x7fcfd42419d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| `-Field 0x7fcfd42416f0 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-IndirectFieldDecl 0x7fcfd4241ad0 <line:746:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-Field 0x7fcfd42419d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| `-Field 0x7fcfd4241970 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
`-CXXDestructorDecl 0x7fcfd4284008 <line:740:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fcfd4242220 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2034:1, line:2067:1> line:2037:8 struct __compressed_pair_elem definition
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument integral 0
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7fcfd42424a0 prev 0x7fcfd4242220 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7fcfd4242548 <line:2038:3, col:15> col:15 _ParamT 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-SubstTemplateTypeParmType 0x7fcfd4241180 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|   |-TemplateTypeParmType 0x7fcfd51fcc50 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fcfd51fcc08 '_Tp'
|   `-RecordType 0x7fcfd4240ec0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|     `-CXXRecord 0x7fcfd4240e20 '__rep'
|-TypedefDecl 0x7fcfd4242608 <line:2039:3, col:16> col:16 referenced reference 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
| `-LValueReferenceType 0x7fcfd42425d0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
|   `-SubstTemplateTypeParmType 0x7fcfd4241180 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|     |-TemplateTypeParmType 0x7fcfd51fcc50 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fcfd51fcc08 '_Tp'
|     `-RecordType 0x7fcfd4240ec0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|       `-CXXRecord 0x7fcfd4240e20 '__rep'
|-TypedefDecl 0x7fcfd42426c8 <line:2040:3, col:22> col:22 referenced const_reference 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
| `-LValueReferenceType 0x7fcfd4242690 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
|   `-QualType 0x7fcfd4241181 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' const
|     `-SubstTemplateTypeParmType 0x7fcfd4241180 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|       |-TemplateTypeParmType 0x7fcfd51fcc50 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fcfd51fcc08 '_Tp'
|       `-RecordType 0x7fcfd4240ec0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|         `-CXXRecord 0x7fcfd4240e20 '__rep'
|-CXXConstructorDecl 0x7fcfd4242760 <line:2043:3, col:52> col:13 constexpr __compressed_pair_elem 'void (void)'
|-FunctionTemplateDecl 0x7fcfd4245b58 <line:2045:3, line:2050:44> line:2049:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fcfd4242818 <line:2045:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fcfd4242888 <col:24, line:2047:6> line:2045:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<struct __rep, 0, false>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7fcfd4245ab0 <line:2048:3, line:2050:44> line:2049:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7fcfd42459c8 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7fcfd42461d8 <line:2052:3, line:2056:75> line:2054:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fcfd4245c38 <line:2052:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7fcfd4245ca8 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7fcfd4246130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2056:75> line:2054:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7fcfd4245d20 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fcfd4245e88 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7fcfd4245fd8 <line:2055:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7fcfd4246268 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd42463e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2062:3, col:50> col:13 __get 'std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>::reference (void) noexcept'
|-CXXMethodDecl 0x7fcfd4246538 <line:2063:3, col:62> col:19 __get 'std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>::const_reference (void) const noexcept'
|-AccessSpecDecl 0x7fcfd42465e0 <line:2065:1, col:8> col:1 private
|-FieldDecl 0x7fcfd4246618 <line:2066:3, col:7> col:7 __value_ 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
`-CXXDestructorDecl 0x7fcfd4283f28 <line:2037:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fcfd50dace8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:101:1, col:52> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28 class allocator definition
|-TemplateArgument type 'char'
|-CXXRecordDecl 0x7fcfd42287c8 prev 0x7fcfd50dace8 <col:1, col:28> col:28 implicit class allocator
|-AccessSpecDecl 0x7fcfd4228860 <line:1722:1, col:7> col:1 public
|-TypedefDecl 0x7fcfd4228888 <line:1723:5, col:31> col:31 referenced size_type 'size_t':'unsigned long'
| `-TypedefType 0x7fcfd38d15d0 'size_t' sugar
|   |-Typedef 0x7fcfd38697b0 'size_t'
|   `-BuiltinType 0x7fcfd3833c80 'unsigned long'
|-TypedefDecl 0x7fcfd42288e0 <line:1724:5, col:31> col:31 referenced difference_type 'ptrdiff_t':'long'
| `-TypedefType 0x7fcfd511a510 'ptrdiff_t' sugar
|   |-Typedef 0x7fcfd3869740 'ptrdiff_t'
|   `-BuiltinType 0x7fcfd3833be0 'long'
|-TypedefDecl 0x7fcfd42289a8 <line:1725:5, col:31> col:31 referenced pointer 'char *'
| `-PointerType 0x7fcfd4228970 'char *'
|   `-SubstTemplateTypeParmType 0x7fcfd4228940 'char' sugar
|     |-TemplateTypeParmType 0x7fcfd51ec550 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fcfd51ec508 '_Tp'
|     `-BuiltinType 0x7fcfd3833b60 'char'
|-TypedefDecl 0x7fcfd4228a38 <line:1726:5, col:31> col:31 referenced const_pointer 'const char *'
| `-PointerType 0x7fcfd4228a00 'const char *'
|   `-QualType 0x7fcfd4228941 'const char' const
|     `-SubstTemplateTypeParmType 0x7fcfd4228940 'char' sugar
|       |-TemplateTypeParmType 0x7fcfd51ec550 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fcfd51ec508 '_Tp'
|       `-BuiltinType 0x7fcfd3833b60 'char'
|-TypedefDecl 0x7fcfd4228ac8 <line:1727:5, col:31> col:31 reference 'char &'
| `-LValueReferenceType 0x7fcfd4228a90 'char &'
|   `-SubstTemplateTypeParmType 0x7fcfd4228940 'char' sugar
|     |-TemplateTypeParmType 0x7fcfd51ec550 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fcfd51ec508 '_Tp'
|     `-BuiltinType 0x7fcfd3833b60 'char'
|-TypedefDecl 0x7fcfd4228b58 <line:1728:5, col:31> col:31 const_reference 'const char &'
| `-LValueReferenceType 0x7fcfd4228b20 'const char &'
|   `-QualType 0x7fcfd4228941 'const char' const
|     `-SubstTemplateTypeParmType 0x7fcfd4228940 'char' sugar
|       |-TemplateTypeParmType 0x7fcfd51ec550 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fcfd51ec508 '_Tp'
|       `-BuiltinType 0x7fcfd3833b60 'char'
|-TypedefDecl 0x7fcfd4228bc0 <line:1729:5, col:31> col:31 referenced value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fcfd4228940 'char' sugar
|   |-TemplateTypeParmType 0x7fcfd51ec550 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fcfd51ec508 '_Tp'
|   `-BuiltinType 0x7fcfd3833b60 'char'
|-TypedefDecl 0x7fcfd4228c18 <line:1731:5, col:23> col:23 referenced propagate_on_container_move_assignment 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fcfd38b3b00 'std::__1::true_type' sugar
|   |-Typedef 0x7fcfd38b2410 'true_type'
|   `-TemplateSpecializationType 0x7fcfd38b2320 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fcfd38b2128 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fcfd38b2110 <line:528:31> '_Bool' true
|     `-RecordType 0x7fcfd38b2300 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fcfd38b2200 'integral_constant'
|-TypedefDecl 0x7fcfd4228c70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1732:5, col:23> col:23 referenced is_always_equal 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fcfd38b3b00 'std::__1::true_type' sugar
|   |-Typedef 0x7fcfd38b2410 'true_type'
|   `-TemplateSpecializationType 0x7fcfd38b2320 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fcfd38b2128 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fcfd38b2110 <line:528:31> '_Bool' true
|     `-RecordType 0x7fcfd38b2300 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fcfd38b2200 'integral_constant'
|-ClassTemplateDecl 0x7fcfd4228de8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1734:5, col:33> col:33 rebind
| |-TemplateTypeParmDecl 0x7fcfd4228cc8 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXRecordDecl 0x7fcfd4228d50 <col:26, col:33> col:33 struct rebind
|-CXXConstructorDecl 0x7fcfd4229038 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1736:54> col:31 allocator 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fcfd4229118 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fcfd422a480 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:5, col:96> col:52 allocator
| |-TemplateTypeParmDecl 0x7fcfd4229160 <col:15, col:21> col:21 class depth 0 index 0 _Up
| |-CXXConstructorDecl 0x7fcfd422a3d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:96> col:52 allocator 'void (const allocator<_Up> &) noexcept'
| | |-ParmVarDecl 0x7fcfd422a2b0 <col:62, col:82> col:83 'const allocator<_Up> &'
| | `-AlwaysInlineAttr 0x7fcfd422a4d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-CXXConstructorDecl 0x7fcfd4286978 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:96> col:52 allocator 'void (const allocator<char> &) noexcept'
|   |-TemplateArgument type 'char'
|   |-ParmVarDecl 0x7fcfd42868b0 <col:62, col:82> col:83 'const allocator<char> &'
|   `-AlwaysInlineAttr 0x7fcfd4286a80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd422a708 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1739:39> line:1738:39 address 'std::__1::allocator<char>::pointer (std::__1::allocator<char>::reference) const noexcept'
| |-ParmVarDecl 0x7fcfd422a600 <col:47, col:57> col:57 __x 'std::__1::allocator<char>::reference':'char &'
| `-AlwaysInlineAttr 0x7fcfd422a7b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd422a958 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1741:39> line:1740:45 address 'std::__1::allocator<char>::const_pointer (std::__1::allocator<char>::const_reference) const noexcept'
| |-ParmVarDecl 0x7fcfd422a850 <col:53, col:69> col:69 __x 'std::__1::allocator<char>::const_reference':'const char &'
| `-AlwaysInlineAttr 0x7fcfd422aa08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd422abc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1748:9> line:1742:39 allocate 'std::__1::allocator<char>::pointer (std::__1::allocator::size_type, allocator<void>::const_pointer)'
| |-ParmVarDecl 0x7fcfd422aa50 <col:48, col:58> col:58 __n 'std::__1::allocator::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd422aab0 <col:63, col:96> col:94 'allocator<void>::const_pointer':'const void *'
| `-AlwaysInlineAttr 0x7fcfd422ac78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd422ae08 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1750:49> line:1749:36 deallocate 'void (std::__1::allocator<char>::pointer, std::__1::allocator::size_type) noexcept'
| |-ParmVarDecl 0x7fcfd422acd0 <col:47, col:55> col:55 __p 'std::__1::allocator<char>::pointer':'char *'
| |-ParmVarDecl 0x7fcfd422ad30 <col:60> col:69 'std::__1::allocator::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd422aec0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd422af08 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1752:45> line:1751:41 max_size 'std::__1::allocator::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd422afb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fcfd422b3d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1754:5, line:1760:9> line:1757:9 construct
| |-TemplateTypeParmDecl 0x7fcfd422aff8 <line:1754:15, col:21> col:21 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fcfd422b068 <col:26, col:35> col:35 class depth 0 index 1 ... _Args
| `-CXXMethodDecl 0x7fcfd422b340 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1760:9> line:1757:9 construct 'void (_Up *, _Args &&...)'
|   |-ParmVarDecl 0x7fcfd422b138 <col:19, col:24> col:24 __p '_Up *'
|   |-ParmVarDecl 0x7fcfd422b228 <col:29, col:40> col:40 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7fcfd422b438 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd422b620 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1814:70> col:36 destroy 'void (std::__1::allocator<char>::pointer)'
| |-ParmVarDecl 0x7fcfd422b518 <col:44, col:52> col:52 __p 'std::__1::allocator<char>::pointer':'char *'
| `-AlwaysInlineAttr 0x7fcfd422b6d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fcfd4248938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28> col:28 implicit referenced ~allocator 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fcfd4282978 <col:28> col:28 implicit constexpr allocator 'void (const class std::__1::allocator<char> &)' inline default trivial noexcept-unevaluated 0x7fcfd4282978
| `-ParmVarDecl 0x7fcfd4282a60 <col:28> col:28 'const class std::__1::allocator<char> &'
`-CXXConstructorDecl 0x7fcfd4282af8 <col:28> col:28 implicit referenced constexpr allocator 'void (class std::__1::allocator<char> &&) noexcept' inline default trivial
  `-ParmVarDecl 0x7fcfd4282c20 <col:28> col:28 'class std::__1::allocator<char> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fcfd4247060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2069:1, line:2099:1> line:2070:8 struct __compressed_pair_elem definition
|-private 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-TemplateArgument integral 1
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7fcfd42473f8 prev 0x7fcfd4247060 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7fcfd42474a0 <line:2071:3, col:15> col:15 _ParamT 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7fcfd42472c0 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7fcfd51ff4a0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fcfd51ff460 '_Tp'
|   `-RecordType 0x7fcfd50dadd0 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7fcfd50dace8 'allocator'
|-TypedefDecl 0x7fcfd4247538 <line:2072:3, col:16> col:16 referenced reference 'class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7fcfd4247500 'class std::__1::allocator<char> &'
|   `-SubstTemplateTypeParmType 0x7fcfd42472c0 'class std::__1::allocator<char>' sugar
|     |-TemplateTypeParmType 0x7fcfd51ff4a0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fcfd51ff460 '_Tp'
|     `-RecordType 0x7fcfd50dadd0 'class std::__1::allocator<char>'
|       `-ClassTemplateSpecialization 0x7fcfd50dace8 'allocator'
|-TypedefDecl 0x7fcfd42475c8 <line:2073:3, col:22> col:22 referenced const_reference 'const class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7fcfd4247590 'const class std::__1::allocator<char> &'
|   `-QualType 0x7fcfd42472c1 'const class std::__1::allocator<char>' const
|     `-SubstTemplateTypeParmType 0x7fcfd42472c0 'class std::__1::allocator<char>' sugar
|       |-TemplateTypeParmType 0x7fcfd51ff4a0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fcfd51ff460 '_Tp'
|       `-RecordType 0x7fcfd50dadd0 'class std::__1::allocator<char>'
|         `-ClassTemplateSpecialization 0x7fcfd50dace8 'allocator'
|-TypedefDecl 0x7fcfd4247630 <line:2074:3, col:15> col:15 __value_type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7fcfd42472c0 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7fcfd51ff4a0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fcfd51ff460 '_Tp'
|   `-RecordType 0x7fcfd50dadd0 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7fcfd50dace8 'allocator'
|-CXXConstructorDecl 0x7fcfd42476c8 <line:2077:3, col:46> col:13 __compressed_pair_elem 'void (void)' default noexcept-unevaluated 0x7fcfd42476c8
|-FunctionTemplateDecl 0x7fcfd4247ea8 <line:2079:3, line:2084:48> line:2083:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fcfd4247780 <line:2079:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fcfd42477e8 <col:24, line:2081:6> line:2079:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<class allocator<char>, 1, true>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7fcfd4247e00 <line:2082:3, line:2084:48> line:2083:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7fcfd4247d18 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7fcfd42484d8 <line:2086:3, line:2090:79> line:2088:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fcfd4247f88 <line:2086:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7fcfd4247ff8 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7fcfd4248430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2090:79> line:2088:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7fcfd4248070 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fcfd42481d8 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7fcfd4248328 <line:2089:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7fcfd4248568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd42486e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2097:3, col:47> col:13 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>::reference (void) noexcept'
|-CXXMethodDecl 0x7fcfd4248838 <line:2098:3, col:59> col:19 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>::const_reference (void) const noexcept'
`-CXXDestructorDecl 0x7fcfd4284388 <line:2070:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem.1" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem.1" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fcfd4240f10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2104:1, line:2201:1> line:2105:7 class __compressed_pair definition
|-private '__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0>':'struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>'
|-private '__compressed_pair_elem<class std::__1::allocator<char>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>'
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-CXXRecordDecl 0x7fcfd4248a60 prev 0x7fcfd4240f10 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7fcfd4248e08 <line:2107:3, col:42> col:42 _Base1 '__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0>':'struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>'
| `-TemplateSpecializationType 0x7fcfd4248d60 '__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fcfd52024d8 <col:39> 'int' 0
|   `-RecordType 0x7fcfd4242340 'struct std::__1::__compressed_pair_elem<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, 0, false>'
|     `-ClassTemplateSpecialization 0x7fcfd4242220 '__compressed_pair_elem'
|-TypedefDecl 0x7fcfd4249168 <line:2108:3, col:42> col:42 _Base2 '__compressed_pair_elem<class std::__1::allocator<char>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>'
| `-TemplateSpecializationType 0x7fcfd42490c0 '__compressed_pair_elem<class std::__1::allocator<char>, 1>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fcfd5202888 <col:39> 'int' 1
|   `-RecordType 0x7fcfd4247180 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<char>, 1, true>'
|     `-ClassTemplateSpecialization 0x7fcfd4247060 '__compressed_pair_elem'
|-StaticAssertDecl 0x7fcfd42495e8 <line:2114:3, line:2117:44> line:2114:3
| |-ParenExpr 0x7fcfd42495c8 <col:17, col:43> '_Bool'
| | `-UnaryOperator 0x7fcfd42495a8 <col:18, col:38> '_Bool' prefix '!'
| |   `-ImplicitCastExpr 0x7fcfd4249590 <col:19, col:38> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7fcfd4249558 <col:19, col:38> 'const _Bool':'const _Bool' lvalue Var 0x7fcfd41056f8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fcfd5202db8 <line:2115:5, line:2117:5> 'const char [179]' lvalue "__compressed_pair cannot be instantated when T1 and T2 are the same type; The current implementation is NOT ABI-compatible with the previous implementation for this configuration"
|-AccessSpecDecl 0x7fcfd4249620 <line:2119:1, col:7> col:1 public
|-FunctionTemplateDecl 0x7fcfd424a068 <line:2121:3, line:2128:34> col:13 __compressed_pair
| |-NonTypeTemplateParmDecl 0x7fcfd4249648 <line:2121:13, col:27> col:18 referenced '_Bool' depth 0 index 0 _Dummy
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fcfd5202f00 <col:27> '_Bool' true
| |-TemplateTypeParmDecl 0x7fcfd42496a0 <line:2122:7, line:2125:10> line:2122:7 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<__dependent_type<is_default_constructible<struct __rep>, _Dummy>::value && __dependent_type<is_default_constructible<class allocator<char> >, _Dummy>::value>::type'
| `-CXXConstructorDecl 0x7fcfd4249fc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2128:34> col:13 constexpr __compressed_pair 'void (void)'
|   `-AlwaysInlineAttr 0x7fcfd424a0e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fcfd424a908 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2130:3, line:2135:51> line:2134:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fcfd424a1b8 <line:2130:13, col:19> col:19 class depth 0 index 0 _Tp
| |-NonTypeTemplateParmDecl 0x7fcfd424a6c0 <col:24, line:2132:57> col:55 'typename enable_if<!is_same<typename decay<_Tp>::type, class __compressed_pair<struct __rep, class allocator<char> > >::value, _Bool>::type' depth 0 index 1
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fcfd5203e20 <col:57> '_Bool' true
| `-CXXConstructorDecl 0x7fcfd424a860 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2135:51> line:2134:3 constexpr __compressed_pair 'void (_Tp &&)'
|   |-ParmVarDecl 0x7fcfd424a778 <col:21, col:27> col:27 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fcfd424a960 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fcfd424ad28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2137:3, line:2140:51> line:2139:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fcfd424aa30 <line:2137:13, col:19> col:19 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7fcfd424ac80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2140:51> line:2139:3 constexpr __compressed_pair 'void (struct std::__1::__second_tag, _Tp &&)'
|   |-ParmVarDecl 0x7fcfd424aab0 <col:21> col:33 'struct std::__1::__second_tag'
|   |-ParmVarDecl 0x7fcfd424ab48 <col:35, col:41> col:41 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fcfd424ad88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fcfd424b218 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2142:3, line:2145:75> line:2144:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fcfd424ae58 <line:2142:13, col:19> col:19 class depth 0 index 0 _U1
| |-TemplateTypeParmDecl 0x7fcfd424aec8 <col:24, col:30> col:30 class depth 0 index 1 _U2
| `-CXXConstructorDecl 0x7fcfd424b170 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 constexpr __compressed_pair 'void (_U1 &&, _U2 &&)'
|   |-ParmVarDecl 0x7fcfd424af98 <col:21, col:27> col:27 __t1 '_U1 &&'
|   |-ParmVarDecl 0x7fcfd424b038 <col:33, col:39> col:39 __t2 '_U2 &&'
|   `-AlwaysInlineAttr 0x7fcfd424b278 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fcfd424b928 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2147:3, line:2154:75> line:2149:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fcfd424b348 <line:2147:13, col:22> col:22 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7fcfd424b3b8 <col:30, col:39> col:39 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7fcfd424b880 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2154:75> line:2149:3 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7fcfd424b448 <col:21, col:43> col:43 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fcfd424b5b8 <col:49, col:66> col:66 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7fcfd424b728 <line:2150:21, col:38> col:38 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7fcfd424b990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd424bb58 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2175:3> line:2173:30 first 'typename _Base1::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7fcfd424bc00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd424bd08 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2180:3> line:2178:36 first 'typename _Base1::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd424bdb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd424bef8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2185:3> line:2183:30 second 'typename _Base2::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7fcfd424bfa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd424c0a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2190:3> line:2188:36 second 'typename _Base2::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd424c150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd424c2f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2200:3> line:2193:8 swap 'void (class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &)' noexcept-uninstantiated 0x7fcfd5205f28
| |-ParmVarDecl 0x7fcfd424c1d8 <col:13, col:32> col:32 __x 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &'
| `-AlwaysInlineAttr 0x7fcfd424c3e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
`-CXXDestructorDecl 0x7fcfd4283e48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2105:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fcfd50dff58 parent 0x7fcfd50d18a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:4040:81> col:64 class basic_string definition
|-private '__basic_string_common<true>':'class std::__1::__basic_string_common<true>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-VisibilityAttr 0x7fcfd539ef48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fcfd4227ec8 prev 0x7fcfd50dff58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:635:1, col:28> col:28 implicit class basic_string
|-AccessSpecDecl 0x7fcfd4227f60 <line:638:1, col:7> col:1 public
|-TypedefDecl 0x7fcfd4227f98 <line:639:5, col:58> col:58 __self 'class std::__1::basic_string<char>'
| `-RecordType 0x7fcfd50e0070 'class std::__1::basic_string<char>'
|   `-ClassTemplateSpecialization 0x7fcfd50dff58 'basic_string'
|-TypedefDecl 0x7fcfd4228118 <line:640:5, col:58> col:58 __self_view 'basic_string_view<char, struct std::__1::char_traits<char> >':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-TemplateSpecializationType 0x7fcfd4228070 'basic_string_view<char, struct std::__1::char_traits<char> >' sugar basic_string_view
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7fcfd4174c90 'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
|     `-ClassTemplateSpecialization 0x7fcfd4174b88 'basic_string_view'
|-TypedefDecl 0x7fcfd4228180 <line:641:5, col:58> col:58 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fcfd4228030 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fcfd4aef830 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fcfd4aef7e8 '_Traits'
|   `-RecordType 0x7fcfd50d99a0 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fcfd4ad8c18 'char_traits'
|-TypedefDecl 0x7fcfd42281e8 <line:642:5, col:58> col:58 value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fcfd4227ff0 'char' sugar
|   |-TemplateTypeParmType 0x7fcfd4aef7c0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fcfd4aef780 '_CharT'
|   `-BuiltinType 0x7fcfd3833b60 'char'
|-TypedefDecl 0x7fcfd4228278 <line:643:5, col:58> col:58 allocator_type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7fcfd4228240 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7fcfd4aef8a0 '_Allocator' dependent depth 0 index 2
|   | `-TemplateTypeParm 0x7fcfd4aef858 '_Allocator'
|   `-RecordType 0x7fcfd50dadd0 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7fcfd50dace8 'allocator'
|-TypedefDecl 0x7fcfd4228488 <line:644:5, col:58> col:58 __alloc_traits 'allocator_traits<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>':'struct std::__1::allocator_traits<class std::__1::allocator<char> >'
| `-TemplateSpecializationType 0x7fcfd4228410 'allocator_traits<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type':'class std::__1::allocator<char>'
|   `-RecordType 0x7fcfd42283f0 'struct std::__1::allocator_traits<class std::__1::allocator<char> >'
|     `-ClassTemplateSpecialization 0x7fcfd4228300 'allocator_traits'
|-TypedefDecl 0x7fcfd423e430 <line:645:5, col:58> col:58 size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7fcfd423e3e0 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7fcfd4236f00 'std::__1::allocator_traits<class std::__1::allocator<char> >::size_type' sugar
|     |-Typedef 0x7fcfd4233580 'size_type'
|     `-ElaboratedType 0x7fcfd4233530 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7fcfd4233510 'std::__1::__size_type<class std::__1::allocator<char>, long, true>::type' sugar
|         |-Typedef 0x7fcfd4233490 'type'
|         `-ElaboratedType 0x7fcfd4233440 'typename class allocator<char>::size_type' sugar
|           `-TypedefType 0x7fcfd4232a40 'std::__1::allocator<char>::size_type' sugar
|             |-Typedef 0x7fcfd4228888 'size_type'
|             `-TypedefType 0x7fcfd38d15d0 'size_t' sugar
|               |-Typedef 0x7fcfd38697b0 'size_t'
|               `-BuiltinType 0x7fcfd3833c80 'unsigned long'
|-TypedefDecl 0x7fcfd423e500 <line:646:5, col:58> col:58 difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7fcfd423e4b0 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7fcfd4232760 'std::__1::allocator_traits<class std::__1::allocator<char> >::difference_type' sugar
|     |-Typedef 0x7fcfd42326f0 'difference_type'
|     `-ElaboratedType 0x7fcfd42326a0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7fcfd4232680 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<char>, char *, true>::type' sugar
|         |-Typedef 0x7fcfd4232600 'type'
|         `-ElaboratedType 0x7fcfd4232170 'typename class allocator<char>::difference_type' sugar
|           `-TypedefType 0x7fcfd4231770 'std::__1::allocator<char>::difference_type' sugar
|             |-Typedef 0x7fcfd42288e0 'difference_type'
|             `-TypedefType 0x7fcfd511a510 'ptrdiff_t' sugar
|               |-Typedef 0x7fcfd3869740 'ptrdiff_t'
|               `-BuiltinType 0x7fcfd3833be0 'long'
|-TypedefDecl 0x7fcfd423e5b8 <line:647:5, col:58> col:58 reference 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
| `-LValueReferenceType 0x7fcfd423e580 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
|   `-TypedefType 0x7fcfd423e560 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' sugar
|     |-Typedef 0x7fcfd42281e8 'value_type'
|     `-SubstTemplateTypeParmType 0x7fcfd4227ff0 'char' sugar
|       |-TemplateTypeParmType 0x7fcfd4aef7c0 '_CharT' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fcfd4aef780 '_CharT'
|       `-BuiltinType 0x7fcfd3833b60 'char'
|-TypedefDecl 0x7fcfd423e648 <line:648:5, col:58> col:58 const_reference 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
| `-LValueReferenceType 0x7fcfd423e610 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
|   `-QualType 0x7fcfd423e561 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' const
|     `-TypedefType 0x7fcfd423e560 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' sugar
|       |-Typedef 0x7fcfd42281e8 'value_type'
|       `-SubstTemplateTypeParmType 0x7fcfd4227ff0 'char' sugar
|         |-TemplateTypeParmType 0x7fcfd4aef7c0 '_CharT' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7fcfd4aef780 '_CharT'
|         `-BuiltinType 0x7fcfd3833b60 'char'
|-TypedefDecl 0x7fcfd423e710 <line:649:5, col:58> col:58 pointer 'typename __alloc_traits::pointer':'char *'
| `-ElaboratedType 0x7fcfd423e6c0 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7fcfd422ce50 'std::__1::allocator_traits<class std::__1::allocator<char> >::pointer' sugar
|     |-Typedef 0x7fcfd422cde0 'pointer'
|     `-ElaboratedType 0x7fcfd422cd90 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7fcfd422cd70 'std::__1::__pointer_type<char, class std::__1::allocator<char> >::type' sugar
|         |-Typedef 0x7fcfd422ccf0 'type'
|         `-ElaboratedType 0x7fcfd422cca0 'typename __pointer_type_imp::__pointer_type<char, typename remove_reference<class allocator<char> >::type>::type' sugar
|           `-TypedefType 0x7fcfd422cc80 'std::__1::__pointer_type_imp::__pointer_type<char, class std::__1::allocator<char>, true>::type' sugar
|             |-Typedef 0x7fcfd422cc00 'type'
|             `-ElaboratedType 0x7fcfd422cbb0 'typename class allocator<char>::pointer' sugar
|               `-TypedefType 0x7fcfd422a5b0 'std::__1::allocator<char>::pointer' sugar
|                 |-Typedef 0x7fcfd42289a8 'pointer'
|                 `-PointerType 0x7fcfd4228970 'char *'
|                   `-SubstTemplateTypeParmType 0x7fcfd4228940 'char' sugar
|                     |-TemplateTypeParmType 0x7fcfd51ec550 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fcfd51ec508 '_Tp'
|                     `-BuiltinType 0x7fcfd3833b60 'char'
|-TypedefDecl 0x7fcfd423e800 <line:650:5, col:58> col:58 const_pointer 'typename __alloc_traits::const_pointer':'const char *'
| `-ElaboratedType 0x7fcfd423e7b0 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7fcfd423e790 'std::__1::allocator_traits<class std::__1::allocator<char> >::const_pointer' sugar
|     |-Typedef 0x7fcfd422dbe0 'const_pointer'
|     `-ElaboratedType 0x7fcfd422db90 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7fcfd422db70 'std::__1::__const_pointer<char, char *, class std::__1::allocator<char>, true>::type' sugar
|         |-Typedef 0x7fcfd422daf0 'type'
|         `-ElaboratedType 0x7fcfd422daa0 'typename class allocator<char>::const_pointer' sugar
|           `-TypedefType 0x7fcfd422a800 'std::__1::allocator<char>::const_pointer' sugar
|             |-Typedef 0x7fcfd4228a38 'const_pointer'
|             `-PointerType 0x7fcfd4228a00 'const char *'
|               `-QualType 0x7fcfd4228941 'const char' const
|                 `-SubstTemplateTypeParmType 0x7fcfd4228940 'char' sugar
|                   |-TemplateTypeParmType 0x7fcfd51ec550 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7fcfd51ec508 '_Tp'
|                   `-BuiltinType 0x7fcfd3833b60 'char'
|-StaticAssertDecl 0x7fcfd423e960 <line:652:5, col:92> col:5
| |-DeclRefExpr 0x7fcfd423e910 <col:19, col:39> 'const _Bool':'const _Bool' lvalue Var 0x7fcfd4104da8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fcfd4af0838 <col:46> 'const char [45]' lvalue "Character type of basic_string must be a POD"
|-StaticAssertDecl 0x7fcfd423eba0 <line:653:5, line:654:74> line:653:5
| |-ParenExpr 0x7fcfd423eb68 <col:19, col:75> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7fcfd423eb30 <col:20, col:70> 'const _Bool':'const _Bool' lvalue Var 0x7fcfd4104da8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fcfd4af0b00 <line:654:19> 'const char [54]' lvalue "traits_type::char_type must be the same type as CharT"
|-StaticAssertDecl 0x7fcfd423edb0 <line:655:5, line:656:74> line:655:5
| |-ParenExpr 0x7fcfd423ed78 <col:19, col:83> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7fcfd423ed40 <col:20, col:78> 'const _Bool':'const _Bool' lvalue Var 0x7fcfd4104da8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fcfd4af0e40 <line:656:19> 'const char [54]' lvalue "Allocator::value_type must be same type as value_type"
|-TypedefDecl 0x7fcfd423efa8 <line:661:5, col:58> col:58 iterator '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer>':'class std::__1::__wrap_iter<char *>'
| `-TemplateSpecializationType 0x7fcfd423ef30 '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
|   `-RecordType 0x7fcfd423ef10 'class std::__1::__wrap_iter<char *>'
|     `-ClassTemplateSpecialization 0x7fcfd423ee20 '__wrap_iter'
|-TypedefDecl 0x7fcfd423f1b8 <line:662:5, col:58> col:58 const_iterator '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer>':'class std::__1::__wrap_iter<const char *>'
| `-TemplateSpecializationType 0x7fcfd423f140 '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer':'const char *'
|   `-RecordType 0x7fcfd423f120 'class std::__1::__wrap_iter<const char *>'
|     `-ClassTemplateSpecialization 0x7fcfd423f030 '__wrap_iter'
|-TypedefDecl 0x7fcfd423f410 <line:664:5, col:59> col:59 reverse_iterator 'std::__1::reverse_iterator<iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<char *> >'
| `-ElaboratedType 0x7fcfd423f3a0 'std::__1::reverse_iterator<iterator>' sugar
|   `-TemplateSpecializationType 0x7fcfd423f350 'reverse_iterator<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator':'class std::__1::__wrap_iter<char *>'
|     `-RecordType 0x7fcfd423f330 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<char *> >'
|       `-ClassTemplateSpecialization 0x7fcfd423f240 'reverse_iterator'
|-TypedefDecl 0x7fcfd423f670 <line:665:5, col:59> col:59 const_reverse_iterator 'std::__1::reverse_iterator<const_iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const char *> >'
| `-ElaboratedType 0x7fcfd423f600 'std::__1::reverse_iterator<const_iterator>' sugar
|   `-TemplateSpecializationType 0x7fcfd423f5b0 'reverse_iterator<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|     `-RecordType 0x7fcfd423f590 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const char *> >'
|       `-ClassTemplateSpecialization 0x7fcfd423f4a0 'reverse_iterator'
|-AccessSpecDecl 0x7fcfd423f6c8 <line:667:1, col:8> col:1 private
|-CXXRecordDecl 0x7fcfd423f6f0 <line:701:5, line:706:5> line:701:12 struct __long definition
| |-CXXRecordDecl 0x7fcfd423fb68 prev 0x7fcfd423f6f0 <col:5, col:12> col:12 implicit struct __long
| |-FieldDecl 0x7fcfd423fc30 <line:703:9, col:19> col:19 __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-FieldDecl 0x7fcfd423fc88 <line:704:9, col:19> col:19 __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-FieldDecl 0x7fcfd423fce0 <line:705:9, col:19> col:19 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
| `-CXXDestructorDecl 0x7fcfd42840e8 <line:701:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial
|-EnumDecl 0x7fcfd423f7c0 <line:712:5> col:5
| `-EnumConstantDecl 0x7fcfd423f890 <col:11, col:26> col:11 __short_mask 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:712:5)'
|   `-ImplicitCastExpr 0x7fcfd423f8d8 <col:26> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7fcfd4af1a00 <col:26> 'int' 1
|-EnumDecl 0x7fcfd423f8f0 <line:713:5> col:5
| `-EnumConstantDecl 0x7fcfd423f9c0 <col:11, col:26> col:11 __long_mask 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:713:5)'
|   `-ImplicitCastExpr 0x7fcfd423fa08 <col:26> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7fcfd4af1b20 <col:26> 'unsigned long' 1
|-EnumDecl 0x7fcfd423fa20 <line:716:5> col:5
| `-EnumConstantDecl 0x7fcfd4240060 <col:11, line:717:65> line:716:11 referenced __min_cap 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:716:5)'
|   `-ImplicitCastExpr 0x7fcfd42400a8 <col:23, line:717:65> 'unsigned int' <IntegralCast>
|     `-ConditionalOperator 0x7fcfd423ff60 <line:716:23, line:717:65> 'unsigned long'
|       |-BinaryOperator 0x7fcfd423fe38 <line:716:23, col:65> '_Bool' '>'
|       | |-BinaryOperator 0x7fcfd423fdf8 <col:23, col:61> 'unsigned long' '/'
|       | | |-ParenExpr 0x7fcfd423fda8 <col:23, col:42> 'unsigned long'
|       | | | `-BinaryOperator 0x7fcfd423fd80 <col:24, col:41> 'unsigned long' '-'
|       | | |   |-UnaryExprOrTypeTraitExpr 0x7fcfd423fd48 <col:24, col:37> 'unsigned long' sizeof 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|       | | |   `-ImplicitCastExpr 0x7fcfd423fd68 <col:41> 'unsigned long' <IntegralCast>
|       | | |     `-IntegerLiteral 0x7fcfd4af1c70 <col:41> 'int' 1
|       | | `-UnaryExprOrTypeTraitExpr 0x7fcfd423fdd8 <col:44, col:61> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|       | `-ImplicitCastExpr 0x7fcfd423fe20 <col:65> 'unsigned long' <IntegralCast>
|       |   `-IntegerLiteral 0x7fcfd4af1d48 <col:65> 'int' 2
|       |-BinaryOperator 0x7fcfd423ff20 <line:717:23, col:61> 'unsigned long' '/'
|       | |-ParenExpr 0x7fcfd423fed0 <col:23, col:42> 'unsigned long'
|       | | `-BinaryOperator 0x7fcfd423fea8 <col:24, col:41> 'unsigned long' '-'
|       | |   |-UnaryExprOrTypeTraitExpr 0x7fcfd423fe70 <col:24, col:37> 'unsigned long' sizeof 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|       | |   `-ImplicitCastExpr 0x7fcfd423fe90 <col:41> 'unsigned long' <IntegralCast>
|       | |     `-IntegerLiteral 0x7fcfd4af1dd8 <col:41> 'int' 1
|       | `-UnaryExprOrTypeTraitExpr 0x7fcfd423ff00 <col:44, col:61> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|       `-ImplicitCastExpr 0x7fcfd423ff48 <col:65> 'unsigned long' <IntegralCast>
|         `-IntegerLiteral 0x7fcfd4af1eb0 <col:65> 'int' 2
|-CXXRecordDecl 0x7fcfd42400c0 <line:719:5, line:727:5> line:719:12 struct __short definition
| |-CXXRecordDecl 0x7fcfd4240510 prev 0x7fcfd42400c0 <col:5, col:12> col:12 implicit struct __short
| |-CXXRecordDecl 0x7fcfd42405a8 <line:721:9, line:725:9> line:721:9 union definition
| | |-FieldDecl 0x7fcfd4240728 <line:723:13, col:27> col:27 __size_ 'unsigned char'
| | |-FieldDecl 0x7fcfd4240780 <line:724:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| | `-CXXDestructorDecl 0x7fcfd4284548 <line:721:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-FieldDecl 0x7fcfd42407e8 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| |-IndirectFieldDecl 0x7fcfd4240840 <line:723:27> col:27 implicit __size_ 'unsigned char'
| | |-Field 0x7fcfd42407e8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| | `-Field 0x7fcfd4240728 '__size_' 'unsigned char'
| |-IndirectFieldDecl 0x7fcfd4240890 <line:724:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| | |-Field 0x7fcfd42407e8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)'
| | `-Field 0x7fcfd4240780 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-FieldDecl 0x7fcfd4240958 <line:726:9, col:37> col:20 __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
| `-CXXDestructorDecl 0x7fcfd42841c8 <line:719:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial
|-CXXRecordDecl 0x7fcfd4240190 <line:731:5, col:44> col:11 union __ulx definition
| |-CXXRecordDecl 0x7fcfd42403a8 prev 0x7fcfd4240190 <col:5, col:11> col:11 implicit union __ulx
| |-FieldDecl 0x7fcfd4240450 <col:17, col:24> col:24 __lx 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| `-FieldDecl 0x7fcfd42409c0 <col:30, col:38> col:38 __lxx 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-EnumDecl 0x7fcfd4240260 <line:733:5> col:5
| `-EnumConstantDecl 0x7fcfd4240cf8 <col:11, col:55> col:11 referenced __n_words 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:733:5)'
|   `-ImplicitCastExpr 0x7fcfd4240d40 <col:23, col:55> 'unsigned int' <IntegralCast>
|     `-BinaryOperator 0x7fcfd4240a78 <col:23, col:55> 'unsigned long' '/'
|       |-UnaryExprOrTypeTraitExpr 0x7fcfd4240a28 <col:23, col:35> 'unsigned long' sizeof 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx'
|       `-UnaryExprOrTypeTraitExpr 0x7fcfd4240a58 <col:39, col:55> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXRecordDecl 0x7fcfd4240d58 <line:735:5, line:738:5> line:735:12 struct __raw definition
| |-CXXRecordDecl 0x7fcfd42417b0 prev 0x7fcfd4240d58 <col:5, col:12> col:12 implicit struct __raw
| |-FieldDecl 0x7fcfd4241908 <line:737:9, col:36> col:19 __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
| `-CXXDestructorDecl 0x7fcfd42842a8 <line:735:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial
|-CXXRecordDecl 0x7fcfd4240e20 <line:740:5, line:748:5> line:740:12 struct __rep definition
| |-CXXRecordDecl 0x7fcfd4241470 prev 0x7fcfd4240e20 <col:5, col:12> col:12 implicit struct __rep
| |-CXXRecordDecl 0x7fcfd4241508 <line:742:9, line:747:9> line:742:9 union definition
| | |-FieldDecl 0x7fcfd4241698 <line:744:13, col:21> col:21 __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| | |-FieldDecl 0x7fcfd42416f0 <line:745:13, col:21> col:21 __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| | |-FieldDecl 0x7fcfd4241970 <line:746:13, col:21> col:21 __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| | `-CXXDestructorDecl 0x7fcfd4284468 <line:742:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-FieldDecl 0x7fcfd42419d8 <col:9> col:9 implicit 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| |-IndirectFieldDecl 0x7fcfd4241a30 <line:744:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| | |-Field 0x7fcfd42419d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| | `-Field 0x7fcfd4241698 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-IndirectFieldDecl 0x7fcfd4241a80 <line:745:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| | |-Field 0x7fcfd42419d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| | `-Field 0x7fcfd42416f0 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-IndirectFieldDecl 0x7fcfd4241ad0 <line:746:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| | |-Field 0x7fcfd42419d8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)'
| | `-Field 0x7fcfd4241970 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| `-CXXDestructorDecl 0x7fcfd4284008 <line:740:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7fcfd424c450 <line:750:5, col:46> col:46 __r_ '__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>':'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >'
|-AccessSpecDecl 0x7fcfd424c498 <line:752:1, col:7> col:1 public
|-VarDecl 0x7fcfd424c4d0 <line:753:5, col:36> col:28 npos 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'const unsigned long' static cinit
| `-ImplicitCastExpr 0x7fcfd424c540 <col:35, col:36> 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'const unsigned long' <IntegralCast>
|   `-UnaryOperator 0x7fcfd4af3540 <col:35, col:36> 'int' prefix '-'
|     `-IntegerLiteral 0x7fcfd4af3520 <col:36> 'int' 1
|-CXXConstructorDecl 0x7fcfd424c618 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:755:31 basic_string 'void (void)' noexcept-uninstantiated 0x7fcfd4af3600
| `-AlwaysInlineAttr 0x7fcfd424c738 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fcfd424c8f0 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:758:40 basic_string 'void (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)' noexcept-uninstantiated 0x7fcfd4af3878
| |-ParmVarDecl 0x7fcfd424c7b8 <col:53, col:75> col:75 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fcfd424c9f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fcfd424caf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:765:5, col:43> col:5 basic_string 'void (const class std::__1::basic_string<char> &)'
| `-ParmVarDecl 0x7fcfd424ca50 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
|-CXXConstructorDecl 0x7fcfd424cd70 <line:766:5, col:70> col:5 basic_string 'void (const class std::__1::basic_string<char> &, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)'
| |-ParmVarDecl 0x7fcfd424cbc8 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
| `-ParmVarDecl 0x7fcfd424cc38 <col:45, col:67> col:67 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
|-CXXConstructorDecl 0x7fcfd424cfb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:770:5 used basic_string 'void (class std::__1::basic_string<char> &&) noexcept(is_nothrow_move_constructible<allocator_type>::value)'
| |-ParmVarDecl 0x7fcfd424ce78 <col:18, col:33> col:33 __str 'class std::__1::basic_string<char> &&'
| `-AlwaysInlineAttr 0x7fcfd424d0b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fcfd424d2b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:778:65> col:5 basic_string 'void (class std::__1::basic_string<char> &&, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)'
| |-ParmVarDecl 0x7fcfd424d110 <col:18, col:33> col:33 __str 'class std::__1::basic_string<char> &&'
| |-ParmVarDecl 0x7fcfd424d180 <col:40, col:62> col:62 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fcfd424d378 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fcfd424d4e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:780:61> col:31 basic_string 'void (const char *)'
| |-ParmVarDecl 0x7fcfd424d3f8 <col:44, col:58> col:58 __s 'const char *'
| `-AlwaysInlineAttr 0x7fcfd424d5a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fcfd42561d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:782:58> col:5 basic_string 'void (const char *, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fcfd4256000 <col:18, col:32> col:32 __s 'const char *'
| |-ParmVarDecl 0x7fcfd4256098 <col:37, col:55> col:55 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fcfd4256298 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fcfd4256450 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:784:50> col:5 used basic_string 'void (const char *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fcfd42562f0 <col:18, col:32> col:32 __s 'const char *'
| |-ParmVarDecl 0x7fcfd4256360 <col:37, col:47> col:47 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd4256518 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fcfd42567a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:786:73> col:5 basic_string 'void (const char *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fcfd4256570 <col:18, col:32> col:32 __s 'const char *'
| |-ParmVarDecl 0x7fcfd42565e0 <col:37, col:47> col:47 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4256650 <col:52, col:70> col:70 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fcfd4256870 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fcfd4256a70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:788:43> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, char)'
| |-ParmVarDecl 0x7fcfd42568c8 <col:18, col:28> col:28 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4256938 <col:33, col:40> col:40 __c 'char':'char'
| `-AlwaysInlineAttr 0x7fcfd4256b38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fcfd4256dc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:790:66> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, char, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fcfd4256b90 <col:18, col:28> col:28 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4256c00 <col:33, col:40> col:40 __c 'char':'char'
| |-ParmVarDecl 0x7fcfd4256c70 <col:45, col:63> col:63 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fcfd4256e90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fcfd42571a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:791:5, line:792:54> line:791:5 basic_string 'void (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fcfd4256ee8 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd4256f58 <col:45, col:55> col:55 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4256fc8 <col:62, col:72> col:72 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd4257038 <line:792:18, col:53> col:36 __a 'const class std::__1::allocator<char> &'
|-CXXConstructorDecl 0x7fcfd42574c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:795:54> line:794:5 basic_string 'void (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fcfd4257288 <col:18, col:38> col:38 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd42572f8 <col:45, col:55> col:55 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4257368 <line:795:18, col:53> col:36 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fcfd4257590 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fcfd4257eb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:796:5, line:800:121> line:798:9 basic_string
| |-TemplateTypeParmDecl 0x7fcfd42575d8 <line:796:14, col:20> col:20 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7fcfd4257e10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:800:121> line:798:9 basic_string 'void (const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &, typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, void>::type *)' inline
|   |-ParmVarDecl 0x7fcfd4257698 <col:22, col:33> col:33 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fcfd4257708 <col:38, col:48> col:48 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fcfd4257778 <col:55, col:65> col:65 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fcfd42577e8 <line:799:22, col:65> col:44 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
|   `-ParmVarDecl 0x7fcfd4257c90 <line:800:22, col:120> col:118 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, void>::type *'
|-CXXConstructorDecl 0x7fcfd4258110 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:802:34> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fcfd4257ff0 <col:18, col:30> col:30 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fcfd42581d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fcfd42583d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:804:57> col:5 basic_string 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fcfd4258228 <col:18, col:30> col:30 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fcfd4258298 <col:36, col:54> col:54 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fcfd4258498 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fcfd4258778 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:805:5, line:807:67> col:9 basic_string
| |-TemplateTypeParmDecl 0x7fcfd42584e0 <line:805:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7fcfd42586d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:807:67> col:9 basic_string 'void (_InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x7fcfd4258570 <col:22, col:37> col:37 __first '_InputIterator'
|   |-ParmVarDecl 0x7fcfd42585e0 <col:46, col:61> col:61 __last '_InputIterator'
|   `-AlwaysInlineAttr 0x7fcfd42587d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fcfd4258c18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:808:5, line:810:94> col:9 basic_string
| |-TemplateTypeParmDecl 0x7fcfd42588a8 <line:808:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7fcfd4258b70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:810:94> col:9 basic_string 'void (_InputIterator, _InputIterator, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &)'
|   |-ParmVarDecl 0x7fcfd4258940 <col:22, col:37> col:37 __first '_InputIterator'
|   |-ParmVarDecl 0x7fcfd42589b0 <col:46, col:61> col:61 __last '_InputIterator'
|   |-ParmVarDecl 0x7fcfd4258a20 <col:69, col:91> col:91 __a 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &'
|   `-AlwaysInlineAttr 0x7fcfd4258c80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fcfd4259010 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:813:47> col:5 basic_string 'void (initializer_list<char>)'
| |-ParmVarDecl 0x7fcfd4258ee8 <col:18, col:43> col:43 __il 'initializer_list<char>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fcfd42590d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fcfd4259350 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:815:70> col:5 basic_string 'void (initializer_list<char>, const class std::__1::allocator<char> &)'
| |-ParmVarDecl 0x7fcfd42591a8 <col:18, col:43> col:43 __il 'initializer_list<char>':'class std::initializer_list<char>'
| |-ParmVarDecl 0x7fcfd4259218 <col:49, col:67> col:67 __a 'const class std::__1::allocator<char> &'
| `-AlwaysInlineAttr 0x7fcfd4259418 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fcfd4259490 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:818:5, col:26> col:12 used ~basic_string 'void (void) noexcept' inline
|-CXXConversionDecl 0x7fcfd42595f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:821:82> col:5 operator basic_string_view 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd42596a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd42597f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:823:5, col:54> col:19 operator= 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| `-ParmVarDecl 0x7fcfd4259728 <col:29, col:49> col:49 __str 'const class std::__1::basic_string<char> &'
|-FunctionTemplateDecl 0x7fcfd4259ac8 <line:826:5, line:829:69> col:19 operator=
| |-TemplateTypeParmDecl 0x7fcfd42598a0 <line:826:15, col:23> col:15 class depth 0 index 0
| | `-TemplateArgument type 'void'
| `-CXXMethodDecl 0x7fcfd4259a30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:829:69> col:19 operator= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
|   |-ParmVarDecl 0x7fcfd4259930 <col:29, col:41> col:41 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
|   `-AlwaysInlineAttr 0x7fcfd4259b20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4259d10 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:832:19 operator= 'class std::__1::basic_string<char> &(class std::__1::basic_string<char> &&)' noexcept-uninstantiated 0x7fcfd4af8218
| |-ParmVarDecl 0x7fcfd4259c00 <col:29, col:44> col:44 __str 'class std::__1::basic_string<char> &&'
| `-AlwaysInlineAttr 0x7fcfd4259e08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4259fe0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:835:106> col:19 operator= 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fcfd4259ed8 <col:29, col:58> col:58 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fcfd425a090 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425a220 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:837:98> col:45 operator= 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fcfd425a118 <col:55, col:73> col:73 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-AlwaysInlineAttr 0x7fcfd425a2d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425a430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:838:5, col:43> col:19 operator= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| `-ParmVarDecl 0x7fcfd425a328 <col:29, col:40> col:40 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fcfd425a568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:856:43> line:855:14 begin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fcfd425a610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425a6e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:859:49> line:858:20 begin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd425a790 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425a800 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:862:52> line:861:14 end 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fcfd425a8a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425a918 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:865:58> line:864:20 end 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd425a9c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425aab8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:869:41> line:868:22 rbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fcfd425ab60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425ac58 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:872:47> line:871:28 rbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd425ad00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425ad70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:875:43> line:874:22 rend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fcfd425ae18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425ae88 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:878:49> line:877:28 rend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd425af30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425afa0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:882:25> line:881:20 cbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd425b048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425b0b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:885:23> line:884:20 cend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd425b160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425b1d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:888:26> line:887:28 crbegin 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd425b278 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425b2e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:891:24> line:890:28 crend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd425b390 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425b438 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:894:70> line:893:41 size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd425b4e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425b550 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:895:81> col:41 length 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd425b5f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425b668 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:896:41 max_size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd425b710 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425b780 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:899:71> line:897:41 capacity 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd425b828 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425b9c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:901:5, col:46> col:10 resize 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fcfd425b880 <col:17, col:27> col:27 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd425b8f0 <col:32, col:43> col:43 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fcfd425bb50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:902:85> col:36 resize 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fcfd425ba88 <col:43, col:53> col:53 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd425bc00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425bce0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:904:5, col:41> col:10 reserve 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| `-ParmVarDecl 0x7fcfd425bc58 <col:18, col:40> col:28 __res_arg 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd425bd90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:906:47> col:10 shrink_to_fit 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fcfd425be38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425be80 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:908:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fcfd425bf28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425bf70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:909:80> col:36 empty '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd425c018 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425c158 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:911:47 operator[] 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd425c090 <col:58, col:68> col:68 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd425c208 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425c388 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:912:47 operator[] 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fcfd425c280 <col:58, col:68> col:68 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd425c438 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425c550 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:914:5, col:39> col:21 at 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| `-ParmVarDecl 0x7fcfd425c490 <col:24, col:34> col:34 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd425c6d0 <line:915:5, col:37> col:21 at 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| `-ParmVarDecl 0x7fcfd425c610 <col:24, col:34> col:34 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd425c818 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:917:105> col:45 operator+= 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fcfd425c790 <col:56, col:76> col:76 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fcfd425c8c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425c9a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:918:104> col:45 operator+= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fcfd425c920 <col:56, col:68> col:68 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fcfd425ca58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425cb38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:919:103> col:45 operator+= 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fcfd425cab0 <col:56, col:74> col:74 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-AlwaysInlineAttr 0x7fcfd425cbe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425ccc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:920:113> col:45 operator+= 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fcfd425cc40 <col:56, col:67> col:67 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-AlwaysInlineAttr 0x7fcfd425cd78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425cf10 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:922:112> col:45 operator+= 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fcfd425ce48 <col:56, col:85> col:85 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fcfd425cfc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425d0a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:926:51> col:19 append 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fcfd425d018 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fcfd425d150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425d230 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:928:87> col:19 append 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fcfd425d1a8 <col:26, col:38> col:38 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fcfd425d2e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd425d550 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:929:5, col:88> col:19 append 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fcfd425d338 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd425d3a8 <col:53, col:63> col:63 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd425d418 <col:70, col:84> col:80 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7fcfd425dcb8 <line:930:5, line:937:77> col:19 append
| |-TemplateTypeParmDecl 0x7fcfd425d610 <line:930:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fcfd425dc20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:937:77> col:19 append 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7fcfd425d9f8 <col:26, col:37> col:37 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fcfd425da68 <col:42, col:52> col:52 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7fcfd425dad8 <col:59, col:73> col:69 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd425df40 <line:938:5, col:62> col:19 append 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fcfd425ddb8 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fcfd425de28 <col:49, col:59> col:59 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd425ec98 <line:939:5, col:47> col:19 append 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| `-ParmVarDecl 0x7fcfd425ec10 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fcfd425eee0 <line:940:5, col:55> col:19 append 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fcfd425ed58 <col:26, col:36> col:36 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd425edc8 <col:41, col:52> col:52 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FunctionTemplateDecl 0x7fcfd425f248 <line:941:5, line:943:77> col:19 __append_forward_unsafe
| |-TemplateTypeParmDecl 0x7fcfd425ef98 <line:941:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fcfd425f1b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:943:77> col:19 __append_forward_unsafe 'class std::__1::basic_string<char> &(_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fcfd425f030 <col:43> col:59 '_ForwardIterator'
|   `-ParmVarDecl 0x7fcfd425f0a0 <col:61> col:77 '_ForwardIterator'
|-FunctionTemplateDecl 0x7fcfd425fa08 <line:944:5, line:957:5> line:953:5 append
| |-TemplateTypeParmDecl 0x7fcfd425f330 <line:944:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fcfd425f970 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:957:5> line:953:5 append 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value || !__libcpp_string_gets_noexcept_iterator<_InputIterator>::value, class basic_string<char> &>::type (_InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fcfd425f7e0 <col:12, col:27> col:27 __first '_InputIterator'
|   |-ParmVarDecl 0x7fcfd425f850 <col:36, col:51> col:51 __last '_InputIterator'
|   `-AlwaysInlineAttr 0x7fcfd425fa68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fcfd42601c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:958:5, line:969:5> line:967:5 append
| |-TemplateTypeParmDecl 0x7fcfd425fb38 <line:958:14, col:20> col:20 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fcfd4260130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:969:5> line:967:5 append 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && __libcpp_string_gets_noexcept_iterator<_ForwardIterator>::value, class basic_string<char> &>::type (_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fcfd425ffa0 <col:12, col:29> col:29 __first '_ForwardIterator'
|   |-ParmVarDecl 0x7fcfd4260010 <col:38, col:55> col:55 __last '_ForwardIterator'
|   `-AlwaysInlineAttr 0x7fcfd4260228 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4260450 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:973:103> col:19 append 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fcfd4260388 <col:26, col:55> col:55 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fcfd4260500 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4260660 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:976:5, col:34> col:10 push_back 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| `-ParmVarDecl 0x7fcfd4260558 <col:20, col:31> col:31 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fcfd4260710 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:978:19> col:10 pop_back 'void (void)'
| `-AlwaysInlineAttr 0x7fcfd42607b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4260880 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:979:53> col:47 front 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (void)'
| `-AlwaysInlineAttr 0x7fcfd4260928 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd42609c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:980:55> col:47 front 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7fcfd4260a68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4260ad0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:981:52> col:47 back 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::reference (void)'
| `-AlwaysInlineAttr 0x7fcfd4260b78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4260be0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:982:54> col:47 back 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7fcfd4260c88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4260d68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:985:87> col:19 assign 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fcfd4260ce0 <col:26, col:38> col:38 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fcfd4260e18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4260ef8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:987:77> col:19 assign 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fcfd4260e70 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fcfd4260fa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd42610d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:992:51> line:990:19 assign 'class std::__1::basic_string<char> &(class std::__1::basic_string<char> &&)' noexcept-uninstantiated 0x7fcfd4aff370
| |-ParmVarDecl 0x7fcfd4261000 <col:26, col:41> col:41 __str 'class std::__1::basic_string<char> &&'
| `-AlwaysInlineAttr 0x7fcfd42611c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4261398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:994:5, col:88> col:19 assign 'class std::__1::basic_string<char> &(const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fcfd4261220 <col:26, col:46> col:46 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd4261290 <col:53, col:63> col:63 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd4261300 <col:70, col:84> col:80 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7fcfd4261a08 <line:995:5, line:1002:78> col:19 assign
| |-TemplateTypeParmDecl 0x7fcfd4261458 <line:995:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fcfd4261970 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1002:78> col:19 assign 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7fcfd4261798 <col:26, col:38> col:38 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fcfd4261808 <col:43, col:53> col:53 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7fcfd4261878 <col:60, col:74> col:70 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd4261c08 <line:1003:5, col:62> col:19 assign 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fcfd4261b08 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fcfd4261b78 <col:49, col:59> col:59 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd4261d58 <line:1004:5, col:47> col:19 assign 'class std::__1::basic_string<char> &(const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| `-ParmVarDecl 0x7fcfd4261cd0 <col:26, col:44> col:44 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fcfd4261f18 <line:1005:5, col:55> col:19 assign 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fcfd4261e18 <col:26, col:36> col:36 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd4261e88 <col:41, col:52> col:52 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FunctionTemplateDecl 0x7fcfd4262588 <line:1006:5, line:1014:61> col:9 assign
| |-TemplateTypeParmDecl 0x7fcfd4261fd0 <line:1006:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fcfd42624f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1014:61> col:9 assign 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value || !__libcpp_string_gets_noexcept_iterator<_InputIterator>::value, class basic_string<char> &>::type (_InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fcfd42623a0 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x7fcfd4262410 <col:40, col:55> col:55 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fcfd4262c08 <line:1015:5, line:1023:65> col:9 assign
| |-TemplateTypeParmDecl 0x7fcfd4262670 <line:1015:14, col:20> col:20 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fcfd4262b70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1023:65> col:9 assign 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && __libcpp_string_gets_noexcept_iterator<_ForwardIterator>::value, class basic_string<char> &>::type (_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fcfd4262a20 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fcfd4262a90 <col:42, col:59> col:59 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fcfd4262e40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1026:103> col:19 assign 'class std::__1::basic_string<char> &(initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fcfd4262d78 <col:26, col:55> col:55 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fcfd4262ef0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd42630d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1030:69> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fcfd4262f48 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4262fb8 <col:44, col:64> col:64 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fcfd4263188 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4263360 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1032:113> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fcfd42631e0 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4263250 <col:44, col:56> col:56 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fcfd4263418 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fcfd4263ad8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1033:5, line:1040:96> col:19 insert
| |-TemplateTypeParmDecl 0x7fcfd4263460 <line:1033:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fcfd4263a40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1040:96> col:19 insert 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7fcfd4263770 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fcfd4263808 <col:44, col:55> col:55 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fcfd4263878 <col:60, col:70> col:70 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7fcfd42638e8 <col:78, col:92> col:88 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd4263e70 <line:1041:5, col:107> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fcfd4263be0 <col:26, col:36> col:36 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4263c50 <col:44, col:64> col:64 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd4263cc0 <col:71, col:81> col:81 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd4263d30 <col:89, col:103> col:99 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd4264160 <line:1042:5, col:79> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fcfd4263f48 <col:26, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4263fb8 <col:43, col:61> col:61 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fcfd4264028 <col:66, col:76> col:76 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd42643b0 <line:1043:5, col:64> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fcfd4264230 <col:26, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd42642a0 <col:43, col:61> col:61 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fcfd4264690 <line:1044:5, col:72> col:19 insert 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fcfd4264478 <col:26, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd42644e8 <col:43, col:53> col:53 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd4264558 <col:58, col:69> col:69 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fcfd42648e0 <line:1045:5, col:62> col:19 insert 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fcfd4264760 <col:26, col:41> col:41 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| `-ParmVarDecl 0x7fcfd42647d0 <col:48, col:59> col:59 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXMethodDecl 0x7fcfd4264bc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1047:77> col:19 insert 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fcfd42649a8 <col:26, col:41> col:41 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fcfd4264a18 <col:48, col:58> col:58 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4264a88 <col:63, col:74> col:74 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-AlwaysInlineAttr 0x7fcfd4264c80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fcfd4265408 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1048:5, line:1056:83> col:9 insert
| |-TemplateTypeParmDecl 0x7fcfd4264cc8 <line:1048:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fcfd4265370 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1056:83> col:9 insert 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value || !__libcpp_string_gets_noexcept_iterator<_InputIterator>::value, iterator>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, _InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fcfd4265150 <col:16, col:31> col:31 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7fcfd42651c0 <col:38, col:53> col:53 __first '_InputIterator'
|   `-ParmVarDecl 0x7fcfd4265230 <col:62, col:77> col:77 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fcfd4265c18 <line:1057:5, line:1065:87> col:9 insert
| |-TemplateTypeParmDecl 0x7fcfd42654f8 <line:1057:14, col:20> col:20 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fcfd4265b80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1065:87> col:9 insert 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && __libcpp_string_gets_noexcept_iterator<_ForwardIterator>::value, iterator>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, _ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fcfd4265960 <col:16, col:31> col:31 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7fcfd42659d0 <col:38, col:55> col:55 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fcfd4265a40 <col:64, col:81> col:81 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fcfd4265f20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1069:69> line:1068:14 insert 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fcfd4265d18 <col:21, col:36> col:36 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fcfd4265e08 <col:43, col:72> col:72 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fcfd4265fd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd42661b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1072:5, col:66> col:19 erase 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fcfd4266030 <col:25, col:43> col:35 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd42660a0 <col:46, col:62> col:56 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd4266380 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1074:45> col:19 erase 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator)'
| |-ParmVarDecl 0x7fcfd4266278 <col:25, col:40> col:40 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| `-AlwaysInlineAttr 0x7fcfd4266430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4266610 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1076:70> col:19 erase 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator)'
| |-ParmVarDecl 0x7fcfd4266488 <col:25, col:40> col:40 __first 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fcfd42664f8 <col:49, col:64> col:64 __last 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| `-AlwaysInlineAttr 0x7fcfd42666c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4266930 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1079:86> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fcfd4266720 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4266790 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4266800 <col:61, col:81> col:81 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fcfd42669f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4266c80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1081:137> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fcfd4266a48 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4266ab8 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4266b28 <col:61, col:73> col:73 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fcfd4266d40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd42670c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1082:5, col:125> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fcfd4266d98 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4266e08 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4266e78 <col:61, col:81> col:81 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd4266ee8 <col:88, col:98> col:98 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd4266f58 <col:106, col:121> col:116 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7fcfd4267898 <line:1083:5, line:1090:114> col:19 replace
| |-TemplateTypeParmDecl 0x7fcfd4267190 <line:1083:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fcfd4267800 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1090:114> col:19 replace 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, class basic_string<char> &>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
|   |-ParmVarDecl 0x7fcfd42674a0 <col:27, col:37> col:37 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fcfd4267510 <col:45, col:55> col:55 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fcfd42675a8 <col:61, col:72> col:72 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fcfd4267618 <col:77, col:87> col:87 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-ParmVarDecl 0x7fcfd4267688 <col:95, col:110> col:105 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd4267c40 <line:1091:5, col:97> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fcfd42679a8 <col:27, col:37> col:37 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4267a18 <col:44, col:54> col:54 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4267a88 <col:60, col:78> col:78 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fcfd4267af8 <col:83, col:93> col:93 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-NoSanitizeAttr 0x7fcfd4267d08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:453:69> unsigned-integer-overflow
|-CXXMethodDecl 0x7fcfd4267fb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1092:5, col:81> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fcfd4267d98 <col:27, col:37> col:37 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4267e08 <col:44, col:54> col:54 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd4267e78 <col:60, col:78> col:78 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fcfd4268310 <line:1093:5, col:90> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fcfd4268080 <col:27, col:37> col:37 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd42680f0 <col:44, col:54> col:54 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4268160 <col:60, col:70> col:70 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd42681d0 <col:76, col:87> col:87 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-NoSanitizeAttr 0x7fcfd42683d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:453:69> unsigned-integer-overflow
|-CXXMethodDecl 0x7fcfd4268680 <line:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1095:94> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fcfd4268468 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fcfd42684d8 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fcfd4268548 <col:69, col:89> col:89 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fcfd4268740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd42689b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1097:140> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view)'
| |-ParmVarDecl 0x7fcfd4268798 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fcfd4268808 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fcfd4268878 <col:69, col:81> col:81 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fcfd4268a70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4268d60 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1099:105> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fcfd4268ac8 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fcfd4268b38 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fcfd4268ba8 <col:69, col:87> col:87 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fcfd4268c18 <col:92, col:102> col:102 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd4268e28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4269090 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1101:90> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fcfd4268e80 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fcfd4268ef0 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fcfd4268f60 <col:69, col:87> col:87 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-AlwaysInlineAttr 0x7fcfd4269150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4269440 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1103:98> col:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
| |-ParmVarDecl 0x7fcfd42691a8 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fcfd4269218 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fcfd4269288 <col:69, col:79> col:79 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd42692f8 <col:84, col:95> col:95 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-AlwaysInlineAttr 0x7fcfd4269508 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fcfd4269bc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1104:5, line:1111:99> col:9 replace
| |-TemplateTypeParmDecl 0x7fcfd4269550 <line:1104:14, col:20> col:20 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fcfd4269b30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1111:99> col:9 replace 'typename enable_if<__is_input_iterator<_InputIterator>::value, class basic_string<char> &>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, _InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fcfd4269890 <col:17, col:32> col:32 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7fcfd4269900 <col:38, col:53> col:53 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|   |-ParmVarDecl 0x7fcfd4269970 <col:59, col:74> col:74 __j1 '_InputIterator'
|   `-ParmVarDecl 0x7fcfd42699e0 <col:80, col:95> col:95 __j2 '_InputIterator'
|-CXXMethodDecl 0x7fcfd4269f60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1115:63> line:1114:19 replace 'class std::__1::basic_string<char> &(std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator, initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>)'
| |-ParmVarDecl 0x7fcfd4269cd0 <col:27, col:42> col:42 __i1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fcfd4269d40 <col:48, col:63> col:63 __i2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
| |-ParmVarDecl 0x7fcfd4269e28 <col:69, col:98> col:98 __il 'initializer_list<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type>':'class std::initializer_list<char>'
| `-AlwaysInlineAttr 0x7fcfd426a020 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426a270 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1118:5, col:73> col:15 copy 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7fcfd426a0a8 <col:20, col:32> col:32 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fcfd426a118 <col:37, col:47> col:47 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd426a188 <col:52, col:70> col:62 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd426a4c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1120:68> col:18 substr 'class std::__1::basic_string<char> (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7fcfd426a340 <col:25, col:43> col:35 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd426a3b0 <col:46, col:62> col:56 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426a578 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426a6d8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1123:10 swap 'void (class std::__1::basic_string<char> &) noexcept'
| |-ParmVarDecl 0x7fcfd426a5d0 <col:15, col:29> col:29 __str 'class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fcfd426a788 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426a828 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1132:62> col:23 c_str 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd426a8d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426a940 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1134:96> col:23 data 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd426a9e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426aab8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1141:70> col:20 get_allocator 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd426ab60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426ad48 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1144:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426abb8 <col:20, col:40> col:40 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd426ac28 <col:47, col:65> col:57 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426ae00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426afa8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1146:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426ae58 <col:20, col:32> col:32 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fcfd426aec8 <col:38, col:56> col:48 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426b060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426b288 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1147:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1147:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426b0b8 <col:20, col:38> col:38 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fcfd426b128 <col:43, col:53> col:53 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd426b198 <col:60, col:70> col:70 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd426b4a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1149:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426b358 <col:20, col:38> col:38 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fcfd426b3c8 <col:43, col:61> col:53 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426b560 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426b708 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1150:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1150:15 find 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426b5b8 <col:20, col:31> col:31 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-ParmVarDecl 0x7fcfd426b628 <col:36, col:54> col:46 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd426b8d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1153:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426b7d0 <col:21, col:41> col:41 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd426b840 <col:48, col:66> col:58 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426b990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426baf0 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1155:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426b9e8 <col:21, col:33> col:33 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fcfd426ba58 <col:39, col:57> col:49 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426bba8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426bd80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1156:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1156:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426bc00 <col:21, col:39> col:39 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fcfd426bc70 <col:44, col:54> col:54 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd426bce0 <col:61, col:71> col:71 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd426bf58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1158:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426be50 <col:21, col:39> col:39 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fcfd426bec0 <col:44, col:62> col:54 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426c010 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426c170 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1159:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1159:15 rfind 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426c068 <col:21, col:32> col:32 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| `-ParmVarDecl 0x7fcfd426c0d8 <col:37, col:55> col:47 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd426c340 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1162:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426c238 <col:29, col:49> col:49 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd426c2a8 <col:56, col:74> col:66 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426c3f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426c558 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1164:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426c450 <col:29, col:41> col:41 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fcfd426c4c0 <col:47, col:65> col:57 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426c610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426c7e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1165:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1165:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426c668 <col:29, col:47> col:47 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fcfd426c6d8 <col:52, col:62> col:62 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd426c748 <col:69, col:79> col:79 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd426c9c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1167:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426c8b8 <col:29, col:47> col:47 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fcfd426c928 <col:52, col:70> col:62 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426ca78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426cbd8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1169:15 find_first_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426cad0 <col:29, col:40> col:40 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7fcfd426cb40 <col:45, col:63> col:55 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426cc90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426cdf0 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1172:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426cce8 <col:28, col:48> col:48 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd426cd58 <col:55, col:73> col:65 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426cea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426d008 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1174:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426cf00 <col:28, col:40> col:40 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fcfd426cf70 <col:46, col:64> col:56 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426d0c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426d298 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1175:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1175:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426d118 <col:28, col:46> col:46 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fcfd426d188 <col:51, col:61> col:61 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd426d1f8 <col:68, col:78> col:78 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd426d470 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1177:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426d368 <col:28, col:46> col:46 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fcfd426d3d8 <col:51, col:69> col:61 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426d528 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426d688 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1179:15 find_last_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426d580 <col:28, col:39> col:39 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7fcfd426d5f0 <col:44, col:62> col:54 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426d740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426d8a0 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1182:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426d798 <col:33, col:53> col:53 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd426d808 <col:60, col:78> col:70 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426d958 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426dab8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1184:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426d9b0 <col:33, col:45> col:45 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fcfd426da20 <col:51, col:69> col:61 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426db70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426dd48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1185:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1185:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426dbc8 <col:33, col:51> col:51 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fcfd426dc38 <col:56, col:66> col:66 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd426dca8 <col:73, col:83> col:83 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd426df20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1187:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426de18 <col:33, col:51> col:51 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fcfd426de88 <col:56, col:74> col:66 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426dfd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426e138 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1189:15 find_first_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426e030 <col:33, col:44> col:44 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7fcfd426e0a0 <col:49, col:67> col:59 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426e1f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426e350 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1192:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426e248 <col:32, col:52> col:52 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd426e2b8 <col:59, col:77> col:69 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426e408 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426e568 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1194:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426e460 <col:32, col:44> col:44 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| |-ParmVarDecl 0x7fcfd426e4d0 <col:50, col:68> col:60 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426e620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd426e7f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1195:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1195:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426e678 <col:32, col:50> col:50 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fcfd426e6e8 <col:55, col:65> col:65 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd426e758 <col:72, col:82> col:82 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd426e9d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1197:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426e8c8 <col:32, col:50> col:50 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fcfd426e938 <col:55, col:73> col:65 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd426ea88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4276e00 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1199:15 find_last_not_of 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const noexcept'
| |-ParmVarDecl 0x7fcfd426eae0 <col:32, col:43> col:43 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-ParmVarDecl 0x7fcfd426eb50 <col:48, col:66> col:58 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd4276eb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4277020 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1202:9 compare 'int (const class std::__1::basic_string<char> &) const noexcept'
| |-ParmVarDecl 0x7fcfd4276f10 <col:17, col:37> col:37 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fcfd42770d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4277200 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1204:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view) const noexcept'
| |-ParmVarDecl 0x7fcfd4277128 <col:17, col:29> col:29 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fcfd42772b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd42774d8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1206:69> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view) const'
| |-ParmVarDecl 0x7fcfd4277308 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4277378 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd42773e8 <col:51, col:63> col:63 __sv 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__self_view':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-AlwaysInlineAttr 0x7fcfd4277598 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4277808 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1208:78> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &) const'
| |-ParmVarDecl 0x7fcfd42775f0 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4277660 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd42776d0 <col:51, col:71> col:71 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fcfd42778c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4277c48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1209:5, col:117> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7fcfd4277920 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4277990 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4277a00 <col:51, col:71> col:71 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd4277a70 <col:78, col:88> col:88 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd4277ae0 <col:96, col:111> col:106 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FunctionTemplateDecl 0x7fcfd42784c8 <line:1210:5, line:1217:106> col:9 compare
| |-TemplateTypeParmDecl 0x7fcfd4277d18 <line:1210:15, col:21> col:21 class depth 0 index 0 _Tp
| `-CXXMethodDecl 0x7fcfd4278430 <line:1211:5, line:1217:106> col:9 compare 'typename enable_if<__can_be_converted_to_string_view<char, struct char_traits<char>, _Tp>::value, int>::type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const _Tp &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const' inline
|   |-ParmVarDecl 0x7fcfd42780d0 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fcfd4278140 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fcfd42781d8 <col:51, col:62> col:62 __t 'const _Tp &'
|   |-ParmVarDecl 0x7fcfd4278248 <col:67, col:77> col:77 __pos2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   |-ParmVarDecl 0x7fcfd42782b8 <col:85, col:100> col:95 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-AlwaysInlineAttr 0x7fcfd4278540 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fcfd42786f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1218:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1218:9 compare 'int (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *) const noexcept'
| `-ParmVarDecl 0x7fcfd4278620 <col:17, col:35> col:35 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fcfd4278978 <line:1219:5, col:74> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *) const'
| |-ParmVarDecl 0x7fcfd42787b0 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4278820 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd4278890 <col:51, col:69> col:69 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fcfd4278c98 <line:1220:5, col:90> col:9 compare 'int (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) const'
| |-ParmVarDecl 0x7fcfd4278a48 <col:17, col:27> col:27 __pos1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4278ab8 <col:35, col:45> col:45 __n1 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd4278b28 <col:51, col:69> col:69 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fcfd4278b98 <col:74, col:84> col:84 __n2 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd4278d60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1222:51> col:36 __invariants '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fcfd4278e08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4278e50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1226:63> line:1225:10 __is_long '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd4278ef8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7fcfd4278f40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1237:1, col:8> col:1 private
|-CXXMethodDecl 0x7fcfd4278ff8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1240:31> line:1239:21 __alloc 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &(void) noexcept'
| `-AlwaysInlineAttr 0x7fcfd42790a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4279148 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1243:31> line:1242:27 __alloc 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type &(void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd42791f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4279318 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1270:63> line:1266:10 __set_short_size 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fcfd4279248 <col:27, col:37> col:37 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd42793c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4279438 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1278:47> line:1274:15 __get_short_size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd42794e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd42795c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1285:41> line:1284:10 __set_long_size 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fcfd4279538 <col:26, col:36> col:36 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd4279678 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd42796e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1288:42> line:1287:15 __get_long_size 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd4279790 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4279878 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1291:76> line:1290:10 __set_size 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fcfd42797e8 <col:21, col:31> col:31 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd4279928 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4279a10 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1295:55> line:1294:10 __set_long_cap 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept'
| |-ParmVarDecl 0x7fcfd4279980 <col:25, col:35> col:35 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd4279ac0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4279b30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1298:67> line:1297:15 __get_long_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd4279bd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4279cf8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1302:41> line:1301:10 __set_long_pointer 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer) noexcept'
| |-ParmVarDecl 0x7fcfd4279c30 <col:29, col:37> col:37 __p 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
| `-AlwaysInlineAttr 0x7fcfd4279da8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4279e78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1305:42> line:1304:13 __get_long_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer (void) noexcept'
| `-AlwaysInlineAttr 0x7fcfd4279f20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd4279fc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1308:42> line:1307:19 __get_long_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd427a070 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd427a0e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1311:82> line:1310:13 __get_short_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer (void) noexcept'
| `-AlwaysInlineAttr 0x7fcfd427a188 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd427a1f8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1314:88> line:1313:19 __get_short_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd427a2a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd427a310 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1317:76> line:1316:13 __get_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer (void) noexcept'
| `-AlwaysInlineAttr 0x7fcfd427a3b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd427a428 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1320:76> line:1319:19 __get_pointer 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer (void) const noexcept'
| `-AlwaysInlineAttr 0x7fcfd427a4d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd427a518 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1328:9> line:1323:10 __zero 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fcfd427a5c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fcfd427a800 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1330:5, line:1333:48> line:1332:19 __align_it
| |-NonTypeTemplateParmDecl 0x7fcfd427a618 <line:1330:15, col:25> col:25 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long' depth 0 index 0 __a
| `-CXXMethodDecl 0x7fcfd427a768 <col:30, line:1333:48> line:1332:19 __align_it 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept' static
|   |-ParmVarDecl 0x7fcfd427a698 <col:30, col:40> col:40 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|   `-AlwaysInlineAttr 0x7fcfd427a858 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-EnumDecl 0x7fcfd427a928 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1334:5> col:5
| `-EnumConstantDecl 0x7fcfd427a9f0 <col:11, col:25> col:11 __alignment 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1334:5)'
|   `-ImplicitCastExpr 0x7fcfd427aa38 <col:25> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7fcfd41b5500 <col:25> 'int' 16
|-CXXMethodDecl 0x7fcfd427aaf0 <line:1335:5, line:1339:79> line:1336:15 __recommend 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type) noexcept' static
| |-ParmVarDecl 0x7fcfd427aa60 <col:27, col:37> col:37 __s 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd427aba0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd427ae10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1341:5, line:1342:75> col:10 __init 'void (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
| |-ParmVarDecl 0x7fcfd427abf8 <col:17, col:35> col:35 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| |-ParmVarDecl 0x7fcfd427ac68 <col:40, col:50> col:50 __sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd427acd8 <col:56, col:66> col:66 __reserve 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd427b020 <line:1343:5, line:1344:54> col:10 __init 'void (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)' inline
| |-ParmVarDecl 0x7fcfd427aee0 <col:17, col:35> col:35 __s 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
| `-ParmVarDecl 0x7fcfd427af50 <col:40, col:50> col:50 __sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd427b1e8 <line:1345:5, line:1346:46> col:10 __init 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)' inline
| |-ParmVarDecl 0x7fcfd427b0e8 <col:17, col:27> col:27 __n 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd427b158 <col:32, col:43> col:43 __c 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FunctionTemplateDecl 0x7fcfd427b7f8 <line:1348:5, line:1355:57> col:5 __init
| |-TemplateTypeParmDecl 0x7fcfd427b2a0 <line:1348:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fcfd427b760 <line:1349:5, line:1355:57> col:5 __init 'typename enable_if<__is_exactly_input_iterator<_InputIterator>::value, void>::type (_InputIterator, _InputIterator)' inline
|   |-ParmVarDecl 0x7fcfd427b5d0 <col:12, col:27> col:27 __first '_InputIterator'
|   `-ParmVarDecl 0x7fcfd427b640 <col:36, col:51> col:51 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fcfd427be38 <line:1357:5, line:1364:61> col:5 __init
| |-TemplateTypeParmDecl 0x7fcfd427b8e0 <line:1357:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fcfd427bda0 <line:1358:5, line:1364:61> col:5 __init 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value, void>::type (_ForwardIterator, _ForwardIterator)' inline
|   |-ParmVarDecl 0x7fcfd427bc10 <col:12, col:29> col:29 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fcfd427bc80 <col:38, col:55> col:55 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fcfd427c2d0 <line:1366:5, line:1367:85> line:1366:10 __grow_by 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fcfd427bf30 <col:20, col:30> col:30 __old_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd427bfa0 <col:41, col:51> col:51 __delta_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd427c010 <col:64, col:74> col:74 __old_sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd427c080 <line:1367:20, col:30> col:30 __n_copy 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd427c0f0 <col:41, col:51> col:51 __n_del 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd427c160 <col:64, col:84> col:74 __n_add 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fcfd427c7f0 <line:1368:5, line:1370:82> line:1368:10 __grow_by_and_replace 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
| |-ParmVarDecl 0x7fcfd427c3b8 <col:32, col:42> col:42 __old_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd427c428 <col:53, col:63> col:63 __delta_cap 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd427c498 <col:76, col:86> col:86 __old_sz 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd427c508 <line:1369:32, col:42> col:42 __n_copy 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd427c578 <col:53, col:63> col:63 __n_del 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fcfd427c5e8 <line:1370:32, col:42> col:42 __n_add 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fcfd427c658 <col:51, col:69> col:69 __p_new_stuff 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|-CXXMethodDecl 0x7fcfd427c968 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1373:40> col:10 __erase_to_end 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fcfd427c8e0 <col:25, col:35> col:35 __pos 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd427ca18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd427caf8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1378:89> line:1376:10 __copy_assign_alloc 'void (const class std::__1::basic_string<char> &)'
| |-ParmVarDecl 0x7fcfd427ca70 <col:30, col:50> col:50 __str 'const class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fcfd427cba8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd427cd70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1405:9> line:1381:10 __copy_assign_alloc 'void (const class std::__1::basic_string<char> &, std::__1::true_type)'
| |-ParmVarDecl 0x7fcfd427cc00 <col:30, col:50> col:50 __str 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd427cc60 <col:57> col:66 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fcfd427ce28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd427cff8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1409:10> line:1408:10 __copy_assign_alloc 'void (const class std::__1::basic_string<char> &, std::__1::false_type) noexcept'
| |-ParmVarDecl 0x7fcfd427ce80 <col:30, col:48> col:49 'const class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd427cee0 <col:51> col:61 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7fcfd427d0b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd427d290 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1413:10 __move_assign 'void (class std::__1::basic_string<char> &, std::__1::false_type)' noexcept-uninstantiated 0x7fcfd41bb478
| |-ParmVarDecl 0x7fcfd427d108 <col:24, col:38> col:38 __str 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd427d168 <col:45> col:55 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7fcfd427d3a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd427d580 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1416:10 __move_assign 'void (class std::__1::basic_string<char> &, std::__1::true_type)' noexcept-uninstantiated 0x7fcfd41bb748
| |-ParmVarDecl 0x7fcfd427d3f8 <col:24, col:38> col:38 __str 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd427d458 <col:45> col:54 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fcfd427d690 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd427d7c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1431:89> line:1426:5 __move_assign_alloc 'void (class std::__1::basic_string<char> &)' noexcept-uninstantiated 0x7fcfd41bb958
| |-ParmVarDecl 0x7fcfd427d6e8 <col:25, col:39> col:39 __str 'class std::__1::basic_string<char> &'
| `-AlwaysInlineAttr 0x7fcfd427d8b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd427da50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1438:9> line:1434:10 __move_assign_alloc 'void (class std::__1::basic_string<char> &, std::__1::true_type)' noexcept-uninstantiated 0x7fcfd41bbb98
| |-ParmVarDecl 0x7fcfd427d910 <col:30, col:44> col:44 __c 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd427d970 <col:49> col:58 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fcfd427db60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd427dcf8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1443:10> line:1441:10 __move_assign_alloc 'void (class std::__1::basic_string<char> &, std::__1::false_type) noexcept'
| |-ParmVarDecl 0x7fcfd427dbb8 <col:30, col:42> col:43 'class std::__1::basic_string<char> &'
| |-ParmVarDecl 0x7fcfd427dc18 <col:45> col:55 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7fcfd427ddb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd427ddf8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1445:63> col:36 __invalidate_all_iterators 'void (void)'
| `-AlwaysInlineAttr 0x7fcfd427dea0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fcfd427df80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1446:73> col:36 __invalidate_iterators_past 'void (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type)'
| |-ParmVarDecl 0x7fcfd427def8 <col:64> col:73 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fcfd427e030 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FriendDecl 0x7fcfd427ebd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:1448:5, col:77> col:25
| `-FunctionDecl 0x7fcfd427e1d0 parent 0x7fcfd41a99f8 prev 0x7fcfd427e970 <col:5, col:77> col:25 operator+ 'class std::__1::basic_string<char> (const class std::__1::basic_string<char> &, const class std::__1::basic_string<char> &)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7fcfd427e088 <col:37, col:55> col:56 'const class std::__1::basic_string<char> &'
|   `-ParmVarDecl 0x7fcfd427e0f8 <col:58, col:76> col:77 'const class std::__1::basic_string<char> &'
|-FriendDecl 0x7fcfd42806f8 <line:1449:5, col:75> col:25
| `-FunctionDecl 0x7fcfd427fe00 parent 0x7fcfd41a99f8 prev 0x7fcfd42804d0 <col:5, col:75> col:25 operator+ 'class std::__1::basic_string<char> (const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *, const class std::__1::basic_string<char> &)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7fcfd427ec18 <col:37, col:53> col:54 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
|   `-ParmVarDecl 0x7fcfd427ec88 <col:56, col:74> col:75 'const class std::__1::basic_string<char> &'
|-FriendDecl 0x7fcfd4281180 <line:1450:5, col:68> col:25
| `-FunctionDecl 0x7fcfd42808c0 parent 0x7fcfd41a99f8 prev 0x7fcfd4280f90 <col:5, col:68> col:25 operator+ 'class std::__1::basic_string<char> (std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type, const class std::__1::basic_string<char> &)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7fcfd4280740 <col:37> col:47 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|   `-ParmVarDecl 0x7fcfd42807b0 <col:49, col:67> col:68 'const class std::__1::basic_string<char> &'
|-FriendDecl 0x7fcfd4281c48 <line:1451:5, col:75> col:25
| `-FunctionDecl 0x7fcfd4281350 parent 0x7fcfd41a99f8 prev 0x7fcfd4281a80 <col:5, col:75> col:25 operator+ 'class std::__1::basic_string<char> (const class std::__1::basic_string<char> &, const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *)'
|   |-TemplateArgument type 'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>'
|   |-TemplateArgument type 'class std::__1::allocator<char>'
|   |-ParmVarDecl 0x7fcfd42811c8 <col:37, col:55> col:56 'const class std::__1::basic_string<char> &'
|   `-ParmVarDecl 0x7fcfd4281238 <col:58, col:74> col:75 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type *'
`-FriendDecl 0x7fcfd42826d0 <line:1452:5, col:68> col:25
  `-FunctionDecl 0x7fcfd4281e10 parent 0x7fcfd41a99f8 prev 0x7fcfd4282540 <col:5, col:68> col:25 operator+ 'class std::__1::basic_string<char> (const class std::__1::basic_string<char> &, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type)'
    |-TemplateArgument type 'char'
    |-TemplateArgument type 'struct std::__1::char_traits<char>'
    |-TemplateArgument type 'class std::__1::allocator<char>'
    |-ParmVarDecl 0x7fcfd4281c90 <col:37, col:55> col:56 'const class std::__1::basic_string<char> &'
    `-ParmVarDecl 0x7fcfd4281d00 <col:58> col:68 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_string" = type { %"class.std::__1::__compressed_pair" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_string" = type { %"class.std::__1::__compressed_pair" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fcfd3a01038 <object_model/8_memory_model/03_atomic_operations_and_types.cpp:6:1, line:8:1> line:6:8 referenced struct D1 definition
|-CXXRecordDecl 0x7fcfd3a01158 <col:1, col:8> col:8 implicit struct D1
|-FieldDecl 0x7fcfd3a01270 <line:7:5, col:17> col:17 s 'std::string':'class std::__1::basic_string<char>'
|-CXXConstructorDecl 0x7fcfd3a01308 <line:6:8> col:8 implicit D1 'void (struct D1 &&)' inline default noexcept-unevaluated 0x7fcfd3a01308
| `-ParmVarDecl 0x7fcfd3a01430 <col:8> col:8 'struct D1 &&'
|-CXXMethodDecl 0x7fcfd3a014c8 <col:8, <invalid sloc>> col:8 implicit operator= 'struct D1 &(struct D1 &&)' inline default noexcept-unevaluated 0x7fcfd3a014c8
| `-ParmVarDecl 0x7fcfd3a015e0 <col:8> col:8 'struct D1 &&'
`-CXXDestructorDecl 0x7fcfd3a01668 <col:8> col:8 implicit ~D1 'void (void)' inline default noexcept-unevaluated 0x7fcfd3a01668

Layout: <CGRecordLayout
  LLVMType:%struct.D1 = type { %"class.std::__1::basic_string" }
  NonVirtualBaseLLVMType:%struct.D1 = type { %"class.std::__1::basic_string" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::__shared_count
         0 |   (__shared_count vtable pointer)
         8 |   long __shared_owners_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fcfd5253b40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3410:1, line:3448:1> line:3410:24 referenced class __shared_count definition
|-VisibilityAttr 0x7fcfd5253c68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fcfd5253cb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3410:1, col:24> col:24 implicit referenced class __shared_count
|-CXXConstructorDecl 0x7fcfd5253ea0 <line:3412:5, col:41> col:5 __shared_count 'void (const class std::__1::__shared_count &)'
| `-ParmVarDecl 0x7fcfd5253d88 <col:20, col:40> col:41 'const class std::__1::__shared_count &'
|-CXXMethodDecl 0x7fcfd5254050 <line:3413:5, col:52> col:21 operator= 'class std::__1::__shared_count &(const class std::__1::__shared_count &)'
| `-ParmVarDecl 0x7fcfd5253f60 <col:31, col:51> col:52 'const class std::__1::__shared_count &'
|-AccessSpecDecl 0x7fcfd52540f0 <line:3415:1, col:10> col:1 protected
|-FieldDecl 0x7fcfd5254130 <line:3416:5, col:10> col:10 referenced __shared_owners_ 'long'
|-CXXDestructorDecl 0x7fcfd52541c8 <line:3417:5, col:29> col:13 used ~__shared_count 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fcfd5254268 <line:3418:1, col:8> col:1 private
|-CXXMethodDecl 0x7fcfd52542b8 <line:3419:5, col:49> col:18 referenced __on_zero_shared 'void (void) noexcept' virtual pure
|-AccessSpecDecl 0x7fcfd5254350 <line:3421:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fcfd5254488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3424:37> line:3423:14 used __shared_count 'void (long) noexcept'
| |-ParmVarDecl 0x7fcfd52543c0 <col:29, col:43> col:34 used __refs 'long' cinit
| | `-ImplicitCastExpr 0x7fcfd5254a58 <col:43> 'long' <IntegralCast>
| |   `-IntegerLiteral 0x7fcfd5254a38 <col:43> 'int' 0
| |-CXXCtorInitializer Field 0x7fcfd5254130 '__shared_owners_' 'long'
| | `-ImplicitCastExpr 0x7fcfd5254ac8 <line:3424:28> 'long' <LValueToRValue>
| |   `-DeclRefExpr 0x7fcfd5254a70 <col:28> 'long' lvalue ParmVar 0x7fcfd52543c0 '__refs' 'long'
| |-CompoundStmt 0x7fcfd5254b10 <col:36, col:37>
| |-AlwaysInlineAttr 0x7fcfd5254538 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fcfd5254580 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fcfd52545e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3434:5> line:3432:10 used __add_shared 'void (void) noexcept'
| |-CompoundStmt 0x7fcfd5255060 <col:35, line:3434:5>
| | `-CallExpr 0x7fcfd5255030 <line:3433:7, col:58> 'long':'long'
| |   |-ImplicitCastExpr 0x7fcfd5255018 <col:7> 'long (*)(long &) noexcept' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7fcfd5254f88 <col:7> 'long (long &) noexcept' lvalue Function 0x7fcfd5254e48 '__libcpp_atomic_refcount_increment' 'long (long &) noexcept' (FunctionTemplate 0x7fcfd5252290 '__libcpp_atomic_refcount_increment')
| |   `-MemberExpr 0x7fcfd5254b98 <col:42> 'long' lvalue ->__shared_owners_ 0x7fcfd5254130
| |     `-CXXThisExpr 0x7fcfd5254b80 <col:42> 'class std::__1::__shared_count *' this
| |-AlwaysInlineAttr 0x7fcfd5254680 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fcfd52546c8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fcfd5254730 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3442:5> line:3436:10 used __release_shared '_Bool (void) noexcept'
| |-CompoundStmt 0x7fcfd52556c8 <col:39, line:3442:5>
| | |-IfStmt 0x7fcfd5255660 <line:3437:7, line:3440:7>
| | | |-<<<NULL>>>
| | | |-<<<NULL>>>
| | | |-BinaryOperator 0x7fcfd5255568 <line:3437:11, col:68> '_Bool' '=='
| | | | |-CallExpr 0x7fcfd52554e0 <col:11, col:62> 'long':'long'
| | | | | |-ImplicitCastExpr 0x7fcfd52554c8 <col:11> 'long (*)(long &) noexcept' <FunctionToPointerDecay>
| | | | | | `-DeclRefExpr 0x7fcfd5255468 <col:11> 'long (long &) noexcept' lvalue Function 0x7fcfd5255328 '__libcpp_atomic_refcount_decrement' 'long (long &) noexcept' (FunctionTemplate 0x7fcfd52527a0 '__libcpp_atomic_refcount_decrement')
| | | | | `-MemberExpr 0x7fcfd52550f0 <col:46> 'long' lvalue ->__shared_owners_ 0x7fcfd5254130
| | | | |   `-CXXThisExpr 0x7fcfd52550d8 <col:46> 'class std::__1::__shared_count *' this
| | | | `-ImplicitCastExpr 0x7fcfd5255550 <col:67, col:68> 'long' <IntegralCast>
| | | |   `-UnaryOperator 0x7fcfd5255530 <col:67, col:68> 'int' prefix '-'
| | | |     `-IntegerLiteral 0x7fcfd5255510 <col:68> 'int' 1
| | | |-CompoundStmt 0x7fcfd5255638 <col:71, line:3440:7>
| | | | |-CXXMemberCallExpr 0x7fcfd52555e0 <line:3438:9, col:26> 'void'
| | | | | `-MemberExpr 0x7fcfd52555a8 <col:9> '<bound member function type>' ->__on_zero_shared 0x7fcfd52542b8
| | | | |   `-CXXThisExpr 0x7fcfd5255590 <col:9> 'class std::__1::__shared_count *' this
| | | | `-ReturnStmt 0x7fcfd5255620 <line:3439:9, col:16>
| | | |   `-CXXBoolLiteralExpr 0x7fcfd5255608 <col:16> '_Bool' true
| | | `-<<<NULL>>>
| | `-ReturnStmt 0x7fcfd52556b0 <line:3441:7, col:14>
| |   `-CXXBoolLiteralExpr 0x7fcfd5255698 <col:14> '_Bool' false
| |-AlwaysInlineAttr 0x7fcfd52547c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fcfd5254810 <col:51, col:74> Hidden
`-CXXMethodDecl 0x7fcfd5254910 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3447:5> line:3445:10 used use_count 'long (void) const noexcept'
  |-CompoundStmt 0x7fcfd5255c78 <col:38, line:3447:5>
  | `-ReturnStmt 0x7fcfd5255c60 <line:3446:9, col:59>
  |   `-BinaryOperator 0x7fcfd5255c38 <col:16, col:59> 'long' '+'
  |     |-CallExpr 0x7fcfd5255bd0 <col:16, col:55> 'long':'long'
  |     | |-ImplicitCastExpr 0x7fcfd5255bb8 <col:16> 'long (*)(const long *)' <FunctionToPointerDecay>
  |     | | `-DeclRefExpr 0x7fcfd5255b30 <col:16> 'long (const long *)' lvalue Function 0x7fcfd52559f0 '__libcpp_relaxed_load' 'long (const long *)' (FunctionTemplate 0x7fcfd51957b8 '__libcpp_relaxed_load')
  |     | `-UnaryOperator 0x7fcfd5255798 <col:38, col:39> 'const long *' prefix '&'
  |     |   `-MemberExpr 0x7fcfd5255760 <col:39> 'const long' lvalue ->__shared_owners_ 0x7fcfd5254130
  |     |     `-CXXThisExpr 0x7fcfd5255748 <col:39> 'const class std::__1::__shared_count *' this
  |     `-ImplicitCastExpr 0x7fcfd5255c20 <col:59> 'long' <IntegralCast>
  |       `-IntegerLiteral 0x7fcfd5255c00 <col:59> 'int' 1
  |-AlwaysInlineAttr 0x7fcfd52549a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
  `-VisibilityAttr 0x7fcfd52549f0 <col:51, col:74> Hidden

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::__shared_count" = type { i32 (...)**, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::__shared_weak_count
         0 |   class std::__1::__shared_count (primary base)
         0 |     (__shared_count vtable pointer)
         8 |     long __shared_owners_
        16 |   long __shared_weak_owners_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fcfd5255cc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3450:1, line:3498:1> line:3450:24 referenced class __shared_weak_count definition
|-private 'class std::__1::__shared_count'
|-VisibilityAttr 0x7fcfd5255de8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fcfd5255e70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3450:1, col:24> col:24 implicit referenced class __shared_weak_count
|-FieldDecl 0x7fcfd5255f20 <line:3453:5, col:10> col:10 referenced __shared_weak_owners_ 'long'
|-AccessSpecDecl 0x7fcfd5255f68 <line:3455:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fcfd52560b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3459:42> line:3457:14 __shared_weak_count 'void (long) noexcept'
| |-ParmVarDecl 0x7fcfd5255fd8 <col:34, col:48> col:39 used __refs 'long' cinit
| | `-ImplicitCastExpr 0x7fcfd5256f28 <col:48> 'long' <IntegralCast>
| |   `-IntegerLiteral 0x7fcfd5256f08 <col:48> 'int' 0
| |-CXXCtorInitializer 'class std::__1::__shared_count'
| | `-CXXConstructExpr 0x7fcfd5256fc0 <line:3458:11, col:32> 'class std::__1::__shared_count' 'void (long) noexcept'
| |   `-ImplicitCastExpr 0x7fcfd5256fa8 <col:26> 'long' <LValueToRValue>
| |     `-DeclRefExpr 0x7fcfd5256f40 <col:26> 'long' lvalue ParmVar 0x7fcfd5255fd8 '__refs' 'long'
| |-CXXCtorInitializer Field 0x7fcfd5255f20 '__shared_weak_owners_' 'long'
| | `-ImplicitCastExpr 0x7fcfd5257078 <line:3459:33> 'long' <LValueToRValue>
| |   `-DeclRefExpr 0x7fcfd5257020 <col:33> 'long' lvalue ParmVar 0x7fcfd5255fd8 '__refs' 'long'
| |-CompoundStmt 0x7fcfd52570c8 <col:41, col:42>
| |-AlwaysInlineAttr 0x7fcfd5256168 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fcfd52561b0 <col:51, col:74> Hidden
|-AccessSpecDecl 0x7fcfd52561c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3460:1, col:10> col:1 protected
|-CXXDestructorDecl 0x7fcfd5256238 <line:3461:5, col:34> col:13 ~__shared_weak_count 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fcfd52562d8 <line:3463:1, col:7> col:1 public
|-CXXMethodDecl 0x7fcfd5256358 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3473:5> line:3471:10 referenced __add_shared 'void (void) noexcept'
| |-CompoundStmt 0x7fcfd52571e0 <col:35, line:3473:5>
| | `-CXXMemberCallExpr 0x7fcfd5257198 <line:3472:7, col:36> 'void'
| |   `-MemberExpr 0x7fcfd5257148 <col:7, col:23> '<bound member function type>' ->__add_shared 0x7fcfd52545e8
| |     `-ImplicitCastExpr 0x7fcfd52571c0 <col:23> 'class std::__1::__shared_count *' <UncheckedDerivedToBase (__shared_count)>
| |       `-CXXThisExpr 0x7fcfd5257130 <col:23> 'class std::__1::__shared_weak_count *' this
| |-AlwaysInlineAttr 0x7fcfd52563f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fcfd5256438 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fcfd52564a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3477:5> line:3475:10 referenced __add_weak 'void (void) noexcept'
| |-CompoundStmt 0x7fcfd5257360 <col:33, line:3477:5>
| | `-CallExpr 0x7fcfd5257330 <line:3476:7, col:63> 'long':'long'
| |   |-ImplicitCastExpr 0x7fcfd5257318 <col:7> 'long (*)(long &) noexcept' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7fcfd52572e8 <col:7> 'long (long &) noexcept' lvalue Function 0x7fcfd5254e48 '__libcpp_atomic_refcount_increment' 'long (long &) noexcept' (FunctionTemplate 0x7fcfd5252290 '__libcpp_atomic_refcount_increment')
| |   `-MemberExpr 0x7fcfd5257270 <col:42> 'long' lvalue ->__shared_weak_owners_ 0x7fcfd5255f20
| |     `-CXXThisExpr 0x7fcfd5257258 <col:42> 'class std::__1::__shared_weak_count *' this
| |-AlwaysInlineAttr 0x7fcfd5256538 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fcfd5256580 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fcfd52565e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3482:5> line:3479:10 referenced __release_shared 'void (void) noexcept'
| |-CompoundStmt 0x7fcfd5257518 <col:39, line:3482:5>
| | `-IfStmt 0x7fcfd52574e0 <line:3480:7, line:3481:24>
| |   |-<<<NULL>>>
| |   |-<<<NULL>>>
| |   |-CXXMemberCallExpr 0x7fcfd5257420 <line:3480:11, col:44> '_Bool'
| |   | `-MemberExpr 0x7fcfd52573d0 <col:11, col:27> '<bound member function type>' ->__release_shared 0x7fcfd5254730
| |   |   `-ImplicitCastExpr 0x7fcfd5257448 <col:27> 'class std::__1::__shared_count *' <UncheckedDerivedToBase (__shared_count)>
| |   |     `-CXXThisExpr 0x7fcfd52573b8 <col:27> 'class std::__1::__shared_weak_count *' this
| |   |-CXXMemberCallExpr 0x7fcfd52574b8 <line:3481:9, col:24> 'void'
| |   | `-MemberExpr 0x7fcfd5257480 <col:9> '<bound member function type>' ->__release_weak 0x7fcfd5256700
| |   |   `-CXXThisExpr 0x7fcfd5257468 <col:9> 'class std::__1::__shared_weak_count *' this
| |   `-<<<NULL>>>
| |-AlwaysInlineAttr 0x7fcfd5256680 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fcfd52566c8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fcfd5256700 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3484:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3484:10 used __release_weak 'void (void) noexcept'
|-CXXMethodDecl 0x7fcfd5256828 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3486:74> col:10 referenced use_count 'long (void) const noexcept'
| |-CompoundStmt 0x7fcfd5257650 <col:38, col:74>
| | `-ReturnStmt 0x7fcfd5257638 <col:39, col:72>
| |   `-CXXMemberCallExpr 0x7fcfd52575d8 <col:46, col:72> 'long'
| |     `-MemberExpr 0x7fcfd5257588 <col:46, col:62> '<bound member function type>' ->use_count 0x7fcfd5254910
| |       `-ImplicitCastExpr 0x7fcfd5257620 <col:62> 'const class std::__1::__shared_count *' <NoOp>
| |         `-ImplicitCastExpr 0x7fcfd5257600 <col:62> 'class std::__1::__shared_count *' <UncheckedDerivedToBase (__shared_count)>
| |           `-CXXThisExpr 0x7fcfd5257570 <col:62> 'const class std::__1::__shared_weak_count *' this
| |-AlwaysInlineAttr 0x7fcfd52568c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fcfd5256908 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fcfd52569a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3487:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3487:26 referenced lock 'class std::__1::__shared_weak_count *(void) noexcept'
|-CXXMethodDecl 0x7fcfd5256b60 <line:3494:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3494:25 referenced __get_deleter 'const void *(const class std::type_info &) const noexcept' virtual
| `-ParmVarDecl 0x7fcfd5256a50 <col:39, col:54> col:55 'const class std::type_info &'
|-AccessSpecDecl 0x7fcfd5256c00 <line:3496:1, col:8> col:1 private
|-CXXMethodDecl 0x7fcfd5256c50 <line:3497:5, col:54> col:18 __on_zero_shared_weak 'void (void) noexcept' virtual pure
`-CXXMethodDecl 0x7fcfd5256d88 <line:3450:24, <invalid sloc>> col:24 implicit operator= 'class std::__1::__shared_weak_count &(const class std::__1::__shared_weak_count &)' inline default_delete noexcept-unevaluated 0x7fcfd5256d88
  `-ParmVarDecl 0x7fcfd5256ea0 <col:24> col:24 'const class std::__1::__shared_weak_count &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__shared_weak_count" = type { %"class.std::__1::__shared_count", i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::__shared_weak_count" = type { %"class.std::__1::__shared_count", i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fcfd3a01780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3633:1, line:3934:1> line:3634:28 class shared_ptr definition
|-TemplateArgument type 'struct D1'
|-CXXRecordDecl 0x7fcfd3a01a60 prev 0x7fcfd3a01780 <col:1, col:28> col:28 implicit class shared_ptr
|-AccessSpecDecl 0x7fcfd3a01af8 <line:3636:1, col:7> col:1 public
|-TypedefDecl 0x7fcfd3a01b58 <line:3637:5, col:17> col:17 element_type 'struct D1':'struct D1'
| `-SubstTemplateTypeParmType 0x7fcfd3a01b20 'struct D1' sugar
|   |-TemplateTypeParmType 0x7fcfd52684a0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fcfd5268460 '_Tp'
|   `-RecordType 0x7fcfd3a010d0 'struct D1'
|     `-CXXRecord 0x7fcfd3a01038 'D1'
|-AccessSpecDecl 0x7fcfd3a01bb0 <line:3642:1, col:8> col:1 private
|-FieldDecl 0x7fcfd3a01c68 <line:3643:5, col:24> col:24 __ptr_ 'std::__1::shared_ptr<struct D1>::element_type *'
|-FieldDecl 0x7fcfd3a01cb0 <line:3644:5, col:26> col:26 __cntrl_ 'class std::__1::__shared_weak_count *'
|-CXXRecordDecl 0x7fcfd3a01cf8 <line:3646:5, col:12> col:12 struct __nat
|-AccessSpecDecl 0x7fcfd3a01dc0 <line:3647:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fcfd3a01e28 <line:3938:1, line:3944:1> line:3649:23 used constexpr shared_ptr 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7fcfd3a01c68 '__ptr_' 'std::__1::shared_ptr<struct D1>::element_type *'
| | `-ImplicitCastExpr 0x7fcfd3a12838 <line:3941:14> 'std::__1::shared_ptr<struct D1>::element_type *' <NullToPointer>
| |   `-IntegerLiteral 0x7fcfd40e2a78 <col:14> 'int' 0
| |-CXXCtorInitializer Field 0x7fcfd3a01cb0 '__cntrl_' 'class std::__1::__shared_weak_count *'
| | `-ImplicitCastExpr 0x7fcfd3a12878 <line:3942:16> 'class std::__1::__shared_weak_count *' <NullToPointer>
| |   `-IntegerLiteral 0x7fcfd40e2af0 <col:16> 'int' 0
| |-CompoundStmt 0x7fcfd40e2b90 <line:3943:1, line:3944:1>
| `-AlwaysInlineAttr 0x7fcfd3a01f08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fcfd3a02000 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3651:23 constexpr shared_ptr 'void (std::nullptr_t) noexcept'
| |-ParmVarDecl 0x7fcfd3a01f50 <col:34> col:43 'std::nullptr_t':'nullptr_t'
| `-AlwaysInlineAttr 0x7fcfd3a020c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-FunctionTemplateDecl 0x7fcfd3a02798 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3652:5, line:3654:114> line:3653:18 shared_ptr
| |-TemplateTypeParmDecl 0x7fcfd3a02108 <line:3652:14, col:20> col:20 class depth 0 index 0 _Yp
| `-CXXConstructorDecl 0x7fcfd3a026f0 <line:3653:9, line:3654:114> line:3653:18 shared_ptr 'void (_Yp *, typename enable_if<is_convertible<_Yp *, element_type *>::value, struct __nat>::type)'
|   |-ParmVarDecl 0x7fcfd3a021c8 <col:29, col:34> col:34 __p '_Yp *'
|   `-ParmVarDecl 0x7fcfd3a025c0 <line:3654:29, col:113> col:105 'typename enable_if<is_convertible<_Yp *, element_type *>::value, struct __nat>::type'
|-FunctionTemplateDecl 0x7fcfd3a02ee8 <line:3655:5, line:3657:105> line:3656:9 shared_ptr
| |-TemplateTypeParmDecl 0x7fcfd3a02880 <line:3655:14, col:20> col:20 class depth 0 index 0 _Yp
| |-TemplateTypeParmDecl 0x7fcfd3a028e8 <col:25, col:31> col:31 class depth 0 index 1 _Dp
| `-CXXConstructorDecl 0x7fcfd3a02e40 <line:3656:9, line:3657:105> line:3656:9 shared_ptr 'void (_Yp *, _Dp, typename enable_if<is_convertible<_Yp *, element_type *>::value, struct __nat>::type)'
|   |-ParmVarDecl 0x7fcfd3a029b8 <col:20, col:25> col:25 __p '_Yp *'
|   |-ParmVarDecl 0x7fcfd3a02a28 <col:30, col:34> col:34 __d '_Dp'
|   `-ParmVarDecl 0x7fcfd3a02cf0 <line:3657:20, col:104> col:96 'typename enable_if<is_convertible<_Yp *, element_type *>::value, struct __nat>::type'
|-FunctionTemplateDecl 0x7fcfd3a03738 <line:3658:5, line:3660:105> line:3659:9 shared_ptr
| |-TemplateTypeParmDecl 0x7fcfd3a02fd8 <line:3658:14, col:20> col:20 class depth 0 index 0 _Yp
| |-TemplateTypeParmDecl 0x7fcfd3a03048 <col:25, col:31> col:31 class depth 0 index 1 _Dp
| |-TemplateTypeParmDecl 0x7fcfd3a030b8 <col:36, col:42> col:42 class depth 0 index 2 _Alloc
| `-CXXConstructorDecl 0x7fcfd3a03690 <line:3659:9, line:3660:105> line:3659:9 shared_ptr 'void (_Yp *, _Dp, _Alloc, typename enable_if<is_convertible<_Yp *, element_type *>::value, struct __nat>::type)'
|   |-ParmVarDecl 0x7fcfd3a03188 <col:20, col:25> col:25 __p '_Yp *'
|   |-ParmVarDecl 0x7fcfd3a031f8 <col:30, col:34> col:34 __d '_Dp'
|   |-ParmVarDecl 0x7fcfd3a03268 <col:39, col:46> col:46 __a '_Alloc'
|   `-ParmVarDecl 0x7fcfd3a03530 <line:3660:20, col:104> col:96 'typename enable_if<is_convertible<_Yp *, element_type *>::value, struct __nat>::type'
|-FunctionTemplateDecl 0x7fcfd3a03af8 <line:3661:5, col:59> col:26 shared_ptr
| |-TemplateTypeParmDecl 0x7fcfd3a03830 <col:15, col:21> col:21 class depth 0 index 0 _Dp
| `-CXXConstructorDecl 0x7fcfd3a03a50 <col:26, col:59> col:26 shared_ptr 'void (std::nullptr_t, _Dp)'
|   |-ParmVarDecl 0x7fcfd3a038b0 <col:37, col:47> col:47 __p 'std::nullptr_t':'nullptr_t'
|   `-ParmVarDecl 0x7fcfd3a03920 <col:52, col:56> col:56 __d '_Dp'
|-FunctionTemplateDecl 0x7fcfd3a03fb8 <line:3662:5, col:85> col:40 shared_ptr
| |-TemplateTypeParmDecl 0x7fcfd3a03be0 <col:15, col:21> col:21 class depth 0 index 0 _Dp
| |-TemplateTypeParmDecl 0x7fcfd3a03c48 <col:26, col:32> col:32 class depth 0 index 1 _Alloc
| `-CXXConstructorDecl 0x7fcfd3a03f10 <col:40, col:85> col:40 shared_ptr 'void (std::nullptr_t, _Dp, _Alloc)'
|   |-ParmVarDecl 0x7fcfd3a03cd8 <col:51, col:61> col:61 __p 'std::nullptr_t':'nullptr_t'
|   |-ParmVarDecl 0x7fcfd3a03d48 <col:66, col:70> col:70 __d '_Dp'
|   `-ParmVarDecl 0x7fcfd3a03db8 <col:75, col:82> col:82 __a '_Alloc'
|-FunctionTemplateDecl 0x7fcfd3a04440 <line:3663:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3663:51 shared_ptr
| |-TemplateTypeParmDecl 0x7fcfd3a040a8 <col:14, col:20> col:20 class depth 0 index 0 _Yp
| `-CXXConstructorDecl 0x7fcfd3a04398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3663:51 shared_ptr 'void (const shared_ptr<_Yp> &, std::__1::shared_ptr<struct D1>::element_type *) noexcept'
|   |-ParmVarDecl 0x7fcfd3a041f0 <col:62, col:85> col:85 __r 'const shared_ptr<_Yp> &'
|   |-ParmVarDecl 0x7fcfd3a04260 <col:90, col:104> col:104 __p 'std::__1::shared_ptr<struct D1>::element_type *'
|   `-AlwaysInlineAttr 0x7fcfd3a044a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fcfd3a046d8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3665:5 shared_ptr 'void (const class std::__1::shared_ptr<struct D1> &) noexcept'
| |-ParmVarDecl 0x7fcfd3a045a8 <col:16, col:34> col:34 __r 'const class std::__1::shared_ptr<struct D1> &'
| `-AlwaysInlineAttr 0x7fcfd3a04798 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-FunctionTemplateDecl 0x7fcfd3a04df0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3666:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3668:9 shared_ptr
| |-TemplateTypeParmDecl 0x7fcfd3a047e0 <line:3666:14, col:20> col:20 class depth 0 index 0 _Yp
| `-CXXConstructorDecl 0x7fcfd3a04d48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3668:9 shared_ptr 'void (const shared_ptr<_Yp> &, typename enable_if<is_convertible<_Yp *, element_type *>::value, struct __nat>::type) noexcept'
|   |-ParmVarDecl 0x7fcfd3a04920 <col:20, col:43> col:43 __r 'const shared_ptr<_Yp> &'
|   |-ParmVarDecl 0x7fcfd3a04c10 <line:3669:20, col:104> col:96 'typename enable_if<is_convertible<_Yp *, element_type *>::value, struct __nat>::type'
|   `-AlwaysInlineAttr 0x7fcfd3a04e50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fcfd3a05088 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3673:5 shared_ptr 'void (class std::__1::shared_ptr<struct D1> &&) noexcept'
| |-ParmVarDecl 0x7fcfd3a04f58 <col:16, col:29> col:29 __r 'class std::__1::shared_ptr<struct D1> &&'
| `-AlwaysInlineAttr 0x7fcfd3a05148 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-FunctionTemplateDecl 0x7fcfd3a057d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3674:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3674:52 shared_ptr
| |-TemplateTypeParmDecl 0x7fcfd3a05190 <col:14, col:20> col:20 class depth 0 index 0 _Yp
| `-CXXConstructorDecl 0x7fcfd3a05728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3674:52 shared_ptr 'void (shared_ptr<_Yp> &&, typename enable_if<is_convertible<_Yp *, element_type *>::value, struct __nat>::type) noexcept'
|   |-ParmVarDecl 0x7fcfd3a05300 <col:63, col:81> col:81 __r 'shared_ptr<_Yp> &&'
|   |-ParmVarDecl 0x7fcfd3a055f0 <line:3675:20, col:104> col:96 'typename enable_if<is_convertible<_Yp *, element_type *>::value, struct __nat>::type'
|   `-AlwaysInlineAttr 0x7fcfd3a05830 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-FunctionTemplateDecl 0x7fcfd3a05f08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3678:5, line:3679:104> line:3678:34 shared_ptr
| |-TemplateTypeParmDecl 0x7fcfd3a05900 <col:14, col:20> col:20 class depth 0 index 0 _Yp
| `-CXXConstructorDecl 0x7fcfd3a05e60 <col:25, line:3679:104> line:3678:34 shared_ptr 'void (const weak_ptr<_Yp> &, typename enable_if<is_convertible<_Yp *, element_type *>::value, struct __nat>::type)'
|   |-ParmVarDecl 0x7fcfd3a05a40 <col:45, col:66> col:66 __r 'const weak_ptr<_Yp> &'
|   `-ParmVarDecl 0x7fcfd3a05d30 <line:3679:20, col:103> col:95 'typename enable_if<is_convertible<_Yp *, element_type *>::value, struct __nat>::type'
|-FunctionTemplateDecl 0x7fcfd3a065f8 <line:3682:5, line:3684:105> line:3683:9 shared_ptr
| |-TemplateTypeParmDecl 0x7fcfd3a05ff0 <line:3682:14, col:20> col:20 class depth 0 index 0 _Yp
| `-CXXConstructorDecl 0x7fcfd3a06550 <line:3683:9, line:3684:105> line:3683:9 shared_ptr 'void (auto_ptr<_Yp> &&, typename enable_if<is_convertible<_Yp *, element_type *>::value, struct __nat>::type)'
|   |-ParmVarDecl 0x7fcfd3a06130 <col:20, col:36> col:36 __r 'auto_ptr<_Yp> &&'
|   `-ParmVarDecl 0x7fcfd3a06420 <line:3684:20, col:104> col:96 'typename enable_if<is_convertible<_Yp *, element_type *>::value, struct __nat>::type'
|-FunctionTemplateDecl 0x7fcfd3a09068 <line:3692:5, line:3700:37> line:3693:9 shared_ptr
| |-TemplateTypeParmDecl 0x7fcfd3a066e0 <line:3692:15, col:21> col:21 class depth 0 index 0 _Yp
| |-TemplateTypeParmDecl 0x7fcfd3a06748 <col:26, col:32> col:32 class depth 0 index 1 _Dp
| `-CXXConstructorDecl 0x7fcfd3a08fc0 <line:3693:9, line:3700:37> line:3693:9 shared_ptr 'void (unique_ptr<_Yp, _Dp> &&, typename enable_if<!is_lvalue_reference<_Dp>::value && !is_array<_Yp>::value && is_convertible<typename unique_ptr<_Yp, _Dp>::pointer, element_type *>::value, struct __nat>::type)'
|   |-ParmVarDecl 0x7fcfd3a086d8 <col:20, col:40> col:42 'unique_ptr<_Yp, _Dp> &&'
|   `-ParmVarDecl 0x7fcfd3a08e90 <line:3694:20, line:3700:36> col:28 'typename enable_if<!is_lvalue_reference<_Dp>::value && !is_array<_Yp>::value && is_convertible<typename unique_ptr<_Yp, _Dp>::pointer, element_type *>::value, struct __nat>::type'
|-FunctionTemplateDecl 0x7fcfd3a09c28 <line:3701:5, line:3709:37> line:3702:9 shared_ptr
| |-TemplateTypeParmDecl 0x7fcfd3a09150 <line:3701:15, col:21> col:21 class depth 0 index 0 _Yp
| |-TemplateTypeParmDecl 0x7fcfd3a091b8 <col:26, col:32> col:32 class depth 0 index 1 _Dp
| `-CXXConstructorDecl 0x7fcfd3a09b80 <line:3702:9, line:3709:37> line:3702:9 shared_ptr 'void (unique_ptr<_Yp, _Dp> &&, typename enable_if<is_lvalue_reference<_Dp>::value && !is_array<_Yp>::value && is_convertible<typename unique_ptr<_Yp, _Dp>::pointer, element_type *>::value, struct __nat>::type)'
|   |-ParmVarDecl 0x7fcfd3a09348 <col:20, col:40> col:42 'unique_ptr<_Yp, _Dp> &&'
|   `-ParmVarDecl 0x7fcfd3a09a50 <line:3703:20, line:3709:36> col:28 'typename enable_if<is_lvalue_reference<_Dp>::value && !is_array<_Yp>::value && is_convertible<typename unique_ptr<_Yp, _Dp>::pointer, element_type *>::value, struct __nat>::type'
|-CXXDestructorDecl 0x7fcfd3a09d40 <line:3731:5, col:17> col:5 used ~shared_ptr 'void (void) noexcept'
|-CXXMethodDecl 0x7fcfd3a09f38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3734:17 operator= 'class std::__1::shared_ptr<struct D1> &(const class std::__1::shared_ptr<struct D1> &) noexcept'
| |-ParmVarDecl 0x7fcfd3a09e28 <col:27, col:45> col:45 __r 'const class std::__1::shared_ptr<struct D1> &'
| `-AlwaysInlineAttr 0x7fcfd3a09fe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-FunctionTemplateDecl 0x7fcfd3a0a640 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3735:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3742:9 operator=
| |-TemplateTypeParmDecl 0x7fcfd3a0a030 <line:3735:14, col:20> col:20 class depth 0 index 0 _Yp
| `-CXXMethodDecl 0x7fcfd3a0a5a8 <line:3736:9, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3742:9 operator= 'typename enable_if<is_convertible<_Yp *, element_type *>::value, class shared_ptr<struct D1> &>::type (const shared_ptr<_Yp> &) noexcept'
|   |-ParmVarDecl 0x7fcfd3a0a490 <col:19, col:42> col:42 __r 'const shared_ptr<_Yp> &'
|   `-AlwaysInlineAttr 0x7fcfd3a0a698 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fcfd3a0a888 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3745:17 operator= 'class std::__1::shared_ptr<struct D1> &(class std::__1::shared_ptr<struct D1> &&) noexcept'
| |-ParmVarDecl 0x7fcfd3a0a778 <col:27, col:40> col:40 __r 'class std::__1::shared_ptr<struct D1> &&'
| `-AlwaysInlineAttr 0x7fcfd3a0a938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-FunctionTemplateDecl 0x7fcfd3a0af88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3746:5, line:3753:40> col:9 operator=
| |-TemplateTypeParmDecl 0x7fcfd3a0a980 <line:3746:14, col:20> col:20 class depth 0 index 0 _Yp
| `-CXXMethodDecl 0x7fcfd3a0aef0 <line:3747:9, line:3753:40> col:9 operator= 'typename enable_if<is_convertible<_Yp *, element_type *>::value, shared_ptr<struct D1> &>::type (shared_ptr<_Yp> &&)'
|   |-ParmVarDecl 0x7fcfd3a0ade0 <col:19, col:37> col:37 __r 'shared_ptr<_Yp> &&'
|   `-AlwaysInlineAttr 0x7fcfd3a0afe0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-FunctionTemplateDecl 0x7fcfd3a0b860 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3755:5, line:3763:38> col:9 operator=
| |-TemplateTypeParmDecl 0x7fcfd3a0b0b0 <line:3755:14, col:20> col:20 class depth 0 index 0 _Yp
| `-CXXMethodDecl 0x7fcfd3a0b7c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3763:38> col:9 operator= 'typename enable_if<!is_array<_Yp>::value && is_convertible<_Yp *, element_type *>::value, class shared_ptr<struct D1> >::type &(auto_ptr<_Yp> &&)'
|   |-ParmVarDecl 0x7fcfd3a0b6b0 <col:19, col:35> col:35 __r 'auto_ptr<_Yp> &&'
|   `-AlwaysInlineAttr 0x7fcfd3a0b8b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-FunctionTemplateDecl 0x7fcfd3a0c298 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:3778:5, line:3787:45> col:9 operator=
