
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__scalar_hash<struct std::__1::_PairT, 2> (empty)
         0 |   struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1509:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1000000000, 1>, false, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_mutex_t
         0 |   long __sig
         8 |   char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_cond_t
         0 |   long __sig
         8 |   char [40] __opaque
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1, 1>, true, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct _opaque_pthread_t *, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::hash<struct _opaque_pthread_t *> (empty)
         0 |   struct std::__1::unary_function<struct _opaque_pthread_t *, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__thread_struct
         0 |   class std::__1::__thread_struct_imp * __p_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<unsigned long, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__vector_base_common<true> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<int *, 0, false>
         0 |   int * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<int> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (empty)
         0 |   class std::__1::allocator<int> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<int *, class std::__1::allocator<int> >
         0 |   struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
         0 |     int * __value_
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<int> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__vector_base<int, class std::__1::allocator<int> >
         0 |   class std::__1::__vector_base_common<true> (base) (empty)
         0 |   std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __begin_
         8 |   std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __end_
        16 |   class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > __end_cap_
        16 |     struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
        16 |       int * __value_
        16 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (base) (empty)
        16 |       class std::__1::allocator<int> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::vector<int, class std::__1::allocator<int> >
         0 |   class std::__1::__vector_base<int, class std::__1::allocator<int> > (base)
         0 |     class std::__1::__vector_base_common<true> (base) (empty)
         0 |     std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __begin_
         8 |     std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __end_
        16 |     class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > __end_cap_
        16 |       struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
        16 |         int * __value_
        16 |       struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (base) (empty)
        16 |         class std::__1::allocator<int> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9a97ad2f00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:317:89> col:64 class __vector_base_common definition
|-TemplateArgument integral 1
|-VisibilityAttr 0x7f9a97ad3098 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7f9a97ad3148 prev 0x7f9a97ad2f00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:291:1, col:7> col:7 implicit class __vector_base_common
|-AccessSpecDecl 0x7f9a97ad31e0 <line:293:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f9a97ad3248 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:294:51> col:27 __vector_base_common 'void (void)'
| `-AlwaysInlineAttr 0x7f9a97ad3328 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9a97ad3370 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:295:22, col:50> col:27 __throw_length_error 'void (void) const'
| `-CXX11NoReturnAttr 0x7f9a97ad3418 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
|-CXXMethodDecl 0x7f9a97ad3460 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:296:22, col:50> col:27 __throw_out_of_range 'void (void) const'
| `-CXX11NoReturnAttr 0x7f9a97ad3508 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
`-CXXDestructorDecl 0x7f9a98a89328 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:317:64> col:64 implicit ~__vector_base_common 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__vector_base_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__vector_base_common.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9a98a6d200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2034:1, line:2067:1> line:2037:8 struct __compressed_pair_elem definition
|-TemplateArgument type 'int *'
|-TemplateArgument integral 0
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7f9a98a6d480 prev 0x7f9a98a6d200 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7f9a98a6d528 <line:2038:3, col:15> col:15 _ParamT 'int *':'int *'
| `-SubstTemplateTypeParmType 0x7f9a98a6c880 'int *' sugar
|   |-TemplateTypeParmType 0x7f9a97375580 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9a97375538 '_Tp'
|   `-PointerType 0x7f9a970991d0 'int *'
|     `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a98a6d5e8 <line:2039:3, col:16> col:16 referenced reference 'int *&'
| `-LValueReferenceType 0x7f9a98a6d5b0 'int *&'
|   `-SubstTemplateTypeParmType 0x7f9a98a6c880 'int *' sugar
|     |-TemplateTypeParmType 0x7f9a97375580 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f9a97375538 '_Tp'
|     `-PointerType 0x7f9a970991d0 'int *'
|       `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a98a6d6a8 <line:2040:3, col:22> col:22 referenced const_reference 'int *const &'
| `-LValueReferenceType 0x7f9a98a6d670 'int *const &'
|   `-QualType 0x7f9a98a6c881 'int *const' const
|     `-SubstTemplateTypeParmType 0x7f9a98a6c880 'int *' sugar
|       |-TemplateTypeParmType 0x7f9a97375580 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f9a97375538 '_Tp'
|       `-PointerType 0x7f9a970991d0 'int *'
|         `-BuiltinType 0x7f9a96833bc0 'int'
|-CXXConstructorDecl 0x7f9a98a6d740 <line:2043:3, col:52> col:13 constexpr __compressed_pair_elem 'void (void)'
|-FunctionTemplateDecl 0x7f9a98a6df28 <line:2045:3, line:2050:44> line:2049:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7f9a98a6d7f8 <line:2045:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7f9a98a6d868 <col:24, line:2047:6> line:2045:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<int *, 0, false>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7f9a98a6de80 <line:2048:3, line:2050:44> line:2049:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7f9a98a6dd98 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7f9a98a6e558 <line:2052:3, line:2056:75> line:2054:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7f9a98a6e008 <line:2052:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7f9a98a6e078 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7f9a98a6e4b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2056:75> line:2054:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7f9a98a6e0f0 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f9a98a6e258 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7f9a98a6e3a8 <line:2055:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7f9a98a6e5e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a6e768 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2062:3, col:50> col:13 __get 'std::__1::__compressed_pair_elem<int *, 0, false>::reference (void) noexcept'
|-CXXMethodDecl 0x7f9a98a6e8b8 <line:2063:3, col:62> col:19 __get 'std::__1::__compressed_pair_elem<int *, 0, false>::const_reference (void) const noexcept'
|-AccessSpecDecl 0x7f9a98a6e960 <line:2065:1, col:8> col:1 private
|-FieldDecl 0x7f9a98a6e998 <line:2066:3, col:7> col:7 __value_ 'int *':'int *'
`-CXXDestructorDecl 0x7f9a98a894e8 <line:2037:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem" = type { i32* }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem" = type { i32* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9a97739200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:101:1, col:52> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28 class allocator definition
|-TemplateArgument type 'int'
|-CXXRecordDecl 0x7f9a9773a208 prev 0x7f9a97739200 <col:1, col:28> col:28 implicit class allocator
|-AccessSpecDecl 0x7f9a9773a2a0 <line:1722:1, col:7> col:1 public
|-TypedefDecl 0x7f9a9773a2c8 <line:1723:5, col:31> col:31 referenced size_type 'size_t':'unsigned long'
| `-TypedefType 0x7f9a97059410 'size_t' sugar
|   |-Typedef 0x7f9a968691b0 'size_t'
|   `-BuiltinType 0x7f9a96833c80 'unsigned long'
|-TypedefDecl 0x7f9a9773a320 <line:1724:5, col:31> col:31 referenced difference_type 'ptrdiff_t':'long'
| `-TypedefType 0x7f9a970daf50 'ptrdiff_t' sugar
|   |-Typedef 0x7f9a96869140 'ptrdiff_t'
|   `-BuiltinType 0x7f9a96833be0 'long'
|-TypedefDecl 0x7f9a9773a3e8 <line:1725:5, col:31> col:31 referenced pointer 'int *'
| `-PointerType 0x7f9a9773a3b0 'int *'
|   `-SubstTemplateTypeParmType 0x7f9a9773a380 'int' sugar
|     |-TemplateTypeParmType 0x7f9a97365660 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f9a97365618 '_Tp'
|     `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a9773a478 <line:1726:5, col:31> col:31 referenced const_pointer 'const int *'
| `-PointerType 0x7f9a9773a440 'const int *'
|   `-QualType 0x7f9a9773a381 'const int' const
|     `-SubstTemplateTypeParmType 0x7f9a9773a380 'int' sugar
|       |-TemplateTypeParmType 0x7f9a97365660 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f9a97365618 '_Tp'
|       `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a9773a508 <line:1727:5, col:31> col:31 reference 'int &'
| `-LValueReferenceType 0x7f9a9773a4d0 'int &'
|   `-SubstTemplateTypeParmType 0x7f9a9773a380 'int' sugar
|     |-TemplateTypeParmType 0x7f9a97365660 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f9a97365618 '_Tp'
|     `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a9773a598 <line:1728:5, col:31> col:31 const_reference 'const int &'
| `-LValueReferenceType 0x7f9a9773a560 'const int &'
|   `-QualType 0x7f9a9773a381 'const int' const
|     `-SubstTemplateTypeParmType 0x7f9a9773a380 'int' sugar
|       |-TemplateTypeParmType 0x7f9a97365660 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f9a97365618 '_Tp'
|       `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a9773a600 <line:1729:5, col:31> col:31 referenced value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7f9a9773a380 'int' sugar
|   |-TemplateTypeParmType 0x7f9a97365660 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9a97365618 '_Tp'
|   `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a9773a658 <line:1731:5, col:23> col:23 referenced propagate_on_container_move_assignment 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7f9a9703b740 'std::__1::true_type' sugar
|   |-Typedef 0x7f9a97038c48 'true_type'
|   `-TemplateSpecializationType 0x7f9a97038730 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7f9a97038598 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7f9a97038580 <line:528:31> '_Bool' true
|     `-RecordType 0x7f9a97038710 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7f9a97038608 'integral_constant'
|-TypedefDecl 0x7f9a9773a6b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1732:5, col:23> col:23 referenced is_always_equal 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7f9a9703b740 'std::__1::true_type' sugar
|   |-Typedef 0x7f9a97038c48 'true_type'
|   `-TemplateSpecializationType 0x7f9a97038730 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7f9a97038598 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7f9a97038580 <line:528:31> '_Bool' true
|     `-RecordType 0x7f9a97038710 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7f9a97038608 'integral_constant'
|-ClassTemplateDecl 0x7f9a9773a828 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1734:5, col:33> col:33 rebind
| |-TemplateTypeParmDecl 0x7f9a9773a708 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXRecordDecl 0x7f9a9773a790 <col:26, col:33> col:33 struct rebind
|-CXXConstructorDecl 0x7f9a9773aa78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1736:54> col:31 referenced allocator 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7f9a9773ab58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9a9773ae70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:5, col:96> col:52 allocator
| |-TemplateTypeParmDecl 0x7f9a9773aba0 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXConstructorDecl 0x7f9a9773adc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:96> col:52 allocator 'void (const allocator<_Up> &) noexcept'
|   |-ParmVarDecl 0x7f9a9773ace0 <col:62, col:82> col:83 'const allocator<_Up> &'
|   `-AlwaysInlineAttr 0x7f9a9773aec8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a9773b0f8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1739:39> line:1738:39 address 'std::__1::allocator<int>::pointer (std::__1::allocator<int>::reference) const noexcept'
| |-ParmVarDecl 0x7f9a9773aff0 <col:47, col:57> col:57 __x 'std::__1::allocator<int>::reference':'int &'
| `-AlwaysInlineAttr 0x7f9a9773b1a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a9773b348 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1741:39> line:1740:45 address 'std::__1::allocator<int>::const_pointer (std::__1::allocator<int>::const_reference) const noexcept'
| |-ParmVarDecl 0x7f9a9773b240 <col:53, col:69> col:69 __x 'std::__1::allocator<int>::const_reference':'const int &'
| `-AlwaysInlineAttr 0x7f9a9773b3f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a9773b5b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1748:9> line:1742:39 allocate 'std::__1::allocator<int>::pointer (std::__1::allocator::size_type, allocator<void>::const_pointer)'
| |-ParmVarDecl 0x7f9a9773b440 <col:48, col:58> col:58 __n 'std::__1::allocator::size_type':'unsigned long'
| |-ParmVarDecl 0x7f9a9773b4a0 <col:63, col:96> col:94 'allocator<void>::const_pointer':'const void *'
| `-AlwaysInlineAttr 0x7f9a9773b668 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a9773b838 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1750:49> line:1749:36 deallocate 'void (std::__1::allocator<int>::pointer, std::__1::allocator::size_type) noexcept'
| |-ParmVarDecl 0x7f9a9773b6c0 <col:47, col:55> col:55 __p 'std::__1::allocator<int>::pointer':'int *'
| |-ParmVarDecl 0x7f9a9773b720 <col:60> col:69 'std::__1::allocator::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f9a9773b8f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a9773b938 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1752:45> line:1751:41 max_size 'std::__1::allocator::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a9773b9e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9a9773bdc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1754:5, line:1760:9> line:1757:9 construct
| |-TemplateTypeParmDecl 0x7f9a9773ba28 <line:1754:15, col:21> col:21 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7f9a9773ba98 <col:26, col:35> col:35 class depth 0 index 1 ... _Args
| `-CXXMethodDecl 0x7f9a9773bd30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1760:9> line:1757:9 construct 'void (_Up *, _Args &&...)'
|   |-ParmVarDecl 0x7f9a9773bb68 <col:19, col:24> col:24 __p '_Up *'
|   |-ParmVarDecl 0x7f9a9773bc58 <col:29, col:40> col:40 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7f9a9773be28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a9773c010 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1814:70> col:36 destroy 'void (std::__1::allocator<int>::pointer)'
| |-ParmVarDecl 0x7f9a9773bf08 <col:44, col:52> col:52 __p 'std::__1::allocator<int>::pointer':'int *'
| `-AlwaysInlineAttr 0x7f9a9773c0c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7f9a98a70cb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28> col:28 implicit referenced ~allocator 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f9a98a88198 <col:28> col:28 implicit constexpr allocator 'void (const class std::__1::allocator<int> &)' inline default trivial noexcept-unevaluated 0x7f9a98a88198
| `-ParmVarDecl 0x7f9a98a88280 <col:28> col:28 'const class std::__1::allocator<int> &'
`-CXXConstructorDecl 0x7f9a98a88318 <col:28> col:28 implicit constexpr allocator 'void (class std::__1::allocator<int> &&)' inline default trivial noexcept-unevaluated 0x7f9a98a88318
  `-ParmVarDecl 0x7f9a98a88440 <col:28> col:28 'class std::__1::allocator<int> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9a98a6f3e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2069:1, line:2099:1> line:2070:8 struct __compressed_pair_elem definition
|-private 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-TemplateArgument integral 1
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7f9a98a6f778 prev 0x7f9a98a6f3e0 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7f9a98a6f820 <line:2071:3, col:15> col:15 _ParamT 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7f9a98a6f640 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7f9a973779b0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9a97377970 '_Tp'
|   `-RecordType 0x7f9a977392f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7f9a97739200 'allocator'
|-TypedefDecl 0x7f9a98a6f8b8 <line:2072:3, col:16> col:16 referenced reference 'class std::__1::allocator<int> &'
| `-LValueReferenceType 0x7f9a98a6f880 'class std::__1::allocator<int> &'
|   `-SubstTemplateTypeParmType 0x7f9a98a6f640 'class std::__1::allocator<int>' sugar
|     |-TemplateTypeParmType 0x7f9a973779b0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f9a97377970 '_Tp'
|     `-RecordType 0x7f9a977392f0 'class std::__1::allocator<int>'
|       `-ClassTemplateSpecialization 0x7f9a97739200 'allocator'
|-TypedefDecl 0x7f9a98a6f948 <line:2073:3, col:22> col:22 referenced const_reference 'const class std::__1::allocator<int> &'
| `-LValueReferenceType 0x7f9a98a6f910 'const class std::__1::allocator<int> &'
|   `-QualType 0x7f9a98a6f641 'const class std::__1::allocator<int>' const
|     `-SubstTemplateTypeParmType 0x7f9a98a6f640 'class std::__1::allocator<int>' sugar
|       |-TemplateTypeParmType 0x7f9a973779b0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f9a97377970 '_Tp'
|       `-RecordType 0x7f9a977392f0 'class std::__1::allocator<int>'
|         `-ClassTemplateSpecialization 0x7f9a97739200 'allocator'
|-TypedefDecl 0x7f9a98a6f9b0 <line:2074:3, col:15> col:15 __value_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7f9a98a6f640 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7f9a973779b0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9a97377970 '_Tp'
|   `-RecordType 0x7f9a977392f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7f9a97739200 'allocator'
|-CXXConstructorDecl 0x7f9a98a6fa48 <line:2077:3, col:46> col:13 __compressed_pair_elem 'void (void)' default noexcept-unevaluated 0x7f9a98a6fa48
|-FunctionTemplateDecl 0x7f9a98a70228 <line:2079:3, line:2084:48> line:2083:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7f9a98a6fb00 <line:2079:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7f9a98a6fb68 <col:24, line:2081:6> line:2079:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<class allocator<int>, 1, true>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7f9a98a70180 <line:2082:3, line:2084:48> line:2083:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7f9a98a70098 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7f9a98a70858 <line:2086:3, line:2090:79> line:2088:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7f9a98a70308 <line:2086:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7f9a98a70378 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7f9a98a707b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2090:79> line:2088:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7f9a98a703f0 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f9a98a70558 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7f9a98a706a8 <line:2089:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7f9a98a708e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a70a68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2097:3, col:47> col:13 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>::reference (void) noexcept'
|-CXXMethodDecl 0x7f9a98a70bb8 <line:2098:3, col:59> col:19 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>::const_reference (void) const noexcept'
`-CXXDestructorDecl 0x7f9a98a895c8 <line:2070:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem.0" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem.0" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9a98a6c608 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2104:1, line:2201:1> line:2105:7 class __compressed_pair definition
|-private '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|-private '__compressed_pair_elem<class std::__1::allocator<int>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>'
|-TemplateArgument type 'int *'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x7f9a98a70de0 prev 0x7f9a98a6c608 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7f9a98a71188 <line:2107:3, col:42> col:42 _Base1 '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
| `-TemplateSpecializationType 0x7f9a98a710e0 '__compressed_pair_elem<int *, 0>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'int *':'int *'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7f9a9737aa00 <col:39> 'int' 0
|   `-RecordType 0x7f9a98a6d320 'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|     `-ClassTemplateSpecialization 0x7f9a98a6d200 '__compressed_pair_elem'
|-TypedefDecl 0x7f9a98a714e8 <line:2108:3, col:42> col:42 _Base2 '__compressed_pair_elem<class std::__1::allocator<int>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>'
| `-TemplateSpecializationType 0x7f9a98a71440 '__compressed_pair_elem<class std::__1::allocator<int>, 1>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7f9a9737ada8 <col:39> 'int' 1
|   `-RecordType 0x7f9a98a6f500 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>'
|     `-ClassTemplateSpecialization 0x7f9a98a6f3e0 '__compressed_pair_elem'
|-StaticAssertDecl 0x7f9a98a71968 <line:2114:3, line:2117:44> line:2114:3
| |-ParenExpr 0x7f9a98a71948 <col:17, col:43> '_Bool'
| | `-UnaryOperator 0x7f9a98a71928 <col:18, col:38> '_Bool' prefix '!'
| |   `-ImplicitCastExpr 0x7f9a98a71910 <col:19, col:38> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7f9a98a718d8 <col:19, col:38> 'const _Bool':'const _Bool' lvalue Var 0x7f9a98993278 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f9a9737b2d8 <line:2115:5, line:2117:5> 'const char [179]' lvalue "__compressed_pair cannot be instantated when T1 and T2 are the same type; The current implementation is NOT ABI-compatible with the previous implementation for this configuration"
|-AccessSpecDecl 0x7f9a98a719a0 <line:2119:1, col:7> col:1 public
|-FunctionTemplateDecl 0x7f9a98a723e8 <line:2121:3, line:2128:34> col:13 __compressed_pair
| |-NonTypeTemplateParmDecl 0x7f9a98a719c8 <line:2121:13, col:27> col:18 referenced '_Bool' depth 0 index 0 _Dummy
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7f9a9737b420 <col:27> '_Bool' true
| |-TemplateTypeParmDecl 0x7f9a98a71a20 <line:2122:7, line:2125:10> line:2122:7 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<__dependent_type<is_default_constructible<int *>, _Dummy>::value && __dependent_type<is_default_constructible<class allocator<int> >, _Dummy>::value>::type'
| `-CXXConstructorDecl 0x7f9a98a72340 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2128:34> col:13 constexpr __compressed_pair 'void (void)'
|   `-AlwaysInlineAttr 0x7f9a98a72468 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9a98a72c88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2130:3, line:2135:51> line:2134:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f9a98a72538 <line:2130:13, col:19> col:19 class depth 0 index 0 _Tp
| |-NonTypeTemplateParmDecl 0x7f9a98a72a40 <col:24, line:2132:57> col:55 'typename enable_if<!is_same<typename decay<_Tp>::type, class __compressed_pair<int *, class allocator<int> > >::value, _Bool>::type' depth 0 index 1
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7f9a9737c340 <col:57> '_Bool' true
| `-CXXConstructorDecl 0x7f9a98a72be0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2135:51> line:2134:3 constexpr __compressed_pair 'void (_Tp &&)'
|   |-ParmVarDecl 0x7f9a98a72af8 <col:21, col:27> col:27 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7f9a98a72ce0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9a98a73068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2137:3, line:2140:51> line:2139:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f9a98a72db0 <line:2137:13, col:19> col:19 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7f9a98a72fc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2140:51> line:2139:3 constexpr __compressed_pair 'void (struct std::__1::__second_tag, _Tp &&)'
|   |-ParmVarDecl 0x7f9a98a72e30 <col:21> col:33 'struct std::__1::__second_tag'
|   |-ParmVarDecl 0x7f9a98a72ec8 <col:35, col:41> col:41 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7f9a98a730c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9a98a73518 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2142:3, line:2145:75> line:2144:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f9a98a73198 <line:2142:13, col:19> col:19 class depth 0 index 0 _U1
| |-TemplateTypeParmDecl 0x7f9a98a73208 <col:24, col:30> col:30 class depth 0 index 1 _U2
| `-CXXConstructorDecl 0x7f9a98a73470 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 constexpr __compressed_pair 'void (_U1 &&, _U2 &&)'
|   |-ParmVarDecl 0x7f9a98a732d8 <col:21, col:27> col:27 __t1 '_U1 &&'
|   |-ParmVarDecl 0x7f9a98a73378 <col:33, col:39> col:39 __t2 '_U2 &&'
|   `-AlwaysInlineAttr 0x7f9a98a73578 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9a98a73bd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2147:3, line:2154:75> line:2149:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f9a98a73648 <line:2147:13, col:22> col:22 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7f9a98a736b8 <col:30, col:39> col:39 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7f9a98a73b30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2154:75> line:2149:3 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7f9a98a73748 <col:21, col:43> col:43 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f9a98a738b8 <col:49, col:66> col:66 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7f9a98a73a28 <line:2150:21, col:38> col:38 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7f9a98a73c40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a73e08 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2175:3> line:2173:30 first 'typename _Base1::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7f9a98a73eb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a73fb8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2180:3> line:2178:36 first 'typename _Base1::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a74060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a741a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2185:3> line:2183:30 second 'typename _Base2::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7f9a98a74250 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a74358 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2190:3> line:2188:36 second 'typename _Base2::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a74400 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a745a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2200:3> line:2193:8 swap 'void (class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > &)' noexcept-uninstantiated 0x7f9a9737e448
| |-ParmVarDecl 0x7f9a98a74488 <col:13, col:32> col:32 __x 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7f9a98a74698 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
`-CXXDestructorDecl 0x7f9a98a89408 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2105:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9a97739728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:322:1, line:411:1> line:323:7 class __vector_base definition
|-protected '__vector_base_common<true>':'class std::__1::__vector_base_common<true>'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x7f9a97739990 prev 0x7f9a97739728 <col:1, col:7> col:7 implicit class __vector_base
|-AccessSpecDecl 0x7f9a97739a28 <line:326:1, col:10> col:1 protected
|-TypedefDecl 0x7f9a97739a88 <line:327:5, col:54> col:54 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7f9a97739a50 'int' sugar
|   |-TemplateTypeParmType 0x7f9a97ad35b0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9a97ad3570 '_Tp'
|   `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a97739b18 <line:328:5, col:54> col:54 allocator_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7f9a97739ae0 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7f9a97ad3620 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f9a97ad35d8 '_Allocator'
|   `-RecordType 0x7f9a977392f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7f9a97739200 'allocator'
|-TypedefDecl 0x7f9a97739d28 <line:329:5, col:54> col:54 referenced __alloc_traits 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x7f9a97739cb0 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type':'class std::__1::allocator<int>'
|   `-RecordType 0x7f9a97739c90 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x7f9a97739ba0 'allocator_traits'
|-TypedefDecl 0x7f9a97739e08 <line:330:5, col:54> col:54 referenced reference 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-LValueReferenceType 0x7f9a97739dd0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|   `-TypedefType 0x7f9a97739d80 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|     |-Typedef 0x7f9a97739a88 'value_type'
|     `-SubstTemplateTypeParmType 0x7f9a97739a50 'int' sugar
|       |-TemplateTypeParmType 0x7f9a97ad35b0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f9a97ad3570 '_Tp'
|       `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a97739ec8 <line:331:5, col:54> col:54 referenced const_reference 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-LValueReferenceType 0x7f9a97739e90 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|   `-QualType 0x7f9a97739d81 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' const
|     `-TypedefType 0x7f9a97739d80 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|       |-Typedef 0x7f9a97739a88 'value_type'
|       `-SubstTemplateTypeParmType 0x7f9a97739a50 'int' sugar
|         |-TemplateTypeParmType 0x7f9a97ad35b0 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7f9a97ad3570 '_Tp'
|         `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a98a6c130 <line:332:5, col:54> col:54 referenced size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7f9a98a6c0e0 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7f9a97746c20 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x7f9a977435b0 'size_type'
|     `-ElaboratedType 0x7f9a97743560 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7f9a97743540 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|         |-Typedef 0x7f9a977434c0 'type'
|         `-ElaboratedType 0x7f9a97743470 'typename class allocator<int>::size_type' sugar
|           `-TypedefType 0x7f9a97742d50 'std::__1::allocator<int>::size_type' sugar
|             |-Typedef 0x7f9a9773a2c8 'size_type'
|             `-TypedefType 0x7f9a97059410 'size_t' sugar
|               |-Typedef 0x7f9a968691b0 'size_t'
|               `-BuiltinType 0x7f9a96833c80 'unsigned long'
|-TypedefDecl 0x7f9a98a6c200 <line:333:5, col:54> col:54 referenced difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7f9a98a6c1b0 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7f9a97742a70 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x7f9a97742a00 'difference_type'
|     `-ElaboratedType 0x7f9a977429b0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7f9a97742990 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|         |-Typedef 0x7f9a97742910 'type'
|         `-ElaboratedType 0x7f9a977428c0 'typename class allocator<int>::difference_type' sugar
|           `-TypedefType 0x7f9a97742170 'std::__1::allocator<int>::difference_type' sugar
|             |-Typedef 0x7f9a9773a320 'difference_type'
|             `-TypedefType 0x7f9a970daf50 'ptrdiff_t' sugar
|               |-Typedef 0x7f9a96869140 'ptrdiff_t'
|               `-BuiltinType 0x7f9a96833be0 'long'
|-TypedefDecl 0x7f9a98a6c2d0 <line:334:5, col:54> col:54 referenced pointer 'typename __alloc_traits::pointer':'int *'
| `-ElaboratedType 0x7f9a98a6c280 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7f9a9773d840 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x7f9a9773d7d0 'pointer'
|     `-ElaboratedType 0x7f9a9773d780 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7f9a9773d760 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|         |-Typedef 0x7f9a9773d6e0 'type'
|         `-ElaboratedType 0x7f9a9773d690 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|           `-TypedefType 0x7f9a9773d670 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x7f9a9773d5f0 'type'
|             `-ElaboratedType 0x7f9a9773d5a0 'typename class allocator<int>::pointer' sugar
|               `-TypedefType 0x7f9a9773afa0 'std::__1::allocator<int>::pointer' sugar
|                 |-Typedef 0x7f9a9773a3e8 'pointer'
|                 `-PointerType 0x7f9a9773a3b0 'int *'
|                   `-SubstTemplateTypeParmType 0x7f9a9773a380 'int' sugar
|                     |-TemplateTypeParmType 0x7f9a97365660 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7f9a97365618 '_Tp'
|                     `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a98a6c3c0 <line:335:5, col:54> col:54 referenced const_pointer 'typename __alloc_traits::const_pointer':'const int *'
| `-ElaboratedType 0x7f9a98a6c370 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7f9a98a6c350 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x7f9a9773e5d0 'const_pointer'
|     `-ElaboratedType 0x7f9a9773e580 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7f9a9773e560 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|         |-Typedef 0x7f9a9773e4e0 'type'
|         `-ElaboratedType 0x7f9a9773e490 'typename class allocator<int>::const_pointer' sugar
|           `-TypedefType 0x7f9a9773b1f0 'std::__1::allocator<int>::const_pointer' sugar
|             |-Typedef 0x7f9a9773a478 'const_pointer'
|             `-PointerType 0x7f9a9773a440 'const int *'
|               `-QualType 0x7f9a9773a381 'const int' const
|                 `-SubstTemplateTypeParmType 0x7f9a9773a380 'int' sugar
|                   |-TemplateTypeParmType 0x7f9a97365660 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7f9a97365618 '_Tp'
|                   `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a98a6c450 <line:336:5, col:54> col:54 iterator 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
| `-TypedefType 0x7f9a98a6c420 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer' sugar
|   |-Typedef 0x7f9a98a6c2d0 'pointer'
|   `-ElaboratedType 0x7f9a98a6c280 'typename __alloc_traits::pointer' sugar
|     `-TypedefType 0x7f9a9773d840 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|       |-Typedef 0x7f9a9773d7d0 'pointer'
|       `-ElaboratedType 0x7f9a9773d780 'typename __pointer_type<value_type, allocator_type>::type' sugar
|         `-TypedefType 0x7f9a9773d760 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|           |-Typedef 0x7f9a9773d6e0 'type'
|           `-ElaboratedType 0x7f9a9773d690 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|             `-TypedefType 0x7f9a9773d670 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|               |-Typedef 0x7f9a9773d5f0 'type'
|               `-ElaboratedType 0x7f9a9773d5a0 'typename class allocator<int>::pointer' sugar
|                 `-TypedefType 0x7f9a9773afa0 'std::__1::allocator<int>::pointer' sugar
|                   |-Typedef 0x7f9a9773a3e8 'pointer'
|                   `-PointerType 0x7f9a9773a3b0 'int *'
|                     `-SubstTemplateTypeParmType 0x7f9a9773a380 'int' sugar
|                       |-TemplateTypeParmType 0x7f9a97365660 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7f9a97365618 '_Tp'
|                       `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a98a6c4e0 <line:337:5, col:54> col:54 const_iterator 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer':'const int *'
| `-TypedefType 0x7f9a98a6c4b0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer' sugar
|   |-Typedef 0x7f9a98a6c3c0 'const_pointer'
|   `-ElaboratedType 0x7f9a98a6c370 'typename __alloc_traits::const_pointer' sugar
|     `-TypedefType 0x7f9a98a6c350 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|       |-Typedef 0x7f9a9773e5d0 'const_pointer'
|       `-ElaboratedType 0x7f9a9773e580 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|         `-TypedefType 0x7f9a9773e560 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|           |-Typedef 0x7f9a9773e4e0 'type'
|           `-ElaboratedType 0x7f9a9773e490 'typename class allocator<int>::const_pointer' sugar
|             `-TypedefType 0x7f9a9773b1f0 'std::__1::allocator<int>::const_pointer' sugar
|               |-Typedef 0x7f9a9773a478 'const_pointer'
|               `-PointerType 0x7f9a9773a440 'const int *'
|                 `-QualType 0x7f9a9773a381 'const int' const
|                   `-SubstTemplateTypeParmType 0x7f9a9773a380 'int' sugar
|                     |-TemplateTypeParmType 0x7f9a97365660 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7f9a97365618 '_Tp'
|                     `-BuiltinType 0x7f9a96833bc0 'int'
|-FieldDecl 0x7f9a98a6c548 <line:339:5, col:53> col:53 __begin_ 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
|-FieldDecl 0x7f9a98a6c5a0 <line:340:5, col:53> col:53 __end_ 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
|-FieldDecl 0x7f9a98a74700 <line:341:5, col:48> col:48 __end_cap_ '__compressed_pair<std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer, std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> >'
|-CXXMethodDecl 0x7f9a98a747d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:345:37> line:344:21 __alloc 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &(void) noexcept'
| `-AlwaysInlineAttr 0x7f9a98a748a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a74978 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:348:37> line:347:27 __alloc 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &(void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a74a20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a74af8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:351:36> line:350:14 __end_cap 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer &(void) noexcept'
| `-AlwaysInlineAttr 0x7f9a98a74ba0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a74c78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:354:36> line:353:20 __end_cap 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer &(void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a74d20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9a98a74dd0 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:357:5 __vector_base 'void (void)' noexcept-uninstantiated 0x7f9a97ad4ef0
| `-AlwaysInlineAttr 0x7f9a98a74ed0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9a98a75050 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:359:70> col:31 __vector_base 'void (const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7f9a98a74f28 <col:45, col:67> col:67 __a 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7f9a98a75110 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7f9a98a75188 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:360:5, col:20> col:5 used ~__vector_base 'void (void) noexcept'
|-CXXMethodDecl 0x7f9a98a75238 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:363:57> col:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7f9a98a752e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a753a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:366:64> line:365:15 capacity 'std::__1::__vector_base<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a75450 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a75578 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:369:10 __destruct_at_end 'void (std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x7f9a98a754a8 <col:28, col:36> col:36 __new_last 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7f9a98a75628 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a75770 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:374:89> line:372:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &)'
| |-ParmVarDecl 0x7f9a98a756a8 <col:30, col:51> col:51 __c 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7f9a98a75820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a759c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:382:89> line:377:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &)' noexcept-uninstantiated 0x7f9a97ae0800
| |-ParmVarDecl 0x7f9a98a758a8 <col:30, col:45> col:45 __c 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7f9a98a75ab8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7f9a98a75b00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:383:1, col:8> col:1 private
|-CXXMethodDecl 0x7f9a98a75cb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:394:9> line:385:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::true_type)'
| |-ParmVarDecl 0x7f9a98a75b38 <col:30, col:51> col:51 __c 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7f9a98a75b98 <col:56> col:65 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7f9a98a75d68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a75f30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:398:10> line:397:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::false_type)'
| |-ParmVarDecl 0x7f9a98a75dc0 <col:30, col:49> col:50 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7f9a98a75e20 <col:52> col:62 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7f9a98a75fe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a761c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:405:9> line:401:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::true_type)' noexcept-uninstantiated 0x7f9a97ae1068
| |-ParmVarDecl 0x7f9a98a76040 <col:30, col:45> col:45 __c 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7f9a98a760a0 <col:50> col:59 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7f9a98a762d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
`-CXXMethodDecl 0x7f9a98a764a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:410:10> line:408:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::false_type) noexcept'
  |-ParmVarDecl 0x7f9a98a76328 <col:30, col:43> col:44 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
  |-ParmVarDecl 0x7f9a98a76388 <col:46> col:56 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
  `-AlwaysInlineAttr 0x7f9a98a76560 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__vector_base" = type { i32*, i32*, %"class.std::__1::__compressed_pair" }
  NonVirtualBaseLLVMType:%"class.std::__1::__vector_base" = type { i32*, i32*, %"class.std::__1::__compressed_pair" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9a97739388 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:453:1, line:887:1> line:454:28 class vector definition
|-private '__vector_base<int, class std::__1::allocator<int> >':'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x7f9a98a76618 prev 0x7f9a97739388 <col:1, col:28> col:28 implicit class vector
|-AccessSpecDecl 0x7f9a98a766b0 <line:457:1, col:8> col:1 private
|-TypedefDecl 0x7f9a98a767a8 <line:458:5, col:54> col:54 __base '__vector_base<int, class std::__1::allocator<int> >':'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x7f9a98a76700 '__vector_base<int, class std::__1::allocator<int> >' sugar __vector_base
|   |-TemplateArgument type 'int':'int'
|   |-TemplateArgument type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|   `-RecordType 0x7f9a97739830 'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x7f9a97739728 '__vector_base'
|-TypedefDecl 0x7f9a98a76888 <line:459:5, col:54> col:54 __default_allocator_type 'allocator<int>':'class std::__1::allocator<int>'
| `-TemplateSpecializationType 0x7f9a98a76810 'allocator<int>' sugar allocator
|   |-TemplateArgument type 'int':'int'
|   `-RecordType 0x7f9a977392f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7f9a97739200 'allocator'
|-AccessSpecDecl 0x7f9a98a768e0 <line:460:1, col:7> col:1 public
|-TypedefDecl 0x7f9a98a76918 <line:461:5, col:54> col:54 __self 'class std::__1::vector<int, class std::__1::allocator<int> >'
| `-RecordType 0x7f9a97739490 'class std::__1::vector<int, class std::__1::allocator<int> >'
|   `-ClassTemplateSpecialization 0x7f9a97739388 'vector'
|-TypedefDecl 0x7f9a98a76980 <line:462:5, col:54> col:54 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7f9a977396b0 'int' sugar
|   |-TemplateTypeParmType 0x7f9a97ae57e0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9a97ae57a0 '_Tp'
|   `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a98a769e8 <line:463:5, col:54> col:54 allocator_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7f9a977396f0 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7f9a97ae5850 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f9a97ae5808 '_Allocator'
|   `-RecordType 0x7f9a977392f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7f9a97739200 'allocator'
|-TypedefDecl 0x7f9a98a76af0 <line:464:5, col:54> col:54 __alloc_traits 'typename __base::__alloc_traits':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-ElaboratedType 0x7f9a98a76aa0 'typename __base::__alloc_traits' sugar
|   `-TypedefType 0x7f9a97739f20 'std::__1::__vector_base<int, class std::__1::allocator<int> >::__alloc_traits' sugar
|     |-Typedef 0x7f9a97739d28 '__alloc_traits'
|     `-TemplateSpecializationType 0x7f9a97739cb0 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>' sugar allocator_traits
|       |-TemplateArgument type 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type':'class std::__1::allocator<int>'
|       `-RecordType 0x7f9a97739c90 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|         `-ClassTemplateSpecialization 0x7f9a97739ba0 'allocator_traits'
|-TypedefDecl 0x7f9a98a76be0 <line:465:5, col:54> col:54 reference 'typename __base::reference':'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ElaboratedType 0x7f9a98a76b90 'typename __base::reference' sugar
|   `-TypedefType 0x7f9a98a76b70 'std::__1::__vector_base<int, class std::__1::allocator<int> >::reference' sugar
|     |-Typedef 0x7f9a97739e08 'reference'
|     `-LValueReferenceType 0x7f9a97739dd0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|       `-TypedefType 0x7f9a97739d80 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|         |-Typedef 0x7f9a97739a88 'value_type'
|         `-SubstTemplateTypeParmType 0x7f9a97739a50 'int' sugar
|           |-TemplateTypeParmType 0x7f9a97ad35b0 '_Tp' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x7f9a97ad3570 '_Tp'
|           `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a98a76cd0 <line:466:5, col:54> col:54 const_reference 'typename __base::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ElaboratedType 0x7f9a98a76c80 'typename __base::const_reference' sugar
|   `-TypedefType 0x7f9a98a76c60 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_reference' sugar
|     |-Typedef 0x7f9a97739ec8 'const_reference'
|     `-LValueReferenceType 0x7f9a97739e90 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|       `-QualType 0x7f9a97739d81 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' const
|         `-TypedefType 0x7f9a97739d80 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|           |-Typedef 0x7f9a97739a88 'value_type'
|           `-SubstTemplateTypeParmType 0x7f9a97739a50 'int' sugar
|             |-TemplateTypeParmType 0x7f9a97ad35b0 '_Tp' dependent depth 0 index 0
|             | `-TemplateTypeParm 0x7f9a97ad3570 '_Tp'
|             `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a98a76da0 <line:467:5, col:54> col:54 size_type 'typename __base::size_type':'unsigned long'
| `-ElaboratedType 0x7f9a98a76d50 'typename __base::size_type' sugar
|   `-TypedefType 0x7f9a98a75330 'std::__1::__vector_base<int, class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x7f9a98a6c130 'size_type'
|     `-ElaboratedType 0x7f9a98a6c0e0 'typename __alloc_traits::size_type' sugar
|       `-TypedefType 0x7f9a97746c20 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|         |-Typedef 0x7f9a977435b0 'size_type'
|         `-ElaboratedType 0x7f9a97743560 'typename __size_type<allocator_type, difference_type>::type' sugar
|           `-TypedefType 0x7f9a97743540 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|             |-Typedef 0x7f9a977434c0 'type'
|             `-ElaboratedType 0x7f9a97743470 'typename class allocator<int>::size_type' sugar
|               `-TypedefType 0x7f9a97742d50 'std::__1::allocator<int>::size_type' sugar
|                 |-Typedef 0x7f9a9773a2c8 'size_type'
|                 `-TypedefType 0x7f9a97059410 'size_t' sugar
|                   |-Typedef 0x7f9a968691b0 'size_t'
|                   `-BuiltinType 0x7f9a96833c80 'unsigned long'
|-TypedefDecl 0x7f9a98a76e90 <line:468:5, col:54> col:54 difference_type 'typename __base::difference_type':'long'
| `-ElaboratedType 0x7f9a98a76e40 'typename __base::difference_type' sugar
|   `-TypedefType 0x7f9a98a76e20 'std::__1::__vector_base<int, class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x7f9a98a6c200 'difference_type'
|     `-ElaboratedType 0x7f9a98a6c1b0 'typename __alloc_traits::difference_type' sugar
|       `-TypedefType 0x7f9a97742a70 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|         |-Typedef 0x7f9a97742a00 'difference_type'
|         `-ElaboratedType 0x7f9a977429b0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|           `-TypedefType 0x7f9a97742990 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|             |-Typedef 0x7f9a97742910 'type'
|             `-ElaboratedType 0x7f9a977428c0 'typename class allocator<int>::difference_type' sugar
|               `-TypedefType 0x7f9a97742170 'std::__1::allocator<int>::difference_type' sugar
|                 |-Typedef 0x7f9a9773a320 'difference_type'
|                 `-TypedefType 0x7f9a970daf50 'ptrdiff_t' sugar
|                   |-Typedef 0x7f9a96869140 'ptrdiff_t'
|                   `-BuiltinType 0x7f9a96833be0 'long'
|-TypedefDecl 0x7f9a98a76f60 <line:469:5, col:54> col:54 pointer 'typename __base::pointer':'int *'
| `-ElaboratedType 0x7f9a98a76f10 'typename __base::pointer' sugar
|   `-TypedefType 0x7f9a98a6c420 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x7f9a98a6c2d0 'pointer'
|     `-ElaboratedType 0x7f9a98a6c280 'typename __alloc_traits::pointer' sugar
|       `-TypedefType 0x7f9a9773d840 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|         |-Typedef 0x7f9a9773d7d0 'pointer'
|         `-ElaboratedType 0x7f9a9773d780 'typename __pointer_type<value_type, allocator_type>::type' sugar
|           `-TypedefType 0x7f9a9773d760 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|             |-Typedef 0x7f9a9773d6e0 'type'
|             `-ElaboratedType 0x7f9a9773d690 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|               `-TypedefType 0x7f9a9773d670 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|                 |-Typedef 0x7f9a9773d5f0 'type'
|                 `-ElaboratedType 0x7f9a9773d5a0 'typename class allocator<int>::pointer' sugar
|                   `-TypedefType 0x7f9a9773afa0 'std::__1::allocator<int>::pointer' sugar
|                     |-Typedef 0x7f9a9773a3e8 'pointer'
|                     `-PointerType 0x7f9a9773a3b0 'int *'
|                       `-SubstTemplateTypeParmType 0x7f9a9773a380 'int' sugar
|                         |-TemplateTypeParmType 0x7f9a97365660 '_Tp' dependent depth 0 index 0
|                         | `-TemplateTypeParm 0x7f9a97365618 '_Tp'
|                         `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a98a77030 <line:470:5, col:54> col:54 const_pointer 'typename __base::const_pointer':'const int *'
| `-ElaboratedType 0x7f9a98a76fe0 'typename __base::const_pointer' sugar
|   `-TypedefType 0x7f9a98a6c4b0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x7f9a98a6c3c0 'const_pointer'
|     `-ElaboratedType 0x7f9a98a6c370 'typename __alloc_traits::const_pointer' sugar
|       `-TypedefType 0x7f9a98a6c350 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|         |-Typedef 0x7f9a9773e5d0 'const_pointer'
|         `-ElaboratedType 0x7f9a9773e580 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|           `-TypedefType 0x7f9a9773e560 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x7f9a9773e4e0 'type'
|             `-ElaboratedType 0x7f9a9773e490 'typename class allocator<int>::const_pointer' sugar
|               `-TypedefType 0x7f9a9773b1f0 'std::__1::allocator<int>::const_pointer' sugar
|                 |-Typedef 0x7f9a9773a478 'const_pointer'
|                 `-PointerType 0x7f9a9773a440 'const int *'
|                   `-QualType 0x7f9a9773a381 'const int' const
|                     `-SubstTemplateTypeParmType 0x7f9a9773a380 'int' sugar
|                       |-TemplateTypeParmType 0x7f9a97365660 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7f9a97365618 '_Tp'
|                       `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a98a77248 <line:471:5, col:54> col:54 iterator '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::pointer>':'class std::__1::__wrap_iter<int *>'
| `-TemplateSpecializationType 0x7f9a98a771d0 '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|   `-RecordType 0x7f9a98a771b0 'class std::__1::__wrap_iter<int *>'
|     `-ClassTemplateSpecialization 0x7f9a98a770c0 '__wrap_iter'
|-TypedefDecl 0x7f9a98a77458 <line:472:5, col:54> col:54 const_iterator '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::const_pointer>':'class std::__1::__wrap_iter<const int *>'
| `-TemplateSpecializationType 0x7f9a98a773e0 '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::const_pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::const_pointer':'const int *'
|   `-RecordType 0x7f9a98a773c0 'class std::__1::__wrap_iter<const int *>'
|     `-ClassTemplateSpecialization 0x7f9a98a772d0 '__wrap_iter'
|-TypedefDecl 0x7f9a98a776c0 <line:473:5, col:55> col:55 reverse_iterator 'std::__1::reverse_iterator<iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<int *> >'
| `-ElaboratedType 0x7f9a98a77650 'std::__1::reverse_iterator<iterator>' sugar
|   `-TemplateSpecializationType 0x7f9a98a77600 'reverse_iterator<std::__1::vector<int, class std::__1::allocator<int> >::iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::iterator':'class std::__1::__wrap_iter<int *>'
|     `-RecordType 0x7f9a98a775d0 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<int *> >'
|       `-ClassTemplateSpecialization 0x7f9a98a774e0 'reverse_iterator'
|-TypedefDecl 0x7f9a98a77920 <line:474:5, col:55> col:55 const_reverse_iterator 'std::__1::reverse_iterator<const_iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const int *> >'
| `-ElaboratedType 0x7f9a98a778b0 'std::__1::reverse_iterator<const_iterator>' sugar
|   `-TemplateSpecializationType 0x7f9a98a77860 'reverse_iterator<std::__1::vector<int, class std::__1::allocator<int> >::const_iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|     `-RecordType 0x7f9a98a77840 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const int *> >'
|       `-ClassTemplateSpecialization 0x7f9a98a77750 'reverse_iterator'
|-StaticAssertDecl 0x7f9a98a77ea8 <line:476:5, line:477:74> line:476:5
| |-ParenExpr 0x7f9a98a77e70 <col:19, col:83> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7f9a98a77e38 <col:20, col:78> 'const _Bool':'const _Bool' lvalue Var 0x7f9a9691ee20 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f9a97ae71f0 <line:477:19> 'const char [54]' lvalue "Allocator::value_type must be same type as value_type"
|-CXXConstructorDecl 0x7f9a98a77f48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:485:9> line:480:5 used vector 'void (void) noexcept(is_nothrow_default_constructible<allocator_type>::value)'
| `-AlwaysInlineAttr 0x7f9a98a78068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9a98a781e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:497:5> line:486:40 vector 'void (const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)' noexcept-uninstantiated 0x7f9a97ae7568
| |-ParmVarDecl 0x7f9a98a780e8 <col:47, col:69> col:69 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7f9a98a782e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9a98a78440 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:498:5, col:34> col:14 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7f9a98a78360 <col:21, col:31> col:31 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXConstructorDecl 0x7f9a98a786b0 <line:500:5, col:61> col:14 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7f9a98a78510 <col:21, col:31> col:31 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f9a98a78580 <col:36, col:58> col:58 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-CXXConstructorDecl 0x7f9a98a78950 <line:502:5, col:46> col:5 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7f9a98a78788 <col:12, col:22> col:22 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f9a98a78820 <col:27, col:43> col:43 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXConstructorDecl 0x7f9a98a78c60 <line:503:5, col:73> col:5 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7f9a98a78a28 <col:12, col:22> col:22 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f9a98a78a98 <col:27, col:43> col:43 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ParmVarDecl 0x7f9a98a78b08 <col:48, col:70> col:70 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-FunctionTemplateDecl 0x7f9a98a796f8 <line:504:5, line:511:62> line:505:9 vector
| |-TemplateTypeParmDecl 0x7f9a98a78d30 <line:504:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7f9a98a79650 <line:505:9, line:511:62> line:505:9 vector 'void (_InputIterator, typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, _InputIterator>::type)'
|   |-ParmVarDecl 0x7f9a98a78dc0 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x7f9a98a79520 <line:506:16, line:511:56> col:56 __last 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, _InputIterator>::type'
|-FunctionTemplateDecl 0x7f9a98a7a268 <line:512:5, line:518:108> line:513:9 vector
| |-TemplateTypeParmDecl 0x7f9a98a797e0 <line:512:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7f9a98a7a1c0 <line:513:9, line:518:108> line:513:9 vector 'void (_InputIterator, _InputIterator, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &, typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value>::type *)'
|   |-ParmVarDecl 0x7f9a98a79870 <col:16, col:31> col:31 __first '_InputIterator'
|   |-ParmVarDecl 0x7f9a98a798e0 <col:40, col:55> col:55 __last '_InputIterator'
|   |-ParmVarDecl 0x7f9a98a79950 <col:63, col:85> col:85 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|   `-ParmVarDecl 0x7f9a98a7a060 <line:514:16, line:518:107> col:105 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value>::type *'
|-FunctionTemplateDecl 0x7f9a98a7ab78 <line:519:5, line:525:64> line:520:9 vector
| |-TemplateTypeParmDecl 0x7f9a98a7a360 <line:519:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXConstructorDecl 0x7f9a98a7aad0 <line:520:9, line:525:64> line:520:9 vector 'void (_ForwardIterator, typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, _ForwardIterator>::type)'
|   |-ParmVarDecl 0x7f9a98a7a3f0 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7f9a98a7a9a0 <line:521:16, line:525:58> col:58 __last 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, _ForwardIterator>::type'
|-FunctionTemplateDecl 0x7f9a98a7b5a8 <line:526:5, line:531:110> line:527:9 vector
| |-TemplateTypeParmDecl 0x7f9a98a7ac60 <line:526:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXConstructorDecl 0x7f9a98a7b500 <line:527:9, line:531:110> line:527:9 vector 'void (_ForwardIterator, _ForwardIterator, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &, typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value>::type *)'
|   |-ParmVarDecl 0x7f9a98a7acf0 <col:16, col:33> col:33 __first '_ForwardIterator'
|   |-ParmVarDecl 0x7f9a98a7ad60 <col:42, col:59> col:59 __last '_ForwardIterator'
|   |-ParmVarDecl 0x7f9a98a7add0 <col:67, col:89> col:89 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|   `-ParmVarDecl 0x7f9a98a7b3a0 <line:528:16, line:531:109> col:107 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value>::type *'
|-CXXConstructorDecl 0x7f9a98a7b7c0 <line:541:5, col:29> col:5 vector 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &)'
| `-ParmVarDecl 0x7f9a98a7b6d8 <col:12, col:26> col:26 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
|-CXXConstructorDecl 0x7f9a98a7ba30 <line:542:5, col:56> col:5 vector 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7f9a98a7b890 <col:12, col:26> col:26 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x7f9a98a7b900 <col:31, col:53> col:53 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-CXXMethodDecl 0x7f9a98a7bc00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:544:40> col:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(const class std::__1::vector<int, class std::__1::allocator<int> > &)'
| |-ParmVarDecl 0x7f9a98a7bb38 <col:23, col:37> col:37 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7f9a98a7bcb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9a98a7bfb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:548:45> col:5 vector 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7f9a98a7be88 <col:12, col:41> col:41 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7f9a98a7c070 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9a98a7c2f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:551:72> col:5 vector 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7f9a98a7c148 <col:12, col:41> col:41 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| |-ParmVarDecl 0x7f9a98a7c1b8 <col:47, col:69> col:69 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7f9a98a7c3b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9a98a7c570 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:554:5 vector 'void (class std::__1::vector<int, class std::__1::allocator<int> > &&)' noexcept-uninstantiated 0x7f9a97aeb6b8
| |-ParmVarDecl 0x7f9a98a7c438 <col:12, col:21> col:21 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| `-AlwaysInlineAttr 0x7f9a98a7c678 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9a98a7c870 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:562:51> col:5 vector 'void (class std::__1::vector<int, class std::__1::allocator<int> > &&, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7f9a98a7c6d0 <col:12, col:21> col:21 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| |-ParmVarDecl 0x7f9a98a7c740 <col:26, col:48> col:48 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7f9a98a7c938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7caa0 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:564:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(class std::__1::vector<int, class std::__1::allocator<int> > &&)' noexcept-uninstantiated 0x7f9a97aebbd8
| |-ParmVarDecl 0x7f9a98a7c990 <col:23, col:32> col:32 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| `-AlwaysInlineAttr 0x7f9a98a7cb98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7cd70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:569:57> line:568:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7f9a98a7cc68 <col:23, col:52> col:52 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7f9a98a7ce20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9a98a7d6d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:573:5, line:583:61> col:9 assign
| |-TemplateTypeParmDecl 0x7f9a98a7ce68 <line:573:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7f9a98a7d640 <line:574:9, line:583:61> col:9 assign 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, void>::type (_InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x7f9a98a7d4b0 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x7f9a98a7d520 <col:40, col:55> col:55 __last '_InputIterator'
|-FunctionTemplateDecl 0x7f9a98a7dee8 <line:584:5, line:593:65> col:9 assign
| |-TemplateTypeParmDecl 0x7f9a98a7d7c0 <line:584:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7f9a98a7de50 <line:585:9, line:593:65> col:9 assign 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, void>::type (_ForwardIterator, _ForwardIterator)'
|   |-ParmVarDecl 0x7f9a98a7dcc0 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7f9a98a7dd30 <col:42, col:59> col:59 __last '_ForwardIterator'
|-CXXMethodDecl 0x7f9a98a7e0e0 <line:595:5, col:51> col:10 assign 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7f9a98a7dfe0 <col:17, col:27> col:27 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f9a98a7e050 <col:32, col:48> col:48 __u 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7f9a98a7e2f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:600:43> line:599:10 assign 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7f9a98a7e228 <col:17, col:46> col:46 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7f9a98a7e3a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7e478 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:605:33> line:604:20 get_allocator 'std::__1::vector<int, class std::__1::allocator<int> >::allocator_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a7e520 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7e5f8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:607:54 begin 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f9a98a7e6a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7e778 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:608:54 begin 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a7e820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7e890 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:609:54 end 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f9a98a7e938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7e9a8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:610:54 end 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a7ea50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7eb48 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:614:47> line:613:28 rbegin 'std::__1::vector<int, class std::__1::allocator<int> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f9a98a7ebf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7ece8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:617:47> line:616:28 rbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a7ed90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7ee00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:620:49> line:619:28 rend 'std::__1::vector<int, class std::__1::allocator<int> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f9a98a7eea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7ef18 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:623:49> line:622:28 rend 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a7efc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7f030 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:627:25> line:626:28 cbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a7f0d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7f148 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:630:23> line:629:28 cend 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a7f1f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7f260 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:633:26> line:632:28 crbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a7f308 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7f378 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:636:24> line:635:28 crend 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a7f420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7f4c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:640:71> line:639:15 size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a7f570 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7f5e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:643:36> line:642:15 capacity 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a7f688 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7f6d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:646:48> line:645:10 empty '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a7f778 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7f7e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:647:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:647:15 max_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
|-CXXMethodDecl 0x7f9a98a7f928 <line:648:5, col:31> col:10 reserve 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7f9a98a7f8a0 <col:18, col:28> col:28 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f9a98a7f9d8 <line:649:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:649:10 shrink_to_fit 'void (void) noexcept'
|-CXXMethodDecl 0x7f9a98a7fbb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:651:71> col:47 operator[] 'std::__1::vector<int, class std::__1::allocator<int> >::reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| |-ParmVarDecl 0x7f9a98a7fab0 <col:58, col:68> col:68 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f9a98a7fc60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7fdc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:652:73> col:47 operator[] 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7f9a98a7fcb8 <col:58, col:68> col:68 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f9a98a7fe70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a7ff50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:653:5, col:37> col:21 at 'std::__1::vector<int, class std::__1::allocator<int> >::reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7f9a98a7fec8 <col:24, col:34> col:34 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f9a98a80098 <line:654:5, col:39> col:21 at 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| `-ParmVarDecl 0x7f9a98a80010 <col:24, col:34> col:34 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f9a98a801d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:660:5> line:656:47 front 'std::__1::vector<int, class std::__1::allocator<int> >::reference (void)'
| `-AlwaysInlineAttr 0x7f9a98a80278 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a80340 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:665:5> line:661:47 front 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7f9a98a803e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a80450 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:670:5> line:666:47 back 'std::__1::vector<int, class std::__1::allocator<int> >::reference (void)'
| `-AlwaysInlineAttr 0x7f9a98a804f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a80560 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:675:5> line:671:47 back 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7f9a98a80608 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a806d8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:679:57> line:678:23 data 'std::__1::vector<int, class std::__1::allocator<int> >::value_type *(void) noexcept'
| `-AlwaysInlineAttr 0x7f9a98a80780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a80888 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:682:57> line:681:23 data 'const std::__1::vector<int, class std::__1::allocator<int> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a80930 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a80a90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:684:65> col:36 push_back 'void (std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7f9a98a80988 <col:46, col:62> col:62 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-AlwaysInlineAttr 0x7f9a98a80b40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a80d00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:687:62> col:36 push_back 'void (std::__1::vector<int, class std::__1::allocator<int> >::value_type &&)'
| |-ParmVarDecl 0x7f9a98a80bf8 <col:46, col:59> col:59 __x 'std::__1::vector<int, class std::__1::allocator<int> >::value_type &&'
| `-AlwaysInlineAttr 0x7f9a98a80db0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9a98a81068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:689:5, line:694:49> col:19 emplace_back
| |-TemplateTypeParmDecl 0x7f9a98a80df8 <line:689:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x7f9a98a80fd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:694:49> col:19 emplace_back 'void (_Args &&...)'
|   |-ParmVarDecl 0x7f9a98a80f08 <col:32, col:43> col:43 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7f9a98a810c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f9a98a81190 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:699:19> col:10 pop_back 'void (void)'
| `-AlwaysInlineAttr 0x7f9a98a81238 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f9a98a81410 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:701:5, col:67> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7f9a98a81290 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x7f9a98a81300 <col:48, col:64> col:64 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7f9a98a81660 <line:704:5, col:64> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::value_type &&)'
| |-ParmVarDecl 0x7f9a98a814d8 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x7f9a98a81548 <col:48, col:61> col:61 __x 'std::__1::vector<int, class std::__1::allocator<int> >::value_type &&'
|-FunctionTemplateDecl 0x7f9a98a81a48 <line:705:5, line:706:70> col:18 emplace
| |-TemplateTypeParmDecl 0x7f9a98a81718 <line:705:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x7f9a98a819b0 <line:706:9, col:70> col:18 emplace 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _Args &&...)'
|   |-ParmVarDecl 0x7f9a98a817b0 <col:26, col:41> col:41 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   `-ParmVarDecl 0x7f9a98a81898 <col:53, col:64> col:64 __args '_Args &&...'
|-CXXMethodDecl 0x7f9a98a81d50 <line:709:5, col:82> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7f9a98a81b40 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| |-ParmVarDecl 0x7f9a98a81bb0 <col:48, col:58> col:58 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f9a98a81c20 <col:63, col:79> col:79 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-FunctionTemplateDecl 0x7f9a98a827c8 <line:710:5, line:720:88> col:9 insert
| |-TemplateTypeParmDecl 0x7f9a98a81e10 <line:710:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7f9a98a82730 <line:711:9, line:720:88> col:9 insert 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, iterator>::type (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x7f9a98a82510 <col:16, col:31> col:31 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   |-ParmVarDecl 0x7f9a98a82580 <col:43, col:58> col:58 __first '_InputIterator'
|   `-ParmVarDecl 0x7f9a98a825f0 <col:67, col:82> col:82 __last '_InputIterator'
|-FunctionTemplateDecl 0x7f9a98a83138 <line:721:5, line:730:92> col:9 insert
| |-TemplateTypeParmDecl 0x7f9a98a828b8 <line:721:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7f9a98a830a0 <line:722:9, line:730:92> col:9 insert 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, iterator>::type (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _ForwardIterator, _ForwardIterator)'
|   |-ParmVarDecl 0x7f9a98a82e80 <col:16, col:31> col:31 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   |-ParmVarDecl 0x7f9a98a82ef0 <col:43, col:60> col:60 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7f9a98a82f60 <col:69, col:86> col:86 __last '_ForwardIterator'
|-CXXMethodDecl 0x7f9a98a83440 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:735:62> line:734:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7f9a98a83238 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| |-ParmVarDecl 0x7f9a98a83328 <col:48, col:77> col:77 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7f9a98a834f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a83650 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:738:71> col:40 erase 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator)'
| |-ParmVarDecl 0x7f9a98a83550 <col:46, col:61> col:61 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-AlwaysInlineAttr 0x7f9a98a83700 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a838e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:739:5, col:65> col:14 erase 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::const_iterator)'
| |-ParmVarDecl 0x7f9a98a83758 <col:20, col:35> col:35 __first 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x7f9a98a837c8 <col:44, col:59> col:59 __last 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|-CXXMethodDecl 0x7f9a98a83998 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:748:5> line:742:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7f9a98a83a40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a83b20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:750:5, col:31> col:10 resize 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7f9a98a83a98 <col:17, col:27> col:27 __sz 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f9a98a83ce0 <line:751:5, col:52> col:10 resize 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7f9a98a83be0 <col:17, col:27> col:27 __sz 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f9a98a83c50 <col:33, col:49> col:49 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7f9a98a83eb8 <line:753:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:753:10 swap 'void (class std::__1::vector<int, class std::__1::allocator<int> > &) noexcept'
| `-ParmVarDecl 0x7f9a98a83da8 <col:15, col:21> col:22 'class std::__1::vector<int, class std::__1::allocator<int> > &'
|-CXXMethodDecl 0x7f9a98a83f68 <line:761:5, col:25> col:10 __invariants '_Bool (void) const'
|-AccessSpecDecl 0x7f9a98a84010 <line:772:1, col:8> col:1 private
|-CXXMethodDecl 0x7f9a98a84038 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:773:63> col:36 __invalidate_all_iterators 'void (void)'
| `-AlwaysInlineAttr 0x7f9a98a840e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a84200 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:774:82> col:36 __invalidate_iterators_past 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x7f9a98a84138 <col:64, col:72> col:72 __new_last 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7f9a98a842b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a84390 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:775:5, col:32> col:10 allocate 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7f9a98a84308 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f9a98a84440 <line:776:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:776:10 deallocate 'void (void) noexcept'
|-CXXMethodDecl 0x7f9a98a845c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:777:75> col:41 __recommend 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7f9a98a844f8 <col:53, col:63> col:63 __new_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f9a98a84670 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a84750 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:778:5, col:42> col:10 __construct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7f9a98a846c8 <col:29, col:39> col:39 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f9a98a84910 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:780:63> col:10 __construct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7f9a98a84810 <col:29, col:39> col:39 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f9a98a84880 <col:44, col:60> col:60 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-AlwaysInlineAttr 0x7f9a98a849c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-FunctionTemplateDecl 0x7f9a98a84f48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:781:5, line:787:92> col:9 __construct_at_end
| |-TemplateTypeParmDecl 0x7f9a98a84a10 <line:781:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7f9a98a84eb0 <line:782:9, line:787:92> col:9 __construct_at_end 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value, void>::type (_ForwardIterator, _ForwardIterator, std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
|   |-ParmVarDecl 0x7f9a98a84c90 <col:28, col:45> col:45 __first '_ForwardIterator'
|   |-ParmVarDecl 0x7f9a98a84d00 <col:54, col:71> col:71 __last '_ForwardIterator'
|   `-ParmVarDecl 0x7f9a98a84d70 <col:79, col:89> col:89 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f9a98a850d0 <line:788:5, col:32> col:10 __append 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7f9a98a85048 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f9a98a85290 <line:789:5, col:53> col:10 __append 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7f9a98a85190 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f9a98a85200 <col:34, col:50> col:50 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7f9a98a85468 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:791:20 __make_iter 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x7f9a98a85358 <col:32, col:40> col:40 __p 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7f9a98a85518 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a85678 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:793:20 __make_iter 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_pointer) const noexcept'
| |-ParmVarDecl 0x7f9a98a85570 <col:32, col:46> col:46 __p 'std::__1::vector<int, class std::__1::allocator<int> >::const_pointer':'const int *'
| `-AlwaysInlineAttr 0x7f9a98a85728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a85af0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:794:5, col:85> col:10 __swap_out_circular_buffer 'void (__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &)'
| `-ParmVarDecl 0x7f9a98a859e8 <col:37, col:82> col:82 __v '__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &'
|-CXXMethodDecl 0x7f9a98a85e20 <line:795:5, col:101> col:13 __swap_out_circular_buffer 'std::__1::vector<int, class std::__1::allocator<int> >::pointer (__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &, std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x7f9a98a85c98 <col:40, col:85> col:85 __v '__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &'
| `-ParmVarDecl 0x7f9a98a85d08 <col:90, col:98> col:98 __p 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|-CXXMethodDecl 0x7f9a98a86100 <line:796:5, col:71> col:10 __move_range 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer, std::__1::vector<int, class std::__1::allocator<int> >::pointer, std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x7f9a98a85ee8 <col:23, col:31> col:31 __from_s 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| |-ParmVarDecl 0x7f9a98a85f58 <col:41, col:49> col:49 __from_e 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-ParmVarDecl 0x7f9a98a85fc8 <col:59, col:67> col:67 __to 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|-CXXMethodDecl 0x7f9a98a86350 <line:797:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:797:10 __move_assign 'void (class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::true_type)' noexcept-uninstantiated 0x7f9a97af5a98
| |-ParmVarDecl 0x7f9a98a861d0 <col:24, col:32> col:32 __c 'class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x7f9a98a86230 <col:37> col:46 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
|-CXXMethodDecl 0x7f9a98a865f0 <line:799:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:799:10 __move_assign 'void (class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::false_type)' noexcept-uninstantiated 0x7f9a97af5cd8
| |-ParmVarDecl 0x7f9a98a86470 <col:24, col:32> col:32 __c 'class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x7f9a98a864d0 <col:37> col:47 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
|-CXXMethodDecl 0x7f9a98a867d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:808:5> line:802:10 __destruct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x7f9a98a86710 <col:28, col:36> col:36 __new_last 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7f9a98a86888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9a98a86ae8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:811:5, col:62> col:31 __push_back_slow_path
| |-TemplateTypeParmDecl 0x7f9a98a868d0 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXMethodDecl 0x7f9a98a86a50 <col:26, col:62> col:31 __push_back_slow_path 'void (_Up &&)'
|   `-ParmVarDecl 0x7f9a98a86988 <col:53, col:59> col:59 __x '_Up &&'
|-FunctionTemplateDecl 0x7f9a98a86e38 <line:813:5, line:814:52> col:10 __emplace_back_slow_path
| |-TemplateTypeParmDecl 0x7f9a98a86bc8 <line:813:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x7f9a98a86da0 <line:814:5, col:52> col:10 __emplace_back_slow_path 'void (_Args &&...)'
|   `-ParmVarDecl 0x7f9a98a86cd8 <col:35, col:46> col:46 __args '_Args &&...'
|-CXXMethodDecl 0x7f9a98a870d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:835:62> line:834:10 __annotate_contiguous_container 'void (const void *, const void *, const void *, const void *) const'
| |-ParmVarDecl 0x7f9a98a86f18 <col:42, col:52> col:53 'const void *'
| |-ParmVarDecl 0x7f9a98a86f78 <col:55, col:65> col:66 'const void *'
| |-ParmVarDecl 0x7f9a98a86fd8 <col:68, col:78> col:79 'const void *'
| |-ParmVarDecl 0x7f9a98a87038 <line:835:42, col:52> col:53 'const void *'
| `-AlwaysInlineAttr 0x7f9a98a871a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a87300 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:841:5> line:838:10 __annotate_new 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7f9a98a871f8 <col:25, col:35> col:35 __current_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f9a98a873b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a873f8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:847:5> line:844:10 __annotate_delete 'void (void) const'
| `-AlwaysInlineAttr 0x7f9a98a874a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a87600 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:854:5> line:850:10 __annotate_increase 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7f9a98a874f8 <col:30, col:40> col:40 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f9a98a876b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a87790 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:861:5> line:857:10 __annotate_shrink 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7f9a98a87708 <col:28, col:38> col:38 __old_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f9a98a87840 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXRecordDecl 0x7f9a98a87888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:880:5, col:12> col:12 struct __RAII_IncreaseAnnotator
`-CXXDestructorDecl 0x7f9a98a87970 <line:454:28> col:28 implicit used ~vector 'void (void) noexcept' inline default
  `-CompoundStmt 0x7f9a98a896a8 <col:28>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::vector" = type { %"class.std::__1::__vector_base" }
  NonVirtualBaseLLVMType:%"class.std::__1::vector" = type { %"class.std::__1::__vector_base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__atomic_base<_Bool, false>
         0 |   _Atomic(_Bool) __a_
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::atomic<_Bool>
         0 |   struct std::__1::__atomic_base<_Bool, false> (base)
         0 |     _Atomic(_Bool) __a_
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9a98a8b3b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:890:1, line:993:1> line:891:8 struct __atomic_base definition
|-TemplateArgument type '_Bool'
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7f9a98a8b5f0 prev 0x7f9a98a8b3b8 <col:1, col:8> col:8 implicit struct __atomic_base
|-FieldDecl 0x7f9a98a8b6d0 <line:893:5, col:26> col:26 __a_ '_Atomic(_Bool)' mutable
|-CXXMethodDecl 0x7f9a98a8b718 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:907:5> line:900:10 is_lock_free '_Bool (void) const volatile noexcept'
| `-AlwaysInlineAttr 0x7f9a98a8b7e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a8b830 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:910:82> line:909:10 is_lock_free '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a8b8d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a8baa8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:914:46> line:912:10 store 'void (_Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7f9a98a8b930 <col:16, col:20> col:20 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9a98a8b990 <col:25, col:44> col:38 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7f9a98a8bb60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7f9a98a8cb40 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7f9a98a8baa8 'store' 'void (_Bool, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7f9a98a8cb18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:913:40, line:566:35> '_Bool' '||'
|     |-BinaryOperator 0x7f9a98a8c5d8 <line:913:40, line:565:35> '_Bool' '||'
|     | |-BinaryOperator 0x7f9a98a8c098 <line:913:40, line:564:35> '_Bool' '=='
|     | | |-ImplicitCastExpr 0x7f9a98a8c068 <line:913:40> 'int' <IntegralCast>
|     | | | `-ImplicitCastExpr 0x7f9a98a8c050 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | | |   `-DeclRefExpr 0x7f9a98a8bba8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9a98a8b990 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | | `-ImplicitCastExpr 0x7f9a98a8c080 <line:564:35> 'int' <IntegralCast>
|     | |   `-DeclRefExpr 0x7f9a9716e4d8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9a97164938 'memory_order_consume' 'enum std::__1::memory_order'
|     | `-BinaryOperator 0x7f9a98a8c5b0 <line:913:40, line:565:35> '_Bool' '=='
|     |   |-ImplicitCastExpr 0x7f9a98a8c580 <line:913:40> 'int' <IntegralCast>
|     |   | `-ImplicitCastExpr 0x7f9a98a8c568 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     |   |   `-DeclRefExpr 0x7f9a98a8c0c0 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9a98a8b990 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     |   `-ImplicitCastExpr 0x7f9a98a8c598 <line:565:35> 'int' <IntegralCast>
|     |     `-DeclRefExpr 0x7f9a9716e598 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9a97164980 'memory_order_acquire' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7f9a98a8caf0 <line:913:40, line:566:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7f9a98a8cac0 <line:913:40> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7f9a98a8caa8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7f9a98a8c600 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9a98a8b990 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7f9a98a8cad8 <line:566:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7f9a9716e680 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9a97164a10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7f9a98a8cd38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:918:46> line:916:10 store 'void (_Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7f9a98a8cbc0 <col:16, col:20> col:20 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9a98a8cc20 <col:25, col:44> col:38 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7f9a98a8cdf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7f9a98a8ddd0 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7f9a98a8cd38 'store' 'void (_Bool, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7f9a98a8dda8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:917:40, line:566:35> '_Bool' '||'
|     |-BinaryOperator 0x7f9a98a8d868 <line:917:40, line:565:35> '_Bool' '||'
|     | |-BinaryOperator 0x7f9a98a8d328 <line:917:40, line:564:35> '_Bool' '=='
|     | | |-ImplicitCastExpr 0x7f9a98a8d2f8 <line:917:40> 'int' <IntegralCast>
|     | | | `-ImplicitCastExpr 0x7f9a98a8d2e0 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | | |   `-DeclRefExpr 0x7f9a98a8ce38 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9a98a8cc20 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | | `-ImplicitCastExpr 0x7f9a98a8d310 <line:564:35> 'int' <IntegralCast>
|     | |   `-DeclRefExpr 0x7f9a9716e8e0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9a97164938 'memory_order_consume' 'enum std::__1::memory_order'
|     | `-BinaryOperator 0x7f9a98a8d840 <line:917:40, line:565:35> '_Bool' '=='
|     |   |-ImplicitCastExpr 0x7f9a98a8d810 <line:917:40> 'int' <IntegralCast>
|     |   | `-ImplicitCastExpr 0x7f9a98a8d7f8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     |   |   `-DeclRefExpr 0x7f9a98a8d350 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9a98a8cc20 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     |   `-ImplicitCastExpr 0x7f9a98a8d828 <line:565:35> 'int' <IntegralCast>
|     |     `-DeclRefExpr 0x7f9a9716e9a0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9a97164980 'memory_order_acquire' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7f9a98a8dd80 <line:917:40, line:566:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7f9a98a8dd50 <line:917:40> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7f9a98a8dd38 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7f9a98a8d890 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9a98a8cc20 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7f9a98a8dd68 <line:566:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7f9a9716ea88 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9a97164a10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7f9a98a8df48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:922:47> line:920:9 load '_Bool (std::__1::memory_order) const volatile noexcept'
| |-ParmVarDecl 0x7f9a98a8de40 <col:14, col:33> col:27 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7f9a98a8dff8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7f9a98a8ea98 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7f9a98a8df48 'load' '_Bool (std::__1::memory_order) const volatile noexcept'
|   `-BinaryOperator 0x7f9a98a8ea70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:921:39, line:571:35> '_Bool' '||'
|     |-BinaryOperator 0x7f9a98a8e530 <line:921:39, line:570:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7f9a98a8e500 <line:921:39> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7f9a98a8e4e8 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7f9a98a8e040 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9a98a8de40 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7f9a98a8e518 <line:570:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7f9a9716ec70 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9a971649c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7f9a98a8ea48 <line:921:39, line:571:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7f9a98a8ea18 <line:921:39> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7f9a98a8ea00 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7f9a98a8e558 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9a98a8de40 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7f9a98a8ea30 <line:571:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7f9a9716ed30 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9a97164a10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7f9a98a8ec18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:926:47> line:924:9 load '_Bool (std::__1::memory_order) const noexcept'
| |-ParmVarDecl 0x7f9a98a8eb08 <col:14, col:33> col:27 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7f9a98a8ecc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7f9a98a8f768 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7f9a98a8ec18 'load' '_Bool (std::__1::memory_order) const noexcept'
|   `-BinaryOperator 0x7f9a98a8f740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:925:39, line:571:35> '_Bool' '||'
|     |-BinaryOperator 0x7f9a98a8f200 <line:925:39, line:570:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7f9a98a8f1d0 <line:925:39> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7f9a98a8f1b8 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7f9a98a8ed10 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9a98a8eb08 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7f9a98a8f1e8 <line:570:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7f9a9716ef18 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9a971649c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7f9a98a8f718 <line:925:39, line:571:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7f9a98a8f6e8 <line:925:39> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7f9a98a8f6d0 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7f9a98a8f228 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9a98a8eb08 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7f9a98a8f700 <line:571:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7f9a9716efd8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9a97164a10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXConversionDecl 0x7f9a98a8f848 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:928:60> col:5 operator bool '_Bool (void) const volatile noexcept'
| `-AlwaysInlineAttr 0x7f9a98a8f8f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConversionDecl 0x7f9a98a8f9a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:930:60> col:5 operator bool '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a98a8fa50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a8fc38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:933:56> line:932:9 exchange '_Bool (_Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7f9a98a8fab8 <col:18, col:22> col:22 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9a98a8fb18 <col:27, col:46> col:40 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7f9a98a8fcf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a8fec8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:936:56> line:935:9 exchange '_Bool (_Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7f9a98a8fd48 <col:18, col:22> col:22 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9a98a8fda8 <col:27, col:46> col:40 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7f9a98a8ff80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a90288 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:941:80> line:938:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7f9a98a90008 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7f9a98a90078 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9a98a900d8 <line:939:32, col:45> col:45 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7f9a98a90138 <col:50, col:63> col:63 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7f9a98a90350 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7f9a98a90df0 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7f9a98a90288 'compare_exchange_weak' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7f9a98a90dc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:940:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7f9a98a90888 <line:940:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7f9a98a90858 <line:940:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7f9a98a90840 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7f9a98a90398 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9a98a90138 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7f9a98a90870 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7f9a971761c0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9a971649c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7f9a98a90da0 <line:940:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7f9a98a90d70 <line:940:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7f9a98a90d58 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7f9a98a908b0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9a98a90138 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7f9a98a90d88 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7f9a97176280 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9a97164a10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7f9a98a910e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:946:80> line:943:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7f9a98a90e70 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7f9a98a90ee0 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9a98a90f40 <line:944:32, col:45> col:45 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7f9a98a90fa0 <col:50, col:63> col:63 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7f9a98a911b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7f9a98a91c50 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7f9a98a910e8 'compare_exchange_weak' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7f9a98a91c28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:945:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7f9a98a916e8 <line:945:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7f9a98a916b8 <line:945:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7f9a98a916a0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7f9a98a911f8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9a98a90fa0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7f9a98a916d0 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7f9a97176468 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9a971649c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7f9a98a91c00 <line:945:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7f9a98a91bd0 <line:945:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7f9a98a91bb8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7f9a98a91710 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9a98a90fa0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7f9a98a91be8 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7f9a97176528 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9a97164a10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7f9a98a91ea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:951:82> line:948:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7f9a98a91cd0 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7f9a98a91d40 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9a98a91da0 <line:949:34, col:47> col:47 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7f9a98a91e00 <col:52, col:65> col:65 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7f9a98a91f70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7f9a98a92a10 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7f9a98a91ea8 'compare_exchange_strong' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7f9a98a929e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:950:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7f9a98a924a8 <line:950:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7f9a98a92478 <line:950:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7f9a98a92460 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7f9a98a91fb8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9a98a91e00 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7f9a98a92490 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7f9a97176710 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9a971649c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7f9a98a929c0 <line:950:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7f9a98a92990 <line:950:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7f9a98a92978 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7f9a98a924d0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9a98a91e00 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7f9a98a929a8 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7f9a971767d0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9a97164a10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7f9a98a92c68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:956:82> line:953:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7f9a98a92a90 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7f9a98a92b00 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9a98a92b60 <line:954:34, col:47> col:47 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7f9a98a92bc0 <col:52, col:65> col:65 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7f9a98a92d30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7f9a98a937d0 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7f9a98a92c68 'compare_exchange_strong' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7f9a98a937a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:955:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7f9a98a93268 <line:955:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7f9a98a93238 <line:955:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7f9a98a93220 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7f9a98a92d78 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9a98a92bc0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7f9a98a93250 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7f9a971769b8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9a971649c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7f9a98a93780 <line:955:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7f9a98a93750 <line:955:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7f9a98a93738 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7f9a98a93290 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9a98a92bc0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7f9a98a93768 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7f9a97176a78 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9a97164a10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7f9a98a93a58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:960:80> line:958:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7f9a98a93850 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7f9a98a938c0 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9a98a93920 <line:959:31, col:50> col:44 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7f9a98a93b18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a93d78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:964:80> line:962:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7f9a98a93b70 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7f9a98a93be0 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9a98a93c40 <line:963:32, col:51> col:45 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7f9a98a93e38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a94000 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:968:82> line:966:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7f9a98a93e90 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7f9a98a93f00 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9a98a93f60 <line:967:31, col:50> col:44 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7f9a98a940c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a94288 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:972:82> line:970:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7f9a98a94118 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7f9a98a94188 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9a98a941e8 <line:971:34, col:53> col:47 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7f9a98a94348 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9a98a943d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:976:39> col:5 __atomic_base 'void (void) noexcept' default trivial
| `-AlwaysInlineAttr 0x7f9a98a94488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9a98a945c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:982:69> col:23 used constexpr __atomic_base 'void (_Bool) noexcept'
| |-ParmVarDecl 0x7f9a98a944e0 <col:37, col:41> col:41 used __d '_Bool':'_Bool'
| |-CXXCtorInitializer Field 0x7f9a98a8b6d0 '__a_' '_Atomic(_Bool)'
| | `-ImplicitCastExpr 0x7f9a98a960e8 <col:63> '_Atomic(_Bool)' <NonAtomicToAtomic>
| |   `-ImplicitCastExpr 0x7f9a98a960d0 <col:63> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7f9a98a96078 <col:63> '_Bool':'_Bool' lvalue ParmVar 0x7f9a98a944e0 '__d' '_Bool':'_Bool'
| |-CompoundStmt 0x7f9a9716ffd8 <col:68, col:69>
| `-AlwaysInlineAttr 0x7f9a98a94688 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9a98a947f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:984:5, col:48> col:5 __atomic_base 'void (const struct std::__1::__atomic_base<_Bool, false> &)' delete trivial
| `-ParmVarDecl 0x7f9a98a94708 <col:19, col:38> col:39 'const struct std::__1::__atomic_base<_Bool, false> &'
|-CXXMethodDecl 0x7f9a98a949b0 <line:985:5, col:59> col:20 operator= 'struct std::__1::__atomic_base<_Bool, false> &(const struct std::__1::__atomic_base<_Bool, false> &)' delete trivial
| `-ParmVarDecl 0x7f9a98a948e8 <col:30, col:49> col:50 'const struct std::__1::__atomic_base<_Bool, false> &'
|-CXXMethodDecl 0x7f9a98a94b30 <line:986:5, col:68> col:20 operator= 'struct std::__1::__atomic_base<_Bool, false> &(const struct std::__1::__atomic_base<_Bool, false> &) volatile' delete trivial
| `-ParmVarDecl 0x7f9a98a94a70 <col:30, col:49> col:50 'const struct std::__1::__atomic_base<_Bool, false> &'
`-CXXDestructorDecl 0x7f9a98a95ef8 <line:891:8> col:8 implicit ~__atomic_base 'void (void)' inline default trivial noexcept-unevaluated 0x7f9a98a95ef8

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__atomic_base" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__atomic_base" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9a971886a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1083:1, line:1099:1> line:1084:8 struct atomic definition
|-public '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>'
|-TemplateArgument type '_Bool'
|-CXXRecordDecl 0x7f9a98a94c68 prev 0x7f9a971886a8 <col:1, col:8> col:8 implicit struct atomic
|-TypedefDecl 0x7f9a98a95008 <line:1087:5, col:32> col:32 __base '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>'
| `-TemplateSpecializationType 0x7f9a98a94f90 '__atomic_base<_Bool>' sugar __atomic_base
|   |-TemplateArgument type '_Bool':'_Bool'
|   `-RecordType 0x7f9a98a8b4c0 'struct std::__1::__atomic_base<_Bool, false>'
|     `-ClassTemplateSpecialization 0x7f9a98a8b3b8 '__atomic_base'
|-CXXConstructorDecl 0x7f9a98a950a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:818:33> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1089:5 atomic 'void (void)' default trivial noexcept-unevaluated 0x7f9a98a950a0
| `-AlwaysInlineAttr 0x7f9a98a95188 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9a98a952c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1091:64> col:23 used constexpr atomic 'void (_Bool) noexcept'
| |-ParmVarDecl 0x7f9a98a951e0 <col:30, col:34> col:34 used __d '_Bool':'_Bool'
| |-CXXCtorInitializer 'std::__1::atomic<_Bool>::__base':'struct std::__1::__atomic_base<_Bool, false>'
| | `-CXXConstructExpr 0x7f9a98a96130 <col:51, col:61> '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>' 'void (_Bool) noexcept'
| |   `-ImplicitCastExpr 0x7f9a98a96060 <col:58> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7f9a98a95fd8 <col:58> '_Bool':'_Bool' lvalue ParmVar 0x7f9a98a951e0 '__d' '_Bool':'_Bool'
| |-CompoundStmt 0x7f9a970d9700 <col:63, col:64>
| `-AlwaysInlineAttr 0x7f9a98a95388 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a954e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1095:41> line:1094:9 operator= '_Bool (_Bool) volatile noexcept'
| |-ParmVarDecl 0x7f9a98a953e0 <col:19, col:23> col:23 __d '_Bool':'_Bool'
| `-AlwaysInlineAttr 0x7f9a98a95598 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a98a956f8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1098:41> line:1097:9 operator= '_Bool (_Bool) noexcept'
| |-ParmVarDecl 0x7f9a98a955f0 <col:19, col:23> col:23 __d '_Bool':'_Bool'
| `-AlwaysInlineAttr 0x7f9a98a957a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9a98a95818 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1084:8> col:8 implicit atomic 'void (const struct std::__1::atomic<_Bool> &)' inline default_delete trivial noexcept-unevaluated 0x7f9a98a95818
| `-ParmVarDecl 0x7f9a98a95940 <col:8> col:8 'const struct std::__1::atomic<_Bool> &'
|-CXXConstructorDecl 0x7f9a98a959d8 <col:8> col:8 implicit atomic 'void (struct std::__1::atomic<_Bool> &&)' inline default_delete trivial noexcept-unevaluated 0x7f9a98a959d8
| `-ParmVarDecl 0x7f9a98a95b00 <col:8> col:8 'struct std::__1::atomic<_Bool> &&'
|-CXXMethodDecl 0x7f9a98a95b98 <col:8, <invalid sloc>> col:8 implicit operator= 'struct std::__1::atomic<_Bool> &(const struct std::__1::atomic<_Bool> &)' inline default_delete trivial noexcept-unevaluated 0x7f9a98a95b98
| `-ParmVarDecl 0x7f9a98a95cb0 <col:8> col:8 'const struct std::__1::atomic<_Bool> &'
`-CXXMethodDecl 0x7f9a98a95d18 <col:8, <invalid sloc>> col:8 implicit operator= 'struct std::__1::atomic<_Bool> &(struct std::__1::atomic<_Bool> &&)' inline default_delete trivial noexcept-unevaluated 0x7f9a98a95d18
  `-ParmVarDecl 0x7f9a98a95e30 <col:8> col:8 'struct std::__1::atomic<_Bool> &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::atomic" = type { %"struct.std::__1::__atomic_base" }
  NonVirtualBaseLLVMType:%"struct.std::__1::atomic" = type { %"struct.std::__1::__atomic_base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::thread
         0 |   std::__1::__libcpp_thread_t __t_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_t
         0 |   long __sig
         8 |   struct __darwin_pthread_handler_rec * __cleanup_stack
        16 |   char [8176] __opaque
           | [sizeof=8192, dsize=8192, align=8,
           |  nvsize=8192, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __darwin_pthread_handler_rec
         0 |   void (*)(void *) __routine
         8 |   void * __arg
        16 |   struct __darwin_pthread_handler_rec * __next
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9a97019160 </usr/include/sys/_pthread/_pthread_types.h:57:1, line:61:1> line:57:8 struct __darwin_pthread_handler_rec definition
|-CXXRecordDecl 0x7f9a97019288 <col:1, col:8> col:8 implicit struct __darwin_pthread_handler_rec
|-FieldDecl 0x7f9a970194d0 <line:58:2, col:26> col:9 __routine 'void (*)(void *)'
|-FieldDecl 0x7f9a97019530 <line:59:2, col:8> col:8 __arg 'void *'
`-FieldDecl 0x7f9a97019600 <line:60:2, col:39> col:39 __next 'struct __darwin_pthread_handler_rec *'

Layout: <CGRecordLayout
  LLVMType:%struct.__darwin_pthread_handler_rec = type { void (i8*)*, i8*, %struct.__darwin_pthread_handler_rec* }
  NonVirtualBaseLLVMType:%struct.__darwin_pthread_handler_rec = type { void (i8*)*, i8*, %struct.__darwin_pthread_handler_rec* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9a9701ea60 </usr/include/sys/_pthread/_pthread_types.h:103:1, line:107:1> line:103:8 struct _opaque_pthread_t definition
|-CXXRecordDecl 0x7f9a9701eb88 <col:1, col:8> col:8 implicit struct _opaque_pthread_t
|-FieldDecl 0x7f9a9701ec38 <line:104:2, col:7> col:7 __sig 'long'
|-FieldDecl 0x7f9a9701eca8 <line:105:2, col:40> col:40 __cleanup_stack 'struct __darwin_pthread_handler_rec *'
`-FieldDecl 0x7f9a9701ed68 <line:106:2, col:32> col:7 __opaque 'char [8176]'

Layout: <CGRecordLayout
  LLVMType:%struct._opaque_pthread_t = type { i64, %struct.__darwin_pthread_handler_rec*, [8176 x i8] }
  NonVirtualBaseLLVMType:%struct._opaque_pthread_t = type { i64, %struct.__darwin_pthread_handler_rec*, [8176 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9a969f6178 prev 0x7f9a969ee710 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:285:1, line:333:1> line:285:24 referenced class thread definition
|-VisibilityAttr 0x7f9a969f6278 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7f9a969f62c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:285:1, col:24> col:24 implicit referenced class thread
|-FieldDecl 0x7f9a969f6368 <line:287:5, col:23> col:23 referenced __t_ 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
|-CXXConstructorDecl 0x7f9a969f6500 <line:289:5, col:25> col:5 thread 'void (const class std::__1::thread &)'
| `-ParmVarDecl 0x7f9a969f63e8 <col:12, col:24> col:25 'const class std::__1::thread &'
|-CXXMethodDecl 0x7f9a969f66b0 <line:290:5, col:36> col:13 operator= 'class std::__1::thread &(const class std::__1::thread &)'
| `-ParmVarDecl 0x7f9a969f65c0 <col:23, col:35> col:36 'const class std::__1::thread &'
|-AccessSpecDecl 0x7f9a969f6750 <line:291:1, col:7> col:1 public
|-TypedefDecl 0x7f9a969f6788 <line:292:5, col:25> col:25 referenced id 'class std::__1::__thread_id'
| `-RecordType 0x7f9a969ec350 'class std::__1::__thread_id'
|   `-CXXRecord 0x7f9a969ec7e8 '__thread_id'
|-TypedefDecl 0x7f9a969f67f0 <line:293:5, col:31> col:31 referenced native_handle_type 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| `-TypedefType 0x7f9a97493910 'std::__1::__libcpp_thread_t' sugar
|   |-Typedef 0x7f9a974911e0 '__libcpp_thread_t'
|   `-TypedefType 0x7f9a97458890 'pthread_t' sugar
|     |-Typedef 0x7f9a97456ed0 'pthread_t'
|     `-TypedefType 0x7f9a97456ea0 '__darwin_pthread_t' sugar
|       |-Typedef 0x7f9a97020480 '__darwin_pthread_t'
|       `-PointerType 0x7f9a97020430 'struct _opaque_pthread_t *'
|         `-ElaboratedType 0x7f9a9701f3c0 'struct _opaque_pthread_t' sugar
|           `-RecordType 0x7f9a9701eb00 'struct _opaque_pthread_t'
|             `-CXXRecord 0x7f9a9701ea60 '_opaque_pthread_t'
|-CXXConstructorDecl 0x7f9a969f68a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:296:53> col:5 thread 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7f9a969f6368 '__t_' 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| | `-ImplicitCastExpr 0x7f9a969f8328 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__threading_support:73:29> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <NullToPointer>
| |   `-IntegerLiteral 0x7f9a969f82d8 <col:29> 'unsigned int' 0
| |-CompoundStmt 0x7f9a969f8370 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:296:52, col:53>
| |-AlwaysInlineAttr 0x7f9a969f6948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9a969f6990 <col:51, col:74> Hidden
|-FunctionTemplateDecl 0x7f9a969f72b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:298:5, line:305:53> col:18 thread
| |-TemplateTypeParmDecl 0x7f9a969f69a0 <line:298:15, col:21> col:21 referenced class depth 0 index 0 _Fp
| |-TemplateTypeParmDecl 0x7f9a969f6a08 <col:26, col:35> col:35 referenced class depth 0 index 1 ... _Args
| |-TemplateTypeParmDecl 0x7f9a969f6f20 <line:299:15, line:302:18> line:299:15 class depth 0 index 2
| | `-TemplateArgument type 'typename enable_if<!is_same<typename decay<_Fp>::type, class thread>::value>::type'
| |-CXXConstructorDecl 0x7f9a969f7210 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:305:53> col:18 thread 'void (_Fp &&, _Args &&...)' inline
| | |-ParmVarDecl 0x7f9a969f7018 <col:25, col:31> col:31 __f '_Fp &&'
| | |-ParmVarDecl 0x7f9a969f70f8 <col:36, col:47> col:47 __args '_Args &&...'
| | `-VisibilityAttr 0x7f9a969f7318 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:644:40, col:63> Hidden
| `-CXXConstructorDecl 0x7f9a98aa1e20 parent 0x7f9a969f6178 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:359:1, line:373:1> line:359:9 used thread 'void (void (&&)(void))'
|   |-TemplateArgument type 'void (&)(void)'
|   |-TemplateArgument pack
|   |-TemplateArgument type 'void'
|   `-ParmVarDecl 0x7f9a98aa1d18 <col:16, col:19> col:22 __f 'void (&&)(void)'
|-CXXDestructorDecl 0x7f9a969f73b0 <line:311:5, col:13> col:5 used ~thread 'void (void) noexcept'
|-CXXConstructorDecl 0x7f9a969f75c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:315:85> col:5 thread 'void (class std::__1::thread &&) noexcept'
| |-ParmVarDecl 0x7f9a969f74b8 <col:12, col:21> col:21 used __t 'class std::__1::thread &&'
| |-CXXCtorInitializer Field 0x7f9a969f6368 '__t_' 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| | `-ImplicitCastExpr 0x7f9a969f8418 <col:43, col:47> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <LValueToRValue>
| |   `-MemberExpr 0x7f9a969f83b0 <col:43, col:47> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue .__t_ 0x7f9a969f6368
| |     `-DeclRefExpr 0x7f9a969f8388 <col:43> 'class std::__1::thread' lvalue ParmVar 0x7f9a969f74b8 '__t' 'class std::__1::thread &&'
| |-CompoundStmt 0x7f9a969f8520 <col:53, col:85>
| | `-BinaryOperator 0x7f9a969f84f8 <col:54, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__threading_support:73:29> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue '='
| |   |-MemberExpr 0x7f9a969f8488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:315:54, col:58> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue .__t_ 0x7f9a969f6368
| |   | `-DeclRefExpr 0x7f9a969f8460 <col:54> 'class std::__1::thread' lvalue ParmVar 0x7f9a969f74b8 '__t' 'class std::__1::thread &&'
| |   `-ImplicitCastExpr 0x7f9a969f84e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__threading_support:73:29> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <NullToPointer>
| |     `-IntegerLiteral 0x7f9a969f84c0 <col:29> 'unsigned int' 0
| |-AlwaysInlineAttr 0x7f9a969f7678 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9a969f76c0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9a969f7818 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:317:13 operator= 'class std::__1::thread &(class std::__1::thread &&) noexcept'
| |-ParmVarDecl 0x7f9a969f7710 <col:23, col:32> col:32 __t 'class std::__1::thread &&'
| |-AlwaysInlineAttr 0x7f9a969f78b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9a969f7900 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9a969f7a58 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:67> col:10 used swap 'void (class std::__1::thread &) noexcept'
| |-ParmVarDecl 0x7f9a969f7950 <col:15, col:23> col:23 used __t 'class std::__1::thread &'
| |-CompoundStmt 0x7f9a96a071e8 <col:38, col:67>
| | `-CallExpr 0x7f9a96a071b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:65> 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type':'void'
| |   |-ImplicitCastExpr 0x7f9a96a07198 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:46> 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type (*)(struct _opaque_pthread_t *&, struct _opaque_pthread_t *&) noexcept(is_nothrow_move_constructible<struct _opaque_pthread_t *>::value && is_nothrow_move_assignable<struct _opaque_pthread_t *>::value)' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7f9a96a070f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:46> 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type (struct _opaque_pthread_t *&, struct _opaque_pthread_t *&) noexcept(is_nothrow_move_constructible<struct _opaque_pthread_t *>::value && is_nothrow_move_assignable<struct _opaque_pthread_t *>::value)' lvalue Function 0x7f9a96a03930 'swap' 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type (struct _opaque_pthread_t *&, struct _opaque_pthread_t *&) noexcept(is_nothrow_move_constructible<struct _opaque_pthread_t *>::value && is_nothrow_move_assignable<struct _opaque_pthread_t *>::value)' (FunctionTemplate 0x7f9a971536b8 'swap')
| |   |-MemberExpr 0x7f9a969f8660 <col:51> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue ->__t_ 0x7f9a969f6368
| |   | `-CXXThisExpr 0x7f9a969f8648 <col:51> 'class std::__1::thread *' this
| |   `-MemberExpr 0x7f9a969f86c0 <col:57, col:61> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue .__t_ 0x7f9a969f6368
| |     `-DeclRefExpr 0x7f9a969f8698 <col:57> 'class std::__1::thread' lvalue ParmVar 0x7f9a969f7950 '__t' 'class std::__1::thread &'
| |-AlwaysInlineAttr 0x7f9a969f7af8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9a969f7b40 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9a969f7bd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:324:76> col:10 joinable '_Bool (void) const noexcept'
| |-CompoundStmt 0x7f9a96a073d8 <col:37, col:76>
| | `-ReturnStmt 0x7f9a96a073c0 <col:38, col:74>
| |   `-UnaryOperator 0x7f9a96a073a0 <col:45, col:74> '_Bool' prefix '!'
| |     `-CallExpr 0x7f9a96a07370 <col:46, col:74> '_Bool'
| |       |-ImplicitCastExpr 0x7f9a96a07358 <col:46> '_Bool (*)(const std::__1::__libcpp_thread_t *)' <FunctionToPointerDecay>
| |       | `-DeclRefExpr 0x7f9a96a072d0 <col:46> '_Bool (const std::__1::__libcpp_thread_t *)' lvalue Function 0x7f9a9749b020 '__libcpp_thread_isnull' '_Bool (const std::__1::__libcpp_thread_t *)'
| |       `-UnaryOperator 0x7f9a96a072b0 <col:69, col:70> 'const std::__1::__libcpp_thread_t *' prefix '&'
| |         `-MemberExpr 0x7f9a96a07278 <col:70> 'const std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *const' lvalue ->__t_ 0x7f9a969f6368
| |           `-CXXThisExpr 0x7f9a96a07260 <col:70> 'const class std::__1::thread *' this
| |-AlwaysInlineAttr 0x7f9a969f7c68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9a969f7cb0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9a969f7ce0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:325:5, col:15> col:10 used join 'void (void)'
|-CXXMethodDecl 0x7f9a969f7d98 <line:326:5, col:17> col:10 detach 'void (void)'
|-CXXMethodDecl 0x7f9a969f7f08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:328:71> col:8 get_id 'std::__1::thread::id (void) const noexcept'
| |-CompoundStmt 0x7f9a96a07660 <col:33, col:71>
| | `-ReturnStmt 0x7f9a96a07648 <col:34, col:69>
| |   `-ExprWithCleanups 0x7f9a96a07630 <col:34, col:69> 'std::__1::thread::id':'class std::__1::__thread_id'
| |     `-CXXConstructExpr 0x7f9a96a075f8 <col:34, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' 'void (class std::__1::__thread_id &&) noexcept' elidable
| |       `-MaterializeTemporaryExpr 0x7f9a96a075e0 <col:41, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' xvalue
| |         `-ImplicitCastExpr 0x7f9a96a075c8 <col:41, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' <ConstructorConversion>
| |           `-CXXConstructExpr 0x7f9a96a07590 <col:41, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' 'void (std::__1::__libcpp_thread_id)'
| |             `-CallExpr 0x7f9a96a07560 <col:41, col:69> 'std::__1::__libcpp_thread_id':'struct _opaque_pthread_t *'
| |               |-ImplicitCastExpr 0x7f9a96a07548 <col:41> 'std::__1::__libcpp_thread_id (*)(const std::__1::__libcpp_thread_t *)' <FunctionToPointerDecay>
| |               | `-DeclRefExpr 0x7f9a96a074c0 <col:41> 'std::__1::__libcpp_thread_id (const std::__1::__libcpp_thread_t *)' lvalue Function 0x7f9a9749bad8 '__libcpp_thread_get_id' 'std::__1::__libcpp_thread_id (const std::__1::__libcpp_thread_t *)'
| |               `-UnaryOperator 0x7f9a96a074a0 <col:64, col:65> 'const std::__1::__libcpp_thread_t *' prefix '&'
| |                 `-MemberExpr 0x7f9a96a07468 <col:65> 'const std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *const' lvalue ->__t_ 0x7f9a969f6368
| |                   `-CXXThisExpr 0x7f9a96a07450 <col:65> 'const class std::__1::thread *' this
| |-AlwaysInlineAttr 0x7f9a969f7fa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9a969f7fe8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9a969f80a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:330:63> col:24 native_handle 'std::__1::thread::native_handle_type (void) noexcept'
| |-CompoundStmt 0x7f9a96a07700 <col:50, col:63>
| | `-ReturnStmt 0x7f9a96a076e8 <col:51, col:58>
| |   `-ImplicitCastExpr 0x7f9a96a076d0 <col:58> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <LValueToRValue>
| |     `-MemberExpr 0x7f9a96a07698 <col:58> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue ->__t_ 0x7f9a969f6368
| |       `-CXXThisExpr 0x7f9a96a07680 <col:58> 'class std::__1::thread *' this
| |-AlwaysInlineAttr 0x7f9a969f8140 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9a969f8188 <col:51, col:74> Hidden
`-CXXMethodDecl 0x7f9a969f8200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:332:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:332:21 hardware_concurrency 'unsigned int (void) noexcept' static

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::thread" = type { %struct._opaque_pthread_t* }
  NonVirtualBaseLLVMType:%"class.std::__1::thread" = type { %struct._opaque_pthread_t* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1225:9)
         0 |   struct std::__1::_PairT __t
         0 |     size_t first
         8 |     size_t second
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__murmur2_or_cityhash<unsigned long, 64> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1190:9)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1208:9)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1303:9)
         0 |   struct _opaque_pthread_t * __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |       union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __l
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __s
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw __r
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__rep
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __l
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |     struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __s
         0 |       union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw __r
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__split_buffer_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>
         0 |   class std::__1::allocator<int> & __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>
         0 |   struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
         0 |     int * __value_
         8 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> (base)
         8 |     class std::__1::allocator<int> & __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__split_buffer<int, class std::__1::allocator<int> &>
         0 |   class std::__1::__split_buffer_common<true> (base) (empty)
         0 |   std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer __first_
         8 |   std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer __begin_
        16 |   std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer __end_
        24 |   class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> __end_cap_
        24 |     struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
        24 |       int * __value_
        32 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> (base)
        32 |       class std::__1::allocator<int> & __value_
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false>
         0 |   class std::__1::__thread_struct * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::default_delete<class std::__1::__thread_struct> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (empty)
         0 |   struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> >
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |     class std::__1::__thread_struct * __value_
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |     struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >
         0 |   class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |       class std::__1::__thread_struct * __value_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |       struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__tuple_leaf<0, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, false>
         0 |   class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> > __value_
         0 |     class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |       struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |         class std::__1::__thread_struct * __value_
         0 |       struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |         struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__tuple_leaf<1, void (*)(void), false>
         0 |   void (*)(void) __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__tuple_impl<struct std::__1::__tuple_indices<0, 1>, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)>
         0 |   class std::__1::__tuple_leaf<0, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, false> (base)
         0 |     class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> > __value_
         0 |       class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |         struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |           class std::__1::__thread_struct * __value_
         0 |         struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |           struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
         8 |   class std::__1::__tuple_leaf<1, void (*)(void), false> (base)
         8 |     void (*)(void) __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)>
         0 |   struct std::__1::__tuple_impl<struct std::__1::__tuple_indices<0, 1>, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> __base_
         0 |     class std::__1::__tuple_leaf<0, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, false> (base)
         0 |       class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> > __value_
         0 |         class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |           struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |             class std::__1::__thread_struct * __value_
         0 |           struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |             struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
         8 |     class std::__1::__tuple_leaf<1, void (*)(void), false> (base)
         8 |       void (*)(void) __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> >, 1, true> (empty)
         0 |   struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> *, 0, false>
         0 |   class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> *, struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > >
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> *, 0, false> (base)
         0 |     class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> * __value_
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> >, 1, true> (base) (empty)
         0 |     struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::integral_constant<_Bool, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9a97038608 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:503:1, line:515:1> line:504:29 struct integral_constant definition
|-TemplateArgument type '_Bool'
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7f9a9703b7d8 prev 0x7f9a97038608 <col:1, col:29> col:29 implicit struct integral_constant
|-VarDecl 0x7f9a9703b880 <line:506:5, col:53> col:45 used value 'const _Bool':'const _Bool' static constexpr cinit
| `-SubstNonTypeTemplateParmExpr 0x7f9a9703b908 <col:53> '_Bool'
|   `-CXXBoolLiteralExpr 0x7f9a9703b8f0 <col:53> '_Bool' true
|-TypedefDecl 0x7f9a9703b998 <line:507:5, col:31> col:31 value_type '_Bool':'_Bool'
| `-SubstTemplateTypeParmType 0x7f9a970385d0 '_Bool' sugar
|   |-TemplateTypeParmType 0x7f9a97037600 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9a970375c0 '_Tp'
|   `-BuiltinType 0x7f9a96833b40 '_Bool'
|-TypedefDecl 0x7f9a9703ba00 <line:508:5, col:31> col:31 referenced type 'struct std::__1::integral_constant<_Bool, true>'
| `-RecordType 0x7f9a97038710 'struct std::__1::integral_constant<_Bool, true>'
|   `-ClassTemplateSpecialization 0x7f9a97038608 'integral_constant'
|-CXXConversionDecl 0x7f9a9703bae8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:510:79> col:27 constexpr operator bool 'std::__1::integral_constant<_Bool, true>::value_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a9703bbb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a9703bc30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:513:75> col:31 constexpr operator() 'std::__1::integral_constant<_Bool, true>::value_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a9703bcd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9a9734a490 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:504:29> col:29 implicit referenced constexpr integral_constant 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f9a9734a5a8 <col:29> col:29 implicit constexpr integral_constant 'void (const struct std::__1::integral_constant<_Bool, true> &)' inline default trivial noexcept-unevaluated 0x7f9a9734a5a8
| `-ParmVarDecl 0x7f9a9734a6d0 <col:29> col:29 'const struct std::__1::integral_constant<_Bool, true> &'
|-CXXConstructorDecl 0x7f9a9734a768 <col:29> col:29 implicit used constexpr integral_constant 'void (struct std::__1::integral_constant<_Bool, true> &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7f9a9734a890 <col:29> col:29 'struct std::__1::integral_constant<_Bool, true> &&'
| `-CompoundStmt 0x7f9a96b7cf58 <col:29>
`-CXXDestructorDecl 0x7f9a9734a980 <col:29> col:29 implicit referenced ~integral_constant 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::integral_constant" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::integral_constant" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> (empty)
         0 |   struct std::__1::integral_constant<_Bool, true> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9a998a1f88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1366:1, line:1374:1> line:1367:8 struct __has_destroy definition
|-public 'integral_constant<_Bool, is_same<decltype(__has_destroy_test(declval<class allocator<int> >(), declval<int *>())), true_type>::value>':'struct std::__1::integral_constant<_Bool, true>'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-TemplateArgument type 'int *'
|-CXXRecordDecl 0x7f9a998a4e78 prev 0x7f9a998a1f88 <col:1, col:8> col:8 implicit struct __has_destroy
|-CXXConstructorDecl 0x7f9a998a4f50 <col:8> col:8 implicit referenced constexpr __has_destroy 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f9a998a5068 <col:8> col:8 implicit constexpr __has_destroy 'void (const struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &)' inline default trivial noexcept-unevaluated 0x7f9a998a5068
| `-ParmVarDecl 0x7f9a998a5190 <col:8> col:8 'const struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &'
|-CXXConstructorDecl 0x7f9a998a5228 <col:8> col:8 implicit constexpr __has_destroy 'void (struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &&)' inline default trivial noexcept-unevaluated 0x7f9a998a5228
| `-ParmVarDecl 0x7f9a998a5350 <col:8> col:8 'struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &&'
`-CXXDestructorDecl 0x7f9a998a53f0 <col:8> col:8 implicit referenced ~__has_destroy 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__has_destroy" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__has_destroy" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9a98a87888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:880:5, line:884:5> line:880:12 struct __RAII_IncreaseAnnotator definition
|-CXXRecordDecl 0x7f9a998a72f0 prev 0x7f9a98a87888 <col:5, col:12> col:12 implicit struct __RAII_IncreaseAnnotator
|-CXXConstructorDecl 0x7f9a998a7560 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:882:64> col:7 used __RAII_IncreaseAnnotator 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| |-ParmVarDecl 0x7f9a998a7398 <col:32, col:45> col:46 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7f9a998a7408 <col:48, col:60> col:58 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7f9a998a7b40 <col:60> 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7f9a97af80b8 <col:60> 'int' 1
| |-CompoundStmt 0x7f9a97afc928 <col:63, col:64>
| `-AlwaysInlineAttr 0x7f9a998a7658 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998a76a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:883:48> col:38 used __done 'void (void)'
| |-CompoundStmt 0x7f9a97afc940 <col:47, col:48>
| `-AlwaysInlineAttr 0x7f9a998a7748 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9a998a77d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:880:12> col:12 implicit constexpr __RAII_IncreaseAnnotator 'void (const struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &)' inline default trivial noexcept-unevaluated 0x7f9a998a77d8
| `-ParmVarDecl 0x7f9a998a7900 <col:12> col:12 'const struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &'
`-CXXConstructorDecl 0x7f9a998a7998 <col:12> col:12 implicit constexpr __RAII_IncreaseAnnotator 'void (struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &&)' inline default trivial noexcept-unevaluated 0x7f9a998a7998
  `-ParmVarDecl 0x7f9a998a7ac0 <col:12> col:12 'struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::vector<int, std::__1::allocator<int> >::__RAII_IncreaseAnnotator" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::vector<int, std::__1::allocator<int> >::__RAII_IncreaseAnnotator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> (empty)
         0 |   struct std::__1::integral_constant<_Bool, true> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9a998a9e00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1345:1, line:1354:1> line:1346:8 struct __has_construct definition
|-public 'integral_constant<_Bool, is_same<decltype(__has_construct_test(declval<class allocator<int> >(), declval<int *>(), declval<int>())), true_type>::value>':'struct std::__1::integral_constant<_Bool, true>'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-TemplateArgument type 'int *'
|-TemplateArgument pack
| `-TemplateArgument type 'int'
|-CXXRecordDecl 0x7f9a998ade88 prev 0x7f9a998a9e00 <col:1, col:8> col:8 implicit struct __has_construct
|-CXXConstructorDecl 0x7f9a998adf60 <col:8> col:8 implicit referenced constexpr __has_construct 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f9a998ae078 <col:8> col:8 implicit constexpr __has_construct 'void (const struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &)' inline default trivial noexcept-unevaluated 0x7f9a998ae078
| `-ParmVarDecl 0x7f9a998ae1a0 <col:8> col:8 'const struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &'
|-CXXConstructorDecl 0x7f9a998ae238 <col:8> col:8 implicit constexpr __has_construct 'void (struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &&)' inline default trivial noexcept-unevaluated 0x7f9a998ae238
| `-ParmVarDecl 0x7f9a998ae360 <col:8> col:8 'struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &&'
`-CXXDestructorDecl 0x7f9a998ae400 <col:8> col:8 implicit referenced ~__has_construct 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__has_construct" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__has_construct" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9a976d4e68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:19:1, line:25:1> line:20:7 class __split_buffer_common definition
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7f9a976d5050 prev 0x7f9a976d4e68 <col:1, col:7> col:7 implicit class __split_buffer_common
|-AccessSpecDecl 0x7f9a976d50e8 <line:22:1, col:10> col:1 protected
|-CXXMethodDecl 0x7f9a976d5110 <line:23:5, col:33> col:10 __throw_length_error 'void (void) const'
|-CXXMethodDecl 0x7f9a976d51b8 <line:24:5, col:33> col:10 __throw_out_of_range 'void (void) const'
|-CXXDestructorDecl 0x7f9a998c05a0 <line:20:7> col:7 implicit ~__split_buffer_common 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f9a998de158 <col:7> col:7 implicit used constexpr __split_buffer_common 'void (void) noexcept' inline default trivial
| `-CompoundStmt 0x7f9a998de5b8 <col:7>
|-CXXConstructorDecl 0x7f9a998de268 <col:7> col:7 implicit constexpr __split_buffer_common 'void (const class std::__1::__split_buffer_common<true> &)' inline default trivial noexcept-unevaluated 0x7f9a998de268
| `-ParmVarDecl 0x7f9a998de390 <col:7> col:7 'const class std::__1::__split_buffer_common<true> &'
`-CXXConstructorDecl 0x7f9a998de428 <col:7> col:7 implicit constexpr __split_buffer_common 'void (class std::__1::__split_buffer_common<true> &&)' inline default trivial noexcept-unevaluated 0x7f9a998de428
  `-ParmVarDecl 0x7f9a998de550 <col:7> col:7 'class std::__1::__split_buffer_common<true> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__split_buffer_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__split_buffer_common" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9a998b3a20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2034:1, line:2067:1> line:2037:8 struct __compressed_pair_elem definition
|-TemplateArgument type 'class std::__1::allocator<int> &'
|-TemplateArgument integral 1
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7f9a998b3ca0 prev 0x7f9a998b3a20 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7f9a998b3d48 <line:2038:3, col:15> col:15 _ParamT 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
| `-SubstTemplateTypeParmType 0x7f9a998b30a0 'class std::__1::allocator<int> &' sugar
|   |-TemplateTypeParmType 0x7f9a97375580 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9a97375538 '_Tp'
|   `-LValueReferenceType 0x7f9a97746b50 'class std::__1::allocator<int> &'
|     `-RecordType 0x7f9a977392f0 'class std::__1::allocator<int>'
|       `-ClassTemplateSpecialization 0x7f9a97739200 'allocator'
|-TypedefDecl 0x7f9a998b3dd8 <line:2039:3, col:16> col:16 referenced reference 'class std::__1::allocator<int> &&'
| `-LValueReferenceType 0x7f9a998b3da0 'class std::__1::allocator<int> &&'
|   `-RecordType 0x7f9a977392f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7f9a97739200 'allocator'
|-TypedefDecl 0x7f9a998b3e40 <line:2040:3, col:22> col:22 referenced const_reference 'class std::__1::allocator<int> &&'
| `-LValueReferenceType 0x7f9a998b3da0 'class std::__1::allocator<int> &&'
|   `-RecordType 0x7f9a977392f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7f9a97739200 'allocator'
|-CXXConstructorDecl 0x7f9a998b3ed8 <line:2043:3, col:52> col:13 constexpr __compressed_pair_elem 'void (void)'
|-FunctionTemplateDecl 0x7f9a998b46b8 <line:2045:3, line:2050:44> line:2049:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7f9a998b3f90 <line:2045:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7f9a998b3ff8 <col:24, line:2047:6> line:2045:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<class allocator<int> &, 1, false>, typename decay<_Up>::type>::value>::type'
| |-CXXConstructorDecl 0x7f9a998b4610 <line:2048:3, line:2050:44> line:2049:3 constexpr __compressed_pair_elem 'void (_Up &&)'
| | `-ParmVarDecl 0x7f9a998b4528 <col:26, col:32> col:32 __u '_Up &&'
| `-CXXConstructorDecl 0x7f9a998dd920 <line:2048:3, line:2050:44> line:2049:3 used constexpr __compressed_pair_elem 'void (class std::__1::allocator<int> &&)'
|   |-TemplateArgument type 'class std::__1::allocator<int> &'
|   |-TemplateArgument type 'void'
|   |-ParmVarDecl 0x7f9a998dd858 <col:26, col:32> col:32 used __u 'class std::__1::allocator<int> &&'
|   |-CXXCtorInitializer Field 0x7f9a998b50f8 '__value_' 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
|   | `-CallExpr 0x7f9a998ddfb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2050:41> 'class std::__1::allocator<int>' lvalue
|   |   |-ImplicitCastExpr 0x7f9a998ddfa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2050:36> 'class std::__1::allocator<int> &&(*)(typename remove_reference<class allocator<int> &>::type &) noexcept' <FunctionToPointerDecay>
|   |   | `-DeclRefExpr 0x7f9a998ddf20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2050:36> 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' lvalue Function 0x7f9a998d6ce8 'forward' 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' (FunctionTemplate 0x7f9a970ea4e0 'forward')
|   |   `-DeclRefExpr 0x7f9a998ddb18 <col:38> 'class std::__1::allocator<int>' lvalue ParmVar 0x7f9a998dd858 '__u' 'class std::__1::allocator<int> &&'
|   `-CompoundStmt 0x7f9a973773c0 <col:43, col:44>
|-FunctionTemplateDecl 0x7f9a998b4ce8 <line:2052:3, line:2056:75> line:2054:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7f9a998b4798 <line:2052:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7f9a998b4808 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7f9a998b4c40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2056:75> line:2054:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7f9a998b4880 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f9a998b49e8 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7f9a998b4b38 <line:2055:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7f9a998b4d78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998b4ec8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2062:3, col:50> col:13 used __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>::reference (void) noexcept'
| `-CompoundStmt 0x7f9a96baeb00 <col:31, col:50>
|   `-ReturnStmt 0x7f9a96baeae8 <col:33, col:40>
|     `-MemberExpr 0x7f9a96baeab0 <col:40> 'class std::__1::allocator<int>' lvalue ->__value_ 0x7f9a998b50f8
|       `-CXXThisExpr 0x7f9a96baea98 <col:40> 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> *' this
|-CXXMethodDecl 0x7f9a998b5018 <line:2063:3, col:62> col:19 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>::const_reference (void) const noexcept'
|-AccessSpecDecl 0x7f9a998b50c0 <line:2065:1, col:8> col:1 private
|-FieldDecl 0x7f9a998b50f8 <line:2066:3, col:7> col:7 referenced __value_ 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
|-CXXMethodDecl 0x7f9a998b8ca8 <line:2037:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &(const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &)' inline default_delete trivial noexcept-unevaluated 0x7f9a998b8ca8
| `-ParmVarDecl 0x7f9a998b8dc0 <col:8> col:8 'const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &'
|-CXXMethodDecl 0x7f9a998b8e58 <col:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &(struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&)' inline default_delete trivial noexcept-unevaluated 0x7f9a998b8e58
| `-ParmVarDecl 0x7f9a998b8f70 <col:8> col:8 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&'
|-CXXDestructorDecl 0x7f9a998c0758 <col:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f9a998c7e88 <col:8> col:8 implicit constexpr __compressed_pair_elem 'void (const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &)' inline default trivial noexcept-unevaluated 0x7f9a998c7e88
| `-ParmVarDecl 0x7f9a998c7fb0 <col:8> col:8 'const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &'
`-CXXConstructorDecl 0x7f9a998c8018 <col:8> col:8 implicit constexpr __compressed_pair_elem 'void (struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&)' inline default trivial noexcept-unevaluated 0x7f9a998c8018
  `-ParmVarDecl 0x7f9a998c8140 <col:8> col:8 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem.2" = type { %"class.std::__1::allocator"* }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem.2" = type { %"class.std::__1::allocator"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9a998b2b10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2104:1, line:2201:1> line:2105:7 class __compressed_pair definition
|-private '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|-private '__compressed_pair_elem<class std::__1::allocator<int> &, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
|-TemplateArgument type 'int *'
|-TemplateArgument type 'class std::__1::allocator<int> &'
|-CXXRecordDecl 0x7f9a998b51a8 prev 0x7f9a998b2b10 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7f9a998b5548 <line:2107:3, col:42> col:42 _Base1 '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
| `-TemplateSpecializationType 0x7f9a998b54a0 '__compressed_pair_elem<int *, 0>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'int *':'int *'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7f9a9737aa00 <col:39> 'int' 0
|   `-RecordType 0x7f9a98a6d320 'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|     `-ClassTemplateSpecialization 0x7f9a98a6d200 '__compressed_pair_elem'
|-TypedefDecl 0x7f9a998b58a8 <line:2108:3, col:42> col:42 _Base2 '__compressed_pair_elem<class std::__1::allocator<int> &, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
| `-TemplateSpecializationType 0x7f9a998b5800 '__compressed_pair_elem<class std::__1::allocator<int> &, 1>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7f9a9737ada8 <col:39> 'int' 1
|   `-RecordType 0x7f9a998b3b40 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
|     `-ClassTemplateSpecialization 0x7f9a998b3a20 '__compressed_pair_elem'
|-StaticAssertDecl 0x7f9a998b5d28 <line:2114:3, line:2117:44> line:2114:3
| |-ParenExpr 0x7f9a998b5d08 <col:17, col:43> '_Bool'
| | `-UnaryOperator 0x7f9a998b5ce8 <col:18, col:38> '_Bool' prefix '!'
| |   `-ImplicitCastExpr 0x7f9a998b5cd0 <col:19, col:38> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7f9a998b5c98 <col:19, col:38> 'const _Bool':'const _Bool' lvalue Var 0x7f9a98993278 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f9a9737b2d8 <line:2115:5, line:2117:5> 'const char [179]' lvalue "__compressed_pair cannot be instantated when T1 and T2 are the same type; The current implementation is NOT ABI-compatible with the previous implementation for this configuration"
|-AccessSpecDecl 0x7f9a998b5d60 <line:2119:1, col:7> col:1 public
|-FunctionTemplateDecl 0x7f9a998b6628 <line:2121:3, line:2128:34> col:13 __compressed_pair
| |-NonTypeTemplateParmDecl 0x7f9a998b5d88 <line:2121:13, col:27> col:18 referenced '_Bool' depth 0 index 0 _Dummy
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7f9a9737b420 <col:27> '_Bool' true
| |-TemplateTypeParmDecl 0x7f9a998b5de0 <line:2122:7, line:2125:10> line:2122:7 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<__dependent_type<is_default_constructible<int *>, _Dummy>::value && __dependent_type<is_default_constructible<class allocator<int> &>, _Dummy>::value>::type'
| `-CXXConstructorDecl 0x7f9a998b6580 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2128:34> col:13 constexpr __compressed_pair 'void (void)'
|   `-AlwaysInlineAttr 0x7f9a998b66a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9a998b6ec8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2130:3, line:2135:51> line:2134:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f9a998b6778 <line:2130:13, col:19> col:19 class depth 0 index 0 _Tp
| |-NonTypeTemplateParmDecl 0x7f9a998b6c80 <col:24, line:2132:57> col:55 'typename enable_if<!is_same<typename decay<_Tp>::type, class __compressed_pair<int *, class allocator<int> &> >::value, _Bool>::type' depth 0 index 1
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7f9a9737c340 <col:57> '_Bool' true
| `-CXXConstructorDecl 0x7f9a998b6e20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2135:51> line:2134:3 constexpr __compressed_pair 'void (_Tp &&)'
|   |-ParmVarDecl 0x7f9a998b6d38 <col:21, col:27> col:27 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7f9a998b6f20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9a998b72a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2137:3, line:2140:51> line:2139:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f9a998b6ff0 <line:2137:13, col:19> col:19 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7f9a998b7200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2140:51> line:2139:3 constexpr __compressed_pair 'void (struct std::__1::__second_tag, _Tp &&)'
|   |-ParmVarDecl 0x7f9a998b7070 <col:21> col:33 'struct std::__1::__second_tag'
|   |-ParmVarDecl 0x7f9a998b7108 <col:35, col:41> col:41 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7f9a998b7308 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9a998b7758 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2142:3, line:2145:75> line:2144:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f9a998b73d8 <line:2142:13, col:19> col:19 class depth 0 index 0 _U1
| |-TemplateTypeParmDecl 0x7f9a998b7448 <col:24, col:30> col:30 class depth 0 index 1 _U2
| |-CXXConstructorDecl 0x7f9a998b76b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 constexpr __compressed_pair 'void (_U1 &&, _U2 &&)'
| | |-ParmVarDecl 0x7f9a998b7518 <col:21, col:27> col:27 __t1 '_U1 &&'
| | |-ParmVarDecl 0x7f9a998b75b8 <col:33, col:39> col:39 __t2 '_U2 &&'
| | `-AlwaysInlineAttr 0x7f9a998b77b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-CXXConstructorDecl 0x7f9a998d5b60 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 used constexpr __compressed_pair 'void (nullptr_t &&, class std::__1::allocator<int> &&)'
|   |-TemplateArgument type 'nullptr_t'
|   |-TemplateArgument type 'class std::__1::allocator<int> &'
|   |-ParmVarDecl 0x7f9a998d5978 <col:21, col:27> col:27 used __t1 'nullptr_t &&'
|   |-ParmVarDecl 0x7f9a998d5a48 <col:33, col:39> col:39 used __t2 'class std::__1::allocator<int> &&'
|   |-CXXCtorInitializer 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|   | `-CXXConstructExpr 0x7f9a998d66e0 <line:2145:9, col:39> '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>' 'void (nullptr_t &&)'
|   |   `-CallExpr 0x7f9a998d62e8 <col:16, col:38> 'nullptr_t':'nullptr_t' xvalue
|   |     |-ImplicitCastExpr 0x7f9a998d62d0 <col:16, col:32> 'nullptr_t &&(*)(typename remove_reference<nullptr_t>::type &) noexcept' <FunctionToPointerDecay>
|   |     | `-DeclRefExpr 0x7f9a998d6250 <col:16, col:32> 'nullptr_t &&(typename remove_reference<nullptr_t>::type &) noexcept' lvalue Function 0x7f9a9989e968 'forward' 'nullptr_t &&(typename remove_reference<nullptr_t>::type &) noexcept' (FunctionTemplate 0x7f9a970ea4e0 'forward')
|   |     `-DeclRefExpr 0x7f9a998d5e48 <col:34> 'nullptr_t':'nullptr_t' lvalue ParmVar 0x7f9a998d5978 '__t1' 'nullptr_t &&'
|   |-CXXCtorInitializer 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
|   | `-CXXConstructExpr 0x7f9a998de048 <col:42, col:72> '__compressed_pair_elem<class std::__1::allocator<int> &, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>' 'void (class std::__1::allocator<int> &&)'
|   |   `-CallExpr 0x7f9a998d71f0 <col:49, col:71> 'class std::__1::allocator<int>' lvalue
|   |     |-ImplicitCastExpr 0x7f9a998d71d8 <col:49, col:65> 'class std::__1::allocator<int> &&(*)(typename remove_reference<class allocator<int> &>::type &) noexcept' <FunctionToPointerDecay>
|   |     | `-DeclRefExpr 0x7f9a998d7060 <col:49, col:65> 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' lvalue Function 0x7f9a998d6ce8 'forward' 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' (FunctionTemplate 0x7f9a970ea4e0 'forward')
|   |     `-DeclRefExpr 0x7f9a998d6818 <col:67> 'class std::__1::allocator<int>' lvalue ParmVar 0x7f9a998d5a48 '__t2' 'class std::__1::allocator<int> &&'
|   |-CompoundStmt 0x7f9a9737eff8 <col:74, col:75>
|   `-AlwaysInlineAttr 0x7f9a998d5c88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9a998b7e18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2147:3, line:2154:75> line:2149:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f9a998b7888 <line:2147:13, col:22> col:22 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7f9a998b78f8 <col:30, col:39> col:39 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7f9a998b7d70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2154:75> line:2149:3 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7f9a998b7988 <col:21, col:43> col:43 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f9a998b7af8 <col:49, col:66> col:66 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7f9a998b7c68 <line:2150:21, col:38> col:38 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7f9a998b7e80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998b8048 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2175:3> line:2173:30 used first 'typename _Base1::reference (void) noexcept'
| |-CompoundStmt 0x7f9a96baf2e8 <col:48, line:2175:3>
| | `-ReturnStmt 0x7f9a96baf2d0 <line:2174:5, col:46>
| |   `-CXXMemberCallExpr 0x7f9a96baf2a8 <col:12, col:46> 'int *':'int *' lvalue
| |     `-MemberExpr 0x7f9a96baf270 <col:12, col:40> '<bound member function type>' .__get 0x7f9a98a6e768
| |       `-CXXStaticCastExpr 0x7f9a96baf1d0 <col:12, col:38> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue static_cast<std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1 &> <NoOp>
| |         `-ImplicitCastExpr 0x7f9a96baf1b0 <col:33, col:34> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue <DerivedToBase (__compressed_pair_elem)>
| |           `-UnaryOperator 0x7f9a96baf190 <col:33, col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue prefix '*'
| |             `-CXXThisExpr 0x7f9a96baf178 <col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7f9a998b80f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998b81f8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2180:3> line:2178:36 used first 'typename _Base1::const_reference (void) const noexcept'
| |-CompoundStmt 0x7f9a96bb0ad8 <col:60, line:2180:3>
| | `-ReturnStmt 0x7f9a96bb0ac0 <line:2179:5, col:52>
| |   `-CXXMemberCallExpr 0x7f9a96bb0a98 <col:12, col:52> 'int *const':'int *const' lvalue
| |     `-MemberExpr 0x7f9a96bb0a60 <col:12, col:46> '<bound member function type>' .__get 0x7f9a98a6e8b8
| |       `-CXXStaticCastExpr 0x7f9a96bb09c0 <col:12, col:44> 'const std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'const struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue static_cast<const std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1 &> <NoOp>
| |         `-ImplicitCastExpr 0x7f9a96bb09a0 <col:39, col:40> 'const std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'const struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue <DerivedToBase (__compressed_pair_elem)>
| |           `-UnaryOperator 0x7f9a96bb0980 <col:39, col:40> 'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue prefix '*'
| |             `-CXXThisExpr 0x7f9a96bb0968 <col:40> 'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7f9a998b82a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998b83e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2185:3> line:2183:30 used second 'typename _Base2::reference (void) noexcept'
| |-CompoundStmt 0x7f9a96baea78 <col:49, line:2185:3>
| | `-ReturnStmt 0x7f9a96baea60 <line:2184:5, col:46>
| |   `-CXXMemberCallExpr 0x7f9a96baea38 <col:12, col:46> 'class std::__1::allocator<int>' lvalue
| |     `-MemberExpr 0x7f9a96baea00 <col:12, col:40> '<bound member function type>' .__get 0x7f9a998b4ec8
| |       `-CXXStaticCastExpr 0x7f9a998df330 <col:12, col:38> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>' lvalue static_cast<std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2 &> <NoOp>
| |         `-ImplicitCastExpr 0x7f9a998df310 <col:33, col:34> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>' lvalue <DerivedToBase (__compressed_pair_elem)>
| |           `-UnaryOperator 0x7f9a998df2f0 <col:33, col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue prefix '*'
| |             `-CXXThisExpr 0x7f9a998df2d8 <col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7f9a998b8490 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998b8598 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2190:3> line:2188:36 second 'typename _Base2::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a998b8640 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998b87e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2200:3> line:2193:8 swap 'void (class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &)' noexcept-uninstantiated 0x7f9a9737e448
| |-ParmVarDecl 0x7f9a998b86c8 <col:13, col:32> col:32 __x 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &'
| `-AlwaysInlineAttr 0x7f9a998b88d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998b8fd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2105:7, <invalid sloc>> col:7 implicit constexpr operator= 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &(class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&)' inline default_delete trivial noexcept-unevaluated 0x7f9a998b8fd8
| `-ParmVarDecl 0x7f9a998b90f0 <col:7> col:7 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&'
|-CXXDestructorDecl 0x7f9a998c0678 <col:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f9a998cf480 <col:7> col:7 implicit constexpr __compressed_pair 'void (const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &)' inline default trivial noexcept-unevaluated 0x7f9a998cf480
| `-ParmVarDecl 0x7f9a998cf5b0 <col:7> col:7 'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &'
`-CXXConstructorDecl 0x7f9a998d5708 <col:7> col:7 implicit constexpr __compressed_pair 'void (class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&)' inline default trivial noexcept-unevaluated 0x7f9a998d5708
  `-ParmVarDecl 0x7f9a998d5830 <col:7> col:7 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair.1" = type { %"struct.std::__1::__compressed_pair_elem", %"struct.std::__1::__compressed_pair_elem.2" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair.1" = type { %"struct.std::__1::__compressed_pair_elem", %"struct.std::__1::__compressed_pair_elem.2" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9a98a857b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:27:1, line:164:1> line:28:8 struct __split_buffer definition
|-private '__split_buffer_common<true>':'class std::__1::__split_buffer_common<true>'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int> &'
|-CXXRecordDecl 0x7f9a998b1858 prev 0x7f9a98a857b8 <col:1, col:8> col:8 implicit struct __split_buffer
|-AccessSpecDecl 0x7f9a998b18f0 <line:31:1, col:8> col:1 private
|-CXXConstructorDecl 0x7f9a998b1a60 <line:32:5, col:41> col:5 __split_buffer 'void (const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &)'
| `-ParmVarDecl 0x7f9a998b1958 <col:20, col:40> col:41 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &'
|-CXXMethodDecl 0x7f9a998b1bf0 <line:33:5, col:52> col:21 operator= 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &(const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &)'
| `-ParmVarDecl 0x7f9a998b1b30 <col:31, col:51> col:52 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &'
|-AccessSpecDecl 0x7f9a998b1ca0 <line:34:1, col:7> col:1 public
|-TypedefDecl 0x7f9a998b1d08 <line:35:5, col:61> col:61 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7f9a998b1cd0 'int' sugar
|   |-TemplateTypeParmType 0x7f9a976d0940 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9a976d08f8 '_Tp'
|   `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a998b1d98 <line:36:5, col:61> col:61 allocator_type 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
| `-SubstTemplateTypeParmType 0x7f9a998b1d60 'class std::__1::allocator<int> &' sugar
|   |-TemplateTypeParmType 0x7f9a976d0a70 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f9a976d0a28 '_Allocator'
|   `-LValueReferenceType 0x7f9a97746b50 'class std::__1::allocator<int> &'
|     `-RecordType 0x7f9a977392f0 'class std::__1::allocator<int>'
|       `-ClassTemplateSpecialization 0x7f9a97739200 'allocator'
|-TypedefDecl 0x7f9a998b22b0 <line:37:5, col:61> col:61 __alloc_rr 'typename remove_reference<allocator_type>::type':'class std::__1::allocator<int>'
| `-ElaboratedType 0x7f9a998b2260 'typename remove_reference<allocator_type>::type' sugar
|   `-TypedefType 0x7f9a998b2240 'std::__1::remove_reference<class std::__1::allocator<int> &>::type' sugar
|     |-Typedef 0x7f9a998b21c8 'type'
|     `-SubstTemplateTypeParmType 0x7f9a998b2010 'class std::__1::allocator<int>' sugar
|       |-TemplateTypeParmType 0x7f9a97073420 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f9a970733d8 '_Tp'
|       `-RecordType 0x7f9a977392f0 'class std::__1::allocator<int>'
|         `-ClassTemplateSpecialization 0x7f9a97739200 'allocator'
|-TypedefDecl 0x7f9a998b23b8 <line:38:5, col:61> col:61 __alloc_traits 'allocator_traits<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr>':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x7f9a998b2340 'allocator_traits<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>'
|   `-RecordType 0x7f9a97739c90 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x7f9a97739ba0 'allocator_traits'
|-TypedefDecl 0x7f9a998b2468 <line:39:5, col:61> col:61 reference 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
| `-LValueReferenceType 0x7f9a998b2430 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
|   `-TypedefType 0x7f9a998b2410 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type' sugar
|     |-Typedef 0x7f9a998b1d08 'value_type'
|     `-SubstTemplateTypeParmType 0x7f9a998b1cd0 'int' sugar
|       |-TemplateTypeParmType 0x7f9a976d0940 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f9a976d08f8 '_Tp'
|       `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a998b24f8 <line:40:5, col:61> col:61 const_reference 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
| `-LValueReferenceType 0x7f9a998b24c0 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
|   `-QualType 0x7f9a998b2411 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type' const
|     `-TypedefType 0x7f9a998b2410 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type' sugar
|       |-Typedef 0x7f9a998b1d08 'value_type'
|       `-SubstTemplateTypeParmType 0x7f9a998b1cd0 'int' sugar
|         |-TemplateTypeParmType 0x7f9a976d0940 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7f9a976d08f8 '_Tp'
|         `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a998b2600 <line:41:5, col:61> col:61 size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7f9a998b25b0 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7f9a97746c20 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x7f9a977435b0 'size_type'
|     `-ElaboratedType 0x7f9a97743560 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7f9a97743540 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|         |-Typedef 0x7f9a977434c0 'type'
|         `-ElaboratedType 0x7f9a97743470 'typename class allocator<int>::size_type' sugar
|           `-TypedefType 0x7f9a97742d50 'std::__1::allocator<int>::size_type' sugar
|             |-Typedef 0x7f9a9773a2c8 'size_type'
|             `-TypedefType 0x7f9a97059410 'size_t' sugar
|               |-Typedef 0x7f9a968691b0 'size_t'
|               `-BuiltinType 0x7f9a96833c80 'unsigned long'
|-TypedefDecl 0x7f9a998b26d0 <line:42:5, col:61> col:61 difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7f9a998b2680 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7f9a97742a70 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x7f9a97742a00 'difference_type'
|     `-ElaboratedType 0x7f9a977429b0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7f9a97742990 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|         |-Typedef 0x7f9a97742910 'type'
|         `-ElaboratedType 0x7f9a977428c0 'typename class allocator<int>::difference_type' sugar
|           `-TypedefType 0x7f9a97742170 'std::__1::allocator<int>::difference_type' sugar
|             |-Typedef 0x7f9a9773a320 'difference_type'
|             `-TypedefType 0x7f9a970daf50 'ptrdiff_t' sugar
|               |-Typedef 0x7f9a96869140 'ptrdiff_t'
|               `-BuiltinType 0x7f9a96833be0 'long'
|-TypedefDecl 0x7f9a998b27a0 <line:43:5, col:61> col:61 pointer 'typename __alloc_traits::pointer':'int *'
| `-ElaboratedType 0x7f9a998b2750 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7f9a9773d840 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x7f9a9773d7d0 'pointer'
|     `-ElaboratedType 0x7f9a9773d780 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7f9a9773d760 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|         |-Typedef 0x7f9a9773d6e0 'type'
|         `-ElaboratedType 0x7f9a9773d690 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|           `-TypedefType 0x7f9a9773d670 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x7f9a9773d5f0 'type'
|             `-ElaboratedType 0x7f9a9773d5a0 'typename class allocator<int>::pointer' sugar
|               `-TypedefType 0x7f9a9773afa0 'std::__1::allocator<int>::pointer' sugar
|                 |-Typedef 0x7f9a9773a3e8 'pointer'
|                 `-PointerType 0x7f9a9773a3b0 'int *'
|                   `-SubstTemplateTypeParmType 0x7f9a9773a380 'int' sugar
|                     |-TemplateTypeParmType 0x7f9a97365660 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7f9a97365618 '_Tp'
|                     `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a998b2870 <line:44:5, col:61> col:61 const_pointer 'typename __alloc_traits::const_pointer':'const int *'
| `-ElaboratedType 0x7f9a998b2820 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7f9a98a6c350 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x7f9a9773e5d0 'const_pointer'
|     `-ElaboratedType 0x7f9a9773e580 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7f9a9773e560 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|         |-Typedef 0x7f9a9773e4e0 'type'
|         `-ElaboratedType 0x7f9a9773e490 'typename class allocator<int>::const_pointer' sugar
|           `-TypedefType 0x7f9a9773b1f0 'std::__1::allocator<int>::const_pointer' sugar
|             |-Typedef 0x7f9a9773a478 'const_pointer'
|             `-PointerType 0x7f9a9773a440 'const int *'
|               `-QualType 0x7f9a9773a381 'const int' const
|                 `-SubstTemplateTypeParmType 0x7f9a9773a380 'int' sugar
|                   |-TemplateTypeParmType 0x7f9a97365660 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7f9a97365618 '_Tp'
|                   `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a998b2900 <line:45:5, col:61> col:61 iterator 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
| `-TypedefType 0x7f9a998b28d0 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer' sugar
|   |-Typedef 0x7f9a998b27a0 'pointer'
|   `-ElaboratedType 0x7f9a998b2750 'typename __alloc_traits::pointer' sugar
|     `-TypedefType 0x7f9a9773d840 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|       |-Typedef 0x7f9a9773d7d0 'pointer'
|       `-ElaboratedType 0x7f9a9773d780 'typename __pointer_type<value_type, allocator_type>::type' sugar
|         `-TypedefType 0x7f9a9773d760 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|           |-Typedef 0x7f9a9773d6e0 'type'
|           `-ElaboratedType 0x7f9a9773d690 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|             `-TypedefType 0x7f9a9773d670 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|               |-Typedef 0x7f9a9773d5f0 'type'
|               `-ElaboratedType 0x7f9a9773d5a0 'typename class allocator<int>::pointer' sugar
|                 `-TypedefType 0x7f9a9773afa0 'std::__1::allocator<int>::pointer' sugar
|                   |-Typedef 0x7f9a9773a3e8 'pointer'
|                   `-PointerType 0x7f9a9773a3b0 'int *'
|                     `-SubstTemplateTypeParmType 0x7f9a9773a380 'int' sugar
|                       |-TemplateTypeParmType 0x7f9a97365660 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7f9a97365618 '_Tp'
|                       `-BuiltinType 0x7f9a96833bc0 'int'
|-TypedefDecl 0x7f9a998b2990 <line:46:5, col:61> col:61 const_iterator 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_pointer':'const int *'
| `-TypedefType 0x7f9a998b2960 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_pointer' sugar
|   |-Typedef 0x7f9a998b2870 'const_pointer'
|   `-ElaboratedType 0x7f9a998b2820 'typename __alloc_traits::const_pointer' sugar
|     `-TypedefType 0x7f9a98a6c350 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|       |-Typedef 0x7f9a9773e5d0 'const_pointer'
|       `-ElaboratedType 0x7f9a9773e580 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|         `-TypedefType 0x7f9a9773e560 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|           |-Typedef 0x7f9a9773e4e0 'type'
|           `-ElaboratedType 0x7f9a9773e490 'typename class allocator<int>::const_pointer' sugar
|             `-TypedefType 0x7f9a9773b1f0 'std::__1::allocator<int>::const_pointer' sugar
|               |-Typedef 0x7f9a9773a478 'const_pointer'
|               `-PointerType 0x7f9a9773a440 'const int *'
|                 `-QualType 0x7f9a9773a381 'const int' const
|                   `-SubstTemplateTypeParmType 0x7f9a9773a380 'int' sugar
|                     |-TemplateTypeParmType 0x7f9a97365660 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7f9a97365618 '_Tp'
|                     `-BuiltinType 0x7f9a96833bc0 'int'
|-FieldDecl 0x7f9a998b29f8 <line:48:5, col:53> col:53 referenced __first_ 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
|-FieldDecl 0x7f9a998b2a50 <line:49:5, col:53> col:53 referenced __begin_ 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
|-FieldDecl 0x7f9a998b2aa8 <line:50:5, col:53> col:53 referenced __end_ 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
|-FieldDecl 0x7f9a998b9178 <line:51:5, col:48> col:48 referenced __end_cap_ '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>'
|-TypedefDecl 0x7f9a998ba900 <line:53:5, col:65> col:65 __alloc_ref 'typename add_lvalue_reference<allocator_type>::type':'class std::__1::allocator<int> &&'
| `-ElaboratedType 0x7f9a998ba8b0 'typename add_lvalue_reference<allocator_type>::type' sugar
|   `-TypedefType 0x7f9a998ba890 'std::__1::add_lvalue_reference<class std::__1::allocator<int> &>::type' sugar
|     |-Typedef 0x7f9a998ba810 'type'
|     `-ElaboratedType 0x7f9a998ba7c0 'typename __add_lvalue_reference_impl<class allocator<int> &>::type' sugar
|       `-TypedefType 0x7f9a998ba7a0 'std::__1::__add_lvalue_reference_impl<class std::__1::allocator<int> &, true>::type' sugar
|         |-Typedef 0x7f9a998ba728 'type'
|         `-LValueReferenceType 0x7f9a998ba6f0 'class std::__1::allocator<int> &&'
|           `-RecordType 0x7f9a977392f0 'class std::__1::allocator<int>'
|             `-ClassTemplateSpecialization 0x7f9a97739200 'allocator'
|-TypedefDecl 0x7f9a998baa60 <line:54:5, col:65> col:65 __alloc_const_ref 'typename add_lvalue_reference<allocator_type>::type':'class std::__1::allocator<int> &&'
| `-ElaboratedType 0x7f9a998baa10 'typename add_lvalue_reference<allocator_type>::type' sugar
|   `-TypedefType 0x7f9a998ba890 'std::__1::add_lvalue_reference<class std::__1::allocator<int> &>::type' sugar
|     |-Typedef 0x7f9a998ba810 'type'
|     `-ElaboratedType 0x7f9a998ba7c0 'typename __add_lvalue_reference_impl<class allocator<int> &>::type' sugar
|       `-TypedefType 0x7f9a998ba7a0 'std::__1::__add_lvalue_reference_impl<class std::__1::allocator<int> &, true>::type' sugar
|         |-Typedef 0x7f9a998ba728 'type'
|         `-LValueReferenceType 0x7f9a998ba6f0 'class std::__1::allocator<int> &&'
|           `-RecordType 0x7f9a977392f0 'class std::__1::allocator<int>'
|             `-ClassTemplateSpecialization 0x7f9a97739200 'allocator'
|-CXXMethodDecl 0x7f9a998bab48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:56:109> col:53 used __alloc 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &(void) noexcept'
| |-CompoundStmt 0x7f9a998df280 <col:81, col:109>
| | `-ReturnStmt 0x7f9a998df268 <col:82, col:107>
| |   `-CXXMemberCallExpr 0x7f9a998df240 <col:89, col:107> 'class std::__1::allocator<int>' lvalue
| |     `-MemberExpr 0x7f9a998df208 <col:89, col:100> '<bound member function type>' .second 0x7f9a998b83e8
| |       `-MemberExpr 0x7f9a998df160 <col:89> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue ->__end_cap_ 0x7f9a998b9178
| |         `-CXXThisExpr 0x7f9a998df148 <col:89> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7f9a998bac18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998bace8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:57:109> col:53 __alloc 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &(void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a998bad90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998bae68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:58:108> col:53 used __end_cap 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer &(void) noexcept'
| |-CompoundStmt 0x7f9a96baf120 <col:81, col:108>
| | `-ReturnStmt 0x7f9a96baf108 <col:82, col:106>
| |   `-CXXMemberCallExpr 0x7f9a96baf0e0 <col:89, col:106> 'int *':'int *' lvalue
| |     `-MemberExpr 0x7f9a96baf0a8 <col:89, col:100> '<bound member function type>' .first 0x7f9a998b8048
| |       `-MemberExpr 0x7f9a96baf000 <col:89> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue ->__end_cap_ 0x7f9a998b9178
| |         `-CXXThisExpr 0x7f9a96baefe8 <col:89> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7f9a998baf10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998bafe8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:59:108> col:53 used __end_cap 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer &(void) const noexcept'
| |-CompoundStmt 0x7f9a96bb0910 <col:81, col:108>
| | `-ReturnStmt 0x7f9a96bb08f8 <col:82, col:106>
| |   `-CXXMemberCallExpr 0x7f9a96bb08a8 <col:89, col:106> 'int *const':'int *const' lvalue
| |     `-MemberExpr 0x7f9a96bb0870 <col:89, col:100> '<bound member function type>' .first 0x7f9a998b81f8
| |       `-MemberExpr 0x7f9a96bb07c8 <col:89> 'const __compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue ->__end_cap_ 0x7f9a998b9178
| |         `-CXXThisExpr 0x7f9a96bb07b0 <col:89> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7f9a998bb090 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9a998bb120 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:62:5 __split_buffer 'void (void)' noexcept-uninstantiated 0x7f9a976d70b0
| `-AlwaysInlineAttr 0x7f9a998bb220 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7f9a998bb3a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:65:44> col:14 __split_buffer 'void (std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7f9a998bb278 <col:29, col:41> col:41 __a 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| `-AlwaysInlineAttr 0x7f9a998bb460 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7f9a998bb5a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:67:50> col:14 __split_buffer 'void (const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7f9a998bb4b8 <col:29, col:47> col:47 __a 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| `-AlwaysInlineAttr 0x7f9a998bb660 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7f9a998bb910 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:308:1, line:314:1> line:68:5 used __split_buffer 'void (std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7f9a998bb6e0 <col:20, col:30> col:30 used __cap 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
| |-ParmVarDecl 0x7f9a998bb750 <col:37, col:47> col:47 used __start 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
| |-ParmVarDecl 0x7f9a998bb7c0 <col:56, col:68> col:68 used __a 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| |-CXXCtorInitializer '__split_buffer_common<true>':'class std::__1::__split_buffer_common<true>'
| | `-CXXConstructExpr 0x7f9a998de5d0 <col:5> '__split_buffer_common<true>':'class std::__1::__split_buffer_common<true>' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7f9a998b9178 '__end_cap_' '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>'
| | `-ExprWithCleanups 0x7f9a998de0f8 <line:309:7, col:30> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>'
| |   `-CXXConstructExpr 0x7f9a998de0b8 <col:7, col:30> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' 'void (nullptr_t &&, class std::__1::allocator<int> &&)'
| |     |-MaterializeTemporaryExpr 0x7f9a998d5cd0 <col:18> 'nullptr_t':'nullptr_t' xvalue
| |     | `-CXXNullPtrLiteralExpr 0x7f9a97ab8248 <col:18> 'nullptr_t'
| |     `-DeclRefExpr 0x7f9a998c7df8 <col:27> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>' lvalue ParmVar 0x7f9a998bb7c0 '__a' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| `-CompoundStmt 0x7f9a998df118 <line:310:1, line:314:1>
|   |-BinaryOperator 0x7f9a998deb88 <line:311:5, col:74> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|   | |-MemberExpr 0x7f9a998de680 <col:5> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7f9a998b29f8
|   | | `-CXXThisExpr 0x7f9a998de668 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   | `-ConditionalOperator 0x7f9a998deb58 <col:16, col:74> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer':'int *'
|   |   |-BinaryOperator 0x7f9a998de838 <col:16, col:25> '_Bool' '!='
|   |   | |-ImplicitCastExpr 0x7f9a998de808 <col:16> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|   |   | | `-DeclRefExpr 0x7f9a998de7e0 <col:16> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7f9a998bb6e0 '__cap' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|   |   | `-ImplicitCastExpr 0x7f9a998de820 <col:25> 'unsigned long' <IntegralCast>
|   |   |   `-IntegerLiteral 0x7f9a97ab8368 <col:25> 'int' 0
|   |   |-CallExpr 0x7f9a998deaf0 <col:29, col:70> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer':'int *'
|   |   | |-ImplicitCastExpr 0x7f9a998dead8 <col:29, col:45> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer (*)(std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type)' <FunctionToPointerDecay>
|   |   | | `-DeclRefExpr 0x7f9a998dea40 <col:29, col:45> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type)' lvalue CXXMethod 0x7f9a97746d60 'allocate' 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type)'
|   |   | |-CXXMemberCallExpr 0x7f9a998de9f0 <col:54, col:62> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>' lvalue
|   |   | | `-MemberExpr 0x7f9a998de9b8 <col:54> '<bound member function type>' ->__alloc 0x7f9a998bab48
|   |   | |   `-CXXThisExpr 0x7f9a998de9a0 <col:54> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   |   | `-ImplicitCastExpr 0x7f9a998deb28 <col:65> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|   |   |   `-DeclRefExpr 0x7f9a998dea18 <col:65> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7f9a998bb6e0 '__cap' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|   |   `-ImplicitCastExpr 0x7f9a998deb40 <col:74> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer':'int *' <NullToPointer>
|   |     `-CXXNullPtrLiteralExpr 0x7f9a97ab8698 <col:74> 'nullptr_t'
|   |-BinaryOperator 0x7f9a998dee28 <line:312:5, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|   | |-MemberExpr 0x7f9a998debc8 <col:5> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__begin_ 0x7f9a998b2a50
|   | | `-CXXThisExpr 0x7f9a998debb0 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   | `-ImplicitCastExpr 0x7f9a998dee10 <col:16, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|   |   `-BinaryOperator 0x7f9a998dede8 <col:16, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|   |     |-MemberExpr 0x7f9a998dec18 <col:16> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__end_ 0x7f9a998b2aa8
|   |     | `-CXXThisExpr 0x7f9a998dec00 <col:16> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   |     `-BinaryOperator 0x7f9a998dedc0 <col:25, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' '+'
|   |       |-ImplicitCastExpr 0x7f9a998ded90 <col:25> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|   |       | `-MemberExpr 0x7f9a998ded30 <col:25> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7f9a998b29f8
|   |       |   `-CXXThisExpr 0x7f9a998ded18 <col:25> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   |       `-ImplicitCastExpr 0x7f9a998deda8 <col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|   |         `-DeclRefExpr 0x7f9a998ded68 <col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7f9a998bb750 '__start' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|   `-BinaryOperator 0x7f9a998df0f0 <line:313:5, col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|     |-CXXMemberCallExpr 0x7f9a998def30 <col:5, col:15> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue
|     | `-MemberExpr 0x7f9a998deef8 <col:5> '<bound member function type>' ->__end_cap 0x7f9a998bae68
|     |   `-CXXThisExpr 0x7f9a998deee0 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     `-BinaryOperator 0x7f9a998df0c8 <col:19, col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' '+'
|       |-ImplicitCastExpr 0x7f9a998df098 <col:19> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|       | `-MemberExpr 0x7f9a998df038 <col:19> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7f9a998b29f8
|       |   `-CXXThisExpr 0x7f9a998df020 <col:19> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|       `-ImplicitCastExpr 0x7f9a998df0b0 <col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|         `-DeclRefExpr 0x7f9a998df070 <col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7f9a998bb6e0 '__cap' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|-CXXDestructorDecl 0x7f9a998bba10 <line:339:1, line:344:1> line:69:5 used ~__split_buffer 'void (void) noexcept'
| `-CompoundStmt 0x7f9a96baf8b8 <line:340:1, line:344:1>
|   |-CXXMemberCallExpr 0x7f9a96baf4d8 <line:341:5, col:11> 'void'
|   | `-MemberExpr 0x7f9a96baf4a0 <col:5> '<bound member function type>' ->clear 0x7f9a998bc6e8
|   |   `-CXXThisExpr 0x7f9a96baf488 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   `-IfStmt 0x7f9a96baf880 <line:342:5, line:343:67>
|     |-<<<NULL>>>
|     |-<<<NULL>>>
|     |-ImplicitCastExpr 0x7f9a96baf568 <line:342:9> '_Bool' <PointerToBoolean>
|     | `-ImplicitCastExpr 0x7f9a96baf550 <col:9> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|     |   `-MemberExpr 0x7f9a96baf518 <col:9> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7f9a998b29f8
|     |     `-CXXThisExpr 0x7f9a96baf500 <col:9> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     |-CallExpr 0x7f9a96baf828 <line:343:9, col:67> 'void'
|     | |-ImplicitCastExpr 0x7f9a96baf810 <col:9, col:25> 'void (*)(std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::pointer, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type) noexcept' <FunctionToPointerDecay>
|     | | `-DeclRefExpr 0x7f9a96baf5c0 <col:9, col:25> 'void (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::pointer, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type) noexcept' lvalue CXXMethod 0x7f9a977473d8 'deallocate' 'void (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::pointer, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type) noexcept'
|     | |-CXXMemberCallExpr 0x7f9a96baf6d8 <col:36, col:44> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>' lvalue
|     | | `-MemberExpr 0x7f9a96baf6a0 <col:36> '<bound member function type>' ->__alloc 0x7f9a998bab48
|     | |   `-CXXThisExpr 0x7f9a96baf688 <col:36> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     | |-ImplicitCastExpr 0x7f9a96baf868 <col:47> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|     | | `-MemberExpr 0x7f9a96baf718 <col:47> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7f9a998b29f8
|     | |   `-CXXThisExpr 0x7f9a96baf700 <col:47> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     | `-CXXMemberCallExpr 0x7f9a96baf7a0 <col:57, col:66> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|     |   `-MemberExpr 0x7f9a96baf768 <col:57> '<bound member function type>' ->capacity 0x7f9a998bca30
|     |     `-ImplicitCastExpr 0x7f9a96baf7f8 <col:57> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' <NoOp>
|     |       `-CXXThisExpr 0x7f9a96baf750 <col:57> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     `-<<<NULL>>>
|-CXXConstructorDecl 0x7f9a998bbc30 <line:72:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:72:5 __split_buffer 'void (struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&)' noexcept-uninstantiated 0x7f9a976d7b88
| `-ParmVarDecl 0x7f9a998bbaf8 <col:20, col:37> col:37 __c 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&'
|-CXXConstructorDecl 0x7f9a998bbef0 <line:74:5, col:63> col:5 __split_buffer 'void (struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&, const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7f9a998bbd48 <col:20, col:37> col:37 __c 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&'
| `-ParmVarDecl 0x7f9a998bbdb8 <col:42, col:60> col:60 __a 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
|-CXXMethodDecl 0x7f9a998bc0e0 <line:75:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:75:21 operator= 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &(struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&)' noexcept-uninstantiated 0x7f9a976d7fa8
| `-ParmVarDecl 0x7f9a998bbfc8 <col:31, col:48> col:48 __c 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&'
|-CXXMethodDecl 0x7f9a998bc258 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:81:87> col:46 begin 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f9a998bc300 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998bc3c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:82:87> col:46 begin 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a998bc470 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998bc4e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:83:85> col:46 end 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f9a998bc588 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998bc5f8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:84:85> col:46 end 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9a998bc6a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998bc6e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:88:38> line:87:10 used clear 'void (void) noexcept'
| |-CompoundStmt 0x7f9a96bafa60 <line:88:9, col:38>
| | `-CXXMemberCallExpr 0x7f9a96bafa18 <col:10, col:36> 'void'
| |   |-MemberExpr 0x7f9a96baf9e0 <col:10> '<bound member function type>' ->__destruct_at_end 0x7f9a998bf758
| |   | `-CXXThisExpr 0x7f9a96baf9c8 <col:10> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| |   `-ImplicitCastExpr 0x7f9a96bafa48 <col:28> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
| |     `-MemberExpr 0x7f9a96baf990 <col:28> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__begin_ 0x7f9a998b2a50
| |       `-CXXThisExpr 0x7f9a96baf978 <col:28> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7f9a998bc790 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998bc830 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:89:104> col:41 size 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| `-AlwaysInlineAttr 0x7f9a998bc8d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998bc920 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:90:81> col:36 empty '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f9a998bc9c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998bca30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:91:113> col:41 used capacity 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| |-CompoundStmt 0x7f9a96bb0790 <col:58, col:113>
| | `-ReturnStmt 0x7f9a96bb0778 <col:59, col:111>
| |   `-CXXStaticCastExpr 0x7f9a96bb0748 <col:66, col:111> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' static_cast<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type> <NoOp>
| |     `-ImplicitCastExpr 0x7f9a96bb0730 <col:89, col:103> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <IntegralCast>
| |       `-BinaryOperator 0x7f9a96bb0708 <col:89, col:103> 'long' '-'
| |         |-ImplicitCastExpr 0x7f9a96bb06d8 <col:89, col:99> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
| |         | `-CXXMemberCallExpr 0x7f9a96bb0660 <col:89, col:99> 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *const' lvalue
| |         |   `-MemberExpr 0x7f9a96bb0628 <col:89> '<bound member function type>' ->__end_cap 0x7f9a998bafe8
| |         |     `-CXXThisExpr 0x7f9a96bb0610 <col:89> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| |         `-ImplicitCastExpr 0x7f9a96bb06f0 <col:103> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
| |           `-MemberExpr 0x7f9a96bb06a0 <col:103> 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *const' lvalue ->__first_ 0x7f9a998b29f8
| |             `-CXXThisExpr 0x7f9a96bb0688 <col:103> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7f9a998bcad8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998bcb40 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:92:115> col:41 __front_spare 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| `-AlwaysInlineAttr 0x7f9a998bcbe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998bcc50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:93:115> col:41 __back_spare 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| `-AlwaysInlineAttr 0x7f9a998bccf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9a998bcdb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:95:79> col:47 front 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::reference (void)'
| `-AlwaysInlineAttr 0x7f9a998bce58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
