
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__scalar_hash<struct std::__1::_PairT, 2> (empty)
         0 |   struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1509:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1000000000, 1>, false, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_mutex_t
         0 |   long __sig
         8 |   char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_cond_t
         0 |   long __sig
         8 |   char [40] __opaque
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1, 1>, true, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct _opaque_pthread_t *, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::hash<struct _opaque_pthread_t *> (empty)
         0 |   struct std::__1::unary_function<struct _opaque_pthread_t *, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__thread_struct
         0 |   class std::__1::__thread_struct_imp * __p_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<unsigned long, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__vector_base_common<true> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<int *, 0, false>
         0 |   int * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<int> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (empty)
         0 |   class std::__1::allocator<int> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<int *, class std::__1::allocator<int> >
         0 |   struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
         0 |     int * __value_
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<int> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__vector_base<int, class std::__1::allocator<int> >
         0 |   class std::__1::__vector_base_common<true> (base) (empty)
         0 |   std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __begin_
         8 |   std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __end_
        16 |   class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > __end_cap_
        16 |     struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
        16 |       int * __value_
        16 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (base) (empty)
        16 |       class std::__1::allocator<int> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::vector<int, class std::__1::allocator<int> >
         0 |   class std::__1::__vector_base<int, class std::__1::allocator<int> > (base)
         0 |     class std::__1::__vector_base_common<true> (base) (empty)
         0 |     std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __begin_
         8 |     std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __end_
        16 |     class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > __end_cap_
        16 |       struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
        16 |         int * __value_
        16 |       struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (base) (empty)
        16 |         class std::__1::allocator<int> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9d35da6600 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:317:89> col:64 class __vector_base_common definition
|-TemplateArgument integral 1
|-VisibilityAttr 0x7f9d35da6798 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7f9d35da6848 prev 0x7f9d35da6600 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:291:1, col:7> col:7 implicit class __vector_base_common
|-AccessSpecDecl 0x7f9d35da68e0 <line:293:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f9d35da6948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:294:51> col:27 __vector_base_common 'void (void)'
| `-AlwaysInlineAttr 0x7f9d35da6a28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7f9d35da6a70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:295:22, col:50> col:27 __throw_length_error 'void (void) const'
| `-CXX11NoReturnAttr 0x7f9d35da6b18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
|-CXXMethodDecl 0x7f9d35da6b60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:296:22, col:50> col:27 __throw_out_of_range 'void (void) const'
| `-CXX11NoReturnAttr 0x7f9d35da6c08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
`-CXXDestructorDecl 0x7f9d35e9c4d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:317:64> col:64 implicit ~__vector_base_common 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__vector_base_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__vector_base_common.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9d35e7e3e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2034:1, line:2067:1> line:2037:8 struct __compressed_pair_elem definition
|-TemplateArgument type 'int *'
|-TemplateArgument integral 0
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7f9d35e7e660 prev 0x7f9d35e7e3e0 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7f9d35e7e708 <line:2038:3, col:15> col:15 _ParamT 'int *':'int *'
| `-SubstTemplateTypeParmType 0x7f9d35e7da60 'int *' sugar
|   |-TemplateTypeParmType 0x7f9d35383f80 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9d35383f38 '_Tp'
|   `-PointerType 0x7f9d3509f5d0 'int *'
|     `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d35e7e7c8 <line:2039:3, col:16> col:16 referenced reference 'int *&'
| `-LValueReferenceType 0x7f9d35e7e790 'int *&'
|   `-SubstTemplateTypeParmType 0x7f9d35e7da60 'int *' sugar
|     |-TemplateTypeParmType 0x7f9d35383f80 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f9d35383f38 '_Tp'
|     `-PointerType 0x7f9d3509f5d0 'int *'
|       `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d35e7e888 <line:2040:3, col:22> col:22 referenced const_reference 'int *const &'
| `-LValueReferenceType 0x7f9d35e7e850 'int *const &'
|   `-QualType 0x7f9d35e7da61 'int *const' const
|     `-SubstTemplateTypeParmType 0x7f9d35e7da60 'int *' sugar
|       |-TemplateTypeParmType 0x7f9d35383f80 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f9d35383f38 '_Tp'
|       `-PointerType 0x7f9d3509f5d0 'int *'
|         `-BuiltinType 0x7f9d348335c0 'int'
|-CXXConstructorDecl 0x7f9d35e7e920 <line:2043:3, col:52> col:13 constexpr __compressed_pair_elem 'void (void)'
|-FunctionTemplateDecl 0x7f9d35e7f108 <line:2045:3, line:2050:44> line:2049:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7f9d35e7e9d8 <line:2045:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7f9d35e7ea48 <col:24, line:2047:6> line:2045:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<int *, 0, false>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7f9d35e7f060 <line:2048:3, line:2050:44> line:2049:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7f9d35e7ef78 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7f9d35e7f738 <line:2052:3, line:2056:75> line:2054:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7f9d35e7f1e8 <line:2052:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7f9d35e7f258 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7f9d35e7f690 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2056:75> line:2054:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7f9d35e7f2d0 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f9d35e7f438 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7f9d35e7f588 <line:2055:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7f9d35e7f7c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e7f948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2062:3, col:50> col:13 __get 'std::__1::__compressed_pair_elem<int *, 0, false>::reference (void) noexcept'
|-CXXMethodDecl 0x7f9d35e7fa98 <line:2063:3, col:62> col:19 __get 'std::__1::__compressed_pair_elem<int *, 0, false>::const_reference (void) const noexcept'
|-AccessSpecDecl 0x7f9d35e7fb40 <line:2065:1, col:8> col:1 private
|-FieldDecl 0x7f9d35e7fb78 <line:2066:3, col:7> col:7 __value_ 'int *':'int *'
`-CXXDestructorDecl 0x7f9d35e9c698 <line:2037:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem" = type { i32* }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem" = type { i32* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9d35e67fc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:101:1, col:52> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28 class allocator definition
|-TemplateArgument type 'int'
|-CXXRecordDecl 0x7f9d35e68ff8 prev 0x7f9d35e67fc8 <col:1, col:28> col:28 implicit class allocator
|-AccessSpecDecl 0x7f9d35e69090 <line:1722:1, col:7> col:1 public
|-TypedefDecl 0x7f9d35e690b8 <line:1723:5, col:31> col:31 referenced size_type 'size_t':'unsigned long'
| `-TypedefType 0x7f9d35060010 'size_t' sugar
|   |-Typedef 0x7f9d348687b0 'size_t'
|   `-BuiltinType 0x7f9d34833680 'unsigned long'
|-TypedefDecl 0x7f9d35e69110 <line:1724:5, col:31> col:31 referenced difference_type 'ptrdiff_t':'long'
| `-TypedefType 0x7f9d350e0350 'ptrdiff_t' sugar
|   |-Typedef 0x7f9d34868740 'ptrdiff_t'
|   `-BuiltinType 0x7f9d348335e0 'long'
|-TypedefDecl 0x7f9d35e691d8 <line:1725:5, col:31> col:31 referenced pointer 'int *'
| `-PointerType 0x7f9d35e691a0 'int *'
|   `-SubstTemplateTypeParmType 0x7f9d35e69170 'int' sugar
|     |-TemplateTypeParmType 0x7f9d3537b060 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f9d3537b018 '_Tp'
|     `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d35e69268 <line:1726:5, col:31> col:31 referenced const_pointer 'const int *'
| `-PointerType 0x7f9d35e69230 'const int *'
|   `-QualType 0x7f9d35e69171 'const int' const
|     `-SubstTemplateTypeParmType 0x7f9d35e69170 'int' sugar
|       |-TemplateTypeParmType 0x7f9d3537b060 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f9d3537b018 '_Tp'
|       `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d35e692f8 <line:1727:5, col:31> col:31 reference 'int &'
| `-LValueReferenceType 0x7f9d35e692c0 'int &'
|   `-SubstTemplateTypeParmType 0x7f9d35e69170 'int' sugar
|     |-TemplateTypeParmType 0x7f9d3537b060 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f9d3537b018 '_Tp'
|     `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d35e69388 <line:1728:5, col:31> col:31 const_reference 'const int &'
| `-LValueReferenceType 0x7f9d35e69350 'const int &'
|   `-QualType 0x7f9d35e69171 'const int' const
|     `-SubstTemplateTypeParmType 0x7f9d35e69170 'int' sugar
|       |-TemplateTypeParmType 0x7f9d3537b060 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f9d3537b018 '_Tp'
|       `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d35e693f0 <line:1729:5, col:31> col:31 referenced value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7f9d35e69170 'int' sugar
|   |-TemplateTypeParmType 0x7f9d3537b060 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9d3537b018 '_Tp'
|   `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d35e69448 <line:1731:5, col:23> col:23 referenced propagate_on_container_move_assignment 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7f9d35043340 'std::__1::true_type' sugar
|   |-Typedef 0x7f9d35040848 'true_type'
|   `-TemplateSpecializationType 0x7f9d35040330 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7f9d35040198 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7f9d35040180 <line:528:31> '_Bool' true
|     `-RecordType 0x7f9d35040310 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7f9d35040208 'integral_constant'
|-TypedefDecl 0x7f9d35e694a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1732:5, col:23> col:23 referenced is_always_equal 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7f9d35043340 'std::__1::true_type' sugar
|   |-Typedef 0x7f9d35040848 'true_type'
|   `-TemplateSpecializationType 0x7f9d35040330 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7f9d35040198 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7f9d35040180 <line:528:31> '_Bool' true
|     `-RecordType 0x7f9d35040310 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7f9d35040208 'integral_constant'
|-ClassTemplateDecl 0x7f9d35e69618 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1734:5, col:33> col:33 rebind
| |-TemplateTypeParmDecl 0x7f9d35e694f8 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXRecordDecl 0x7f9d35e69580 <col:26, col:33> col:33 struct rebind
|-CXXConstructorDecl 0x7f9d35e69868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1736:54> col:31 referenced allocator 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7f9d35e69948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9d35e69c60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:5, col:96> col:52 allocator
| |-TemplateTypeParmDecl 0x7f9d35e69990 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXConstructorDecl 0x7f9d35e69bb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:96> col:52 allocator 'void (const allocator<_Up> &) noexcept'
|   |-ParmVarDecl 0x7f9d35e69ad0 <col:62, col:82> col:83 'const allocator<_Up> &'
|   `-AlwaysInlineAttr 0x7f9d35e69cb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e69ee8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1739:39> line:1738:39 address 'std::__1::allocator<int>::pointer (std::__1::allocator<int>::reference) const noexcept'
| |-ParmVarDecl 0x7f9d35e69de0 <col:47, col:57> col:57 __x 'std::__1::allocator<int>::reference':'int &'
| `-AlwaysInlineAttr 0x7f9d35e69f98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e6a138 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1741:39> line:1740:45 address 'std::__1::allocator<int>::const_pointer (std::__1::allocator<int>::const_reference) const noexcept'
| |-ParmVarDecl 0x7f9d35e6a030 <col:53, col:69> col:69 __x 'std::__1::allocator<int>::const_reference':'const int &'
| `-AlwaysInlineAttr 0x7f9d35e6a1e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e6a3a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1748:9> line:1742:39 allocate 'std::__1::allocator<int>::pointer (std::__1::allocator::size_type, allocator<void>::const_pointer)'
| |-ParmVarDecl 0x7f9d35e6a230 <col:48, col:58> col:58 __n 'std::__1::allocator::size_type':'unsigned long'
| |-ParmVarDecl 0x7f9d35e6a290 <col:63, col:96> col:94 'allocator<void>::const_pointer':'const void *'
| `-AlwaysInlineAttr 0x7f9d35e6a458 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e6a628 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1750:49> line:1749:36 deallocate 'void (std::__1::allocator<int>::pointer, std::__1::allocator::size_type) noexcept'
| |-ParmVarDecl 0x7f9d35e6a4b0 <col:47, col:55> col:55 __p 'std::__1::allocator<int>::pointer':'int *'
| |-ParmVarDecl 0x7f9d35e6a510 <col:60> col:69 'std::__1::allocator::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f9d35e6a6e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e6a728 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1752:45> line:1751:41 max_size 'std::__1::allocator::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e6a7d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9d35e6abb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1754:5, line:1760:9> line:1757:9 construct
| |-TemplateTypeParmDecl 0x7f9d35e6a818 <line:1754:15, col:21> col:21 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7f9d35e6a888 <col:26, col:35> col:35 class depth 0 index 1 ... _Args
| `-CXXMethodDecl 0x7f9d35e6ab20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1760:9> line:1757:9 construct 'void (_Up *, _Args &&...)'
|   |-ParmVarDecl 0x7f9d35e6a958 <col:19, col:24> col:24 __p '_Up *'
|   |-ParmVarDecl 0x7f9d35e6aa48 <col:29, col:40> col:40 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7f9d35e6ac18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e6ae00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1814:70> col:36 destroy 'void (std::__1::allocator<int>::pointer)'
| |-ParmVarDecl 0x7f9d35e6acf8 <col:44, col:52> col:52 __p 'std::__1::allocator<int>::pointer':'int *'
| `-AlwaysInlineAttr 0x7f9d35e6aeb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7f9d35e81e98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28> col:28 implicit referenced ~allocator 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f9d35e9b348 <col:28> col:28 implicit constexpr allocator 'void (const class std::__1::allocator<int> &)' inline default trivial noexcept-unevaluated 0x7f9d35e9b348
| `-ParmVarDecl 0x7f9d35e9b430 <col:28> col:28 'const class std::__1::allocator<int> &'
`-CXXConstructorDecl 0x7f9d35e9b4c8 <col:28> col:28 implicit constexpr allocator 'void (class std::__1::allocator<int> &&)' inline default trivial noexcept-unevaluated 0x7f9d35e9b4c8
  `-ParmVarDecl 0x7f9d35e9b5f0 <col:28> col:28 'class std::__1::allocator<int> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9d35e805c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2069:1, line:2099:1> line:2070:8 struct __compressed_pair_elem definition
|-private 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-TemplateArgument integral 1
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7f9d35e80958 prev 0x7f9d35e805c0 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7f9d35e80a00 <line:2071:3, col:15> col:15 _ParamT 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7f9d35e80820 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7f9d353863b0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9d35386370 '_Tp'
|   `-RecordType 0x7f9d35e680b0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7f9d35e67fc8 'allocator'
|-TypedefDecl 0x7f9d35e80a98 <line:2072:3, col:16> col:16 referenced reference 'class std::__1::allocator<int> &'
| `-LValueReferenceType 0x7f9d35e80a60 'class std::__1::allocator<int> &'
|   `-SubstTemplateTypeParmType 0x7f9d35e80820 'class std::__1::allocator<int>' sugar
|     |-TemplateTypeParmType 0x7f9d353863b0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f9d35386370 '_Tp'
|     `-RecordType 0x7f9d35e680b0 'class std::__1::allocator<int>'
|       `-ClassTemplateSpecialization 0x7f9d35e67fc8 'allocator'
|-TypedefDecl 0x7f9d35e80b28 <line:2073:3, col:22> col:22 referenced const_reference 'const class std::__1::allocator<int> &'
| `-LValueReferenceType 0x7f9d35e80af0 'const class std::__1::allocator<int> &'
|   `-QualType 0x7f9d35e80821 'const class std::__1::allocator<int>' const
|     `-SubstTemplateTypeParmType 0x7f9d35e80820 'class std::__1::allocator<int>' sugar
|       |-TemplateTypeParmType 0x7f9d353863b0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f9d35386370 '_Tp'
|       `-RecordType 0x7f9d35e680b0 'class std::__1::allocator<int>'
|         `-ClassTemplateSpecialization 0x7f9d35e67fc8 'allocator'
|-TypedefDecl 0x7f9d35e80b90 <line:2074:3, col:15> col:15 __value_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7f9d35e80820 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7f9d353863b0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9d35386370 '_Tp'
|   `-RecordType 0x7f9d35e680b0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7f9d35e67fc8 'allocator'
|-CXXConstructorDecl 0x7f9d35e80c28 <line:2077:3, col:46> col:13 __compressed_pair_elem 'void (void)' default noexcept-unevaluated 0x7f9d35e80c28
|-FunctionTemplateDecl 0x7f9d35e81408 <line:2079:3, line:2084:48> line:2083:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7f9d35e80ce0 <line:2079:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7f9d35e80d48 <col:24, line:2081:6> line:2079:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<class allocator<int>, 1, true>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7f9d35e81360 <line:2082:3, line:2084:48> line:2083:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7f9d35e81278 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7f9d35e81a38 <line:2086:3, line:2090:79> line:2088:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7f9d35e814e8 <line:2086:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7f9d35e81558 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7f9d35e81990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2090:79> line:2088:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7f9d35e815d0 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f9d35e81738 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7f9d35e81888 <line:2089:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7f9d35e81ac8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e81c48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2097:3, col:47> col:13 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>::reference (void) noexcept'
|-CXXMethodDecl 0x7f9d35e81d98 <line:2098:3, col:59> col:19 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>::const_reference (void) const noexcept'
`-CXXDestructorDecl 0x7f9d35e9c778 <line:2070:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem.0" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem.0" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9d35e7d7e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2104:1, line:2201:1> line:2105:7 class __compressed_pair definition
|-private '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|-private '__compressed_pair_elem<class std::__1::allocator<int>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>'
|-TemplateArgument type 'int *'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x7f9d35e81fc0 prev 0x7f9d35e7d7e8 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7f9d35e82368 <line:2107:3, col:42> col:42 _Base1 '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
| `-TemplateSpecializationType 0x7f9d35e822c0 '__compressed_pair_elem<int *, 0>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'int *':'int *'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7f9d3538a000 <col:39> 'int' 0
|   `-RecordType 0x7f9d35e7e500 'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|     `-ClassTemplateSpecialization 0x7f9d35e7e3e0 '__compressed_pair_elem'
|-TypedefDecl 0x7f9d35e826c8 <line:2108:3, col:42> col:42 _Base2 '__compressed_pair_elem<class std::__1::allocator<int>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>'
| `-TemplateSpecializationType 0x7f9d35e82620 '__compressed_pair_elem<class std::__1::allocator<int>, 1>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7f9d3538a3a8 <col:39> 'int' 1
|   `-RecordType 0x7f9d35e806e0 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>'
|     `-ClassTemplateSpecialization 0x7f9d35e805c0 '__compressed_pair_elem'
|-StaticAssertDecl 0x7f9d35e82b48 <line:2114:3, line:2117:44> line:2114:3
| |-ParenExpr 0x7f9d35e82b28 <col:17, col:43> '_Bool'
| | `-UnaryOperator 0x7f9d35e82b08 <col:18, col:38> '_Bool' prefix '!'
| |   `-ImplicitCastExpr 0x7f9d35e82af0 <col:19, col:38> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7f9d35e82ab8 <col:19, col:38> 'const _Bool':'const _Bool' lvalue Var 0x7f9d35548bc8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f9d3538a8d8 <line:2115:5, line:2117:5> 'const char [179]' lvalue "__compressed_pair cannot be instantated when T1 and T2 are the same type; The current implementation is NOT ABI-compatible with the previous implementation for this configuration"
|-AccessSpecDecl 0x7f9d35e82b80 <line:2119:1, col:7> col:1 public
|-FunctionTemplateDecl 0x7f9d35e835c8 <line:2121:3, line:2128:34> col:13 __compressed_pair
| |-NonTypeTemplateParmDecl 0x7f9d35e82ba8 <line:2121:13, col:27> col:18 referenced '_Bool' depth 0 index 0 _Dummy
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7f9d3538aa20 <col:27> '_Bool' true
| |-TemplateTypeParmDecl 0x7f9d35e82c00 <line:2122:7, line:2125:10> line:2122:7 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<__dependent_type<is_default_constructible<int *>, _Dummy>::value && __dependent_type<is_default_constructible<class allocator<int> >, _Dummy>::value>::type'
| `-CXXConstructorDecl 0x7f9d35e83520 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2128:34> col:13 constexpr __compressed_pair 'void (void)'
|   `-AlwaysInlineAttr 0x7f9d35e83648 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9d35e83e68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2130:3, line:2135:51> line:2134:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f9d35e83718 <line:2130:13, col:19> col:19 class depth 0 index 0 _Tp
| |-NonTypeTemplateParmDecl 0x7f9d35e83c20 <col:24, line:2132:57> col:55 'typename enable_if<!is_same<typename decay<_Tp>::type, class __compressed_pair<int *, class allocator<int> > >::value, _Bool>::type' depth 0 index 1
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7f9d3538b940 <col:57> '_Bool' true
| `-CXXConstructorDecl 0x7f9d35e83dc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2135:51> line:2134:3 constexpr __compressed_pair 'void (_Tp &&)'
|   |-ParmVarDecl 0x7f9d35e83cd8 <col:21, col:27> col:27 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7f9d35e83ec0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9d35e84248 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2137:3, line:2140:51> line:2139:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f9d35e83f90 <line:2137:13, col:19> col:19 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7f9d35e841a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2140:51> line:2139:3 constexpr __compressed_pair 'void (struct std::__1::__second_tag, _Tp &&)'
|   |-ParmVarDecl 0x7f9d35e84010 <col:21> col:33 'struct std::__1::__second_tag'
|   |-ParmVarDecl 0x7f9d35e840a8 <col:35, col:41> col:41 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7f9d35e842a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9d35e846f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2142:3, line:2145:75> line:2144:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f9d35e84378 <line:2142:13, col:19> col:19 class depth 0 index 0 _U1
| |-TemplateTypeParmDecl 0x7f9d35e843e8 <col:24, col:30> col:30 class depth 0 index 1 _U2
| `-CXXConstructorDecl 0x7f9d35e84650 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 constexpr __compressed_pair 'void (_U1 &&, _U2 &&)'
|   |-ParmVarDecl 0x7f9d35e844b8 <col:21, col:27> col:27 __t1 '_U1 &&'
|   |-ParmVarDecl 0x7f9d35e84558 <col:33, col:39> col:39 __t2 '_U2 &&'
|   `-AlwaysInlineAttr 0x7f9d35e84758 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9d35e84db8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2147:3, line:2154:75> line:2149:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f9d35e84828 <line:2147:13, col:22> col:22 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7f9d35e84898 <col:30, col:39> col:39 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7f9d35e84d10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2154:75> line:2149:3 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7f9d35e84928 <col:21, col:43> col:43 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f9d35e84a98 <col:49, col:66> col:66 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7f9d35e84c08 <line:2150:21, col:38> col:38 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7f9d35e84e20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e84fe8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2175:3> line:2173:30 first 'typename _Base1::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7f9d35e85090 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e85198 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2180:3> line:2178:36 first 'typename _Base1::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e85240 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e85388 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2185:3> line:2183:30 second 'typename _Base2::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7f9d35e85430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e85538 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2190:3> line:2188:36 second 'typename _Base2::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e855e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e85780 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2200:3> line:2193:8 swap 'void (class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > &)' noexcept-uninstantiated 0x7f9d3538da48
| |-ParmVarDecl 0x7f9d35e85668 <col:13, col:32> col:32 __x 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7f9d35e85878 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
`-CXXDestructorDecl 0x7f9d35e9c5b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2105:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9d35e68518 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:322:1, line:411:1> line:323:7 class __vector_base definition
|-protected '__vector_base_common<true>':'class std::__1::__vector_base_common<true>'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x7f9d35e68780 prev 0x7f9d35e68518 <col:1, col:7> col:7 implicit class __vector_base
|-AccessSpecDecl 0x7f9d35e68818 <line:326:1, col:10> col:1 protected
|-TypedefDecl 0x7f9d35e68878 <line:327:5, col:54> col:54 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7f9d35e68840 'int' sugar
|   |-TemplateTypeParmType 0x7f9d35da6cb0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9d35da6c70 '_Tp'
|   `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d35e68908 <line:328:5, col:54> col:54 allocator_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7f9d35e688d0 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7f9d35da6d20 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f9d35da6cd8 '_Allocator'
|   `-RecordType 0x7f9d35e680b0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7f9d35e67fc8 'allocator'
|-TypedefDecl 0x7f9d35e68b18 <line:329:5, col:54> col:54 referenced __alloc_traits 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x7f9d35e68aa0 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type':'class std::__1::allocator<int>'
|   `-RecordType 0x7f9d35e68a80 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x7f9d35e68990 'allocator_traits'
|-TypedefDecl 0x7f9d35e68bf8 <line:330:5, col:54> col:54 referenced reference 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-LValueReferenceType 0x7f9d35e68bc0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|   `-TypedefType 0x7f9d35e68b70 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|     |-Typedef 0x7f9d35e68878 'value_type'
|     `-SubstTemplateTypeParmType 0x7f9d35e68840 'int' sugar
|       |-TemplateTypeParmType 0x7f9d35da6cb0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f9d35da6c70 '_Tp'
|       `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d35e68cb8 <line:331:5, col:54> col:54 referenced const_reference 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-LValueReferenceType 0x7f9d35e68c80 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|   `-QualType 0x7f9d35e68b71 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' const
|     `-TypedefType 0x7f9d35e68b70 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|       |-Typedef 0x7f9d35e68878 'value_type'
|       `-SubstTemplateTypeParmType 0x7f9d35e68840 'int' sugar
|         |-TemplateTypeParmType 0x7f9d35da6cb0 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7f9d35da6c70 '_Tp'
|         `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d35e7d310 <line:332:5, col:54> col:54 referenced size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7f9d35e7d2c0 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7f9d35e75a10 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x7f9d35e723a0 'size_type'
|     `-ElaboratedType 0x7f9d35e72350 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7f9d35e72330 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|         |-Typedef 0x7f9d35e722b0 'type'
|         `-ElaboratedType 0x7f9d35e72260 'typename class allocator<int>::size_type' sugar
|           `-TypedefType 0x7f9d35e71b40 'std::__1::allocator<int>::size_type' sugar
|             |-Typedef 0x7f9d35e690b8 'size_type'
|             `-TypedefType 0x7f9d35060010 'size_t' sugar
|               |-Typedef 0x7f9d348687b0 'size_t'
|               `-BuiltinType 0x7f9d34833680 'unsigned long'
|-TypedefDecl 0x7f9d35e7d3e0 <line:333:5, col:54> col:54 referenced difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7f9d35e7d390 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7f9d35e71860 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x7f9d35e717f0 'difference_type'
|     `-ElaboratedType 0x7f9d35e717a0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7f9d35e71780 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|         |-Typedef 0x7f9d35e71700 'type'
|         `-ElaboratedType 0x7f9d35e716b0 'typename class allocator<int>::difference_type' sugar
|           `-TypedefType 0x7f9d35e70f60 'std::__1::allocator<int>::difference_type' sugar
|             |-Typedef 0x7f9d35e69110 'difference_type'
|             `-TypedefType 0x7f9d350e0350 'ptrdiff_t' sugar
|               |-Typedef 0x7f9d34868740 'ptrdiff_t'
|               `-BuiltinType 0x7f9d348335e0 'long'
|-TypedefDecl 0x7f9d35e7d4b0 <line:334:5, col:54> col:54 referenced pointer 'typename __alloc_traits::pointer':'int *'
| `-ElaboratedType 0x7f9d35e7d460 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7f9d35e6c630 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x7f9d35e6c5c0 'pointer'
|     `-ElaboratedType 0x7f9d35e6c570 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7f9d35e6c550 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|         |-Typedef 0x7f9d35e6c4d0 'type'
|         `-ElaboratedType 0x7f9d35e6c480 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|           `-TypedefType 0x7f9d35e6c460 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x7f9d35e6c3e0 'type'
|             `-ElaboratedType 0x7f9d35e6c390 'typename class allocator<int>::pointer' sugar
|               `-TypedefType 0x7f9d35e69d90 'std::__1::allocator<int>::pointer' sugar
|                 |-Typedef 0x7f9d35e691d8 'pointer'
|                 `-PointerType 0x7f9d35e691a0 'int *'
|                   `-SubstTemplateTypeParmType 0x7f9d35e69170 'int' sugar
|                     |-TemplateTypeParmType 0x7f9d3537b060 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7f9d3537b018 '_Tp'
|                     `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d35e7d5a0 <line:335:5, col:54> col:54 referenced const_pointer 'typename __alloc_traits::const_pointer':'const int *'
| `-ElaboratedType 0x7f9d35e7d550 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7f9d35e7d530 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x7f9d35e6d3c0 'const_pointer'
|     `-ElaboratedType 0x7f9d35e6d370 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7f9d35e6d350 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|         |-Typedef 0x7f9d35e6d2d0 'type'
|         `-ElaboratedType 0x7f9d35e6d280 'typename class allocator<int>::const_pointer' sugar
|           `-TypedefType 0x7f9d35e69fe0 'std::__1::allocator<int>::const_pointer' sugar
|             |-Typedef 0x7f9d35e69268 'const_pointer'
|             `-PointerType 0x7f9d35e69230 'const int *'
|               `-QualType 0x7f9d35e69171 'const int' const
|                 `-SubstTemplateTypeParmType 0x7f9d35e69170 'int' sugar
|                   |-TemplateTypeParmType 0x7f9d3537b060 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7f9d3537b018 '_Tp'
|                   `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d35e7d630 <line:336:5, col:54> col:54 iterator 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
| `-TypedefType 0x7f9d35e7d600 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer' sugar
|   |-Typedef 0x7f9d35e7d4b0 'pointer'
|   `-ElaboratedType 0x7f9d35e7d460 'typename __alloc_traits::pointer' sugar
|     `-TypedefType 0x7f9d35e6c630 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|       |-Typedef 0x7f9d35e6c5c0 'pointer'
|       `-ElaboratedType 0x7f9d35e6c570 'typename __pointer_type<value_type, allocator_type>::type' sugar
|         `-TypedefType 0x7f9d35e6c550 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|           |-Typedef 0x7f9d35e6c4d0 'type'
|           `-ElaboratedType 0x7f9d35e6c480 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|             `-TypedefType 0x7f9d35e6c460 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|               |-Typedef 0x7f9d35e6c3e0 'type'
|               `-ElaboratedType 0x7f9d35e6c390 'typename class allocator<int>::pointer' sugar
|                 `-TypedefType 0x7f9d35e69d90 'std::__1::allocator<int>::pointer' sugar
|                   |-Typedef 0x7f9d35e691d8 'pointer'
|                   `-PointerType 0x7f9d35e691a0 'int *'
|                     `-SubstTemplateTypeParmType 0x7f9d35e69170 'int' sugar
|                       |-TemplateTypeParmType 0x7f9d3537b060 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7f9d3537b018 '_Tp'
|                       `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d35e7d6c0 <line:337:5, col:54> col:54 const_iterator 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer':'const int *'
| `-TypedefType 0x7f9d35e7d690 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer' sugar
|   |-Typedef 0x7f9d35e7d5a0 'const_pointer'
|   `-ElaboratedType 0x7f9d35e7d550 'typename __alloc_traits::const_pointer' sugar
|     `-TypedefType 0x7f9d35e7d530 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|       |-Typedef 0x7f9d35e6d3c0 'const_pointer'
|       `-ElaboratedType 0x7f9d35e6d370 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|         `-TypedefType 0x7f9d35e6d350 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|           |-Typedef 0x7f9d35e6d2d0 'type'
|           `-ElaboratedType 0x7f9d35e6d280 'typename class allocator<int>::const_pointer' sugar
|             `-TypedefType 0x7f9d35e69fe0 'std::__1::allocator<int>::const_pointer' sugar
|               |-Typedef 0x7f9d35e69268 'const_pointer'
|               `-PointerType 0x7f9d35e69230 'const int *'
|                 `-QualType 0x7f9d35e69171 'const int' const
|                   `-SubstTemplateTypeParmType 0x7f9d35e69170 'int' sugar
|                     |-TemplateTypeParmType 0x7f9d3537b060 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7f9d3537b018 '_Tp'
|                     `-BuiltinType 0x7f9d348335c0 'int'
|-FieldDecl 0x7f9d35e7d728 <line:339:5, col:53> col:53 __begin_ 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
|-FieldDecl 0x7f9d35e7d780 <line:340:5, col:53> col:53 __end_ 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
|-FieldDecl 0x7f9d35e858e0 <line:341:5, col:48> col:48 __end_cap_ '__compressed_pair<std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer, std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> >'
|-CXXMethodDecl 0x7f9d35e859b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:345:37> line:344:21 __alloc 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &(void) noexcept'
| `-AlwaysInlineAttr 0x7f9d35e85a88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e85b58 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:348:37> line:347:27 __alloc 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &(void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e85c00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e85cd8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:351:36> line:350:14 __end_cap 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer &(void) noexcept'
| `-AlwaysInlineAttr 0x7f9d35e85d80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e85e58 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:354:36> line:353:20 __end_cap 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer &(void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e85f00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9d35e85fb0 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:357:5 __vector_base 'void (void)' noexcept-uninstantiated 0x7f9d35da85f0
| `-AlwaysInlineAttr 0x7f9d35e860b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9d35e86230 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:359:70> col:31 __vector_base 'void (const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7f9d35e86108 <col:45, col:67> col:67 __a 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7f9d35e862f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7f9d35e86368 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:360:5, col:20> col:5 used ~__vector_base 'void (void) noexcept'
|-CXXMethodDecl 0x7f9d35e86418 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:363:57> col:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7f9d35e864c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e86588 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:366:64> line:365:15 capacity 'std::__1::__vector_base<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e86630 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e86758 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:369:10 __destruct_at_end 'void (std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x7f9d35e86688 <col:28, col:36> col:36 __new_last 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7f9d35e86808 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e86950 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:374:89> line:372:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &)'
| |-ParmVarDecl 0x7f9d35e86888 <col:30, col:51> col:51 __c 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7f9d35e86a00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e86ba0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:382:89> line:377:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &)' noexcept-uninstantiated 0x7f9d35da92e8
| |-ParmVarDecl 0x7f9d35e86a88 <col:30, col:45> col:45 __c 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7f9d35e86c98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7f9d35e86ce0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:383:1, col:8> col:1 private
|-CXXMethodDecl 0x7f9d35e86e90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:394:9> line:385:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::true_type)'
| |-ParmVarDecl 0x7f9d35e86d18 <col:30, col:51> col:51 __c 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7f9d35e86d78 <col:56> col:65 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7f9d35e86f48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e87110 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:398:10> line:397:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::false_type)'
| |-ParmVarDecl 0x7f9d35e86fa0 <col:30, col:49> col:50 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7f9d35e87000 <col:52> col:62 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7f9d35e871c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e873a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:405:9> line:401:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::true_type)' noexcept-uninstantiated 0x7f9d35db5178
| |-ParmVarDecl 0x7f9d35e87220 <col:30, col:45> col:45 __c 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7f9d35e87280 <col:50> col:59 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7f9d35e874b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
`-CXXMethodDecl 0x7f9d35e87688 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:410:10> line:408:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::false_type) noexcept'
  |-ParmVarDecl 0x7f9d35e87508 <col:30, col:43> col:44 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
  |-ParmVarDecl 0x7f9d35e87568 <col:46> col:56 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
  `-AlwaysInlineAttr 0x7f9d35e87740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__vector_base" = type { i32*, i32*, %"class.std::__1::__compressed_pair" }
  NonVirtualBaseLLVMType:%"class.std::__1::__vector_base" = type { i32*, i32*, %"class.std::__1::__compressed_pair" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9d35e68148 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:453:1, line:887:1> line:454:28 class vector definition
|-private '__vector_base<int, class std::__1::allocator<int> >':'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x7f9d35e877f8 prev 0x7f9d35e68148 <col:1, col:28> col:28 implicit class vector
|-AccessSpecDecl 0x7f9d35e87890 <line:457:1, col:8> col:1 private
|-TypedefDecl 0x7f9d35e87988 <line:458:5, col:54> col:54 __base '__vector_base<int, class std::__1::allocator<int> >':'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x7f9d35e878e0 '__vector_base<int, class std::__1::allocator<int> >' sugar __vector_base
|   |-TemplateArgument type 'int':'int'
|   |-TemplateArgument type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|   `-RecordType 0x7f9d35e68620 'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x7f9d35e68518 '__vector_base'
|-TypedefDecl 0x7f9d35e87a68 <line:459:5, col:54> col:54 __default_allocator_type 'allocator<int>':'class std::__1::allocator<int>'
| `-TemplateSpecializationType 0x7f9d35e879f0 'allocator<int>' sugar allocator
|   |-TemplateArgument type 'int':'int'
|   `-RecordType 0x7f9d35e680b0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7f9d35e67fc8 'allocator'
|-AccessSpecDecl 0x7f9d35e87ac0 <line:460:1, col:7> col:1 public
|-TypedefDecl 0x7f9d35e87af8 <line:461:5, col:54> col:54 __self 'class std::__1::vector<int, class std::__1::allocator<int> >'
| `-RecordType 0x7f9d35e68250 'class std::__1::vector<int, class std::__1::allocator<int> >'
|   `-ClassTemplateSpecialization 0x7f9d35e68148 'vector'
|-TypedefDecl 0x7f9d35e87b60 <line:462:5, col:54> col:54 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7f9d35e684a0 'int' sugar
|   |-TemplateTypeParmType 0x7f9d35db98f0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9d35db98b0 '_Tp'
|   `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d35e87bc8 <line:463:5, col:54> col:54 allocator_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7f9d35e684e0 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7f9d35db9960 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f9d35db9918 '_Allocator'
|   `-RecordType 0x7f9d35e680b0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7f9d35e67fc8 'allocator'
|-TypedefDecl 0x7f9d35e87cd0 <line:464:5, col:54> col:54 __alloc_traits 'typename __base::__alloc_traits':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-ElaboratedType 0x7f9d35e87c80 'typename __base::__alloc_traits' sugar
|   `-TypedefType 0x7f9d35e68d10 'std::__1::__vector_base<int, class std::__1::allocator<int> >::__alloc_traits' sugar
|     |-Typedef 0x7f9d35e68b18 '__alloc_traits'
|     `-TemplateSpecializationType 0x7f9d35e68aa0 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>' sugar allocator_traits
|       |-TemplateArgument type 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type':'class std::__1::allocator<int>'
|       `-RecordType 0x7f9d35e68a80 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|         `-ClassTemplateSpecialization 0x7f9d35e68990 'allocator_traits'
|-TypedefDecl 0x7f9d35e87dc0 <line:465:5, col:54> col:54 reference 'typename __base::reference':'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ElaboratedType 0x7f9d35e87d70 'typename __base::reference' sugar
|   `-TypedefType 0x7f9d35e87d50 'std::__1::__vector_base<int, class std::__1::allocator<int> >::reference' sugar
|     |-Typedef 0x7f9d35e68bf8 'reference'
|     `-LValueReferenceType 0x7f9d35e68bc0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|       `-TypedefType 0x7f9d35e68b70 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|         |-Typedef 0x7f9d35e68878 'value_type'
|         `-SubstTemplateTypeParmType 0x7f9d35e68840 'int' sugar
|           |-TemplateTypeParmType 0x7f9d35da6cb0 '_Tp' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x7f9d35da6c70 '_Tp'
|           `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d35e87eb0 <line:466:5, col:54> col:54 const_reference 'typename __base::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ElaboratedType 0x7f9d35e87e60 'typename __base::const_reference' sugar
|   `-TypedefType 0x7f9d35e87e40 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_reference' sugar
|     |-Typedef 0x7f9d35e68cb8 'const_reference'
|     `-LValueReferenceType 0x7f9d35e68c80 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|       `-QualType 0x7f9d35e68b71 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' const
|         `-TypedefType 0x7f9d35e68b70 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|           |-Typedef 0x7f9d35e68878 'value_type'
|           `-SubstTemplateTypeParmType 0x7f9d35e68840 'int' sugar
|             |-TemplateTypeParmType 0x7f9d35da6cb0 '_Tp' dependent depth 0 index 0
|             | `-TemplateTypeParm 0x7f9d35da6c70 '_Tp'
|             `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d35e87f80 <line:467:5, col:54> col:54 size_type 'typename __base::size_type':'unsigned long'
| `-ElaboratedType 0x7f9d35e87f30 'typename __base::size_type' sugar
|   `-TypedefType 0x7f9d35e86510 'std::__1::__vector_base<int, class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x7f9d35e7d310 'size_type'
|     `-ElaboratedType 0x7f9d35e7d2c0 'typename __alloc_traits::size_type' sugar
|       `-TypedefType 0x7f9d35e75a10 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|         |-Typedef 0x7f9d35e723a0 'size_type'
|         `-ElaboratedType 0x7f9d35e72350 'typename __size_type<allocator_type, difference_type>::type' sugar
|           `-TypedefType 0x7f9d35e72330 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|             |-Typedef 0x7f9d35e722b0 'type'
|             `-ElaboratedType 0x7f9d35e72260 'typename class allocator<int>::size_type' sugar
|               `-TypedefType 0x7f9d35e71b40 'std::__1::allocator<int>::size_type' sugar
|                 |-Typedef 0x7f9d35e690b8 'size_type'
|                 `-TypedefType 0x7f9d35060010 'size_t' sugar
|                   |-Typedef 0x7f9d348687b0 'size_t'
|                   `-BuiltinType 0x7f9d34833680 'unsigned long'
|-TypedefDecl 0x7f9d35e88070 <line:468:5, col:54> col:54 difference_type 'typename __base::difference_type':'long'
| `-ElaboratedType 0x7f9d35e88020 'typename __base::difference_type' sugar
|   `-TypedefType 0x7f9d35e88000 'std::__1::__vector_base<int, class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x7f9d35e7d3e0 'difference_type'
|     `-ElaboratedType 0x7f9d35e7d390 'typename __alloc_traits::difference_type' sugar
|       `-TypedefType 0x7f9d35e71860 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|         |-Typedef 0x7f9d35e717f0 'difference_type'
|         `-ElaboratedType 0x7f9d35e717a0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|           `-TypedefType 0x7f9d35e71780 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|             |-Typedef 0x7f9d35e71700 'type'
|             `-ElaboratedType 0x7f9d35e716b0 'typename class allocator<int>::difference_type' sugar
|               `-TypedefType 0x7f9d35e70f60 'std::__1::allocator<int>::difference_type' sugar
|                 |-Typedef 0x7f9d35e69110 'difference_type'
|                 `-TypedefType 0x7f9d350e0350 'ptrdiff_t' sugar
|                   |-Typedef 0x7f9d34868740 'ptrdiff_t'
|                   `-BuiltinType 0x7f9d348335e0 'long'
|-TypedefDecl 0x7f9d35e88140 <line:469:5, col:54> col:54 pointer 'typename __base::pointer':'int *'
| `-ElaboratedType 0x7f9d35e880f0 'typename __base::pointer' sugar
|   `-TypedefType 0x7f9d35e7d600 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x7f9d35e7d4b0 'pointer'
|     `-ElaboratedType 0x7f9d35e7d460 'typename __alloc_traits::pointer' sugar
|       `-TypedefType 0x7f9d35e6c630 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|         |-Typedef 0x7f9d35e6c5c0 'pointer'
|         `-ElaboratedType 0x7f9d35e6c570 'typename __pointer_type<value_type, allocator_type>::type' sugar
|           `-TypedefType 0x7f9d35e6c550 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|             |-Typedef 0x7f9d35e6c4d0 'type'
|             `-ElaboratedType 0x7f9d35e6c480 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|               `-TypedefType 0x7f9d35e6c460 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|                 |-Typedef 0x7f9d35e6c3e0 'type'
|                 `-ElaboratedType 0x7f9d35e6c390 'typename class allocator<int>::pointer' sugar
|                   `-TypedefType 0x7f9d35e69d90 'std::__1::allocator<int>::pointer' sugar
|                     |-Typedef 0x7f9d35e691d8 'pointer'
|                     `-PointerType 0x7f9d35e691a0 'int *'
|                       `-SubstTemplateTypeParmType 0x7f9d35e69170 'int' sugar
|                         |-TemplateTypeParmType 0x7f9d3537b060 '_Tp' dependent depth 0 index 0
|                         | `-TemplateTypeParm 0x7f9d3537b018 '_Tp'
|                         `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d35e88210 <line:470:5, col:54> col:54 const_pointer 'typename __base::const_pointer':'const int *'
| `-ElaboratedType 0x7f9d35e881c0 'typename __base::const_pointer' sugar
|   `-TypedefType 0x7f9d35e7d690 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x7f9d35e7d5a0 'const_pointer'
|     `-ElaboratedType 0x7f9d35e7d550 'typename __alloc_traits::const_pointer' sugar
|       `-TypedefType 0x7f9d35e7d530 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|         |-Typedef 0x7f9d35e6d3c0 'const_pointer'
|         `-ElaboratedType 0x7f9d35e6d370 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|           `-TypedefType 0x7f9d35e6d350 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x7f9d35e6d2d0 'type'
|             `-ElaboratedType 0x7f9d35e6d280 'typename class allocator<int>::const_pointer' sugar
|               `-TypedefType 0x7f9d35e69fe0 'std::__1::allocator<int>::const_pointer' sugar
|                 |-Typedef 0x7f9d35e69268 'const_pointer'
|                 `-PointerType 0x7f9d35e69230 'const int *'
|                   `-QualType 0x7f9d35e69171 'const int' const
|                     `-SubstTemplateTypeParmType 0x7f9d35e69170 'int' sugar
|                       |-TemplateTypeParmType 0x7f9d3537b060 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7f9d3537b018 '_Tp'
|                       `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d35e88428 <line:471:5, col:54> col:54 iterator '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::pointer>':'class std::__1::__wrap_iter<int *>'
| `-TemplateSpecializationType 0x7f9d35e883b0 '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|   `-RecordType 0x7f9d35e88390 'class std::__1::__wrap_iter<int *>'
|     `-ClassTemplateSpecialization 0x7f9d35e882a0 '__wrap_iter'
|-TypedefDecl 0x7f9d35e88638 <line:472:5, col:54> col:54 const_iterator '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::const_pointer>':'class std::__1::__wrap_iter<const int *>'
| `-TemplateSpecializationType 0x7f9d35e885c0 '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::const_pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::const_pointer':'const int *'
|   `-RecordType 0x7f9d35e885a0 'class std::__1::__wrap_iter<const int *>'
|     `-ClassTemplateSpecialization 0x7f9d35e884b0 '__wrap_iter'
|-TypedefDecl 0x7f9d35e88890 <line:473:5, col:55> col:55 reverse_iterator 'std::__1::reverse_iterator<iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<int *> >'
| `-ElaboratedType 0x7f9d35e88820 'std::__1::reverse_iterator<iterator>' sugar
|   `-TemplateSpecializationType 0x7f9d35e887d0 'reverse_iterator<std::__1::vector<int, class std::__1::allocator<int> >::iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::iterator':'class std::__1::__wrap_iter<int *>'
|     `-RecordType 0x7f9d35e887b0 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<int *> >'
|       `-ClassTemplateSpecialization 0x7f9d35e886c0 'reverse_iterator'
|-TypedefDecl 0x7f9d35e88af0 <line:474:5, col:55> col:55 const_reverse_iterator 'std::__1::reverse_iterator<const_iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const int *> >'
| `-ElaboratedType 0x7f9d35e88a80 'std::__1::reverse_iterator<const_iterator>' sugar
|   `-TemplateSpecializationType 0x7f9d35e88a30 'reverse_iterator<std::__1::vector<int, class std::__1::allocator<int> >::const_iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|     `-RecordType 0x7f9d35e88a10 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const int *> >'
|       `-ClassTemplateSpecialization 0x7f9d35e88920 'reverse_iterator'
|-StaticAssertDecl 0x7f9d35e8a478 <line:476:5, line:477:74> line:476:5
| |-ParenExpr 0x7f9d35e8a440 <col:19, col:83> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7f9d35e8a408 <col:20, col:78> 'const _Bool':'const _Bool' lvalue Var 0x7f9d355d9820 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f9d35dbb300 <line:477:19> 'const char [54]' lvalue "Allocator::value_type must be same type as value_type"
|-CXXConstructorDecl 0x7f9d35e8a518 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:485:9> line:480:5 used vector 'void (void) noexcept(is_nothrow_default_constructible<allocator_type>::value)'
| `-AlwaysInlineAttr 0x7f9d35e8a638 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9d35e8a7b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:497:5> line:486:40 vector 'void (const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)' noexcept-uninstantiated 0x7f9d35dbb678
| |-ParmVarDecl 0x7f9d35e8a6b8 <col:47, col:69> col:69 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7f9d35e8a8b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9d35e8aa10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:498:5, col:34> col:14 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7f9d35e8a930 <col:21, col:31> col:31 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXConstructorDecl 0x7f9d35e8ac80 <line:500:5, col:61> col:14 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7f9d35e8aae0 <col:21, col:31> col:31 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f9d35e8ab50 <col:36, col:58> col:58 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-CXXConstructorDecl 0x7f9d35e8af20 <line:502:5, col:46> col:5 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7f9d35e8ad58 <col:12, col:22> col:22 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f9d35e8adf0 <col:27, col:43> col:43 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXConstructorDecl 0x7f9d35e8b230 <line:503:5, col:73> col:5 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7f9d35e8aff8 <col:12, col:22> col:22 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f9d35e8b068 <col:27, col:43> col:43 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ParmVarDecl 0x7f9d35e8b0d8 <col:48, col:70> col:70 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-FunctionTemplateDecl 0x7f9d35e8bcc8 <line:504:5, line:511:62> line:505:9 vector
| |-TemplateTypeParmDecl 0x7f9d35e8b300 <line:504:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7f9d35e8bc20 <line:505:9, line:511:62> line:505:9 vector 'void (_InputIterator, typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, _InputIterator>::type)'
|   |-ParmVarDecl 0x7f9d35e8b390 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x7f9d35e8baf0 <line:506:16, line:511:56> col:56 __last 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, _InputIterator>::type'
|-FunctionTemplateDecl 0x7f9d35e8c838 <line:512:5, line:518:108> line:513:9 vector
| |-TemplateTypeParmDecl 0x7f9d35e8bdb0 <line:512:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7f9d35e8c790 <line:513:9, line:518:108> line:513:9 vector 'void (_InputIterator, _InputIterator, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &, typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value>::type *)'
|   |-ParmVarDecl 0x7f9d35e8be40 <col:16, col:31> col:31 __first '_InputIterator'
|   |-ParmVarDecl 0x7f9d35e8beb0 <col:40, col:55> col:55 __last '_InputIterator'
|   |-ParmVarDecl 0x7f9d35e8bf20 <col:63, col:85> col:85 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|   `-ParmVarDecl 0x7f9d35e8c630 <line:514:16, line:518:107> col:105 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value>::type *'
|-FunctionTemplateDecl 0x7f9d35e8d148 <line:519:5, line:525:64> line:520:9 vector
| |-TemplateTypeParmDecl 0x7f9d35e8c930 <line:519:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXConstructorDecl 0x7f9d35e8d0a0 <line:520:9, line:525:64> line:520:9 vector 'void (_ForwardIterator, typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, _ForwardIterator>::type)'
|   |-ParmVarDecl 0x7f9d35e8c9c0 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7f9d35e8cf70 <line:521:16, line:525:58> col:58 __last 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, _ForwardIterator>::type'
|-FunctionTemplateDecl 0x7f9d35e8db78 <line:526:5, line:531:110> line:527:9 vector
| |-TemplateTypeParmDecl 0x7f9d35e8d230 <line:526:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXConstructorDecl 0x7f9d35e8dad0 <line:527:9, line:531:110> line:527:9 vector 'void (_ForwardIterator, _ForwardIterator, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &, typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value>::type *)'
|   |-ParmVarDecl 0x7f9d35e8d2c0 <col:16, col:33> col:33 __first '_ForwardIterator'
|   |-ParmVarDecl 0x7f9d35e8d330 <col:42, col:59> col:59 __last '_ForwardIterator'
|   |-ParmVarDecl 0x7f9d35e8d3a0 <col:67, col:89> col:89 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|   `-ParmVarDecl 0x7f9d35e8d970 <line:528:16, line:531:109> col:107 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value>::type *'
|-CXXConstructorDecl 0x7f9d35e8dd90 <line:541:5, col:29> col:5 vector 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &)'
| `-ParmVarDecl 0x7f9d35e8dca8 <col:12, col:26> col:26 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
|-CXXConstructorDecl 0x7f9d35e8e000 <line:542:5, col:56> col:5 vector 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7f9d35e8de60 <col:12, col:26> col:26 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x7f9d35e8ded0 <col:31, col:53> col:53 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-CXXMethodDecl 0x7f9d35e8e1d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:544:40> col:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(const class std::__1::vector<int, class std::__1::allocator<int> > &)'
| |-ParmVarDecl 0x7f9d35e8e108 <col:23, col:37> col:37 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7f9d35e8e280 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9d35e8e580 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:548:45> col:5 vector 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7f9d35e8e458 <col:12, col:41> col:41 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7f9d35e8e640 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9d35e8e8c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:551:72> col:5 vector 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7f9d35e8e718 <col:12, col:41> col:41 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| |-ParmVarDecl 0x7f9d35e8e788 <col:47, col:69> col:69 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7f9d35e8e988 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9d35e8eb40 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:554:5 vector 'void (class std::__1::vector<int, class std::__1::allocator<int> > &&)' noexcept-uninstantiated 0x7f9d35dbf7c8
| |-ParmVarDecl 0x7f9d35e8ea08 <col:12, col:21> col:21 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| `-AlwaysInlineAttr 0x7f9d35e8ec48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9d35e8ee40 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:562:51> col:5 vector 'void (class std::__1::vector<int, class std::__1::allocator<int> > &&, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7f9d35e8eca0 <col:12, col:21> col:21 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| |-ParmVarDecl 0x7f9d35e8ed10 <col:26, col:48> col:48 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7f9d35e8ef08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e8f070 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:564:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(class std::__1::vector<int, class std::__1::allocator<int> > &&)' noexcept-uninstantiated 0x7f9d35dbfce8
| |-ParmVarDecl 0x7f9d35e8ef60 <col:23, col:32> col:32 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| `-AlwaysInlineAttr 0x7f9d35e8f168 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e8f340 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:569:57> line:568:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7f9d35e8f238 <col:23, col:52> col:52 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7f9d35e8f3f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9d35e8fca8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:573:5, line:583:61> col:9 assign
| |-TemplateTypeParmDecl 0x7f9d35e8f438 <line:573:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7f9d35e8fc10 <line:574:9, line:583:61> col:9 assign 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, void>::type (_InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x7f9d35e8fa80 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x7f9d35e8faf0 <col:40, col:55> col:55 __last '_InputIterator'
|-FunctionTemplateDecl 0x7f9d35e904b8 <line:584:5, line:593:65> col:9 assign
| |-TemplateTypeParmDecl 0x7f9d35e8fd90 <line:584:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7f9d35e90420 <line:585:9, line:593:65> col:9 assign 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, void>::type (_ForwardIterator, _ForwardIterator)'
|   |-ParmVarDecl 0x7f9d35e90290 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7f9d35e90300 <col:42, col:59> col:59 __last '_ForwardIterator'
|-CXXMethodDecl 0x7f9d35e906b0 <line:595:5, col:51> col:10 assign 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7f9d35e905b0 <col:17, col:27> col:27 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f9d35e90620 <col:32, col:48> col:48 __u 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7f9d35e908c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:600:43> line:599:10 assign 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7f9d35e907f8 <col:17, col:46> col:46 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7f9d35e90970 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e90a48 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:605:33> line:604:20 get_allocator 'std::__1::vector<int, class std::__1::allocator<int> >::allocator_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e90af0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e90bc8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:607:54 begin 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f9d35e90c70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e90d48 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:608:54 begin 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e90df0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e90e60 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:609:54 end 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f9d35e90f08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e90f78 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:610:54 end 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e91020 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e91118 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:614:47> line:613:28 rbegin 'std::__1::vector<int, class std::__1::allocator<int> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f9d35e911c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e912b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:617:47> line:616:28 rbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e91360 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e913d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:620:49> line:619:28 rend 'std::__1::vector<int, class std::__1::allocator<int> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f9d35e91478 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e914e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:623:49> line:622:28 rend 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e91590 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e91600 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:627:25> line:626:28 cbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e916a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e91718 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:630:23> line:629:28 cend 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e917c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e91830 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:633:26> line:632:28 crbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e918d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e91948 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:636:24> line:635:28 crend 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e919f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e91a98 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:640:71> line:639:15 size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e91b40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e91bb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:643:36> line:642:15 capacity 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e91c58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e91ca0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:646:48> line:645:10 empty '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e91d48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e91db8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:647:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:647:15 max_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
|-CXXMethodDecl 0x7f9d35e91ef8 <line:648:5, col:31> col:10 reserve 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7f9d35e91e70 <col:18, col:28> col:28 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f9d35e91fa8 <line:649:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:649:10 shrink_to_fit 'void (void) noexcept'
|-CXXMethodDecl 0x7f9d35e92180 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:651:71> col:47 operator[] 'std::__1::vector<int, class std::__1::allocator<int> >::reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| |-ParmVarDecl 0x7f9d35e92080 <col:58, col:68> col:68 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f9d35e92230 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e92390 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:652:73> col:47 operator[] 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7f9d35e92288 <col:58, col:68> col:68 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f9d35e92440 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e92520 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:653:5, col:37> col:21 at 'std::__1::vector<int, class std::__1::allocator<int> >::reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7f9d35e92498 <col:24, col:34> col:34 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f9d35e92668 <line:654:5, col:39> col:21 at 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| `-ParmVarDecl 0x7f9d35e925e0 <col:24, col:34> col:34 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f9d35e927a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:660:5> line:656:47 front 'std::__1::vector<int, class std::__1::allocator<int> >::reference (void)'
| `-AlwaysInlineAttr 0x7f9d35e92848 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e92910 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:665:5> line:661:47 front 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7f9d35e929b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e92a20 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:670:5> line:666:47 back 'std::__1::vector<int, class std::__1::allocator<int> >::reference (void)'
| `-AlwaysInlineAttr 0x7f9d35e92ac8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e92b30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:675:5> line:671:47 back 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7f9d35e92bd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e92ca8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:679:57> line:678:23 data 'std::__1::vector<int, class std::__1::allocator<int> >::value_type *(void) noexcept'
| `-AlwaysInlineAttr 0x7f9d35e92d50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e92e58 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:682:57> line:681:23 data 'const std::__1::vector<int, class std::__1::allocator<int> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e92f00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e93060 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:684:65> col:36 push_back 'void (std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7f9d35e92f58 <col:46, col:62> col:62 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-AlwaysInlineAttr 0x7f9d35e93110 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e932d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:687:62> col:36 push_back 'void (std::__1::vector<int, class std::__1::allocator<int> >::value_type &&)'
| |-ParmVarDecl 0x7f9d35e931c8 <col:46, col:59> col:59 __x 'std::__1::vector<int, class std::__1::allocator<int> >::value_type &&'
| `-AlwaysInlineAttr 0x7f9d35e93380 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9d35e93638 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:689:5, line:694:49> col:19 emplace_back
| |-TemplateTypeParmDecl 0x7f9d35e933c8 <line:689:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x7f9d35e935a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:694:49> col:19 emplace_back 'void (_Args &&...)'
|   |-ParmVarDecl 0x7f9d35e934d8 <col:32, col:43> col:43 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7f9d35e93690 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f9d35e93760 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:699:19> col:10 pop_back 'void (void)'
| `-AlwaysInlineAttr 0x7f9d35e93808 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7f9d35e939e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:701:5, col:67> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7f9d35e93860 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x7f9d35e938d0 <col:48, col:64> col:64 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7f9d35e93c30 <line:704:5, col:64> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::value_type &&)'
| |-ParmVarDecl 0x7f9d35e93aa8 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x7f9d35e93b18 <col:48, col:61> col:61 __x 'std::__1::vector<int, class std::__1::allocator<int> >::value_type &&'
|-FunctionTemplateDecl 0x7f9d35e94018 <line:705:5, line:706:70> col:18 emplace
| |-TemplateTypeParmDecl 0x7f9d35e93ce8 <line:705:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x7f9d35e93f80 <line:706:9, col:70> col:18 emplace 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _Args &&...)'
|   |-ParmVarDecl 0x7f9d35e93d80 <col:26, col:41> col:41 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   `-ParmVarDecl 0x7f9d35e93e68 <col:53, col:64> col:64 __args '_Args &&...'
|-CXXMethodDecl 0x7f9d35e94320 <line:709:5, col:82> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7f9d35e94110 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| |-ParmVarDecl 0x7f9d35e94180 <col:48, col:58> col:58 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f9d35e941f0 <col:63, col:79> col:79 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-FunctionTemplateDecl 0x7f9d35e94d98 <line:710:5, line:720:88> col:9 insert
| |-TemplateTypeParmDecl 0x7f9d35e943e0 <line:710:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7f9d35e94d00 <line:711:9, line:720:88> col:9 insert 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, iterator>::type (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x7f9d35e94ae0 <col:16, col:31> col:31 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   |-ParmVarDecl 0x7f9d35e94b50 <col:43, col:58> col:58 __first '_InputIterator'
|   `-ParmVarDecl 0x7f9d35e94bc0 <col:67, col:82> col:82 __last '_InputIterator'
|-FunctionTemplateDecl 0x7f9d35e95708 <line:721:5, line:730:92> col:9 insert
| |-TemplateTypeParmDecl 0x7f9d35e94e88 <line:721:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7f9d35e95670 <line:722:9, line:730:92> col:9 insert 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, iterator>::type (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _ForwardIterator, _ForwardIterator)'
|   |-ParmVarDecl 0x7f9d35e95450 <col:16, col:31> col:31 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   |-ParmVarDecl 0x7f9d35e954c0 <col:43, col:60> col:60 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7f9d35e95530 <col:69, col:86> col:86 __last '_ForwardIterator'
|-CXXMethodDecl 0x7f9d35e95a10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:735:62> line:734:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7f9d35e95808 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| |-ParmVarDecl 0x7f9d35e958f8 <col:48, col:77> col:77 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7f9d35e95ac8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e95c20 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:738:71> col:40 erase 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator)'
| |-ParmVarDecl 0x7f9d35e95b20 <col:46, col:61> col:61 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-AlwaysInlineAttr 0x7f9d35e95cd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e95eb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:739:5, col:65> col:14 erase 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::const_iterator)'
| |-ParmVarDecl 0x7f9d35e95d28 <col:20, col:35> col:35 __first 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x7f9d35e95d98 <col:44, col:59> col:59 __last 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|-CXXMethodDecl 0x7f9d35e95f68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:748:5> line:742:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7f9d35e96010 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e960f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:750:5, col:31> col:10 resize 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7f9d35e96068 <col:17, col:27> col:27 __sz 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f9d35e962b0 <line:751:5, col:52> col:10 resize 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7f9d35e961b0 <col:17, col:27> col:27 __sz 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f9d35e96220 <col:33, col:49> col:49 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7f9d35e96488 <line:753:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:753:10 swap 'void (class std::__1::vector<int, class std::__1::allocator<int> > &) noexcept'
| `-ParmVarDecl 0x7f9d35e96378 <col:15, col:21> col:22 'class std::__1::vector<int, class std::__1::allocator<int> > &'
|-CXXMethodDecl 0x7f9d35e96538 <line:761:5, col:25> col:10 __invariants '_Bool (void) const'
|-AccessSpecDecl 0x7f9d35e965e0 <line:772:1, col:8> col:1 private
|-CXXMethodDecl 0x7f9d35e96608 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:773:63> col:36 __invalidate_all_iterators 'void (void)'
| `-AlwaysInlineAttr 0x7f9d35e966b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e967d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:774:82> col:36 __invalidate_iterators_past 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x7f9d35e96708 <col:64, col:72> col:72 __new_last 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7f9d35e96880 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e96960 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:775:5, col:32> col:10 allocate 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7f9d35e968d8 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f9d35e96a10 <line:776:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:776:10 deallocate 'void (void) noexcept'
|-CXXMethodDecl 0x7f9d35e96b90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:777:75> col:41 __recommend 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7f9d35e96ac8 <col:53, col:63> col:63 __new_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f9d35e96c40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e96d20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:778:5, col:42> col:10 __construct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7f9d35e96c98 <col:29, col:39> col:39 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f9d35e96ee0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:780:63> col:10 __construct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7f9d35e96de0 <col:29, col:39> col:39 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7f9d35e96e50 <col:44, col:60> col:60 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-AlwaysInlineAttr 0x7f9d35e96f98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-FunctionTemplateDecl 0x7f9d35e97518 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:781:5, line:787:92> col:9 __construct_at_end
| |-TemplateTypeParmDecl 0x7f9d35e96fe0 <line:781:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7f9d35e97480 <line:782:9, line:787:92> col:9 __construct_at_end 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value, void>::type (_ForwardIterator, _ForwardIterator, std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
|   |-ParmVarDecl 0x7f9d35e97260 <col:28, col:45> col:45 __first '_ForwardIterator'
|   |-ParmVarDecl 0x7f9d35e972d0 <col:54, col:71> col:71 __last '_ForwardIterator'
|   `-ParmVarDecl 0x7f9d35e97340 <col:79, col:89> col:89 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f9d35e976a0 <line:788:5, col:32> col:10 __append 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7f9d35e97618 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7f9d35e97860 <line:789:5, col:53> col:10 __append 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7f9d35e97760 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7f9d35e977d0 <col:34, col:50> col:50 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7f9d35e97a38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:791:20 __make_iter 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x7f9d35e97928 <col:32, col:40> col:40 __p 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7f9d35e97ae8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e97c48 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:793:20 __make_iter 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_pointer) const noexcept'
| |-ParmVarDecl 0x7f9d35e97b40 <col:32, col:46> col:46 __p 'std::__1::vector<int, class std::__1::allocator<int> >::const_pointer':'const int *'
| `-AlwaysInlineAttr 0x7f9d35e97cf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e980c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:794:5, col:85> col:10 __swap_out_circular_buffer 'void (__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &)'
| `-ParmVarDecl 0x7f9d35e97fb8 <col:37, col:82> col:82 __v '__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &'
|-CXXMethodDecl 0x7f9d35e983f0 <line:795:5, col:101> col:13 __swap_out_circular_buffer 'std::__1::vector<int, class std::__1::allocator<int> >::pointer (__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &, std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x7f9d35e98268 <col:40, col:85> col:85 __v '__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &'
| `-ParmVarDecl 0x7f9d35e982d8 <col:90, col:98> col:98 __p 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|-CXXMethodDecl 0x7f9d35e986d0 <line:796:5, col:71> col:10 __move_range 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer, std::__1::vector<int, class std::__1::allocator<int> >::pointer, std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x7f9d35e984b8 <col:23, col:31> col:31 __from_s 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| |-ParmVarDecl 0x7f9d35e98528 <col:41, col:49> col:49 __from_e 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-ParmVarDecl 0x7f9d35e98598 <col:59, col:67> col:67 __to 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|-CXXMethodDecl 0x7f9d35e98920 <line:797:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:797:10 __move_assign 'void (class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::true_type)' noexcept-uninstantiated 0x7f9d35dc9bd8
| |-ParmVarDecl 0x7f9d35e987a0 <col:24, col:32> col:32 __c 'class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x7f9d35e98800 <col:37> col:46 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
|-CXXMethodDecl 0x7f9d35e98bc0 <line:799:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:799:10 __move_assign 'void (class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::false_type)' noexcept-uninstantiated 0x7f9d35dc9e18
| |-ParmVarDecl 0x7f9d35e98a40 <col:24, col:32> col:32 __c 'class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x7f9d35e98aa0 <col:37> col:47 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
|-CXXMethodDecl 0x7f9d35e98da8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:808:5> line:802:10 __destruct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x7f9d35e98ce0 <col:28, col:36> col:36 __new_last 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7f9d35e98e58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9d35e990b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:811:5, col:62> col:31 __push_back_slow_path
| |-TemplateTypeParmDecl 0x7f9d35e98ea0 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXMethodDecl 0x7f9d35e99020 <col:26, col:62> col:31 __push_back_slow_path 'void (_Up &&)'
|   `-ParmVarDecl 0x7f9d35e98f58 <col:53, col:59> col:59 __x '_Up &&'
|-FunctionTemplateDecl 0x7f9d35e99408 <line:813:5, line:814:52> col:10 __emplace_back_slow_path
| |-TemplateTypeParmDecl 0x7f9d35e99198 <line:813:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x7f9d35e99370 <line:814:5, col:52> col:10 __emplace_back_slow_path 'void (_Args &&...)'
|   `-ParmVarDecl 0x7f9d35e992a8 <col:35, col:46> col:46 __args '_Args &&...'
|-CXXMethodDecl 0x7f9d35e996a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:835:62> line:834:10 __annotate_contiguous_container 'void (const void *, const void *, const void *, const void *) const'
| |-ParmVarDecl 0x7f9d35e994e8 <col:42, col:52> col:53 'const void *'
| |-ParmVarDecl 0x7f9d35e99548 <col:55, col:65> col:66 'const void *'
| |-ParmVarDecl 0x7f9d35e995a8 <col:68, col:78> col:79 'const void *'
| |-ParmVarDecl 0x7f9d35e99608 <line:835:42, col:52> col:53 'const void *'
| `-AlwaysInlineAttr 0x7f9d35e99770 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e998d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:841:5> line:838:10 __annotate_new 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7f9d35e997c8 <col:25, col:35> col:35 __current_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f9d35e99980 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e999c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:847:5> line:844:10 __annotate_delete 'void (void) const'
| `-AlwaysInlineAttr 0x7f9d35e99a70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e99b50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:854:5> line:850:10 __annotate_increase 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7f9d35e99ac8 <col:30, col:40> col:40 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f9d35e99c00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e99ce0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:861:5> line:857:10 __annotate_shrink 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7f9d35e99c58 <col:28, col:38> col:38 __old_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7f9d35e99d90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXRecordDecl 0x7f9d35e99dd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:880:5, col:12> col:12 struct __RAII_IncreaseAnnotator
`-CXXDestructorDecl 0x7f9d35e99ec0 <line:454:28> col:28 implicit used ~vector 'void (void) noexcept' inline default
  `-CompoundStmt 0x7f9d35e9c858 <col:28>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::vector" = type { %"class.std::__1::__vector_base" }
  NonVirtualBaseLLVMType:%"class.std::__1::vector" = type { %"class.std::__1::__vector_base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__atomic_base<_Bool, false>
         0 |   _Atomic(_Bool) __a_
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::atomic<_Bool>
         0 |   struct std::__1::__atomic_base<_Bool, false> (base)
         0 |     _Atomic(_Bool) __a_
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9d35e9e4f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:890:1, line:993:1> line:891:8 struct __atomic_base definition
|-TemplateArgument type '_Bool'
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7f9d35e9e730 prev 0x7f9d35e9e4f8 <col:1, col:8> col:8 implicit struct __atomic_base
|-FieldDecl 0x7f9d35e9e810 <line:893:5, col:26> col:26 __a_ '_Atomic(_Bool)' mutable
|-CXXMethodDecl 0x7f9d35e9e858 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:907:5> line:900:10 is_lock_free '_Bool (void) const volatile noexcept'
| `-AlwaysInlineAttr 0x7f9d35e9e928 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e9e970 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:910:82> line:909:10 is_lock_free '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35e9ea18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35e9ebe8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:914:46> line:912:10 store 'void (_Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7f9d35e9ea70 <col:16, col:20> col:20 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9d35e9ead0 <col:25, col:44> col:38 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7f9d35e9eca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7f9d35e9fc80 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7f9d35e9ebe8 'store' 'void (_Bool, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7f9d35e9fc58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:913:40, line:566:35> '_Bool' '||'
|     |-BinaryOperator 0x7f9d35e9f718 <line:913:40, line:565:35> '_Bool' '||'
|     | |-BinaryOperator 0x7f9d35e9f1d8 <line:913:40, line:564:35> '_Bool' '=='
|     | | |-ImplicitCastExpr 0x7f9d35e9f1a8 <line:913:40> 'int' <IntegralCast>
|     | | | `-ImplicitCastExpr 0x7f9d35e9f190 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | | |   `-DeclRefExpr 0x7f9d35e9ece8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9d35e9ead0 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | | `-ImplicitCastExpr 0x7f9d35e9f1c0 <line:564:35> 'int' <IntegralCast>
|     | |   `-DeclRefExpr 0x7f9d351748d8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9d3516ad38 'memory_order_consume' 'enum std::__1::memory_order'
|     | `-BinaryOperator 0x7f9d35e9f6f0 <line:913:40, line:565:35> '_Bool' '=='
|     |   |-ImplicitCastExpr 0x7f9d35e9f6c0 <line:913:40> 'int' <IntegralCast>
|     |   | `-ImplicitCastExpr 0x7f9d35e9f6a8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     |   |   `-DeclRefExpr 0x7f9d35e9f200 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9d35e9ead0 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     |   `-ImplicitCastExpr 0x7f9d35e9f6d8 <line:565:35> 'int' <IntegralCast>
|     |     `-DeclRefExpr 0x7f9d35174998 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9d3516ad80 'memory_order_acquire' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7f9d35e9fc30 <line:913:40, line:566:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7f9d35e9fc00 <line:913:40> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7f9d35e9fbe8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7f9d35e9f740 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9d35e9ead0 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7f9d35e9fc18 <line:566:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7f9d35174a80 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9d3516ae10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7f9d35e9fe78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:918:46> line:916:10 store 'void (_Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7f9d35e9fd00 <col:16, col:20> col:20 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9d35e9fd60 <col:25, col:44> col:38 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7f9d35e9ff30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7f9d35ea0f10 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7f9d35e9fe78 'store' 'void (_Bool, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7f9d35ea0ee8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:917:40, line:566:35> '_Bool' '||'
|     |-BinaryOperator 0x7f9d35ea09a8 <line:917:40, line:565:35> '_Bool' '||'
|     | |-BinaryOperator 0x7f9d35ea0468 <line:917:40, line:564:35> '_Bool' '=='
|     | | |-ImplicitCastExpr 0x7f9d35ea0438 <line:917:40> 'int' <IntegralCast>
|     | | | `-ImplicitCastExpr 0x7f9d35ea0420 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | | |   `-DeclRefExpr 0x7f9d35e9ff78 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9d35e9fd60 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | | `-ImplicitCastExpr 0x7f9d35ea0450 <line:564:35> 'int' <IntegralCast>
|     | |   `-DeclRefExpr 0x7f9d35174ce0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9d3516ad38 'memory_order_consume' 'enum std::__1::memory_order'
|     | `-BinaryOperator 0x7f9d35ea0980 <line:917:40, line:565:35> '_Bool' '=='
|     |   |-ImplicitCastExpr 0x7f9d35ea0950 <line:917:40> 'int' <IntegralCast>
|     |   | `-ImplicitCastExpr 0x7f9d35ea0938 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     |   |   `-DeclRefExpr 0x7f9d35ea0490 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9d35e9fd60 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     |   `-ImplicitCastExpr 0x7f9d35ea0968 <line:565:35> 'int' <IntegralCast>
|     |     `-DeclRefExpr 0x7f9d35174da0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9d3516ad80 'memory_order_acquire' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7f9d35ea0ec0 <line:917:40, line:566:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7f9d35ea0e90 <line:917:40> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7f9d35ea0e78 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7f9d35ea09d0 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9d35e9fd60 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7f9d35ea0ea8 <line:566:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7f9d35174e88 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9d3516ae10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7f9d35ea1088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:922:47> line:920:9 load '_Bool (std::__1::memory_order) const volatile noexcept'
| |-ParmVarDecl 0x7f9d35ea0f80 <col:14, col:33> col:27 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7f9d35ea1138 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7f9d35ea1bd8 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7f9d35ea1088 'load' '_Bool (std::__1::memory_order) const volatile noexcept'
|   `-BinaryOperator 0x7f9d35ea1bb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:921:39, line:571:35> '_Bool' '||'
|     |-BinaryOperator 0x7f9d35ea1670 <line:921:39, line:570:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7f9d35ea1640 <line:921:39> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7f9d35ea1628 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7f9d35ea1180 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9d35ea0f80 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7f9d35ea1658 <line:570:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7f9d35175070 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9d3516adc8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7f9d35ea1b88 <line:921:39, line:571:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7f9d35ea1b58 <line:921:39> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7f9d35ea1b40 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7f9d35ea1698 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9d35ea0f80 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7f9d35ea1b70 <line:571:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7f9d35175130 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9d3516ae10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7f9d35ea1d58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:926:47> line:924:9 load '_Bool (std::__1::memory_order) const noexcept'
| |-ParmVarDecl 0x7f9d35ea1c48 <col:14, col:33> col:27 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7f9d35ea1e08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7f9d35ea28a8 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7f9d35ea1d58 'load' '_Bool (std::__1::memory_order) const noexcept'
|   `-BinaryOperator 0x7f9d35ea2880 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:925:39, line:571:35> '_Bool' '||'
|     |-BinaryOperator 0x7f9d35ea2340 <line:925:39, line:570:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7f9d35ea2310 <line:925:39> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7f9d35ea22f8 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7f9d35ea1e50 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9d35ea1c48 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7f9d35ea2328 <line:570:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7f9d35175318 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9d3516adc8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7f9d35ea2858 <line:925:39, line:571:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7f9d35ea2828 <line:925:39> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7f9d35ea2810 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7f9d35ea2368 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9d35ea1c48 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7f9d35ea2840 <line:571:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7f9d351753d8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9d3516ae10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXConversionDecl 0x7f9d35ea2988 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:928:60> col:5 operator bool '_Bool (void) const volatile noexcept'
| `-AlwaysInlineAttr 0x7f9d35ea2a30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConversionDecl 0x7f9d35ea2ae8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:930:60> col:5 operator bool '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d35ea2b90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35ea2d78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:933:56> line:932:9 exchange '_Bool (_Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7f9d35ea2bf8 <col:18, col:22> col:22 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9d35ea2c58 <col:27, col:46> col:40 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7f9d35ea2e30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35ea3008 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:936:56> line:935:9 exchange '_Bool (_Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7f9d35ea2e88 <col:18, col:22> col:22 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9d35ea2ee8 <col:27, col:46> col:40 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7f9d35ea30c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35ea33c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:941:80> line:938:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7f9d35ea3148 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7f9d35ea31b8 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9d35ea3218 <line:939:32, col:45> col:45 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7f9d35ea3278 <col:50, col:63> col:63 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7f9d35ea3490 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7f9d35ea3f30 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7f9d35ea33c8 'compare_exchange_weak' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7f9d35ea3f08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:940:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7f9d35ea39c8 <line:940:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7f9d35ea3998 <line:940:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7f9d35ea3980 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7f9d35ea34d8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9d35ea3278 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7f9d35ea39b0 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7f9d3517c5c0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9d3516adc8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7f9d35ea3ee0 <line:940:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7f9d35ea3eb0 <line:940:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7f9d35ea3e98 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7f9d35ea39f0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9d35ea3278 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7f9d35ea3ec8 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7f9d3517c680 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9d3516ae10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7f9d35ea4228 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:946:80> line:943:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7f9d35ea3fb0 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7f9d35ea4020 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9d35ea4080 <line:944:32, col:45> col:45 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7f9d35ea40e0 <col:50, col:63> col:63 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7f9d35ea42f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7f9d35ea4d90 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7f9d35ea4228 'compare_exchange_weak' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7f9d35ea4d68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:945:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7f9d35ea4828 <line:945:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7f9d35ea47f8 <line:945:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7f9d35ea47e0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7f9d35ea4338 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9d35ea40e0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7f9d35ea4810 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7f9d3517c868 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9d3516adc8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7f9d35ea4d40 <line:945:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7f9d35ea4d10 <line:945:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7f9d35ea4cf8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7f9d35ea4850 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9d35ea40e0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7f9d35ea4d28 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7f9d3517c928 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9d3516ae10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7f9d35ea4fe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:951:82> line:948:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7f9d35ea4e10 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7f9d35ea4e80 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9d35ea4ee0 <line:949:34, col:47> col:47 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7f9d35ea4f40 <col:52, col:65> col:65 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7f9d35ea50b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7f9d35ea5b50 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7f9d35ea4fe8 'compare_exchange_strong' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7f9d35ea5b28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:950:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7f9d35ea55e8 <line:950:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7f9d35ea55b8 <line:950:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7f9d35ea55a0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7f9d35ea50f8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9d35ea4f40 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7f9d35ea55d0 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7f9d3517cb10 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9d3516adc8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7f9d35ea5b00 <line:950:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7f9d35ea5ad0 <line:950:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7f9d35ea5ab8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7f9d35ea5610 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9d35ea4f40 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7f9d35ea5ae8 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7f9d3517cbd0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9d3516ae10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7f9d35ea5da8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:956:82> line:953:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7f9d35ea5bd0 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7f9d35ea5c40 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9d35ea5ca0 <line:954:34, col:47> col:47 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7f9d35ea5d00 <col:52, col:65> col:65 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7f9d35ea5e70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7f9d35ea6910 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7f9d35ea5da8 'compare_exchange_strong' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7f9d35ea68e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:955:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7f9d35ea63a8 <line:955:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7f9d35ea6378 <line:955:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7f9d35ea6360 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7f9d35ea5eb8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9d35ea5d00 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7f9d35ea6390 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7f9d3517cdb8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9d3516adc8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7f9d35ea68c0 <line:955:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7f9d35ea6890 <line:955:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7f9d35ea6878 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7f9d35ea63d0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7f9d35ea5d00 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7f9d35ea68a8 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7f9d3517ce78 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7f9d3516ae10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7f9d35ea6b98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:960:80> line:958:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7f9d35ea6990 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7f9d35ea6a00 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9d35ea6a60 <line:959:31, col:50> col:44 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7f9d35ea6c58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35ea6eb8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:964:80> line:962:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7f9d35ea6cb0 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7f9d35ea6d20 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9d35ea6d80 <line:963:32, col:51> col:45 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7f9d35ea6f78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35ea7140 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:968:82> line:966:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7f9d35ea6fd0 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7f9d35ea7040 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9d35ea70a0 <line:967:31, col:50> col:44 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7f9d35ea7200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35ea73c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:972:82> line:970:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7f9d35ea7258 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7f9d35ea72c8 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7f9d35ea7328 <line:971:34, col:53> col:47 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7f9d35ea7488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9d35ea7510 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:976:39> col:5 __atomic_base 'void (void) noexcept' default trivial
| `-AlwaysInlineAttr 0x7f9d35ea75c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9d35ea7708 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:982:69> col:23 used constexpr __atomic_base 'void (_Bool) noexcept'
| |-ParmVarDecl 0x7f9d35ea7620 <col:37, col:41> col:41 used __d '_Bool':'_Bool'
| |-CXXCtorInitializer Field 0x7f9d35e9e810 '__a_' '_Atomic(_Bool)'
| | `-ImplicitCastExpr 0x7f9d35ea9228 <col:63> '_Atomic(_Bool)' <NonAtomicToAtomic>
| |   `-ImplicitCastExpr 0x7f9d35ea9210 <col:63> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7f9d35ea91b8 <col:63> '_Bool':'_Bool' lvalue ParmVar 0x7f9d35ea7620 '__d' '_Bool':'_Bool'
| |-CompoundStmt 0x7f9d351763d8 <col:68, col:69>
| `-AlwaysInlineAttr 0x7f9d35ea77c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9d35ea7930 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:984:5, col:48> col:5 __atomic_base 'void (const struct std::__1::__atomic_base<_Bool, false> &)' delete trivial
| `-ParmVarDecl 0x7f9d35ea7848 <col:19, col:38> col:39 'const struct std::__1::__atomic_base<_Bool, false> &'
|-CXXMethodDecl 0x7f9d35ea7af0 <line:985:5, col:59> col:20 operator= 'struct std::__1::__atomic_base<_Bool, false> &(const struct std::__1::__atomic_base<_Bool, false> &)' delete trivial
| `-ParmVarDecl 0x7f9d35ea7a28 <col:30, col:49> col:50 'const struct std::__1::__atomic_base<_Bool, false> &'
|-CXXMethodDecl 0x7f9d35ea7c70 <line:986:5, col:68> col:20 operator= 'struct std::__1::__atomic_base<_Bool, false> &(const struct std::__1::__atomic_base<_Bool, false> &) volatile' delete trivial
| `-ParmVarDecl 0x7f9d35ea7bb0 <col:30, col:49> col:50 'const struct std::__1::__atomic_base<_Bool, false> &'
`-CXXDestructorDecl 0x7f9d35ea9038 <line:891:8> col:8 implicit ~__atomic_base 'void (void)' inline default trivial noexcept-unevaluated 0x7f9d35ea9038

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__atomic_base" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__atomic_base" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9d351916a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1083:1, line:1099:1> line:1084:8 struct atomic definition
|-public '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>'
|-TemplateArgument type '_Bool'
|-CXXRecordDecl 0x7f9d35ea7da8 prev 0x7f9d351916a8 <col:1, col:8> col:8 implicit struct atomic
|-TypedefDecl 0x7f9d35ea8148 <line:1087:5, col:32> col:32 __base '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>'
| `-TemplateSpecializationType 0x7f9d35ea80d0 '__atomic_base<_Bool>' sugar __atomic_base
|   |-TemplateArgument type '_Bool':'_Bool'
|   `-RecordType 0x7f9d35e9e600 'struct std::__1::__atomic_base<_Bool, false>'
|     `-ClassTemplateSpecialization 0x7f9d35e9e4f8 '__atomic_base'
|-CXXConstructorDecl 0x7f9d35ea81e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:818:33> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1089:5 atomic 'void (void)' default trivial noexcept-unevaluated 0x7f9d35ea81e0
| `-AlwaysInlineAttr 0x7f9d35ea82c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9d35ea8408 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1091:64> col:23 used constexpr atomic 'void (_Bool) noexcept'
| |-ParmVarDecl 0x7f9d35ea8320 <col:30, col:34> col:34 used __d '_Bool':'_Bool'
| |-CXXCtorInitializer 'std::__1::atomic<_Bool>::__base':'struct std::__1::__atomic_base<_Bool, false>'
| | `-CXXConstructExpr 0x7f9d35ea9270 <col:51, col:61> '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>' 'void (_Bool) noexcept'
| |   `-ImplicitCastExpr 0x7f9d35ea91a0 <col:58> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7f9d35ea9118 <col:58> '_Bool':'_Bool' lvalue ParmVar 0x7f9d35ea8320 '__d' '_Bool':'_Bool'
| |-CompoundStmt 0x7f9d350deb00 <col:63, col:64>
| `-AlwaysInlineAttr 0x7f9d35ea84c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35ea8628 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1095:41> line:1094:9 operator= '_Bool (_Bool) volatile noexcept'
| |-ParmVarDecl 0x7f9d35ea8520 <col:19, col:23> col:23 __d '_Bool':'_Bool'
| `-AlwaysInlineAttr 0x7f9d35ea86d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35ea8838 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1098:41> line:1097:9 operator= '_Bool (_Bool) noexcept'
| |-ParmVarDecl 0x7f9d35ea8730 <col:19, col:23> col:23 __d '_Bool':'_Bool'
| `-AlwaysInlineAttr 0x7f9d35ea88e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9d35ea8958 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1084:8> col:8 implicit atomic 'void (const struct std::__1::atomic<_Bool> &)' inline default_delete trivial noexcept-unevaluated 0x7f9d35ea8958
| `-ParmVarDecl 0x7f9d35ea8a80 <col:8> col:8 'const struct std::__1::atomic<_Bool> &'
|-CXXConstructorDecl 0x7f9d35ea8b18 <col:8> col:8 implicit atomic 'void (struct std::__1::atomic<_Bool> &&)' inline default_delete trivial noexcept-unevaluated 0x7f9d35ea8b18
| `-ParmVarDecl 0x7f9d35ea8c40 <col:8> col:8 'struct std::__1::atomic<_Bool> &&'
|-CXXMethodDecl 0x7f9d35ea8cd8 <col:8, <invalid sloc>> col:8 implicit operator= 'struct std::__1::atomic<_Bool> &(const struct std::__1::atomic<_Bool> &)' inline default_delete trivial noexcept-unevaluated 0x7f9d35ea8cd8
| `-ParmVarDecl 0x7f9d35ea8df0 <col:8> col:8 'const struct std::__1::atomic<_Bool> &'
`-CXXMethodDecl 0x7f9d35ea8e58 <col:8, <invalid sloc>> col:8 implicit operator= 'struct std::__1::atomic<_Bool> &(struct std::__1::atomic<_Bool> &&)' inline default_delete trivial noexcept-unevaluated 0x7f9d35ea8e58
  `-ParmVarDecl 0x7f9d35ea8f70 <col:8> col:8 'struct std::__1::atomic<_Bool> &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::atomic" = type { %"struct.std::__1::__atomic_base" }
  NonVirtualBaseLLVMType:%"struct.std::__1::atomic" = type { %"struct.std::__1::__atomic_base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::thread
         0 |   std::__1::__libcpp_thread_t __t_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_t
         0 |   long __sig
         8 |   struct __darwin_pthread_handler_rec * __cleanup_stack
        16 |   char [8176] __opaque
           | [sizeof=8192, dsize=8192, align=8,
           |  nvsize=8192, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __darwin_pthread_handler_rec
         0 |   void (*)(void *) __routine
         8 |   void * __arg
        16 |   struct __darwin_pthread_handler_rec * __next
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9d35020d60 </usr/include/sys/_pthread/_pthread_types.h:57:1, line:61:1> line:57:8 struct __darwin_pthread_handler_rec definition
|-CXXRecordDecl 0x7f9d35020e88 <col:1, col:8> col:8 implicit struct __darwin_pthread_handler_rec
|-FieldDecl 0x7f9d350210d0 <line:58:2, col:26> col:9 __routine 'void (*)(void *)'
|-FieldDecl 0x7f9d35021130 <line:59:2, col:8> col:8 __arg 'void *'
`-FieldDecl 0x7f9d35021200 <line:60:2, col:39> col:39 __next 'struct __darwin_pthread_handler_rec *'

Layout: <CGRecordLayout
  LLVMType:%struct.__darwin_pthread_handler_rec = type { void (i8*)*, i8*, %struct.__darwin_pthread_handler_rec* }
  NonVirtualBaseLLVMType:%struct.__darwin_pthread_handler_rec = type { void (i8*)*, i8*, %struct.__darwin_pthread_handler_rec* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9d35026660 </usr/include/sys/_pthread/_pthread_types.h:103:1, line:107:1> line:103:8 struct _opaque_pthread_t definition
|-CXXRecordDecl 0x7f9d35026788 <col:1, col:8> col:8 implicit struct _opaque_pthread_t
|-FieldDecl 0x7f9d35026838 <line:104:2, col:7> col:7 __sig 'long'
|-FieldDecl 0x7f9d350268a8 <line:105:2, col:40> col:40 __cleanup_stack 'struct __darwin_pthread_handler_rec *'
`-FieldDecl 0x7f9d35026968 <line:106:2, col:32> col:7 __opaque 'char [8176]'

Layout: <CGRecordLayout
  LLVMType:%struct._opaque_pthread_t = type { i64, %struct.__darwin_pthread_handler_rec*, [8176 x i8] }
  NonVirtualBaseLLVMType:%struct._opaque_pthread_t = type { i64, %struct.__darwin_pthread_handler_rec*, [8176 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9d35779458 prev 0x7f9d357719f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:285:1, line:333:1> line:285:24 referenced class thread definition
|-VisibilityAttr 0x7f9d35779558 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7f9d357795a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:285:1, col:24> col:24 implicit referenced class thread
|-FieldDecl 0x7f9d35779648 <line:287:5, col:23> col:23 referenced __t_ 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
|-CXXConstructorDecl 0x7f9d357797e0 <line:289:5, col:25> col:5 thread 'void (const class std::__1::thread &)'
| `-ParmVarDecl 0x7f9d357796c8 <col:12, col:24> col:25 'const class std::__1::thread &'
|-CXXMethodDecl 0x7f9d35779990 <line:290:5, col:36> col:13 operator= 'class std::__1::thread &(const class std::__1::thread &)'
| `-ParmVarDecl 0x7f9d357798a0 <col:23, col:35> col:36 'const class std::__1::thread &'
|-AccessSpecDecl 0x7f9d35779a30 <line:291:1, col:7> col:1 public
|-TypedefDecl 0x7f9d35779a68 <line:292:5, col:25> col:25 referenced id 'class std::__1::__thread_id'
| `-RecordType 0x7f9d3576f630 'class std::__1::__thread_id'
|   `-CXXRecord 0x7f9d3576fac8 '__thread_id'
|-TypedefDecl 0x7f9d35779ad0 <line:293:5, col:31> col:31 referenced native_handle_type 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| `-TypedefType 0x7f9d356ef5b0 'std::__1::__libcpp_thread_t' sugar
|   |-Typedef 0x7f9d356ece80 '__libcpp_thread_t'
|   `-TypedefType 0x7f9d356af970 'pthread_t' sugar
|     |-Typedef 0x7f9d356adfb0 'pthread_t'
|     `-TypedefType 0x7f9d356adf80 '__darwin_pthread_t' sugar
|       |-Typedef 0x7f9d35028080 '__darwin_pthread_t'
|       `-PointerType 0x7f9d35028030 'struct _opaque_pthread_t *'
|         `-ElaboratedType 0x7f9d35026fc0 'struct _opaque_pthread_t' sugar
|           `-RecordType 0x7f9d35026700 'struct _opaque_pthread_t'
|             `-CXXRecord 0x7f9d35026660 '_opaque_pthread_t'
|-CXXConstructorDecl 0x7f9d35779b80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:296:53> col:5 thread 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7f9d35779648 '__t_' 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| | `-ImplicitCastExpr 0x7f9d3577b608 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__threading_support:73:29> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <NullToPointer>
| |   `-IntegerLiteral 0x7f9d3577b5b8 <col:29> 'unsigned int' 0
| |-CompoundStmt 0x7f9d3577b650 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:296:52, col:53>
| |-AlwaysInlineAttr 0x7f9d35779c28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9d35779c70 <col:51, col:74> Hidden
|-FunctionTemplateDecl 0x7f9d3577a598 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:298:5, line:305:53> col:18 thread
| |-TemplateTypeParmDecl 0x7f9d35779c80 <line:298:15, col:21> col:21 referenced class depth 0 index 0 _Fp
| |-TemplateTypeParmDecl 0x7f9d35779ce8 <col:26, col:35> col:35 referenced class depth 0 index 1 ... _Args
| |-TemplateTypeParmDecl 0x7f9d3577a200 <line:299:15, line:302:18> line:299:15 class depth 0 index 2
| | `-TemplateArgument type 'typename enable_if<!is_same<typename decay<_Fp>::type, class thread>::value>::type'
| |-CXXConstructorDecl 0x7f9d3577a4f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:305:53> col:18 thread 'void (_Fp &&, _Args &&...)' inline
| | |-ParmVarDecl 0x7f9d3577a2f8 <col:25, col:31> col:31 __f '_Fp &&'
| | |-ParmVarDecl 0x7f9d3577a3d8 <col:36, col:47> col:47 __args '_Args &&...'
| | `-VisibilityAttr 0x7f9d3577a5f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:644:40, col:63> Hidden
| `-CXXConstructorDecl 0x7f9d35eb8710 parent 0x7f9d35779458 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:359:1, line:373:1> line:359:9 used thread 'void (void (&&)(void))'
|   |-TemplateArgument type 'void (&)(void)'
|   |-TemplateArgument pack
|   |-TemplateArgument type 'void'
|   `-ParmVarDecl 0x7f9d35eb8608 <col:16, col:19> col:22 __f 'void (&&)(void)'
|-CXXDestructorDecl 0x7f9d3577a690 <line:311:5, col:13> col:5 used ~thread 'void (void) noexcept'
|-CXXConstructorDecl 0x7f9d3577a8a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:315:85> col:5 thread 'void (class std::__1::thread &&) noexcept'
| |-ParmVarDecl 0x7f9d3577a798 <col:12, col:21> col:21 used __t 'class std::__1::thread &&'
| |-CXXCtorInitializer Field 0x7f9d35779648 '__t_' 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| | `-ImplicitCastExpr 0x7f9d3577b6f8 <col:43, col:47> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <LValueToRValue>
| |   `-MemberExpr 0x7f9d3577b690 <col:43, col:47> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue .__t_ 0x7f9d35779648
| |     `-DeclRefExpr 0x7f9d3577b668 <col:43> 'class std::__1::thread' lvalue ParmVar 0x7f9d3577a798 '__t' 'class std::__1::thread &&'
| |-CompoundStmt 0x7f9d3577b800 <col:53, col:85>
| | `-BinaryOperator 0x7f9d3577b7d8 <col:54, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__threading_support:73:29> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue '='
| |   |-MemberExpr 0x7f9d3577b768 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:315:54, col:58> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue .__t_ 0x7f9d35779648
| |   | `-DeclRefExpr 0x7f9d3577b740 <col:54> 'class std::__1::thread' lvalue ParmVar 0x7f9d3577a798 '__t' 'class std::__1::thread &&'
| |   `-ImplicitCastExpr 0x7f9d3577b7c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__threading_support:73:29> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <NullToPointer>
| |     `-IntegerLiteral 0x7f9d3577b7a0 <col:29> 'unsigned int' 0
| |-AlwaysInlineAttr 0x7f9d3577a958 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9d3577a9a0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9d3577aaf8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:317:13 operator= 'class std::__1::thread &(class std::__1::thread &&) noexcept'
| |-ParmVarDecl 0x7f9d3577a9f0 <col:23, col:32> col:32 __t 'class std::__1::thread &&'
| |-AlwaysInlineAttr 0x7f9d3577ab98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9d3577abe0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9d3577ad38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:67> col:10 used swap 'void (class std::__1::thread &) noexcept'
| |-ParmVarDecl 0x7f9d3577ac30 <col:15, col:23> col:23 used __t 'class std::__1::thread &'
| |-CompoundStmt 0x7f9d357898f8 <col:38, col:67>
| | `-CallExpr 0x7f9d357898c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:65> 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type':'void'
| |   |-ImplicitCastExpr 0x7f9d357898a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:46> 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type (*)(struct _opaque_pthread_t *&, struct _opaque_pthread_t *&) noexcept(is_nothrow_move_constructible<struct _opaque_pthread_t *>::value && is_nothrow_move_assignable<struct _opaque_pthread_t *>::value)' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7f9d35789808 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:46> 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type (struct _opaque_pthread_t *&, struct _opaque_pthread_t *&) noexcept(is_nothrow_move_constructible<struct _opaque_pthread_t *>::value && is_nothrow_move_assignable<struct _opaque_pthread_t *>::value)' lvalue Function 0x7f9d35786010 'swap' 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type (struct _opaque_pthread_t *&, struct _opaque_pthread_t *&) noexcept(is_nothrow_move_constructible<struct _opaque_pthread_t *>::value && is_nothrow_move_assignable<struct _opaque_pthread_t *>::value)' (FunctionTemplate 0x7f9d35159ab8 'swap')
| |   |-MemberExpr 0x7f9d3577b940 <col:51> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue ->__t_ 0x7f9d35779648
| |   | `-CXXThisExpr 0x7f9d3577b928 <col:51> 'class std::__1::thread *' this
| |   `-MemberExpr 0x7f9d3577b9a0 <col:57, col:61> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue .__t_ 0x7f9d35779648
| |     `-DeclRefExpr 0x7f9d3577b978 <col:57> 'class std::__1::thread' lvalue ParmVar 0x7f9d3577ac30 '__t' 'class std::__1::thread &'
| |-AlwaysInlineAttr 0x7f9d3577add8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9d3577ae20 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9d3577aeb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:324:76> col:10 joinable '_Bool (void) const noexcept'
| |-CompoundStmt 0x7f9d35789ae8 <col:37, col:76>
| | `-ReturnStmt 0x7f9d35789ad0 <col:38, col:74>
| |   `-UnaryOperator 0x7f9d35789ab0 <col:45, col:74> '_Bool' prefix '!'
| |     `-CallExpr 0x7f9d35789a80 <col:46, col:74> '_Bool'
| |       |-ImplicitCastExpr 0x7f9d35789a68 <col:46> '_Bool (*)(const std::__1::__libcpp_thread_t *)' <FunctionToPointerDecay>
| |       | `-DeclRefExpr 0x7f9d357899e0 <col:46> '_Bool (const std::__1::__libcpp_thread_t *)' lvalue Function 0x7f9d356f5cd0 '__libcpp_thread_isnull' '_Bool (const std::__1::__libcpp_thread_t *)'
| |       `-UnaryOperator 0x7f9d357899c0 <col:69, col:70> 'const std::__1::__libcpp_thread_t *' prefix '&'
| |         `-MemberExpr 0x7f9d35789988 <col:70> 'const std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *const' lvalue ->__t_ 0x7f9d35779648
| |           `-CXXThisExpr 0x7f9d35789970 <col:70> 'const class std::__1::thread *' this
| |-AlwaysInlineAttr 0x7f9d3577af48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9d3577af90 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9d3577afc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:325:5, col:15> col:10 used join 'void (void)'
|-CXXMethodDecl 0x7f9d3577b078 <line:326:5, col:17> col:10 detach 'void (void)'
|-CXXMethodDecl 0x7f9d3577b1e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:328:71> col:8 get_id 'std::__1::thread::id (void) const noexcept'
| |-CompoundStmt 0x7f9d35789d70 <col:33, col:71>
| | `-ReturnStmt 0x7f9d35789d58 <col:34, col:69>
| |   `-ExprWithCleanups 0x7f9d35789d40 <col:34, col:69> 'std::__1::thread::id':'class std::__1::__thread_id'
| |     `-CXXConstructExpr 0x7f9d35789d08 <col:34, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' 'void (class std::__1::__thread_id &&) noexcept' elidable
| |       `-MaterializeTemporaryExpr 0x7f9d35789cf0 <col:41, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' xvalue
| |         `-ImplicitCastExpr 0x7f9d35789cd8 <col:41, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' <ConstructorConversion>
| |           `-CXXConstructExpr 0x7f9d35789ca0 <col:41, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' 'void (std::__1::__libcpp_thread_id)'
| |             `-CallExpr 0x7f9d35789c70 <col:41, col:69> 'std::__1::__libcpp_thread_id':'struct _opaque_pthread_t *'
| |               |-ImplicitCastExpr 0x7f9d35789c58 <col:41> 'std::__1::__libcpp_thread_id (*)(const std::__1::__libcpp_thread_t *)' <FunctionToPointerDecay>
| |               | `-DeclRefExpr 0x7f9d35789bd0 <col:41> 'std::__1::__libcpp_thread_id (const std::__1::__libcpp_thread_t *)' lvalue Function 0x7f9d356f6788 '__libcpp_thread_get_id' 'std::__1::__libcpp_thread_id (const std::__1::__libcpp_thread_t *)'
| |               `-UnaryOperator 0x7f9d35789bb0 <col:64, col:65> 'const std::__1::__libcpp_thread_t *' prefix '&'
| |                 `-MemberExpr 0x7f9d35789b78 <col:65> 'const std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *const' lvalue ->__t_ 0x7f9d35779648
| |                   `-CXXThisExpr 0x7f9d35789b60 <col:65> 'const class std::__1::thread *' this
| |-AlwaysInlineAttr 0x7f9d3577b280 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9d3577b2c8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f9d3577b388 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:330:63> col:24 native_handle 'std::__1::thread::native_handle_type (void) noexcept'
| |-CompoundStmt 0x7f9d35789e10 <col:50, col:63>
| | `-ReturnStmt 0x7f9d35789df8 <col:51, col:58>
| |   `-ImplicitCastExpr 0x7f9d35789de0 <col:58> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <LValueToRValue>
| |     `-MemberExpr 0x7f9d35789da8 <col:58> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue ->__t_ 0x7f9d35779648
| |       `-CXXThisExpr 0x7f9d35789d90 <col:58> 'class std::__1::thread *' this
| |-AlwaysInlineAttr 0x7f9d3577b420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7f9d3577b468 <col:51, col:74> Hidden
`-CXXMethodDecl 0x7f9d3577b4e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:332:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:332:21 hardware_concurrency 'unsigned int (void) noexcept' static

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::thread" = type { %struct._opaque_pthread_t* }
  NonVirtualBaseLLVMType:%"class.std::__1::thread" = type { %struct._opaque_pthread_t* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1225:9)
         0 |   struct std::__1::_PairT __t
         0 |     size_t first
         8 |     size_t second
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__murmur2_or_cityhash<unsigned long, 64> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1190:9)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1208:9)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1303:9)
         0 |   struct _opaque_pthread_t * __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |       union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __l
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __s
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw __r
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__rep
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __l
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |     struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __s
         0 |       union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw __r
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__split_buffer_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>
         0 |   class std::__1::allocator<int> & __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>
         0 |   struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
         0 |     int * __value_
         8 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> (base)
         8 |     class std::__1::allocator<int> & __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__split_buffer<int, class std::__1::allocator<int> &>
         0 |   class std::__1::__split_buffer_common<true> (base) (empty)
         0 |   std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer __first_
         8 |   std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer __begin_
        16 |   std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer __end_
        24 |   class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> __end_cap_
        24 |     struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
        24 |       int * __value_
        32 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> (base)
        32 |       class std::__1::allocator<int> & __value_
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false>
         0 |   class std::__1::__thread_struct * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::default_delete<class std::__1::__thread_struct> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (empty)
         0 |   struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> >
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |     class std::__1::__thread_struct * __value_
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |     struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >
         0 |   class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |       class std::__1::__thread_struct * __value_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |       struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__tuple_leaf<0, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, false>
         0 |   class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> > __value_
         0 |     class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |       struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |         class std::__1::__thread_struct * __value_
         0 |       struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |         struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__tuple_leaf<1, void (*)(void), false>
         0 |   void (*)(void) __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__tuple_impl<struct std::__1::__tuple_indices<0, 1>, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)>
         0 |   class std::__1::__tuple_leaf<0, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, false> (base)
         0 |     class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> > __value_
         0 |       class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |         struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |           class std::__1::__thread_struct * __value_
         0 |         struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |           struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
         8 |   class std::__1::__tuple_leaf<1, void (*)(void), false> (base)
         8 |     void (*)(void) __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)>
         0 |   struct std::__1::__tuple_impl<struct std::__1::__tuple_indices<0, 1>, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> __base_
         0 |     class std::__1::__tuple_leaf<0, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, false> (base)
         0 |       class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> > __value_
         0 |         class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |           struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |             class std::__1::__thread_struct * __value_
         0 |           struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |             struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
         8 |     class std::__1::__tuple_leaf<1, void (*)(void), false> (base)
         8 |       void (*)(void) __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> >, 1, true> (empty)
         0 |   struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> *, 0, false>
         0 |   class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> *, struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > >
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> *, 0, false> (base)
         0 |     class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> * __value_
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> >, 1, true> (base) (empty)
         0 |     struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::integral_constant<_Bool, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9d35040208 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:503:1, line:515:1> line:504:29 struct integral_constant definition
|-TemplateArgument type '_Bool'
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7f9d350433d8 prev 0x7f9d35040208 <col:1, col:29> col:29 implicit struct integral_constant
|-VarDecl 0x7f9d35043480 <line:506:5, col:53> col:45 used value 'const _Bool':'const _Bool' static constexpr cinit
| `-SubstNonTypeTemplateParmExpr 0x7f9d35043508 <col:53> '_Bool'
|   `-CXXBoolLiteralExpr 0x7f9d350434f0 <col:53> '_Bool' true
|-TypedefDecl 0x7f9d35043598 <line:507:5, col:31> col:31 value_type '_Bool':'_Bool'
| `-SubstTemplateTypeParmType 0x7f9d350401d0 '_Bool' sugar
|   |-TemplateTypeParmType 0x7f9d3503f200 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9d3503f1c0 '_Tp'
|   `-BuiltinType 0x7f9d34833540 '_Bool'
|-TypedefDecl 0x7f9d35043600 <line:508:5, col:31> col:31 referenced type 'struct std::__1::integral_constant<_Bool, true>'
| `-RecordType 0x7f9d35040310 'struct std::__1::integral_constant<_Bool, true>'
|   `-ClassTemplateSpecialization 0x7f9d35040208 'integral_constant'
|-CXXConversionDecl 0x7f9d350436e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:510:79> col:27 constexpr operator bool 'std::__1::integral_constant<_Bool, true>::value_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d350437b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d35043830 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:513:75> col:31 constexpr operator() 'std::__1::integral_constant<_Bool, true>::value_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d350438d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9d3535f690 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:504:29> col:29 implicit referenced constexpr integral_constant 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f9d3535f7a8 <col:29> col:29 implicit constexpr integral_constant 'void (const struct std::__1::integral_constant<_Bool, true> &)' inline default trivial noexcept-unevaluated 0x7f9d3535f7a8
| `-ParmVarDecl 0x7f9d3535f8d0 <col:29> col:29 'const struct std::__1::integral_constant<_Bool, true> &'
|-CXXConstructorDecl 0x7f9d3535f968 <col:29> col:29 implicit used constexpr integral_constant 'void (struct std::__1::integral_constant<_Bool, true> &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7f9d3535fa90 <col:29> col:29 'struct std::__1::integral_constant<_Bool, true> &&'
| `-CompoundStmt 0x7f9d35f45808 <col:29>
`-CXXDestructorDecl 0x7f9d3535fb80 <col:29> col:29 implicit referenced ~integral_constant 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::integral_constant" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::integral_constant" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> (empty)
         0 |   struct std::__1::integral_constant<_Bool, true> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9d38071be8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1366:1, line:1374:1> line:1367:8 struct __has_destroy definition
|-public 'integral_constant<_Bool, is_same<decltype(__has_destroy_test(declval<class allocator<int> >(), declval<int *>())), true_type>::value>':'struct std::__1::integral_constant<_Bool, true>'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-TemplateArgument type 'int *'
|-CXXRecordDecl 0x7f9d38074ad8 prev 0x7f9d38071be8 <col:1, col:8> col:8 implicit struct __has_destroy
|-CXXConstructorDecl 0x7f9d38074bb0 <col:8> col:8 implicit referenced constexpr __has_destroy 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f9d38074cc8 <col:8> col:8 implicit constexpr __has_destroy 'void (const struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &)' inline default trivial noexcept-unevaluated 0x7f9d38074cc8
| `-ParmVarDecl 0x7f9d38074df0 <col:8> col:8 'const struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &'
|-CXXConstructorDecl 0x7f9d38074e88 <col:8> col:8 implicit constexpr __has_destroy 'void (struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &&)' inline default trivial noexcept-unevaluated 0x7f9d38074e88
| `-ParmVarDecl 0x7f9d38074fb0 <col:8> col:8 'struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &&'
`-CXXDestructorDecl 0x7f9d38075050 <col:8> col:8 implicit referenced ~__has_destroy 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__has_destroy" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__has_destroy" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f9d35e99dd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:880:5, line:884:5> line:880:12 struct __RAII_IncreaseAnnotator definition
|-CXXRecordDecl 0x7f9d38076f50 prev 0x7f9d35e99dd8 <col:5, col:12> col:12 implicit struct __RAII_IncreaseAnnotator
|-CXXConstructorDecl 0x7f9d380771c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:882:64> col:7 used __RAII_IncreaseAnnotator 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| |-ParmVarDecl 0x7f9d38076ff8 <col:32, col:45> col:46 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7f9d38077068 <col:48, col:60> col:58 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7f9d380777a0 <col:60> 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7f9d35dcc1f8 <col:60> 'int' 1
| |-CompoundStmt 0x7f9d35dd0a68 <col:63, col:64>
| `-AlwaysInlineAttr 0x7f9d380772b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d38077300 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:883:48> col:38 used __done 'void (void)'
| |-CompoundStmt 0x7f9d35dd0a80 <col:47, col:48>
| `-AlwaysInlineAttr 0x7f9d380773a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9d38077438 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:880:12> col:12 implicit constexpr __RAII_IncreaseAnnotator 'void (const struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &)' inline default trivial noexcept-unevaluated 0x7f9d38077438
| `-ParmVarDecl 0x7f9d38077560 <col:12> col:12 'const struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &'
`-CXXConstructorDecl 0x7f9d380775f8 <col:12> col:12 implicit constexpr __RAII_IncreaseAnnotator 'void (struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &&)' inline default trivial noexcept-unevaluated 0x7f9d380775f8
  `-ParmVarDecl 0x7f9d38077720 <col:12> col:12 'struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::vector<int, std::__1::allocator<int> >::__RAII_IncreaseAnnotator" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::vector<int, std::__1::allocator<int> >::__RAII_IncreaseAnnotator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> (empty)
         0 |   struct std::__1::integral_constant<_Bool, true> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9d38079a60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1345:1, line:1354:1> line:1346:8 struct __has_construct definition
|-public 'integral_constant<_Bool, is_same<decltype(__has_construct_test(declval<class allocator<int> >(), declval<int *>(), declval<int>())), true_type>::value>':'struct std::__1::integral_constant<_Bool, true>'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-TemplateArgument type 'int *'
|-TemplateArgument pack
| `-TemplateArgument type 'int'
|-CXXRecordDecl 0x7f9d3807dae8 prev 0x7f9d38079a60 <col:1, col:8> col:8 implicit struct __has_construct
|-CXXConstructorDecl 0x7f9d3807dbc0 <col:8> col:8 implicit referenced constexpr __has_construct 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f9d3807dcd8 <col:8> col:8 implicit constexpr __has_construct 'void (const struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &)' inline default trivial noexcept-unevaluated 0x7f9d3807dcd8
| `-ParmVarDecl 0x7f9d3807de00 <col:8> col:8 'const struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &'
|-CXXConstructorDecl 0x7f9d3807de98 <col:8> col:8 implicit constexpr __has_construct 'void (struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &&)' inline default trivial noexcept-unevaluated 0x7f9d3807de98
| `-ParmVarDecl 0x7f9d3807dfc0 <col:8> col:8 'struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &&'
`-CXXDestructorDecl 0x7f9d3807e060 <col:8> col:8 implicit referenced ~__has_construct 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__has_construct" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__has_construct" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9d35d754d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:19:1, line:25:1> line:20:7 class __split_buffer_common definition
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7f9d35d756c0 prev 0x7f9d35d754d8 <col:1, col:7> col:7 implicit class __split_buffer_common
|-AccessSpecDecl 0x7f9d35d75758 <line:22:1, col:10> col:1 protected
|-CXXMethodDecl 0x7f9d35d79800 <line:23:5, col:33> col:10 __throw_length_error 'void (void) const'
|-CXXMethodDecl 0x7f9d35d798a8 <line:24:5, col:33> col:10 __throw_out_of_range 'void (void) const'
|-CXXDestructorDecl 0x7f9d38090230 <line:20:7> col:7 implicit ~__split_buffer_common 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f9d380addd8 <col:7> col:7 implicit used constexpr __split_buffer_common 'void (void) noexcept' inline default trivial
| `-CompoundStmt 0x7f9d380ae238 <col:7>
|-CXXConstructorDecl 0x7f9d380adee8 <col:7> col:7 implicit constexpr __split_buffer_common 'void (const class std::__1::__split_buffer_common<true> &)' inline default trivial noexcept-unevaluated 0x7f9d380adee8
| `-ParmVarDecl 0x7f9d380ae010 <col:7> col:7 'const class std::__1::__split_buffer_common<true> &'
`-CXXConstructorDecl 0x7f9d380ae0a8 <col:7> col:7 implicit constexpr __split_buffer_common 'void (class std::__1::__split_buffer_common<true> &&)' inline default trivial noexcept-unevaluated 0x7f9d380ae0a8
  `-ParmVarDecl 0x7f9d380ae1d0 <col:7> col:7 'class std::__1::__split_buffer_common<true> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__split_buffer_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__split_buffer_common" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9d380836b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2034:1, line:2067:1> line:2037:8 struct __compressed_pair_elem definition
|-TemplateArgument type 'class std::__1::allocator<int> &'
|-TemplateArgument integral 1
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7f9d38083930 prev 0x7f9d380836b0 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7f9d380839d8 <line:2038:3, col:15> col:15 _ParamT 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
| `-SubstTemplateTypeParmType 0x7f9d38082d30 'class std::__1::allocator<int> &' sugar
|   |-TemplateTypeParmType 0x7f9d35383f80 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9d35383f38 '_Tp'
|   `-LValueReferenceType 0x7f9d35e75940 'class std::__1::allocator<int> &'
|     `-RecordType 0x7f9d35e680b0 'class std::__1::allocator<int>'
|       `-ClassTemplateSpecialization 0x7f9d35e67fc8 'allocator'
|-TypedefDecl 0x7f9d38083a68 <line:2039:3, col:16> col:16 referenced reference 'class std::__1::allocator<int> &&'
| `-LValueReferenceType 0x7f9d38083a30 'class std::__1::allocator<int> &&'
|   `-RecordType 0x7f9d35e680b0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7f9d35e67fc8 'allocator'
|-TypedefDecl 0x7f9d38083ad0 <line:2040:3, col:22> col:22 referenced const_reference 'class std::__1::allocator<int> &&'
| `-LValueReferenceType 0x7f9d38083a30 'class std::__1::allocator<int> &&'
|   `-RecordType 0x7f9d35e680b0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7f9d35e67fc8 'allocator'
|-CXXConstructorDecl 0x7f9d38083b68 <line:2043:3, col:52> col:13 constexpr __compressed_pair_elem 'void (void)'
|-FunctionTemplateDecl 0x7f9d38084348 <line:2045:3, line:2050:44> line:2049:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7f9d38083c20 <line:2045:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7f9d38083c88 <col:24, line:2047:6> line:2045:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<class allocator<int> &, 1, false>, typename decay<_Up>::type>::value>::type'
| |-CXXConstructorDecl 0x7f9d380842a0 <line:2048:3, line:2050:44> line:2049:3 constexpr __compressed_pair_elem 'void (_Up &&)'
| | `-ParmVarDecl 0x7f9d380841b8 <col:26, col:32> col:32 __u '_Up &&'
| `-CXXConstructorDecl 0x7f9d380ad5a0 <line:2048:3, line:2050:44> line:2049:3 used constexpr __compressed_pair_elem 'void (class std::__1::allocator<int> &&)'
|   |-TemplateArgument type 'class std::__1::allocator<int> &'
|   |-TemplateArgument type 'void'
|   |-ParmVarDecl 0x7f9d380ad4d8 <col:26, col:32> col:32 used __u 'class std::__1::allocator<int> &&'
|   |-CXXCtorInitializer Field 0x7f9d38084d88 '__value_' 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
|   | `-CallExpr 0x7f9d380adc38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2050:41> 'class std::__1::allocator<int>' lvalue
|   |   |-ImplicitCastExpr 0x7f9d380adc20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2050:36> 'class std::__1::allocator<int> &&(*)(typename remove_reference<class allocator<int> &>::type &) noexcept' <FunctionToPointerDecay>
|   |   | `-DeclRefExpr 0x7f9d380adba0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2050:36> 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' lvalue Function 0x7f9d380a6968 'forward' 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' (FunctionTemplate 0x7f9d350f08e0 'forward')
|   |   `-DeclRefExpr 0x7f9d380ad798 <col:38> 'class std::__1::allocator<int>' lvalue ParmVar 0x7f9d380ad4d8 '__u' 'class std::__1::allocator<int> &&'
|   `-CompoundStmt 0x7f9d35385dc0 <col:43, col:44>
|-FunctionTemplateDecl 0x7f9d38084978 <line:2052:3, line:2056:75> line:2054:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7f9d38084428 <line:2052:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7f9d38084498 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7f9d380848d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2056:75> line:2054:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7f9d38084510 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f9d38084678 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7f9d380847c8 <line:2055:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7f9d38084a08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d38084b58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2062:3, col:50> col:13 used __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>::reference (void) noexcept'
| `-CompoundStmt 0x7f9d380af150 <col:31, col:50>
|   `-ReturnStmt 0x7f9d380af138 <col:33, col:40>
|     `-MemberExpr 0x7f9d380af100 <col:40> 'class std::__1::allocator<int>' lvalue ->__value_ 0x7f9d38084d88
|       `-CXXThisExpr 0x7f9d380af0e8 <col:40> 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> *' this
|-CXXMethodDecl 0x7f9d38084ca8 <line:2063:3, col:62> col:19 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>::const_reference (void) const noexcept'
|-AccessSpecDecl 0x7f9d38084d50 <line:2065:1, col:8> col:1 private
|-FieldDecl 0x7f9d38084d88 <line:2066:3, col:7> col:7 referenced __value_ 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
|-CXXMethodDecl 0x7f9d38088938 <line:2037:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &(const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &)' inline default_delete trivial noexcept-unevaluated 0x7f9d38088938
| `-ParmVarDecl 0x7f9d38088a50 <col:8> col:8 'const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &'
|-CXXMethodDecl 0x7f9d38088ae8 <col:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &(struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&)' inline default_delete trivial noexcept-unevaluated 0x7f9d38088ae8
| `-ParmVarDecl 0x7f9d38088c00 <col:8> col:8 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&'
|-CXXDestructorDecl 0x7f9d380903e8 <col:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f9d38097ad8 <col:8> col:8 implicit constexpr __compressed_pair_elem 'void (const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &)' inline default trivial noexcept-unevaluated 0x7f9d38097ad8
| `-ParmVarDecl 0x7f9d38097c00 <col:8> col:8 'const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &'
`-CXXConstructorDecl 0x7f9d38097c68 <col:8> col:8 implicit constexpr __compressed_pair_elem 'void (struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&)' inline default trivial noexcept-unevaluated 0x7f9d38097c68
  `-ParmVarDecl 0x7f9d38097d90 <col:8> col:8 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem.2" = type { %"class.std::__1::allocator"* }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem.2" = type { %"class.std::__1::allocator"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9d380827a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2104:1, line:2201:1> line:2105:7 class __compressed_pair definition
|-private '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|-private '__compressed_pair_elem<class std::__1::allocator<int> &, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
|-TemplateArgument type 'int *'
|-TemplateArgument type 'class std::__1::allocator<int> &'
|-CXXRecordDecl 0x7f9d38084e38 prev 0x7f9d380827a0 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7f9d380851d8 <line:2107:3, col:42> col:42 _Base1 '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
| `-TemplateSpecializationType 0x7f9d38085130 '__compressed_pair_elem<int *, 0>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'int *':'int *'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7f9d3538a000 <col:39> 'int' 0
|   `-RecordType 0x7f9d35e7e500 'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|     `-ClassTemplateSpecialization 0x7f9d35e7e3e0 '__compressed_pair_elem'
|-TypedefDecl 0x7f9d38085538 <line:2108:3, col:42> col:42 _Base2 '__compressed_pair_elem<class std::__1::allocator<int> &, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
| `-TemplateSpecializationType 0x7f9d38085490 '__compressed_pair_elem<class std::__1::allocator<int> &, 1>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7f9d3538a3a8 <col:39> 'int' 1
|   `-RecordType 0x7f9d380837d0 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
|     `-ClassTemplateSpecialization 0x7f9d380836b0 '__compressed_pair_elem'
|-StaticAssertDecl 0x7f9d380859b8 <line:2114:3, line:2117:44> line:2114:3
| |-ParenExpr 0x7f9d38085998 <col:17, col:43> '_Bool'
| | `-UnaryOperator 0x7f9d38085978 <col:18, col:38> '_Bool' prefix '!'
| |   `-ImplicitCastExpr 0x7f9d38085960 <col:19, col:38> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7f9d38085928 <col:19, col:38> 'const _Bool':'const _Bool' lvalue Var 0x7f9d35548bc8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f9d3538a8d8 <line:2115:5, line:2117:5> 'const char [179]' lvalue "__compressed_pair cannot be instantated when T1 and T2 are the same type; The current implementation is NOT ABI-compatible with the previous implementation for this configuration"
|-AccessSpecDecl 0x7f9d380859f0 <line:2119:1, col:7> col:1 public
|-FunctionTemplateDecl 0x7f9d380862b8 <line:2121:3, line:2128:34> col:13 __compressed_pair
| |-NonTypeTemplateParmDecl 0x7f9d38085a18 <line:2121:13, col:27> col:18 referenced '_Bool' depth 0 index 0 _Dummy
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7f9d3538aa20 <col:27> '_Bool' true
| |-TemplateTypeParmDecl 0x7f9d38085a70 <line:2122:7, line:2125:10> line:2122:7 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<__dependent_type<is_default_constructible<int *>, _Dummy>::value && __dependent_type<is_default_constructible<class allocator<int> &>, _Dummy>::value>::type'
| `-CXXConstructorDecl 0x7f9d38086210 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2128:34> col:13 constexpr __compressed_pair 'void (void)'
|   `-AlwaysInlineAttr 0x7f9d38086338 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9d38086b58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2130:3, line:2135:51> line:2134:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f9d38086408 <line:2130:13, col:19> col:19 class depth 0 index 0 _Tp
| |-NonTypeTemplateParmDecl 0x7f9d38086910 <col:24, line:2132:57> col:55 'typename enable_if<!is_same<typename decay<_Tp>::type, class __compressed_pair<int *, class allocator<int> &> >::value, _Bool>::type' depth 0 index 1
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7f9d3538b940 <col:57> '_Bool' true
| `-CXXConstructorDecl 0x7f9d38086ab0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2135:51> line:2134:3 constexpr __compressed_pair 'void (_Tp &&)'
|   |-ParmVarDecl 0x7f9d380869c8 <col:21, col:27> col:27 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7f9d38086bb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9d38086f38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2137:3, line:2140:51> line:2139:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f9d38086c80 <line:2137:13, col:19> col:19 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7f9d38086e90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2140:51> line:2139:3 constexpr __compressed_pair 'void (struct std::__1::__second_tag, _Tp &&)'
|   |-ParmVarDecl 0x7f9d38086d00 <col:21> col:33 'struct std::__1::__second_tag'
|   |-ParmVarDecl 0x7f9d38086d98 <col:35, col:41> col:41 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7f9d38086f98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9d380873e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2142:3, line:2145:75> line:2144:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f9d38087068 <line:2142:13, col:19> col:19 class depth 0 index 0 _U1
| |-TemplateTypeParmDecl 0x7f9d380870d8 <col:24, col:30> col:30 class depth 0 index 1 _U2
| |-CXXConstructorDecl 0x7f9d38087340 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 constexpr __compressed_pair 'void (_U1 &&, _U2 &&)'
| | |-ParmVarDecl 0x7f9d380871a8 <col:21, col:27> col:27 __t1 '_U1 &&'
| | |-ParmVarDecl 0x7f9d38087248 <col:33, col:39> col:39 __t2 '_U2 &&'
| | `-AlwaysInlineAttr 0x7f9d38087448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-CXXConstructorDecl 0x7f9d380a57e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 used constexpr __compressed_pair 'void (nullptr_t &&, class std::__1::allocator<int> &&)'
|   |-TemplateArgument type 'nullptr_t'
|   |-TemplateArgument type 'class std::__1::allocator<int> &'
|   |-ParmVarDecl 0x7f9d380a55f8 <col:21, col:27> col:27 used __t1 'nullptr_t &&'
|   |-ParmVarDecl 0x7f9d380a56c8 <col:33, col:39> col:39 used __t2 'class std::__1::allocator<int> &&'
|   |-CXXCtorInitializer 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|   | `-CXXConstructExpr 0x7f9d380a6360 <line:2145:9, col:39> '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>' 'void (nullptr_t &&)'
|   |   `-CallExpr 0x7f9d380a5f68 <col:16, col:38> 'nullptr_t':'nullptr_t' xvalue
|   |     |-ImplicitCastExpr 0x7f9d380a5f50 <col:16, col:32> 'nullptr_t &&(*)(typename remove_reference<nullptr_t>::type &) noexcept' <FunctionToPointerDecay>
|   |     | `-DeclRefExpr 0x7f9d380a5ed0 <col:16, col:32> 'nullptr_t &&(typename remove_reference<nullptr_t>::type &) noexcept' lvalue Function 0x7f9d3806e5c8 'forward' 'nullptr_t &&(typename remove_reference<nullptr_t>::type &) noexcept' (FunctionTemplate 0x7f9d350f08e0 'forward')
|   |     `-DeclRefExpr 0x7f9d380a5ac8 <col:34> 'nullptr_t':'nullptr_t' lvalue ParmVar 0x7f9d380a55f8 '__t1' 'nullptr_t &&'
|   |-CXXCtorInitializer 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
|   | `-CXXConstructExpr 0x7f9d380adcc8 <col:42, col:72> '__compressed_pair_elem<class std::__1::allocator<int> &, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>' 'void (class std::__1::allocator<int> &&)'
|   |   `-CallExpr 0x7f9d380a6e70 <col:49, col:71> 'class std::__1::allocator<int>' lvalue
|   |     |-ImplicitCastExpr 0x7f9d380a6e58 <col:49, col:65> 'class std::__1::allocator<int> &&(*)(typename remove_reference<class allocator<int> &>::type &) noexcept' <FunctionToPointerDecay>
|   |     | `-DeclRefExpr 0x7f9d380a6ce0 <col:49, col:65> 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' lvalue Function 0x7f9d380a6968 'forward' 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' (FunctionTemplate 0x7f9d350f08e0 'forward')
|   |     `-DeclRefExpr 0x7f9d380a6498 <col:67> 'class std::__1::allocator<int>' lvalue ParmVar 0x7f9d380a56c8 '__t2' 'class std::__1::allocator<int> &&'
|   |-CompoundStmt 0x7f9d3538e5f8 <col:74, col:75>
|   `-AlwaysInlineAttr 0x7f9d380a5908 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7f9d38087aa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2147:3, line:2154:75> line:2149:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7f9d38087518 <line:2147:13, col:22> col:22 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7f9d38087588 <col:30, col:39> col:39 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7f9d38087a00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2154:75> line:2149:3 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7f9d38087618 <col:21, col:43> col:43 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f9d38087788 <col:49, col:66> col:66 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7f9d380878f8 <line:2150:21, col:38> col:38 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7f9d38087b10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d38087cd8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2175:3> line:2173:30 used first 'typename _Base1::reference (void) noexcept'
| |-CompoundStmt 0x7f9d380bfb38 <col:48, line:2175:3>
| | `-ReturnStmt 0x7f9d380bfb20 <line:2174:5, col:46>
| |   `-CXXMemberCallExpr 0x7f9d380bfaf8 <col:12, col:46> 'int *':'int *' lvalue
| |     `-MemberExpr 0x7f9d380bfac0 <col:12, col:40> '<bound member function type>' .__get 0x7f9d35e7f948
| |       `-CXXStaticCastExpr 0x7f9d380bfa20 <col:12, col:38> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue static_cast<std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1 &> <NoOp>
| |         `-ImplicitCastExpr 0x7f9d380bfa00 <col:33, col:34> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue <DerivedToBase (__compressed_pair_elem)>
| |           `-UnaryOperator 0x7f9d380af7e0 <col:33, col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue prefix '*'
| |             `-CXXThisExpr 0x7f9d380af7c8 <col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7f9d38087d80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d38087e88 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2180:3> line:2178:36 used first 'typename _Base1::const_reference (void) const noexcept'
| |-CompoundStmt 0x7f9d380c1328 <col:60, line:2180:3>
| | `-ReturnStmt 0x7f9d380c1310 <line:2179:5, col:52>
| |   `-CXXMemberCallExpr 0x7f9d380c12e8 <col:12, col:52> 'int *const':'int *const' lvalue
| |     `-MemberExpr 0x7f9d380c12b0 <col:12, col:46> '<bound member function type>' .__get 0x7f9d35e7fa98
| |       `-CXXStaticCastExpr 0x7f9d380c1210 <col:12, col:44> 'const std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'const struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue static_cast<const std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1 &> <NoOp>
| |         `-ImplicitCastExpr 0x7f9d380c11f0 <col:39, col:40> 'const std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'const struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue <DerivedToBase (__compressed_pair_elem)>
| |           `-UnaryOperator 0x7f9d380c11d0 <col:39, col:40> 'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue prefix '*'
| |             `-CXXThisExpr 0x7f9d380c11b8 <col:40> 'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7f9d38087f30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d38088078 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2185:3> line:2183:30 used second 'typename _Base2::reference (void) noexcept'
| |-CompoundStmt 0x7f9d380af0c8 <col:49, line:2185:3>
| | `-ReturnStmt 0x7f9d380af0b0 <line:2184:5, col:46>
| |   `-CXXMemberCallExpr 0x7f9d380af088 <col:12, col:46> 'class std::__1::allocator<int>' lvalue
| |     `-MemberExpr 0x7f9d380af050 <col:12, col:40> '<bound member function type>' .__get 0x7f9d38084b58
| |       `-CXXStaticCastExpr 0x7f9d380aefb0 <col:12, col:38> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>' lvalue static_cast<std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2 &> <NoOp>
| |         `-ImplicitCastExpr 0x7f9d380aef90 <col:33, col:34> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>' lvalue <DerivedToBase (__compressed_pair_elem)>
| |           `-UnaryOperator 0x7f9d380aef70 <col:33, col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue prefix '*'
| |             `-CXXThisExpr 0x7f9d380aef58 <col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7f9d38088120 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d38088228 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2190:3> line:2188:36 second 'typename _Base2::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d380882d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d38088470 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2200:3> line:2193:8 swap 'void (class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &)' noexcept-uninstantiated 0x7f9d3538da48
| |-ParmVarDecl 0x7f9d38088358 <col:13, col:32> col:32 __x 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &'
| `-AlwaysInlineAttr 0x7f9d38088568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d38088c68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2105:7, <invalid sloc>> col:7 implicit constexpr operator= 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &(class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&)' inline default_delete trivial noexcept-unevaluated 0x7f9d38088c68
| `-ParmVarDecl 0x7f9d38088d80 <col:7> col:7 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&'
|-CXXDestructorDecl 0x7f9d38090308 <col:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f9d3809f0a8 <col:7> col:7 implicit constexpr __compressed_pair 'void (const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &)' inline default trivial noexcept-unevaluated 0x7f9d3809f0a8
| `-ParmVarDecl 0x7f9d3809f1d0 <col:7> col:7 'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &'
`-CXXConstructorDecl 0x7f9d380a5388 <col:7> col:7 implicit constexpr __compressed_pair 'void (class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&)' inline default trivial noexcept-unevaluated 0x7f9d380a5388
  `-ParmVarDecl 0x7f9d380a54b0 <col:7> col:7 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair.1" = type { %"struct.std::__1::__compressed_pair_elem", %"struct.std::__1::__compressed_pair_elem.2" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair.1" = type { %"struct.std::__1::__compressed_pair_elem", %"struct.std::__1::__compressed_pair_elem.2" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f9d35e97d88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:27:1, line:164:1> line:28:8 struct __split_buffer definition
|-private '__split_buffer_common<true>':'class std::__1::__split_buffer_common<true>'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int> &'
|-CXXRecordDecl 0x7f9d380814e8 prev 0x7f9d35e97d88 <col:1, col:8> col:8 implicit struct __split_buffer
|-AccessSpecDecl 0x7f9d38081580 <line:31:1, col:8> col:1 private
|-CXXConstructorDecl 0x7f9d380816f0 <line:32:5, col:41> col:5 __split_buffer 'void (const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &)'
| `-ParmVarDecl 0x7f9d380815e8 <col:20, col:40> col:41 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &'
|-CXXMethodDecl 0x7f9d38081880 <line:33:5, col:52> col:21 operator= 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &(const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &)'
| `-ParmVarDecl 0x7f9d380817c0 <col:31, col:51> col:52 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &'
|-AccessSpecDecl 0x7f9d38081930 <line:34:1, col:7> col:1 public
|-TypedefDecl 0x7f9d38081998 <line:35:5, col:61> col:61 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7f9d38081960 'int' sugar
|   |-TemplateTypeParmType 0x7f9d35d75010 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f9d35d74fc8 '_Tp'
|   `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d38081a28 <line:36:5, col:61> col:61 allocator_type 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
| `-SubstTemplateTypeParmType 0x7f9d380819f0 'class std::__1::allocator<int> &' sugar
|   |-TemplateTypeParmType 0x7f9d35d75140 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f9d35d750f8 '_Allocator'
|   `-LValueReferenceType 0x7f9d35e75940 'class std::__1::allocator<int> &'
|     `-RecordType 0x7f9d35e680b0 'class std::__1::allocator<int>'
|       `-ClassTemplateSpecialization 0x7f9d35e67fc8 'allocator'
|-TypedefDecl 0x7f9d38081f40 <line:37:5, col:61> col:61 __alloc_rr 'typename remove_reference<allocator_type>::type':'class std::__1::allocator<int>'
| `-ElaboratedType 0x7f9d38081ef0 'typename remove_reference<allocator_type>::type' sugar
|   `-TypedefType 0x7f9d38081ed0 'std::__1::remove_reference<class std::__1::allocator<int> &>::type' sugar
|     |-Typedef 0x7f9d38081e58 'type'
|     `-SubstTemplateTypeParmType 0x7f9d38081ca0 'class std::__1::allocator<int>' sugar
|       |-TemplateTypeParmType 0x7f9d35079820 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f9d350797d8 '_Tp'
|       `-RecordType 0x7f9d35e680b0 'class std::__1::allocator<int>'
|         `-ClassTemplateSpecialization 0x7f9d35e67fc8 'allocator'
|-TypedefDecl 0x7f9d38082048 <line:38:5, col:61> col:61 __alloc_traits 'allocator_traits<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr>':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x7f9d38081fd0 'allocator_traits<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>'
|   `-RecordType 0x7f9d35e68a80 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x7f9d35e68990 'allocator_traits'
|-TypedefDecl 0x7f9d380820f8 <line:39:5, col:61> col:61 reference 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
| `-LValueReferenceType 0x7f9d380820c0 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
|   `-TypedefType 0x7f9d380820a0 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type' sugar
|     |-Typedef 0x7f9d38081998 'value_type'
|     `-SubstTemplateTypeParmType 0x7f9d38081960 'int' sugar
|       |-TemplateTypeParmType 0x7f9d35d75010 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f9d35d74fc8 '_Tp'
|       `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d38082188 <line:40:5, col:61> col:61 const_reference 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
| `-LValueReferenceType 0x7f9d38082150 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
|   `-QualType 0x7f9d380820a1 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type' const
|     `-TypedefType 0x7f9d380820a0 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type' sugar
|       |-Typedef 0x7f9d38081998 'value_type'
|       `-SubstTemplateTypeParmType 0x7f9d38081960 'int' sugar
|         |-TemplateTypeParmType 0x7f9d35d75010 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7f9d35d74fc8 '_Tp'
|         `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d38082290 <line:41:5, col:61> col:61 size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7f9d38082240 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7f9d35e75a10 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x7f9d35e723a0 'size_type'
|     `-ElaboratedType 0x7f9d35e72350 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7f9d35e72330 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|         |-Typedef 0x7f9d35e722b0 'type'
|         `-ElaboratedType 0x7f9d35e72260 'typename class allocator<int>::size_type' sugar
|           `-TypedefType 0x7f9d35e71b40 'std::__1::allocator<int>::size_type' sugar
|             |-Typedef 0x7f9d35e690b8 'size_type'
|             `-TypedefType 0x7f9d35060010 'size_t' sugar
|               |-Typedef 0x7f9d348687b0 'size_t'
|               `-BuiltinType 0x7f9d34833680 'unsigned long'
|-TypedefDecl 0x7f9d38082360 <line:42:5, col:61> col:61 difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7f9d38082310 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7f9d35e71860 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x7f9d35e717f0 'difference_type'
|     `-ElaboratedType 0x7f9d35e717a0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7f9d35e71780 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|         |-Typedef 0x7f9d35e71700 'type'
|         `-ElaboratedType 0x7f9d35e716b0 'typename class allocator<int>::difference_type' sugar
|           `-TypedefType 0x7f9d35e70f60 'std::__1::allocator<int>::difference_type' sugar
|             |-Typedef 0x7f9d35e69110 'difference_type'
|             `-TypedefType 0x7f9d350e0350 'ptrdiff_t' sugar
|               |-Typedef 0x7f9d34868740 'ptrdiff_t'
|               `-BuiltinType 0x7f9d348335e0 'long'
|-TypedefDecl 0x7f9d38082430 <line:43:5, col:61> col:61 pointer 'typename __alloc_traits::pointer':'int *'
| `-ElaboratedType 0x7f9d380823e0 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7f9d35e6c630 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x7f9d35e6c5c0 'pointer'
|     `-ElaboratedType 0x7f9d35e6c570 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7f9d35e6c550 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|         |-Typedef 0x7f9d35e6c4d0 'type'
|         `-ElaboratedType 0x7f9d35e6c480 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|           `-TypedefType 0x7f9d35e6c460 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x7f9d35e6c3e0 'type'
|             `-ElaboratedType 0x7f9d35e6c390 'typename class allocator<int>::pointer' sugar
|               `-TypedefType 0x7f9d35e69d90 'std::__1::allocator<int>::pointer' sugar
|                 |-Typedef 0x7f9d35e691d8 'pointer'
|                 `-PointerType 0x7f9d35e691a0 'int *'
|                   `-SubstTemplateTypeParmType 0x7f9d35e69170 'int' sugar
|                     |-TemplateTypeParmType 0x7f9d3537b060 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7f9d3537b018 '_Tp'
|                     `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d38082500 <line:44:5, col:61> col:61 const_pointer 'typename __alloc_traits::const_pointer':'const int *'
| `-ElaboratedType 0x7f9d380824b0 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7f9d35e7d530 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x7f9d35e6d3c0 'const_pointer'
|     `-ElaboratedType 0x7f9d35e6d370 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7f9d35e6d350 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|         |-Typedef 0x7f9d35e6d2d0 'type'
|         `-ElaboratedType 0x7f9d35e6d280 'typename class allocator<int>::const_pointer' sugar
|           `-TypedefType 0x7f9d35e69fe0 'std::__1::allocator<int>::const_pointer' sugar
|             |-Typedef 0x7f9d35e69268 'const_pointer'
|             `-PointerType 0x7f9d35e69230 'const int *'
|               `-QualType 0x7f9d35e69171 'const int' const
|                 `-SubstTemplateTypeParmType 0x7f9d35e69170 'int' sugar
|                   |-TemplateTypeParmType 0x7f9d3537b060 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7f9d3537b018 '_Tp'
|                   `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d38082590 <line:45:5, col:61> col:61 iterator 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
| `-TypedefType 0x7f9d38082560 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer' sugar
|   |-Typedef 0x7f9d38082430 'pointer'
|   `-ElaboratedType 0x7f9d380823e0 'typename __alloc_traits::pointer' sugar
|     `-TypedefType 0x7f9d35e6c630 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|       |-Typedef 0x7f9d35e6c5c0 'pointer'
|       `-ElaboratedType 0x7f9d35e6c570 'typename __pointer_type<value_type, allocator_type>::type' sugar
|         `-TypedefType 0x7f9d35e6c550 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|           |-Typedef 0x7f9d35e6c4d0 'type'
|           `-ElaboratedType 0x7f9d35e6c480 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|             `-TypedefType 0x7f9d35e6c460 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|               |-Typedef 0x7f9d35e6c3e0 'type'
|               `-ElaboratedType 0x7f9d35e6c390 'typename class allocator<int>::pointer' sugar
|                 `-TypedefType 0x7f9d35e69d90 'std::__1::allocator<int>::pointer' sugar
|                   |-Typedef 0x7f9d35e691d8 'pointer'
|                   `-PointerType 0x7f9d35e691a0 'int *'
|                     `-SubstTemplateTypeParmType 0x7f9d35e69170 'int' sugar
|                       |-TemplateTypeParmType 0x7f9d3537b060 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7f9d3537b018 '_Tp'
|                       `-BuiltinType 0x7f9d348335c0 'int'
|-TypedefDecl 0x7f9d38082620 <line:46:5, col:61> col:61 const_iterator 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_pointer':'const int *'
| `-TypedefType 0x7f9d380825f0 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_pointer' sugar
|   |-Typedef 0x7f9d38082500 'const_pointer'
|   `-ElaboratedType 0x7f9d380824b0 'typename __alloc_traits::const_pointer' sugar
|     `-TypedefType 0x7f9d35e7d530 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|       |-Typedef 0x7f9d35e6d3c0 'const_pointer'
|       `-ElaboratedType 0x7f9d35e6d370 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|         `-TypedefType 0x7f9d35e6d350 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|           |-Typedef 0x7f9d35e6d2d0 'type'
|           `-ElaboratedType 0x7f9d35e6d280 'typename class allocator<int>::const_pointer' sugar
|             `-TypedefType 0x7f9d35e69fe0 'std::__1::allocator<int>::const_pointer' sugar
|               |-Typedef 0x7f9d35e69268 'const_pointer'
|               `-PointerType 0x7f9d35e69230 'const int *'
|                 `-QualType 0x7f9d35e69171 'const int' const
|                   `-SubstTemplateTypeParmType 0x7f9d35e69170 'int' sugar
|                     |-TemplateTypeParmType 0x7f9d3537b060 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7f9d3537b018 '_Tp'
|                     `-BuiltinType 0x7f9d348335c0 'int'
|-FieldDecl 0x7f9d38082688 <line:48:5, col:53> col:53 referenced __first_ 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
|-FieldDecl 0x7f9d380826e0 <line:49:5, col:53> col:53 referenced __begin_ 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
|-FieldDecl 0x7f9d38082738 <line:50:5, col:53> col:53 referenced __end_ 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
|-FieldDecl 0x7f9d38088e08 <line:51:5, col:48> col:48 referenced __end_cap_ '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>'
|-TypedefDecl 0x7f9d3808a590 <line:53:5, col:65> col:65 __alloc_ref 'typename add_lvalue_reference<allocator_type>::type':'class std::__1::allocator<int> &&'
| `-ElaboratedType 0x7f9d3808a540 'typename add_lvalue_reference<allocator_type>::type' sugar
|   `-TypedefType 0x7f9d3808a520 'std::__1::add_lvalue_reference<class std::__1::allocator<int> &>::type' sugar
|     |-Typedef 0x7f9d3808a4a0 'type'
|     `-ElaboratedType 0x7f9d3808a450 'typename __add_lvalue_reference_impl<class allocator<int> &>::type' sugar
|       `-TypedefType 0x7f9d3808a430 'std::__1::__add_lvalue_reference_impl<class std::__1::allocator<int> &, true>::type' sugar
|         |-Typedef 0x7f9d3808a3b8 'type'
|         `-LValueReferenceType 0x7f9d3808a380 'class std::__1::allocator<int> &&'
|           `-RecordType 0x7f9d35e680b0 'class std::__1::allocator<int>'
|             `-ClassTemplateSpecialization 0x7f9d35e67fc8 'allocator'
|-TypedefDecl 0x7f9d3808a6f0 <line:54:5, col:65> col:65 __alloc_const_ref 'typename add_lvalue_reference<allocator_type>::type':'class std::__1::allocator<int> &&'
| `-ElaboratedType 0x7f9d3808a6a0 'typename add_lvalue_reference<allocator_type>::type' sugar
|   `-TypedefType 0x7f9d3808a520 'std::__1::add_lvalue_reference<class std::__1::allocator<int> &>::type' sugar
|     |-Typedef 0x7f9d3808a4a0 'type'
|     `-ElaboratedType 0x7f9d3808a450 'typename __add_lvalue_reference_impl<class allocator<int> &>::type' sugar
|       `-TypedefType 0x7f9d3808a430 'std::__1::__add_lvalue_reference_impl<class std::__1::allocator<int> &, true>::type' sugar
|         |-Typedef 0x7f9d3808a3b8 'type'
|         `-LValueReferenceType 0x7f9d3808a380 'class std::__1::allocator<int> &&'
|           `-RecordType 0x7f9d35e680b0 'class std::__1::allocator<int>'
|             `-ClassTemplateSpecialization 0x7f9d35e67fc8 'allocator'
|-CXXMethodDecl 0x7f9d3808a7d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:56:109> col:53 used __alloc 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &(void) noexcept'
| |-CompoundStmt 0x7f9d380aef00 <col:81, col:109>
| | `-ReturnStmt 0x7f9d380aeee8 <col:82, col:107>
| |   `-CXXMemberCallExpr 0x7f9d380aeec0 <col:89, col:107> 'class std::__1::allocator<int>' lvalue
| |     `-MemberExpr 0x7f9d380aee88 <col:89, col:100> '<bound member function type>' .second 0x7f9d38088078
| |       `-MemberExpr 0x7f9d380aede0 <col:89> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue ->__end_cap_ 0x7f9d38088e08
| |         `-CXXThisExpr 0x7f9d380aedc8 <col:89> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7f9d3808a8a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d3808a978 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:57:109> col:53 __alloc 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &(void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d3808aa20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d3808aaf8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:58:108> col:53 used __end_cap 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer &(void) noexcept'
| |-CompoundStmt 0x7f9d380af770 <col:81, col:108>
| | `-ReturnStmt 0x7f9d380af758 <col:82, col:106>
| |   `-CXXMemberCallExpr 0x7f9d380af730 <col:89, col:106> 'int *':'int *' lvalue
| |     `-MemberExpr 0x7f9d380af6f8 <col:89, col:100> '<bound member function type>' .first 0x7f9d38087cd8
| |       `-MemberExpr 0x7f9d380af650 <col:89> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue ->__end_cap_ 0x7f9d38088e08
| |         `-CXXThisExpr 0x7f9d380af638 <col:89> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7f9d3808aba0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d3808ac78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:59:108> col:53 used __end_cap 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer &(void) const noexcept'
| |-CompoundStmt 0x7f9d380c1160 <col:81, col:108>
| | `-ReturnStmt 0x7f9d380c1148 <col:82, col:106>
| |   `-CXXMemberCallExpr 0x7f9d380c10f8 <col:89, col:106> 'int *const':'int *const' lvalue
| |     `-MemberExpr 0x7f9d380c10c0 <col:89, col:100> '<bound member function type>' .first 0x7f9d38087e88
| |       `-MemberExpr 0x7f9d380c1018 <col:89> 'const __compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue ->__end_cap_ 0x7f9d38088e08
| |         `-CXXThisExpr 0x7f9d380c1000 <col:89> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7f9d3808ad20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7f9d3808adb0 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:62:5 __split_buffer 'void (void)' noexcept-uninstantiated 0x7f9d35d7b7a0
| `-AlwaysInlineAttr 0x7f9d3808aeb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7f9d3808b030 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:65:44> col:14 __split_buffer 'void (std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7f9d3808af08 <col:29, col:41> col:41 __a 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| `-AlwaysInlineAttr 0x7f9d3808b0f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7f9d3808b230 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:67:50> col:14 __split_buffer 'void (const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7f9d3808b148 <col:29, col:47> col:47 __a 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| `-AlwaysInlineAttr 0x7f9d3808b2f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7f9d3808b5a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:308:1, line:314:1> line:68:5 used __split_buffer 'void (std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7f9d3808b370 <col:20, col:30> col:30 used __cap 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
| |-ParmVarDecl 0x7f9d3808b3e0 <col:37, col:47> col:47 used __start 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
| |-ParmVarDecl 0x7f9d3808b450 <col:56, col:68> col:68 used __a 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| |-CXXCtorInitializer '__split_buffer_common<true>':'class std::__1::__split_buffer_common<true>'
| | `-CXXConstructExpr 0x7f9d380ae250 <col:5> '__split_buffer_common<true>':'class std::__1::__split_buffer_common<true>' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7f9d38088e08 '__end_cap_' '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>'
| | `-ExprWithCleanups 0x7f9d380add78 <line:309:7, col:30> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>'
| |   `-CXXConstructExpr 0x7f9d380add38 <col:7, col:30> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' 'void (nullptr_t &&, class std::__1::allocator<int> &&)'
| |     |-MaterializeTemporaryExpr 0x7f9d380a5950 <col:18> 'nullptr_t':'nullptr_t' xvalue
| |     | `-CXXNullPtrLiteralExpr 0x7f9d35d8c938 <col:18> 'nullptr_t'
| |     `-DeclRefExpr 0x7f9d38097a48 <col:27> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>' lvalue ParmVar 0x7f9d3808b450 '__a' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| `-CompoundStmt 0x7f9d380aed98 <line:310:1, line:314:1>
|   |-BinaryOperator 0x7f9d380ae808 <line:311:5, col:74> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|   | |-MemberExpr 0x7f9d380ae300 <col:5> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7f9d38082688
|   | | `-CXXThisExpr 0x7f9d380ae2e8 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   | `-ConditionalOperator 0x7f9d380ae7d8 <col:16, col:74> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer':'int *'
|   |   |-BinaryOperator 0x7f9d380ae4b8 <col:16, col:25> '_Bool' '!='
|   |   | |-ImplicitCastExpr 0x7f9d380ae488 <col:16> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|   |   | | `-DeclRefExpr 0x7f9d380ae460 <col:16> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7f9d3808b370 '__cap' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|   |   | `-ImplicitCastExpr 0x7f9d380ae4a0 <col:25> 'unsigned long' <IntegralCast>
|   |   |   `-IntegerLiteral 0x7f9d35d8ca58 <col:25> 'int' 0
|   |   |-CallExpr 0x7f9d380ae770 <col:29, col:70> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer':'int *'
|   |   | |-ImplicitCastExpr 0x7f9d380ae758 <col:29, col:45> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer (*)(std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type)' <FunctionToPointerDecay>
|   |   | | `-DeclRefExpr 0x7f9d380ae6c0 <col:29, col:45> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type)' lvalue CXXMethod 0x7f9d35e75b50 'allocate' 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type)'
|   |   | |-CXXMemberCallExpr 0x7f9d380ae670 <col:54, col:62> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>' lvalue
|   |   | | `-MemberExpr 0x7f9d380ae638 <col:54> '<bound member function type>' ->__alloc 0x7f9d3808a7d8
|   |   | |   `-CXXThisExpr 0x7f9d380ae620 <col:54> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   |   | `-ImplicitCastExpr 0x7f9d380ae7a8 <col:65> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|   |   |   `-DeclRefExpr 0x7f9d380ae698 <col:65> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7f9d3808b370 '__cap' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|   |   `-ImplicitCastExpr 0x7f9d380ae7c0 <col:74> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer':'int *' <NullToPointer>
|   |     `-CXXNullPtrLiteralExpr 0x7f9d35d8cd88 <col:74> 'nullptr_t'
|   |-BinaryOperator 0x7f9d380aeaa8 <line:312:5, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|   | |-MemberExpr 0x7f9d380ae848 <col:5> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__begin_ 0x7f9d380826e0
|   | | `-CXXThisExpr 0x7f9d380ae830 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   | `-ImplicitCastExpr 0x7f9d380aea90 <col:16, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|   |   `-BinaryOperator 0x7f9d380aea68 <col:16, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|   |     |-MemberExpr 0x7f9d380ae898 <col:16> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__end_ 0x7f9d38082738
|   |     | `-CXXThisExpr 0x7f9d380ae880 <col:16> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   |     `-BinaryOperator 0x7f9d380aea40 <col:25, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' '+'
|   |       |-ImplicitCastExpr 0x7f9d380aea10 <col:25> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|   |       | `-MemberExpr 0x7f9d380ae9b0 <col:25> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7f9d38082688
|   |       |   `-CXXThisExpr 0x7f9d380ae998 <col:25> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   |       `-ImplicitCastExpr 0x7f9d380aea28 <col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|   |         `-DeclRefExpr 0x7f9d380ae9e8 <col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7f9d3808b3e0 '__start' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|   `-BinaryOperator 0x7f9d380aed70 <line:313:5, col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|     |-CXXMemberCallExpr 0x7f9d380aebb0 <col:5, col:15> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue
|     | `-MemberExpr 0x7f9d380aeb78 <col:5> '<bound member function type>' ->__end_cap 0x7f9d3808aaf8
|     |   `-CXXThisExpr 0x7f9d380aeb60 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     `-BinaryOperator 0x7f9d380aed48 <col:19, col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' '+'
|       |-ImplicitCastExpr 0x7f9d380aed18 <col:19> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|       | `-MemberExpr 0x7f9d380aecb8 <col:19> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7f9d38082688
|       |   `-CXXThisExpr 0x7f9d380aeca0 <col:19> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|       `-ImplicitCastExpr 0x7f9d380aed30 <col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|         `-DeclRefExpr 0x7f9d380aecf0 <col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7f9d3808b370 '__cap' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|-CXXDestructorDecl 0x7f9d3808b6a0 <line:339:1, line:344:1> line:69:5 used ~__split_buffer 'void (void) noexcept'
| `-CompoundStmt 0x7f9d380c0108 <line:340:1, line:344:1>
|   |-CXXMemberCallExpr 0x7f9d380bfd28 <line:341:5, col:11> 'void'
|   | `-MemberExpr 0x7f9d380bfcf0 <col:5> '<bound member function type>' ->clear 0x7f9d3808c378
|   |   `-CXXThisExpr 0x7f9d380bfcd8 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   `-IfStmt 0x7f9d380c00d0 <line:342:5, line:343:67>
|     |-<<<NULL>>>
|     |-<<<NULL>>>
|     |-ImplicitCastExpr 0x7f9d380bfdb8 <line:342:9> '_Bool' <PointerToBoolean>
|     | `-ImplicitCastExpr 0x7f9d380bfda0 <col:9> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|     |   `-MemberExpr 0x7f9d380bfd68 <col:9> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7f9d38082688
|     |     `-CXXThisExpr 0x7f9d380bfd50 <col:9> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     |-CallExpr 0x7f9d380c0078 <line:343:9, col:67> 'void'
|     | |-ImplicitCastExpr 0x7f9d380c0060 <col:9, col:25> 'void (*)(std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::pointer, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type) noexcept' <FunctionToPointerDecay>
|     | | `-DeclRefExpr 0x7f9d380bfe10 <col:9, col:25> 'void (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::pointer, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type) noexcept' lvalue CXXMethod 0x7f9d35e761c8 'deallocate' 'void (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::pointer, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type) noexcept'
|     | |-CXXMemberCallExpr 0x7f9d380bff28 <col:36, col:44> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>' lvalue
|     | | `-MemberExpr 0x7f9d380bfef0 <col:36> '<bound member function type>' ->__alloc 0x7f9d3808a7d8
|     | |   `-CXXThisExpr 0x7f9d380bfed8 <col:36> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     | |-ImplicitCastExpr 0x7f9d380c00b8 <col:47> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|     | | `-MemberExpr 0x7f9d380bff68 <col:47> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7f9d38082688
|     | |   `-CXXThisExpr 0x7f9d380bff50 <col:47> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     | `-CXXMemberCallExpr 0x7f9d380bfff0 <col:57, col:66> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|     |   `-MemberExpr 0x7f9d380bffb8 <col:57> '<bound member function type>' ->capacity 0x7f9d3808c6c0
|     |     `-ImplicitCastExpr 0x7f9d380c0048 <col:57> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' <NoOp>
|     |       `-CXXThisExpr 0x7f9d380bffa0 <col:57> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     `-<<<NULL>>>
|-CXXConstructorDecl 0x7f9d3808b8c0 <line:72:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:72:5 __split_buffer 'void (struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&)' noexcept-uninstantiated 0x7f9d35d7c278
| `-ParmVarDecl 0x7f9d3808b788 <col:20, col:37> col:37 __c 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&'
|-CXXConstructorDecl 0x7f9d3808bb80 <line:74:5, col:63> col:5 __split_buffer 'void (struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&, const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7f9d3808b9d8 <col:20, col:37> col:37 __c 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&'
| `-ParmVarDecl 0x7f9d3808ba48 <col:42, col:60> col:60 __a 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
|-CXXMethodDecl 0x7f9d3808bd70 <line:75:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:75:21 operator= 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &(struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&)' noexcept-uninstantiated 0x7f9d35d7c698
| `-ParmVarDecl 0x7f9d3808bc58 <col:31, col:48> col:48 __c 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&'
|-CXXMethodDecl 0x7f9d3808bee8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:81:87> col:46 begin 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f9d3808bf90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d3808c058 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:82:87> col:46 begin 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d3808c100 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d3808c170 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:83:85> col:46 end 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7f9d3808c218 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d3808c288 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:84:85> col:46 end 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7f9d3808c330 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d3808c378 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:88:38> line:87:10 used clear 'void (void) noexcept'
| |-CompoundStmt 0x7f9d380c02b0 <line:88:9, col:38>
| | `-CXXMemberCallExpr 0x7f9d380c0268 <col:10, col:36> 'void'
| |   |-MemberExpr 0x7f9d380c0230 <col:10> '<bound member function type>' ->__destruct_at_end 0x7f9d3808f3e8
| |   | `-CXXThisExpr 0x7f9d380c0218 <col:10> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| |   `-ImplicitCastExpr 0x7f9d380c0298 <col:28> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
| |     `-MemberExpr 0x7f9d380c01e0 <col:28> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__begin_ 0x7f9d380826e0
| |       `-CXXThisExpr 0x7f9d380c01c8 <col:28> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7f9d3808c420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d3808c4c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:89:104> col:41 size 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| `-AlwaysInlineAttr 0x7f9d3808c568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d3808c5b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:90:81> col:36 empty '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f9d3808c658 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d3808c6c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:91:113> col:41 used capacity 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| |-CompoundStmt 0x7f9d380c0fe0 <col:58, col:113>
| | `-ReturnStmt 0x7f9d380c0fc8 <col:59, col:111>
| |   `-CXXStaticCastExpr 0x7f9d380c0f98 <col:66, col:111> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' static_cast<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type> <NoOp>
| |     `-ImplicitCastExpr 0x7f9d380c0f80 <col:89, col:103> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <IntegralCast>
| |       `-BinaryOperator 0x7f9d380c0f58 <col:89, col:103> 'long' '-'
| |         |-ImplicitCastExpr 0x7f9d380c0f28 <col:89, col:99> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
| |         | `-CXXMemberCallExpr 0x7f9d380c0eb0 <col:89, col:99> 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *const' lvalue
| |         |   `-MemberExpr 0x7f9d380c0e78 <col:89> '<bound member function type>' ->__end_cap 0x7f9d3808ac78
| |         |     `-CXXThisExpr 0x7f9d380c0e60 <col:89> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| |         `-ImplicitCastExpr 0x7f9d380c0f40 <col:103> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
| |           `-MemberExpr 0x7f9d380c0ef0 <col:103> 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *const' lvalue ->__first_ 0x7f9d38082688
| |             `-CXXThisExpr 0x7f9d380c0ed8 <col:103> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7f9d3808c768 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d3808c7d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:92:115> col:41 __front_spare 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| `-AlwaysInlineAttr 0x7f9d3808c878 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d3808c8e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:93:115> col:41 __back_spare 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| `-AlwaysInlineAttr 0x7f9d3808c988 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7f9d3808ca40 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:95:79> col:47 front 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::reference (void)'
| `-AlwaysInlineAttr 0x7f9d3808cae8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
