
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1507:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1504:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1507:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__thread_struct
         0 |   class std::__1::__thread_struct_imp * __p_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::once_flag
         0 |   unsigned long __state_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale::id
         0 |   struct std::__1::once_flag __flag_
         0 |     unsigned long __state_
         8 |   int32_t __id_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__basic_string_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>
         0 |   class std::__1::allocator<char> (base) (empty)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
         0 |   class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
         0 |     class std::__1::allocator<char> (base) (empty)
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<char>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |     class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
         0 |       class std::__1::allocator<char> (base) (empty)
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<wchar_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2>
         0 |   class std::__1::allocator<wchar_t> (base) (empty)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> >
         0 |   class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2> (base)
         0 |     class std::__1::allocator<wchar_t> (base) (empty)
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |           union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<wchar_t>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> > __r_
         0 |     class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2> (base)
         0 |       class std::__1::allocator<wchar_t> (base) (empty)
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |             union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::money_base::pattern
         0 |   char [4] field
           | [sizeof=4, dsize=4, align=1,
           |  nvsize=4, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__bitset<0, 0> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<int> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<int> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<int> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<int> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__vector_base_common<true> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<int> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>
         0 |   class std::__1::allocator<int> (base) (empty)
         0 |   int * __first_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<int *, class std::__1::allocator<int> >
         0 |   class std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2> (base)
         0 |     class std::__1::allocator<int> (base) (empty)
         0 |     int * __first_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__vector_base<int, class std::__1::allocator<int> >
         0 |   class std::__1::__vector_base_common<true> (base) (empty)
         0 |   std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __begin_
         8 |   std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __end_
        16 |   class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > __end_cap_
        16 |     class std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2> (base)
        16 |       class std::__1::allocator<int> (base) (empty)
        16 |       int * __first_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::vector<int, class std::__1::allocator<int> >
         0 |   class std::__1::__vector_base<int, class std::__1::allocator<int> > (base)
         0 |     class std::__1::__vector_base_common<true> (base) (empty)
         0 |     std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __begin_
         8 |     std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __end_
        16 |     class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > __end_cap_
        16 |       class std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2> (base)
        16 |         class std::__1::allocator<int> (base) (empty)
        16 |         int * __first_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fa66ae891f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:315:89> col:64 class __vector_base_common definition
|-TemplateArgument integral 1
|-VisibilityAttr 0x7fa66ae89388 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7fa66ae89438 prev 0x7fa66ae891f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:289:1, col:7> col:7 implicit class __vector_base_common
|-AccessSpecDecl 0x7fa66ae894d0 <line:291:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fa66ae89538 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:292:51> col:27 __vector_base_common 'void (void)'
| `-AlwaysInlineAttr 0x7fa66ae89618 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fa66ae89660 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:293:22, col:50> col:27 __throw_length_error 'void (void) const'
| `-CXX11NoReturnAttr 0x7fa66ae89708 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:313:30> Inherited
|-CXXMethodDecl 0x7fa66ae89750 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:294:22, col:50> col:27 __throw_out_of_range 'void (void) const'
| `-CXX11NoReturnAttr 0x7fa66ae897f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:313:30> Inherited
`-CXXDestructorDecl 0x113e824c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:315:64> col:64 implicit ~__vector_base_common 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__vector_base_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__vector_base_common.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x113b56ee8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:101:1, col:52> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1759:28 class allocator definition
|-TemplateArgument type 'int'
|-CXXRecordDecl 0x113b57eb8 prev 0x113b56ee8 <col:1, col:28> col:28 implicit class allocator
|-AccessSpecDecl 0x113b57f50 <line:1761:1, col:7> col:1 public
|-TypedefDecl 0x113b57f78 <line:1762:5, col:31> col:31 referenced size_type 'size_t':'unsigned long'
| `-TypedefType 0x7fa66b858c10 'size_t' sugar
|   |-Typedef 0x7fa66b04e5b0 'size_t'
|   `-BuiltinType 0x7fa66b019e80 'unsigned long'
|-TypedefDecl 0x113b57fd0 <line:1763:5, col:31> col:31 referenced difference_type 'ptrdiff_t':'long'
| `-TypedefType 0x7fa66a832750 'ptrdiff_t' sugar
|   |-Typedef 0x7fa66b04e540 'ptrdiff_t'
|   `-BuiltinType 0x7fa66b019de0 'long'
|-TypedefDecl 0x113b58098 <line:1764:5, col:31> col:31 referenced pointer 'int *'
| `-PointerType 0x113b58060 'int *'
|   `-SubstTemplateTypeParmType 0x113b58030 'int' sugar
|     |-TemplateTypeParmType 0x7fa66acf51a0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fa66acf5158 '_Tp'
|     `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113b58128 <line:1765:5, col:31> col:31 referenced const_pointer 'const int *'
| `-PointerType 0x113b580f0 'const int *'
|   `-QualType 0x113b58031 'const int' const
|     `-SubstTemplateTypeParmType 0x113b58030 'int' sugar
|       |-TemplateTypeParmType 0x7fa66acf51a0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fa66acf5158 '_Tp'
|       `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113b581b8 <line:1766:5, col:31> col:31 reference 'int &'
| `-LValueReferenceType 0x113b58180 'int &'
|   `-SubstTemplateTypeParmType 0x113b58030 'int' sugar
|     |-TemplateTypeParmType 0x7fa66acf51a0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fa66acf5158 '_Tp'
|     `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113b58248 <line:1767:5, col:31> col:31 const_reference 'const int &'
| `-LValueReferenceType 0x113b58210 'const int &'
|   `-QualType 0x113b58031 'const int' const
|     `-SubstTemplateTypeParmType 0x113b58030 'int' sugar
|       |-TemplateTypeParmType 0x7fa66acf51a0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fa66acf5158 '_Tp'
|       `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113b582b0 <line:1768:5, col:31> col:31 referenced value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x113b58030 'int' sugar
|   |-TemplateTypeParmType 0x7fa66acf51a0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fa66acf5158 '_Tp'
|   `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113b58308 <line:1770:5, col:23> col:23 referenced propagate_on_container_move_assignment 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fa66b83bf40 'std::__1::true_type' sugar
|   |-Typedef 0x7fa66b839448 'true_type'
|   `-TemplateSpecializationType 0x7fa66b835f30 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fa66b835d98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:522:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fa66b835d80 <line:525:31> '_Bool' true
|     `-RecordType 0x7fa66b835f10 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fa66b835e08 'integral_constant'
|-TypedefDecl 0x113b58360 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1771:5, col:23> col:23 referenced is_always_equal 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fa66b83bf40 'std::__1::true_type' sugar
|   |-Typedef 0x7fa66b839448 'true_type'
|   `-TemplateSpecializationType 0x7fa66b835f30 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fa66b835d98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:522:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fa66b835d80 <line:525:31> '_Bool' true
|     `-RecordType 0x7fa66b835f10 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fa66b835e08 'integral_constant'
|-ClassTemplateDecl 0x113b584d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1773:5, col:33> col:33 rebind
| |-TemplateTypeParmDecl 0x113b583b8 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXRecordDecl 0x113b58440 <col:26, col:33> col:33 struct rebind
|-CXXConstructorDecl 0x113b58728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1775:54> col:31 referenced allocator 'void (void) noexcept'
| `-AlwaysInlineAttr 0x113b58808 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x113b58b20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:5, col:96> col:52 allocator
| |-TemplateTypeParmDecl 0x113b58850 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXConstructorDecl 0x113b58a78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:96> col:52 allocator 'void (const allocator<_Up> &) noexcept'
|   |-ParmVarDecl 0x113b58990 <col:62, col:82> col:83 'const allocator<_Up> &'
|   `-AlwaysInlineAttr 0x113b58b78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113b58da8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1778:39> line:1777:39 address 'std::__1::allocator<int>::pointer (std::__1::allocator<int>::reference) const noexcept'
| |-ParmVarDecl 0x113b58ca0 <col:47, col:57> col:57 __x 'std::__1::allocator<int>::reference':'int &'
| `-AlwaysInlineAttr 0x113b58e58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e4b000 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1780:39> line:1779:45 address 'std::__1::allocator<int>::const_pointer (std::__1::allocator<int>::const_reference) const noexcept'
| |-ParmVarDecl 0x113b58ef0 <col:53, col:69> col:69 __x 'std::__1::allocator<int>::const_reference':'const int &'
| `-AlwaysInlineAttr 0x113e4b0b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e4b270 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1787:9> line:1781:39 allocate 'std::__1::allocator<int>::pointer (std::__1::allocator::size_type, allocator<void>::const_pointer)'
| |-ParmVarDecl 0x113e4b0f8 <col:48, col:58> col:58 __n 'std::__1::allocator::size_type':'unsigned long'
| |-ParmVarDecl 0x113e4b158 <col:63, col:96> col:94 'allocator<void>::const_pointer':'const void *'
| `-AlwaysInlineAttr 0x113e4b328 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e4b4f8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:49> line:1788:36 deallocate 'void (std::__1::allocator<int>::pointer, std::__1::allocator::size_type) noexcept'
| |-ParmVarDecl 0x113e4b380 <col:47, col:55> col:55 __p 'std::__1::allocator<int>::pointer':'int *'
| |-ParmVarDecl 0x113e4b3e0 <col:60> col:69 'std::__1::allocator::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x113e4b5b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e4b5f8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1791:45> line:1790:41 max_size 'std::__1::allocator::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x113e4b6a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x113e4ba88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1793:5, line:1799:9> line:1796:9 construct
| |-TemplateTypeParmDecl 0x113e4b6e8 <line:1793:15, col:21> col:21 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x113e4b758 <col:26, col:35> col:35 class depth 0 index 1 ... _Args
| `-CXXMethodDecl 0x113e4b9f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1799:9> line:1796:9 construct 'void (_Up *, _Args &&...)'
|   |-ParmVarDecl 0x113e4b828 <col:19, col:24> col:24 __p '_Up *'
|   |-ParmVarDecl 0x113e4b918 <col:29, col:40> col:40 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x113e4bae8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e4bcd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1853:70> col:36 destroy 'void (std::__1::allocator<int>::pointer)'
| |-ParmVarDecl 0x113e4bbc8 <col:44, col:52> col:52 __p 'std::__1::allocator<int>::pointer':'int *'
| `-AlwaysInlineAttr 0x113e4bd80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113e81258 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1759:28> col:28 implicit constexpr allocator 'void (const class std::__1::allocator<int> &)' inline default trivial noexcept-unevaluated 0x113e81258
| `-ParmVarDecl 0x113e81340 <col:28> col:28 'const class std::__1::allocator<int> &'
|-CXXConstructorDecl 0x113e813d8 <col:28> col:28 implicit constexpr allocator 'void (class std::__1::allocator<int> &&)' inline default trivial noexcept-unevaluated 0x113e813d8
| `-ParmVarDecl 0x113e81500 <col:28> col:28 'class std::__1::allocator<int> &&'
`-CXXDestructorDecl 0x113e815a0 <col:28> col:28 implicit referenced ~allocator 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x113e68608 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2209:1, line:2264:1> line:2210:7 class __libcpp_compressed_pair_imp definition
|-private 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|-TemplateArgument type 'int *'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-TemplateArgument integral 2
|-CXXRecordDecl 0x113e68a28 prev 0x113e68608 <col:1, col:7> col:7 implicit class __libcpp_compressed_pair_imp
|-AccessSpecDecl 0x113e68ac0 <line:2213:1, col:8> col:1 private
|-FieldDecl 0x113e68af8 <line:2214:5, col:9> col:9 __first_ 'int *':'int *'
|-AccessSpecDecl 0x113e68b40 <line:2215:1, col:7> col:1 public
|-TypedefDecl 0x113e68b78 <line:2216:5, col:17> col:17 referenced _T1_param 'int *':'int *'
| `-SubstTemplateTypeParmType 0x113e688b0 'int *' sugar
|   |-TemplateTypeParmType 0x7fa66c010610 '_T1' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fa66c0105d0 '_T1'
|   `-PointerType 0x7fa66b8981d0 'int *'
|     `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113e68be0 <line:2217:5, col:17> col:17 referenced _T2_param 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x113e688f0 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7fa66c010680 '_T2' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fa66c010638 '_T2'
|   `-RecordType 0x113b56fd0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x113b56ee8 'allocator'
|-TypedefDecl 0x113e690d0 <line:2219:5, col:51> col:51 referenced _T1_reference 'typename remove_reference<int *>::type &'
| `-LValueReferenceType 0x113e69080 'typename remove_reference<int *>::type &'
|   `-ElaboratedType 0x113e69020 'typename remove_reference<int *>::type' sugar
|     `-TypedefType 0x113e69000 'std::__1::remove_reference<int *>::type' sugar
|       |-Typedef 0x113e68f88 'type'
|       `-SubstTemplateTypeParmType 0x113e68f50 'int *' sugar
|         |-TemplateTypeParmType 0x7fa66b871ef0 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7fa66b871eb0 '_Tp'
|         `-PointerType 0x7fa66b8981d0 'int *'
|           `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113e69168 <line:2220:5, col:57> col:57 referenced _T2_reference 'class std::__1::allocator<int> &'
| `-LValueReferenceType 0x113e69130 'class std::__1::allocator<int> &'
|   `-SubstTemplateTypeParmType 0x113e688f0 'class std::__1::allocator<int>' sugar
|     |-TemplateTypeParmType 0x7fa66c010680 '_T2' dependent depth 0 index 1
|     | `-TemplateTypeParm 0x7fa66c010638 '_T2'
|     `-RecordType 0x113b56fd0 'class std::__1::allocator<int>'
|       `-ClassTemplateSpecialization 0x113b56ee8 'allocator'
|-TypedefDecl 0x113e69320 <line:2222:5, col:57> col:57 referenced _T1_const_reference 'const typename remove_reference<int *>::type &'
| `-LValueReferenceType 0x113e692d0 'const typename remove_reference<int *>::type &'
|   `-QualType 0x113e69271 'const typename remove_reference<int *>::type' const
|     `-ElaboratedType 0x113e69270 'typename remove_reference<int *>::type' sugar
|       `-TypedefType 0x113e69000 'std::__1::remove_reference<int *>::type' sugar
|         |-Typedef 0x113e68f88 'type'
|         `-SubstTemplateTypeParmType 0x113e68f50 'int *' sugar
|           |-TemplateTypeParmType 0x7fa66b871ef0 '_Tp' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x7fa66b871eb0 '_Tp'
|           `-PointerType 0x7fa66b8981d0 'int *'
|             `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113e693b8 <line:2223:5, col:63> col:63 referenced _T2_const_reference 'const class std::__1::allocator<int> &'
| `-LValueReferenceType 0x113e69380 'const class std::__1::allocator<int> &'
|   `-QualType 0x113e688f1 'const class std::__1::allocator<int>' const
|     `-SubstTemplateTypeParmType 0x113e688f0 'class std::__1::allocator<int>' sugar
|       |-TemplateTypeParmType 0x7fa66c010680 '_T2' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x7fa66c010638 '_T2'
|       `-RecordType 0x113b56fd0 'class std::__1::allocator<int>'
|         `-ClassTemplateSpecialization 0x113b56ee8 'allocator'
|-CXXConstructorDecl 0x113e69450 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2225:76> col:31 __libcpp_compressed_pair_imp 'void (void)'
| `-AlwaysInlineAttr 0x113e69538 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113e69690 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2227:54> line:2226:40 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T1_param)'
| |-ParmVarDecl 0x113e695b0 <col:69, col:79> col:79 __t1 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T1_param':'int *'
| `-AlwaysInlineAttr 0x113e69750 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113e698f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2229:61> line:2228:40 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T2_param)'
| |-ParmVarDecl 0x113e697d0 <col:69, col:79> col:79 __t2 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T2_param':'class std::__1::allocator<int>'
| `-AlwaysInlineAttr 0x113e699b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113e69bc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2233:92> line:2230:31 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T1_param, std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T2_param)' noexcept-uninstantiated 0x7fa66c011a08
| |-ParmVarDecl 0x113e69a08 <col:60, col:70> col:70 __t1 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T1_param':'int *'
| |-ParmVarDecl 0x113e69a78 <col:76, col:86> col:86 __t2 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T2_param':'class std::__1::allocator<int>'
| `-AlwaysInlineAttr 0x113e69ce0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x113e6a638 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2237:5, line:2247:14> line:2239:9 __libcpp_compressed_pair_imp
| |-TemplateTypeParmDecl 0x113e69d28 <line:2237:15, col:24> col:24 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x113e69d98 <col:32, col:41> col:41 class depth 0 index 1 ... _Args2
| |-NonTypeTemplateParmDecl 0x113e69e08 <col:49, col:59> col:59 referenced 'size_t':'unsigned long' depth 0 index 2 ... _I1
| |-NonTypeTemplateParmDecl 0x113e69e60 <col:64, col:74> col:74 referenced 'size_t':'unsigned long' depth 0 index 3 ... _I2
| `-CXXConstructorDecl 0x113e6a590 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2247:14> line:2239:9 __libcpp_compressed_pair_imp 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>, __tuple_indices<_I1...>, __tuple_indices<_I2...>)'
|   |-ParmVarDecl 0x113e69ee8 <col:38> col:59 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x113e6a058 <line:2240:38, col:55> col:55 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x113e6a1c8 <line:2241:38, col:55> col:55 __second_args 'tuple<_Args2...>'
|   |-ParmVarDecl 0x113e6a318 <line:2242:38, col:60> col:61 '__tuple_indices<_I1...>'
|   |-ParmVarDecl 0x113e6a468 <line:2243:38, col:60> col:61 '__tuple_indices<_I2...>'
|   `-AlwaysInlineAttr 0x113e6a6b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6a828 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2251:92> col:51 first 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T1_reference (void) noexcept'
| `-AlwaysInlineAttr 0x113e6a8d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6a9c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2252:92> col:51 first 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T1_const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x113e6aa70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6ab68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2254:90> col:51 second 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T2_reference (void) noexcept'
| `-AlwaysInlineAttr 0x113e6ac10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6ad08 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2255:90> col:51 second 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T2_const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x113e6adb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6af50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2263:5> line:2257:36 swap 'void (class std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2> &)' noexcept-uninstantiated 0x7fa66c012e08
| |-ParmVarDecl 0x113e6ae38 <col:41, col:71> col:71 __x 'class std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2> &'
| `-AlwaysInlineAttr 0x113e6b048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
`-CXXDestructorDecl 0x113e82688 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2210:7> col:7 implicit ~__libcpp_compressed_pair_imp 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__libcpp_compressed_pair_imp" = type { i32* }
  NonVirtualBaseLLVMType:%"class.std::__1::__libcpp_compressed_pair_imp" = type { i32* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x113e64d08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2317:1, line:2363:1> line:2318:7 class __compressed_pair definition
|-private '__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int> >':'class std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>'
|-TemplateArgument type 'int *'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x113e6b0e0 prev 0x113e64d08 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x113e6bb48 <line:2321:5, col:52> col:52 base '__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int> >':'class std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>'
| `-TemplateSpecializationType 0x113e6baa0 '__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int> >' sugar __libcpp_compressed_pair_imp
|   |-TemplateArgument type 'int *':'int *'
|   |-TemplateArgument type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|   `-RecordType 0x113e68720 'class std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>'
|     `-ClassTemplateSpecialization 0x113e68608 '__libcpp_compressed_pair_imp'
|-AccessSpecDecl 0x113e6bba0 <line:2322:1, col:7> col:1 public
|-TypedefDecl 0x113e6bc80 <line:2323:5, col:38> col:38 _T1_param 'typename base::_T1_param':'int *'
| `-ElaboratedType 0x113e6bc30 'typename base::_T1_param' sugar
|   `-TypedefType 0x113e69580 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T1_param' sugar
|     |-Typedef 0x113e68b78 '_T1_param'
|     `-SubstTemplateTypeParmType 0x113e688b0 'int *' sugar
|       |-TemplateTypeParmType 0x7fa66c010610 '_T1' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fa66c0105d0 '_T1'
|       `-PointerType 0x7fa66b8981d0 'int *'
|         `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113e6bd50 <line:2324:5, col:38> col:38 _T2_param 'typename base::_T2_param':'class std::__1::allocator<int>'
| `-ElaboratedType 0x113e6bd00 'typename base::_T2_param' sugar
|   `-TypedefType 0x113e697a0 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T2_param' sugar
|     |-Typedef 0x113e68be0 '_T2_param'
|     `-SubstTemplateTypeParmType 0x113e688f0 'class std::__1::allocator<int>' sugar
|       |-TemplateTypeParmType 0x7fa66c010680 '_T2' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x7fa66c010638 '_T2'
|       `-RecordType 0x113b56fd0 'class std::__1::allocator<int>'
|         `-ClassTemplateSpecialization 0x113b56ee8 'allocator'
|-TypedefDecl 0x113e6be20 <line:2326:5, col:42> col:42 _T1_reference 'typename base::_T1_reference':'typename remove_reference<int *>::type &'
| `-ElaboratedType 0x113e6bdd0 'typename base::_T1_reference' sugar
|   `-TypedefType 0x113e6a780 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T1_reference' sugar
|     |-Typedef 0x113e690d0 '_T1_reference'
|     `-LValueReferenceType 0x113e69080 'typename remove_reference<int *>::type &'
|       `-ElaboratedType 0x113e69020 'typename remove_reference<int *>::type' sugar
|         `-TypedefType 0x113e69000 'std::__1::remove_reference<int *>::type' sugar
|           |-Typedef 0x113e68f88 'type'
|           `-SubstTemplateTypeParmType 0x113e68f50 'int *' sugar
|             |-TemplateTypeParmType 0x7fa66b871ef0 '_Tp' dependent depth 0 index 0
|             | `-TemplateTypeParm 0x7fa66b871eb0 '_Tp'
|             `-PointerType 0x7fa66b8981d0 'int *'
|               `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113e6bef0 <line:2327:5, col:42> col:42 _T2_reference 'typename base::_T2_reference':'class std::__1::allocator<int> &'
| `-ElaboratedType 0x113e6bea0 'typename base::_T2_reference' sugar
|   `-TypedefType 0x113e6aac0 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T2_reference' sugar
|     |-Typedef 0x113e69168 '_T2_reference'
|     `-LValueReferenceType 0x113e69130 'class std::__1::allocator<int> &'
|       `-SubstTemplateTypeParmType 0x113e688f0 'class std::__1::allocator<int>' sugar
|         |-TemplateTypeParmType 0x7fa66c010680 '_T2' dependent depth 0 index 1
|         | `-TemplateTypeParm 0x7fa66c010638 '_T2'
|         `-RecordType 0x113b56fd0 'class std::__1::allocator<int>'
|           `-ClassTemplateSpecialization 0x113b56ee8 'allocator'
|-TypedefDecl 0x113e6bfc0 <line:2329:5, col:48> col:48 _T1_const_reference 'typename base::_T1_const_reference':'const typename remove_reference<int *>::type &'
| `-ElaboratedType 0x113e6bf70 'typename base::_T1_const_reference' sugar
|   `-TypedefType 0x113e6a920 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T1_const_reference' sugar
|     |-Typedef 0x113e69320 '_T1_const_reference'
|     `-LValueReferenceType 0x113e692d0 'const typename remove_reference<int *>::type &'
|       `-QualType 0x113e69271 'const typename remove_reference<int *>::type' const
|         `-ElaboratedType 0x113e69270 'typename remove_reference<int *>::type' sugar
|           `-TypedefType 0x113e69000 'std::__1::remove_reference<int *>::type' sugar
|             |-Typedef 0x113e68f88 'type'
|             `-SubstTemplateTypeParmType 0x113e68f50 'int *' sugar
|               |-TemplateTypeParmType 0x7fa66b871ef0 '_Tp' dependent depth 0 index 0
|               | `-TemplateTypeParm 0x7fa66b871eb0 '_Tp'
|               `-PointerType 0x7fa66b8981d0 'int *'
|                 `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113e6c090 <line:2330:5, col:48> col:48 _T2_const_reference 'typename base::_T2_const_reference':'const class std::__1::allocator<int> &'
| `-ElaboratedType 0x113e6c040 'typename base::_T2_const_reference' sugar
|   `-TypedefType 0x113e6ac60 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T2_const_reference' sugar
|     |-Typedef 0x113e693b8 '_T2_const_reference'
|     `-LValueReferenceType 0x113e69380 'const class std::__1::allocator<int> &'
|       `-QualType 0x113e688f1 'const class std::__1::allocator<int>' const
|         `-SubstTemplateTypeParmType 0x113e688f0 'class std::__1::allocator<int>' sugar
|           |-TemplateTypeParmType 0x7fa66c010680 '_T2' dependent depth 0 index 1
|           | `-TemplateTypeParm 0x7fa66c010638 '_T2'
|           `-RecordType 0x113b56fd0 'class std::__1::allocator<int>'
|             `-ClassTemplateSpecialization 0x113b56ee8 'allocator'
|-CXXConstructorDecl 0x113e6c128 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2332:52> col:31 __compressed_pair 'void (void)'
| `-AlwaysInlineAttr 0x113e6c208 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113e6c360 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2334:50> line:2333:40 __compressed_pair 'void (std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T1_param)'
| |-ParmVarDecl 0x113e6c280 <col:58, col:68> col:68 __t1 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T1_param':'int *'
| `-AlwaysInlineAttr 0x113e6c420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113e6c580 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2336:50> line:2335:40 __compressed_pair 'void (std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T2_param)'
| |-ParmVarDecl 0x113e6c4a0 <col:58, col:68> col:68 __t2 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T2_param':'class std::__1::allocator<int>'
| `-AlwaysInlineAttr 0x113e6c640 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113e6c800 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2338:83> line:2337:31 __compressed_pair 'void (std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T1_param, std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T2_param)'
| |-ParmVarDecl 0x113e6c698 <col:49, col:59> col:59 __t1 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T1_param':'int *'
| |-ParmVarDecl 0x113e6c708 <col:65, col:75> col:75 __t2 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T2_param':'class std::__1::allocator<int>'
| `-AlwaysInlineAttr 0x113e6c8c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x113e6ce98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2342:5, line:2349:14> line:2344:9 __compressed_pair
| |-TemplateTypeParmDecl 0x113e6c910 <line:2342:15, col:24> col:24 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x113e6c978 <col:32, col:41> col:41 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x113e6cdf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2349:14> line:2344:9 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x113e6ca08 <col:27, col:49> col:49 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x113e6cb78 <col:55, col:72> col:72 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x113e6cce8 <line:2345:55, col:72> col:72 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x113e6cf00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6d048 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2353:97> col:51 first 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T1_reference (void) noexcept'
| `-AlwaysInlineAttr 0x113e6d0f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6d1b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2354:97> col:51 first 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T1_const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x113e6d260 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6d328 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2356:99> col:51 second 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T2_reference (void) noexcept'
| `-AlwaysInlineAttr 0x113e6d3d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6d498 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2357:99> col:51 second 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T2_const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x113e6d540 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6d6e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2362:26> line:2359:36 swap 'void (class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > &)' noexcept-uninstantiated 0x7fa66c023b18
| |-ParmVarDecl 0x113e6d5c8 <col:41, col:60> col:60 __x 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x113e6d7d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
`-CXXDestructorDecl 0x113e825a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2318:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair" = type { %"class.std::__1::__libcpp_compressed_pair_imp" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair" = type { %"class.std::__1::__libcpp_compressed_pair_imp" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x113b57408 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:320:1, line:409:1> line:321:7 class __vector_base definition
|-protected '__vector_base_common<true>':'class std::__1::__vector_base_common<true>'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x113b57670 prev 0x113b57408 <col:1, col:7> col:7 implicit class __vector_base
|-AccessSpecDecl 0x113b57708 <line:324:1, col:10> col:1 protected
|-TypedefDecl 0x113b57768 <line:325:5, col:54> col:54 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x113b57730 'int' sugar
|   |-TemplateTypeParmType 0x7fa66ae898a0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fa66ae89860 '_Tp'
|   `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113b577f8 <line:326:5, col:54> col:54 allocator_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x113b577c0 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7fa66ae89910 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fa66ae898c8 '_Allocator'
|   `-RecordType 0x113b56fd0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x113b56ee8 'allocator'
|-TypedefDecl 0x113b57a08 <line:327:5, col:54> col:54 referenced __alloc_traits 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x113b57990 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type':'class std::__1::allocator<int>'
|   `-RecordType 0x113b57970 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x113b57880 'allocator_traits'
|-TypedefDecl 0x113b57ab8 <line:328:5, col:54> col:54 referenced reference 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-LValueReferenceType 0x113b57a80 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|   `-TypedefType 0x113b57a60 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|     |-Typedef 0x113b57768 'value_type'
|     `-SubstTemplateTypeParmType 0x113b57730 'int' sugar
|       |-TemplateTypeParmType 0x7fa66ae898a0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fa66ae89860 '_Tp'
|       `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113b57b78 <line:329:5, col:54> col:54 referenced const_reference 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-LValueReferenceType 0x113b57b40 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|   `-QualType 0x113b57a61 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' const
|     `-TypedefType 0x113b57a60 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|       |-Typedef 0x113b57768 'value_type'
|       `-SubstTemplateTypeParmType 0x113b57730 'int' sugar
|         |-TemplateTypeParmType 0x7fa66ae898a0 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7fa66ae89860 '_Tp'
|         `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113e64830 <line:330:5, col:54> col:54 referenced size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x113e647e0 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x113e5d740 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x113e56b50 'size_type'
|     `-ElaboratedType 0x113e56b00 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x113e56ae0 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|         |-Typedef 0x113e56a60 'type'
|         `-ElaboratedType 0x113e56a10 'typename class allocator<int>::size_type' sugar
|           `-TypedefType 0x113e55f50 'std::__1::allocator<int>::size_type' sugar
|             |-Typedef 0x113b57f78 'size_type'
|             `-TypedefType 0x7fa66b858c10 'size_t' sugar
|               |-Typedef 0x7fa66b04e5b0 'size_t'
|               `-BuiltinType 0x7fa66b019e80 'unsigned long'
|-TypedefDecl 0x113e64900 <line:331:5, col:54> col:54 referenced difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x113e648b0 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x113e55370 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x113e55300 'difference_type'
|     `-ElaboratedType 0x113e552b0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x113e55290 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|         |-Typedef 0x113e55210 'type'
|         `-ElaboratedType 0x113e551c0 'typename class allocator<int>::difference_type' sugar
|           `-TypedefType 0x113e546d0 'std::__1::allocator<int>::difference_type' sugar
|             |-Typedef 0x113b57fd0 'difference_type'
|             `-TypedefType 0x7fa66a832750 'ptrdiff_t' sugar
|               |-Typedef 0x7fa66b04e540 'ptrdiff_t'
|               `-BuiltinType 0x7fa66b019de0 'long'
|-TypedefDecl 0x113e649d0 <line:332:5, col:54> col:54 referenced pointer 'typename __alloc_traits::pointer':'int *'
| `-ElaboratedType 0x113e64980 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x113e4d8e0 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x113e4d870 'pointer'
|     `-ElaboratedType 0x113e4d820 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x113e4d800 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|         |-Typedef 0x113e4d780 'type'
|         `-ElaboratedType 0x113e4d730 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|           `-TypedefType 0x113e4d710 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x113e4d690 'type'
|             `-ElaboratedType 0x113e4d640 'typename class allocator<int>::pointer' sugar
|               `-TypedefType 0x113b58c50 'std::__1::allocator<int>::pointer' sugar
|                 |-Typedef 0x113b58098 'pointer'
|                 `-PointerType 0x113b58060 'int *'
|                   `-SubstTemplateTypeParmType 0x113b58030 'int' sugar
|                     |-TemplateTypeParmType 0x7fa66acf51a0 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fa66acf5158 '_Tp'
|                     `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113e64ac0 <line:333:5, col:54> col:54 referenced const_pointer 'typename __alloc_traits::const_pointer':'const int *'
| `-ElaboratedType 0x113e64a70 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x113e64a50 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x113e4f100 'const_pointer'
|     `-ElaboratedType 0x113e4f0b0 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x113e4f090 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|         |-Typedef 0x113e4f010 'type'
|         `-ElaboratedType 0x113e4efc0 'typename class allocator<int>::const_pointer' sugar
|           `-TypedefType 0x113b58ea0 'std::__1::allocator<int>::const_pointer' sugar
|             |-Typedef 0x113b58128 'const_pointer'
|             `-PointerType 0x113b580f0 'const int *'
|               `-QualType 0x113b58031 'const int' const
|                 `-SubstTemplateTypeParmType 0x113b58030 'int' sugar
|                   |-TemplateTypeParmType 0x7fa66acf51a0 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7fa66acf5158 '_Tp'
|                   `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113e64b50 <line:334:5, col:54> col:54 iterator 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
| `-TypedefType 0x113e64b20 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer' sugar
|   |-Typedef 0x113e649d0 'pointer'
|   `-ElaboratedType 0x113e64980 'typename __alloc_traits::pointer' sugar
|     `-TypedefType 0x113e4d8e0 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|       |-Typedef 0x113e4d870 'pointer'
|       `-ElaboratedType 0x113e4d820 'typename __pointer_type<value_type, allocator_type>::type' sugar
|         `-TypedefType 0x113e4d800 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|           |-Typedef 0x113e4d780 'type'
|           `-ElaboratedType 0x113e4d730 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|             `-TypedefType 0x113e4d710 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|               |-Typedef 0x113e4d690 'type'
|               `-ElaboratedType 0x113e4d640 'typename class allocator<int>::pointer' sugar
|                 `-TypedefType 0x113b58c50 'std::__1::allocator<int>::pointer' sugar
|                   |-Typedef 0x113b58098 'pointer'
|                   `-PointerType 0x113b58060 'int *'
|                     `-SubstTemplateTypeParmType 0x113b58030 'int' sugar
|                       |-TemplateTypeParmType 0x7fa66acf51a0 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7fa66acf5158 '_Tp'
|                       `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113e64be0 <line:335:5, col:54> col:54 const_iterator 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer':'const int *'
| `-TypedefType 0x113e64bb0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer' sugar
|   |-Typedef 0x113e64ac0 'const_pointer'
|   `-ElaboratedType 0x113e64a70 'typename __alloc_traits::const_pointer' sugar
|     `-TypedefType 0x113e64a50 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|       |-Typedef 0x113e4f100 'const_pointer'
|       `-ElaboratedType 0x113e4f0b0 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|         `-TypedefType 0x113e4f090 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|           |-Typedef 0x113e4f010 'type'
|           `-ElaboratedType 0x113e4efc0 'typename class allocator<int>::const_pointer' sugar
|             `-TypedefType 0x113b58ea0 'std::__1::allocator<int>::const_pointer' sugar
|               |-Typedef 0x113b58128 'const_pointer'
|               `-PointerType 0x113b580f0 'const int *'
|                 `-QualType 0x113b58031 'const int' const
|                   `-SubstTemplateTypeParmType 0x113b58030 'int' sugar
|                     |-TemplateTypeParmType 0x7fa66acf51a0 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fa66acf5158 '_Tp'
|                     `-BuiltinType 0x7fa66b019dc0 'int'
|-FieldDecl 0x113e64c48 <line:337:5, col:53> col:53 __begin_ 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
|-FieldDecl 0x113e64ca0 <line:338:5, col:53> col:53 __end_ 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
|-FieldDecl 0x113e6d840 <line:339:5, col:48> col:48 __end_cap_ '__compressed_pair<std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer, std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> >'
|-CXXMethodDecl 0x113e6d918 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:343:37> line:342:21 __alloc 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &(void) noexcept'
| `-AlwaysInlineAttr 0x113e6d9e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6dab8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:346:37> line:345:27 __alloc 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &(void) const noexcept'
| `-AlwaysInlineAttr 0x113e6db60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6dc38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:349:36> line:348:14 __end_cap 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer &(void) noexcept'
| `-AlwaysInlineAttr 0x113e6dce0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6ddb8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:352:36> line:351:20 __end_cap 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer &(void) const noexcept'
| `-AlwaysInlineAttr 0x113e6de60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113e6df10 <col:35, line:739:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:355:5 __vector_base 'void (void)' noexcept-uninstantiated 0x7fa66ae8b1e0
| `-AlwaysInlineAttr 0x113e6e010 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113e6e190 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:357:70> col:31 __vector_base 'void (const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x113e6e068 <col:45, col:67> col:67 __a 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x113e6e250 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x113e6e2c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:358:5, col:20> col:5 used ~__vector_base 'void (void) noexcept'
|-CXXMethodDecl 0x113e6e378 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:361:57> col:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x113e6e420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6e4e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:364:64> line:363:15 capacity 'std::__1::__vector_base<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x113e6e590 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6e6b8 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:367:10 __destruct_at_end 'void (std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x113e6e5e8 <col:28, col:36> col:36 __new_last 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x113e6e768 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6e8b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:372:89> line:370:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &)'
| |-ParmVarDecl 0x113e6e7e8 <col:30, col:51> col:51 __c 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x113e6e960 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6eb00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:380:89> line:375:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &)' noexcept-uninstantiated 0x7fa66ae8bed8
| |-ParmVarDecl 0x113e6e9e8 <col:30, col:45> col:45 __c 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x113e6ebf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-AccessSpecDecl 0x113e6ec40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:381:1, col:8> col:1 private
|-CXXMethodDecl 0x113e6edf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:392:9> line:383:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::true_type)'
| |-ParmVarDecl 0x113e6ec78 <col:30, col:51> col:51 __c 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x113e6ecd8 <col:56> col:65 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x113e6eea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6f070 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:396:10> line:395:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::false_type)'
| |-ParmVarDecl 0x113e6ef00 <col:30, col:49> col:50 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x113e6ef60 <col:52> col:62 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x113e6f128 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e6f300 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:403:9> line:399:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::true_type)' noexcept-uninstantiated 0x7fa66ae8c748
| |-ParmVarDecl 0x113e6f180 <col:30, col:45> col:45 __c 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x113e6f1e0 <col:50> col:59 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x113e6f410 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
`-CXXMethodDecl 0x113e6f5e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:408:10> line:406:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::false_type) noexcept'
  |-ParmVarDecl 0x113e6f468 <col:30, col:43> col:44 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
  |-ParmVarDecl 0x113e6f4c8 <col:46> col:56 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
  `-AlwaysInlineAttr 0x113e6f6a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__vector_base" = type { i32*, i32*, %"class.std::__1::__compressed_pair" }
  NonVirtualBaseLLVMType:%"class.std::__1::__vector_base" = type { i32*, i32*, %"class.std::__1::__compressed_pair" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x113b57068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:451:1, line:881:1> line:452:28 class vector definition
|-private '__vector_base<int, class std::__1::allocator<int> >':'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x113e6f758 prev 0x113b57068 <col:1, col:28> col:28 implicit class vector
|-AccessSpecDecl 0x113e6f7f0 <line:455:1, col:8> col:1 private
|-TypedefDecl 0x113e6f8e8 <line:456:5, col:54> col:54 __base '__vector_base<int, class std::__1::allocator<int> >':'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x113e6f840 '__vector_base<int, class std::__1::allocator<int> >' sugar __vector_base
|   |-TemplateArgument type 'int':'int'
|   |-TemplateArgument type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|   `-RecordType 0x113b57510 'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x113b57408 '__vector_base'
|-TypedefDecl 0x113e6f9c8 <line:457:5, col:54> col:54 __default_allocator_type 'allocator<int>':'class std::__1::allocator<int>'
| `-TemplateSpecializationType 0x113e6f950 'allocator<int>' sugar allocator
|   |-TemplateArgument type 'int':'int'
|   `-RecordType 0x113b56fd0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x113b56ee8 'allocator'
|-AccessSpecDecl 0x113e6fa20 <line:458:1, col:7> col:1 public
|-TypedefDecl 0x113e6fa58 <line:459:5, col:54> col:54 __self 'class std::__1::vector<int, class std::__1::allocator<int> >'
| `-RecordType 0x113b57170 'class std::__1::vector<int, class std::__1::allocator<int> >'
|   `-ClassTemplateSpecialization 0x113b57068 'vector'
|-TypedefDecl 0x113e6fac0 <line:460:5, col:54> col:54 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x113b57390 'int' sugar
|   |-TemplateTypeParmType 0x7fa66e002ad0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fa66e002a90 '_Tp'
|   `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113e6fb28 <line:461:5, col:54> col:54 allocator_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x113b573d0 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7fa66e002b40 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fa66e002af8 '_Allocator'
|   `-RecordType 0x113b56fd0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x113b56ee8 'allocator'
|-TypedefDecl 0x113e6fc30 <line:462:5, col:54> col:54 __alloc_traits 'typename __base::__alloc_traits':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-ElaboratedType 0x113e6fbe0 'typename __base::__alloc_traits' sugar
|   `-TypedefType 0x113b57bd0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::__alloc_traits' sugar
|     |-Typedef 0x113b57a08 '__alloc_traits'
|     `-TemplateSpecializationType 0x113b57990 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>' sugar allocator_traits
|       |-TemplateArgument type 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type':'class std::__1::allocator<int>'
|       `-RecordType 0x113b57970 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|         `-ClassTemplateSpecialization 0x113b57880 'allocator_traits'
|-TypedefDecl 0x113e6fd20 <line:463:5, col:54> col:54 reference 'typename __base::reference':'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ElaboratedType 0x113e6fcd0 'typename __base::reference' sugar
|   `-TypedefType 0x113e6fcb0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::reference' sugar
|     |-Typedef 0x113b57ab8 'reference'
|     `-LValueReferenceType 0x113b57a80 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|       `-TypedefType 0x113b57a60 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|         |-Typedef 0x113b57768 'value_type'
|         `-SubstTemplateTypeParmType 0x113b57730 'int' sugar
|           |-TemplateTypeParmType 0x7fa66ae898a0 '_Tp' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x7fa66ae89860 '_Tp'
|           `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113e6fe10 <line:464:5, col:54> col:54 const_reference 'typename __base::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ElaboratedType 0x113e6fdc0 'typename __base::const_reference' sugar
|   `-TypedefType 0x113e6fda0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_reference' sugar
|     |-Typedef 0x113b57b78 'const_reference'
|     `-LValueReferenceType 0x113b57b40 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|       `-QualType 0x113b57a61 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' const
|         `-TypedefType 0x113b57a60 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|           |-Typedef 0x113b57768 'value_type'
|           `-SubstTemplateTypeParmType 0x113b57730 'int' sugar
|             |-TemplateTypeParmType 0x7fa66ae898a0 '_Tp' dependent depth 0 index 0
|             | `-TemplateTypeParm 0x7fa66ae89860 '_Tp'
|             `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113e6fee0 <line:465:5, col:54> col:54 size_type 'typename __base::size_type':'unsigned long'
| `-ElaboratedType 0x113e6fe90 'typename __base::size_type' sugar
|   `-TypedefType 0x113e6e470 'std::__1::__vector_base<int, class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x113e64830 'size_type'
|     `-ElaboratedType 0x113e647e0 'typename __alloc_traits::size_type' sugar
|       `-TypedefType 0x113e5d740 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|         |-Typedef 0x113e56b50 'size_type'
|         `-ElaboratedType 0x113e56b00 'typename __size_type<allocator_type, difference_type>::type' sugar
|           `-TypedefType 0x113e56ae0 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|             |-Typedef 0x113e56a60 'type'
|             `-ElaboratedType 0x113e56a10 'typename class allocator<int>::size_type' sugar
|               `-TypedefType 0x113e55f50 'std::__1::allocator<int>::size_type' sugar
|                 |-Typedef 0x113b57f78 'size_type'
|                 `-TypedefType 0x7fa66b858c10 'size_t' sugar
|                   |-Typedef 0x7fa66b04e5b0 'size_t'
|                   `-BuiltinType 0x7fa66b019e80 'unsigned long'
|-TypedefDecl 0x113e6ffd0 <line:466:5, col:54> col:54 difference_type 'typename __base::difference_type':'long'
| `-ElaboratedType 0x113e6ff80 'typename __base::difference_type' sugar
|   `-TypedefType 0x113e6ff60 'std::__1::__vector_base<int, class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x113e64900 'difference_type'
|     `-ElaboratedType 0x113e648b0 'typename __alloc_traits::difference_type' sugar
|       `-TypedefType 0x113e55370 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|         |-Typedef 0x113e55300 'difference_type'
|         `-ElaboratedType 0x113e552b0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|           `-TypedefType 0x113e55290 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|             |-Typedef 0x113e55210 'type'
|             `-ElaboratedType 0x113e551c0 'typename class allocator<int>::difference_type' sugar
|               `-TypedefType 0x113e546d0 'std::__1::allocator<int>::difference_type' sugar
|                 |-Typedef 0x113b57fd0 'difference_type'
|                 `-TypedefType 0x7fa66a832750 'ptrdiff_t' sugar
|                   |-Typedef 0x7fa66b04e540 'ptrdiff_t'
|                   `-BuiltinType 0x7fa66b019de0 'long'
|-TypedefDecl 0x113e700a0 <line:467:5, col:54> col:54 pointer 'typename __base::pointer':'int *'
| `-ElaboratedType 0x113e70050 'typename __base::pointer' sugar
|   `-TypedefType 0x113e64b20 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x113e649d0 'pointer'
|     `-ElaboratedType 0x113e64980 'typename __alloc_traits::pointer' sugar
|       `-TypedefType 0x113e4d8e0 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|         |-Typedef 0x113e4d870 'pointer'
|         `-ElaboratedType 0x113e4d820 'typename __pointer_type<value_type, allocator_type>::type' sugar
|           `-TypedefType 0x113e4d800 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|             |-Typedef 0x113e4d780 'type'
|             `-ElaboratedType 0x113e4d730 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|               `-TypedefType 0x113e4d710 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|                 |-Typedef 0x113e4d690 'type'
|                 `-ElaboratedType 0x113e4d640 'typename class allocator<int>::pointer' sugar
|                   `-TypedefType 0x113b58c50 'std::__1::allocator<int>::pointer' sugar
|                     |-Typedef 0x113b58098 'pointer'
|                     `-PointerType 0x113b58060 'int *'
|                       `-SubstTemplateTypeParmType 0x113b58030 'int' sugar
|                         |-TemplateTypeParmType 0x7fa66acf51a0 '_Tp' dependent depth 0 index 0
|                         | `-TemplateTypeParm 0x7fa66acf5158 '_Tp'
|                         `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113e70170 <line:468:5, col:54> col:54 const_pointer 'typename __base::const_pointer':'const int *'
| `-ElaboratedType 0x113e70120 'typename __base::const_pointer' sugar
|   `-TypedefType 0x113e64bb0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x113e64ac0 'const_pointer'
|     `-ElaboratedType 0x113e64a70 'typename __alloc_traits::const_pointer' sugar
|       `-TypedefType 0x113e64a50 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|         |-Typedef 0x113e4f100 'const_pointer'
|         `-ElaboratedType 0x113e4f0b0 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|           `-TypedefType 0x113e4f090 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x113e4f010 'type'
|             `-ElaboratedType 0x113e4efc0 'typename class allocator<int>::const_pointer' sugar
|               `-TypedefType 0x113b58ea0 'std::__1::allocator<int>::const_pointer' sugar
|                 |-Typedef 0x113b58128 'const_pointer'
|                 `-PointerType 0x113b580f0 'const int *'
|                   `-QualType 0x113b58031 'const int' const
|                     `-SubstTemplateTypeParmType 0x113b58030 'int' sugar
|                       |-TemplateTypeParmType 0x7fa66acf51a0 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7fa66acf5158 '_Tp'
|                       `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x113e70388 <line:469:5, col:54> col:54 iterator '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::pointer>':'class std::__1::__wrap_iter<int *>'
| `-TemplateSpecializationType 0x113e70310 '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|   `-RecordType 0x113e702f0 'class std::__1::__wrap_iter<int *>'
|     `-ClassTemplateSpecialization 0x113e70200 '__wrap_iter'
|-TypedefDecl 0x113e70598 <line:470:5, col:54> col:54 const_iterator '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::const_pointer>':'class std::__1::__wrap_iter<const int *>'
| `-TemplateSpecializationType 0x113e70520 '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::const_pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::const_pointer':'const int *'
|   `-RecordType 0x113e70500 'class std::__1::__wrap_iter<const int *>'
|     `-ClassTemplateSpecialization 0x113e70410 '__wrap_iter'
|-TypedefDecl 0x113e707f0 <line:471:5, col:55> col:55 reverse_iterator 'std::__1::reverse_iterator<iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<int *> >'
| `-ElaboratedType 0x113e70780 'std::__1::reverse_iterator<iterator>' sugar
|   `-TemplateSpecializationType 0x113e70730 'reverse_iterator<std::__1::vector<int, class std::__1::allocator<int> >::iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::iterator':'class std::__1::__wrap_iter<int *>'
|     `-RecordType 0x113e70710 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<int *> >'
|       `-ClassTemplateSpecialization 0x113e70620 'reverse_iterator'
|-TypedefDecl 0x113e70a50 <line:472:5, col:55> col:55 const_reverse_iterator 'std::__1::reverse_iterator<const_iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const int *> >'
| `-ElaboratedType 0x113e709e0 'std::__1::reverse_iterator<const_iterator>' sugar
|   `-TemplateSpecializationType 0x113e70990 'reverse_iterator<std::__1::vector<int, class std::__1::allocator<int> >::const_iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|     `-RecordType 0x113e70970 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const int *> >'
|       `-ClassTemplateSpecialization 0x113e70880 'reverse_iterator'
|-StaticAssertDecl 0x113e70fd8 <line:474:5, line:475:74> line:474:5
| |-ParenExpr 0x113e70fa0 <col:19, col:83> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x113e70f68 <col:20, col:78> 'const _Bool':'const _Bool' lvalue Var 0x7fa66b0d6110 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fa66e0044e0 <line:475:19> 'const char [54]' lvalue "Allocator::value_type must be same type as value_type"
|-CXXConstructorDecl 0x113e71078 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:483:9> line:478:5 used vector 'void (void) noexcept(is_nothrow_default_constructible<allocator_type>::value)'
| `-AlwaysInlineAttr 0x113e71198 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113e71310 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:495:5> line:484:40 vector 'void (const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)' noexcept-uninstantiated 0x7fa66e004858
| |-ParmVarDecl 0x113e71218 <col:47, col:69> col:69 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x113e71418 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113e71570 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:496:5, col:34> col:14 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x113e71490 <col:21, col:31> col:31 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXConstructorDecl 0x113e717e0 <line:498:5, col:61> col:14 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x113e71640 <col:21, col:31> col:31 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x113e716b0 <col:36, col:58> col:58 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-CXXConstructorDecl 0x113e71a80 <line:500:5, col:46> col:5 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x113e718b8 <col:12, col:22> col:22 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x113e71950 <col:27, col:43> col:43 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXConstructorDecl 0x113e71d90 <line:501:5, col:73> col:5 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x113e71b58 <col:12, col:22> col:22 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| |-ParmVarDecl 0x113e71bc8 <col:27, col:43> col:43 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ParmVarDecl 0x113e71c38 <col:48, col:70> col:70 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-FunctionTemplateDecl 0x113e72828 <line:502:5, line:509:62> line:503:9 vector
| |-TemplateTypeParmDecl 0x113e71e60 <line:502:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x113e72780 <line:503:9, line:509:62> line:503:9 vector 'void (_InputIterator, typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, _InputIterator>::type)'
|   |-ParmVarDecl 0x113e71ef0 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x113e72650 <line:504:16, line:509:56> col:56 __last 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, _InputIterator>::type'
|-FunctionTemplateDecl 0x113e73398 <line:510:5, line:516:108> line:511:9 vector
| |-TemplateTypeParmDecl 0x113e72910 <line:510:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x113e732f0 <line:511:9, line:516:108> line:511:9 vector 'void (_InputIterator, _InputIterator, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &, typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value>::type *)'
|   |-ParmVarDecl 0x113e729a0 <col:16, col:31> col:31 __first '_InputIterator'
|   |-ParmVarDecl 0x113e72a10 <col:40, col:55> col:55 __last '_InputIterator'
|   |-ParmVarDecl 0x113e72a80 <col:63, col:85> col:85 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|   `-ParmVarDecl 0x113e73190 <line:512:16, line:516:107> col:105 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value>::type *'
|-FunctionTemplateDecl 0x113e73ca8 <line:517:5, line:523:64> line:518:9 vector
| |-TemplateTypeParmDecl 0x113e73490 <line:517:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXConstructorDecl 0x113e73c00 <line:518:9, line:523:64> line:518:9 vector 'void (_ForwardIterator, typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, _ForwardIterator>::type)'
|   |-ParmVarDecl 0x113e73520 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x113e73ad0 <line:519:16, line:523:58> col:58 __last 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, _ForwardIterator>::type'
|-FunctionTemplateDecl 0x113e746d8 <line:524:5, line:529:110> line:525:9 vector
| |-TemplateTypeParmDecl 0x113e73d90 <line:524:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXConstructorDecl 0x113e74630 <line:525:9, line:529:110> line:525:9 vector 'void (_ForwardIterator, _ForwardIterator, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &, typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value>::type *)'
|   |-ParmVarDecl 0x113e73e20 <col:16, col:33> col:33 __first '_ForwardIterator'
|   |-ParmVarDecl 0x113e73e90 <col:42, col:59> col:59 __last '_ForwardIterator'
|   |-ParmVarDecl 0x113e73f00 <col:67, col:89> col:89 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|   `-ParmVarDecl 0x113e744d0 <line:526:16, line:529:109> col:107 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value>::type *'
|-CXXConstructorDecl 0x113e74a90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:532:45> col:5 vector 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x113e74968 <col:12, col:41> col:41 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x113e74b50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113e74dd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:534:72> col:5 vector 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x113e74c28 <col:12, col:41> col:41 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| |-ParmVarDecl 0x113e74c98 <col:47, col:69> col:69 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x113e74e98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113e75000 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:544:5, col:29> col:5 vector 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &)'
| `-ParmVarDecl 0x113e74f18 <col:12, col:26> col:26 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
|-CXXConstructorDecl 0x113e75270 <line:545:5, col:56> col:5 vector 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x113e750d0 <col:12, col:26> col:26 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x113e75140 <col:31, col:53> col:53 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-CXXMethodDecl 0x113e75440 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:547:40> col:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(const class std::__1::vector<int, class std::__1::allocator<int> > &)'
| |-ParmVarDecl 0x113e75378 <col:23, col:37> col:37 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x113e754f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113e756b0 <col:35, line:739:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:550:5 vector 'void (class std::__1::vector<int, class std::__1::allocator<int> > &&)' noexcept-uninstantiated 0x7fa66e008a38
| |-ParmVarDecl 0x113e75578 <col:12, col:21> col:21 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| `-AlwaysInlineAttr 0x113e757b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113e759b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:557:51> col:5 vector 'void (class std::__1::vector<int, class std::__1::allocator<int> > &&, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x113e75810 <col:12, col:21> col:21 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| |-ParmVarDecl 0x113e75880 <col:26, col:48> col:48 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x113e75a78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e75be0 <col:35, line:739:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:559:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(class std::__1::vector<int, class std::__1::allocator<int> > &&)' noexcept-uninstantiated 0x7fa66e008f58
| |-ParmVarDecl 0x113e75ad0 <col:23, col:32> col:32 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| `-AlwaysInlineAttr 0x113e75cd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e75eb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:565:57> line:564:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x113e75da8 <col:23, col:52> col:52 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x113e75f60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x113e76818 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:568:5, line:578:61> col:9 assign
| |-TemplateTypeParmDecl 0x113e75fa8 <line:568:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x113e76780 <line:569:9, line:578:61> col:9 assign 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, void>::type (_InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x113e765f0 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x113e76660 <col:40, col:55> col:55 __last '_InputIterator'
|-FunctionTemplateDecl 0x113e77028 <line:579:5, line:588:65> col:9 assign
| |-TemplateTypeParmDecl 0x113e76900 <line:579:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x113e76f90 <line:580:9, line:588:65> col:9 assign 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, void>::type (_ForwardIterator, _ForwardIterator)'
|   |-ParmVarDecl 0x113e76e00 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x113e76e70 <col:42, col:59> col:59 __last '_ForwardIterator'
|-CXXMethodDecl 0x113e77220 <line:590:5, col:51> col:10 assign 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x113e77120 <col:17, col:27> col:27 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x113e77190 <col:32, col:48> col:48 __u 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x113e77430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:594:43> line:593:10 assign 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x113e77368 <col:17, col:46> col:46 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x113e774e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e775b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:599:33> line:598:20 get_allocator 'std::__1::vector<int, class std::__1::allocator<int> >::allocator_type (void) const noexcept'
| `-AlwaysInlineAttr 0x113e77660 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e77738 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:601:54 begin 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x113e777e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e778b8 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:602:54 begin 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x113e77960 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e779d0 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:603:54 end 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x113e77a78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e77ae8 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:604:54 end 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x113e77b90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e77c88 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:608:47> line:607:28 rbegin 'std::__1::vector<int, class std::__1::allocator<int> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x113e77d30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e77e28 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:611:47> line:610:28 rbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x113e77ed0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e77f40 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:614:49> line:613:28 rend 'std::__1::vector<int, class std::__1::allocator<int> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x113e77fe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e78058 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:617:49> line:616:28 rend 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x113e78100 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e78170 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:621:25> line:620:28 cbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x113e78218 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e78288 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:624:23> line:623:28 cend 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x113e78330 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e783a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:627:26> line:626:28 crbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x113e78448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e784b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:630:24> line:629:28 crend 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x113e78560 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e78608 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:634:71> line:633:15 size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x113e786b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e78720 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:637:36> line:636:15 capacity 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x113e787c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e78810 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:640:48> line:639:10 empty '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x113e788b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e78928 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:641:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:641:15 max_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
|-CXXMethodDecl 0x113e78a68 <line:642:5, col:31> col:10 reserve 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x113e789e0 <col:18, col:28> col:28 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x113e78b18 <line:643:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:643:10 shrink_to_fit 'void (void) noexcept'
|-CXXMethodDecl 0x113e78cf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:645:71> col:47 operator[] 'std::__1::vector<int, class std::__1::allocator<int> >::reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| |-ParmVarDecl 0x113e78bf0 <col:58, col:68> col:68 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x113e78da0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e78f00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:646:73> col:47 operator[] 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x113e78df8 <col:58, col:68> col:68 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x113e78fb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e79090 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:647:5, col:37> col:21 at 'std::__1::vector<int, class std::__1::allocator<int> >::reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x113e79008 <col:24, col:34> col:34 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x113e791d8 <line:648:5, col:39> col:21 at 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| `-ParmVarDecl 0x113e79150 <col:24, col:34> col:34 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x113e79310 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:654:5> line:650:47 front 'std::__1::vector<int, class std::__1::allocator<int> >::reference (void)'
| `-AlwaysInlineAttr 0x113e793b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e79480 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:659:5> line:655:47 front 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x113e79528 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e79590 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:664:5> line:660:47 back 'std::__1::vector<int, class std::__1::allocator<int> >::reference (void)'
| `-AlwaysInlineAttr 0x113e79638 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e796a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:669:5> line:665:47 back 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x113e79748 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e79818 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:673:57> line:672:23 data 'std::__1::vector<int, class std::__1::allocator<int> >::value_type *(void) noexcept'
| `-AlwaysInlineAttr 0x113e798c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e799c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:676:57> line:675:23 data 'const std::__1::vector<int, class std::__1::allocator<int> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x113e79a70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e79bd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:678:65> col:36 push_back 'void (std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x113e79ac8 <col:46, col:62> col:62 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-AlwaysInlineAttr 0x113e79c80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e79e40 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:680:62> col:36 push_back 'void (std::__1::vector<int, class std::__1::allocator<int> >::value_type &&)'
| |-ParmVarDecl 0x113e79d38 <col:46, col:59> col:59 __x 'std::__1::vector<int, class std::__1::allocator<int> >::value_type &&'
| `-AlwaysInlineAttr 0x113e79ef0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x113e7a1a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:682:5, line:687:49> col:19 emplace_back
| |-TemplateTypeParmDecl 0x113e79f38 <line:682:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x113e7a110 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:687:49> col:19 emplace_back 'void (_Args &&...)'
|   |-ParmVarDecl 0x113e7a048 <col:32, col:43> col:43 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x113e7a200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x113e7a2d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:692:19> col:10 pop_back 'void (void)'
| `-AlwaysInlineAttr 0x113e7a378 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x113e7a550 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:694:5, col:67> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x113e7a3d0 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x113e7a440 <col:48, col:64> col:64 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x113e7a7a0 <line:696:5, col:64> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::value_type &&)'
| |-ParmVarDecl 0x113e7a618 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x113e7a688 <col:48, col:61> col:61 __x 'std::__1::vector<int, class std::__1::allocator<int> >::value_type &&'
|-FunctionTemplateDecl 0x113e7ab88 <line:698:5, line:699:70> col:18 emplace
| |-TemplateTypeParmDecl 0x113e7a858 <line:698:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x113e7aaf0 <line:699:9, col:70> col:18 emplace 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _Args &&...)'
|   |-ParmVarDecl 0x113e7a8f0 <col:26, col:41> col:41 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   `-ParmVarDecl 0x113e7a9d8 <col:53, col:64> col:64 __args '_Args &&...'
|-CXXMethodDecl 0x113e7ae90 <line:702:5, col:82> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x113e7ac80 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| |-ParmVarDecl 0x113e7acf0 <col:48, col:58> col:58 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x113e7ad60 <col:63, col:79> col:79 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-FunctionTemplateDecl 0x113e7b908 <line:703:5, line:713:88> col:9 insert
| |-TemplateTypeParmDecl 0x113e7af50 <line:703:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x113e7b870 <line:704:9, line:713:88> col:9 insert 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, iterator>::type (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x113e7b650 <col:16, col:31> col:31 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   |-ParmVarDecl 0x113e7b6c0 <col:43, col:58> col:58 __first '_InputIterator'
|   `-ParmVarDecl 0x113e7b730 <col:67, col:82> col:82 __last '_InputIterator'
|-FunctionTemplateDecl 0x113e7c278 <line:714:5, line:723:92> col:9 insert
| |-TemplateTypeParmDecl 0x113e7b9f8 <line:714:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x113e7c1e0 <line:715:9, line:723:92> col:9 insert 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, iterator>::type (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _ForwardIterator, _ForwardIterator)'
|   |-ParmVarDecl 0x113e7bfc0 <col:16, col:31> col:31 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   |-ParmVarDecl 0x113e7c030 <col:43, col:60> col:60 __first '_ForwardIterator'
|   `-ParmVarDecl 0x113e7c0a0 <col:69, col:86> col:86 __last '_ForwardIterator'
|-CXXMethodDecl 0x113e7c580 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:727:62> line:726:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x113e7c378 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| |-ParmVarDecl 0x113e7c468 <col:48, col:77> col:77 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x113e7c638 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e7c790 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:730:71> col:40 erase 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator)'
| |-ParmVarDecl 0x113e7c690 <col:46, col:61> col:61 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-AlwaysInlineAttr 0x113e7c840 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e7ca20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:731:5, col:65> col:14 erase 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::const_iterator)'
| |-ParmVarDecl 0x113e7c898 <col:20, col:35> col:35 __first 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x113e7c908 <col:44, col:59> col:59 __last 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|-CXXMethodDecl 0x113e7cad8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:740:5> line:734:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x113e7cb80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e7cc60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:742:5, col:31> col:10 resize 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x113e7cbd8 <col:17, col:27> col:27 __sz 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x113e7ce20 <line:743:5, col:52> col:10 resize 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x113e7cd20 <col:17, col:27> col:27 __sz 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x113e7cd90 <col:33, col:49> col:49 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x113e7cff8 <line:745:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:745:10 swap 'void (class std::__1::vector<int, class std::__1::allocator<int> > &) noexcept'
| `-ParmVarDecl 0x113e7cee8 <col:15, col:21> col:22 'class std::__1::vector<int, class std::__1::allocator<int> > &'
|-CXXMethodDecl 0x113e7d0a8 <line:753:5, col:25> col:10 __invariants '_Bool (void) const'
|-AccessSpecDecl 0x113e7d150 <line:764:1, col:8> col:1 private
|-CXXMethodDecl 0x113e7d178 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:765:63> col:36 __invalidate_all_iterators 'void (void)'
| `-AlwaysInlineAttr 0x113e7d220 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e7d340 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:766:82> col:36 __invalidate_iterators_past 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x113e7d278 <col:64, col:72> col:72 __new_last 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x113e7d3f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e7d4d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:767:5, col:32> col:10 allocate 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x113e7d448 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x113e7d580 <line:768:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:768:10 deallocate 'void (void) noexcept'
|-CXXMethodDecl 0x113e7d700 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:769:75> col:41 __recommend 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x113e7d638 <col:53, col:63> col:63 __new_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x113e7d7b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e7d890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:770:5, col:42> col:10 __construct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x113e7d808 <col:29, col:39> col:39 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x113e7da50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:772:63> col:10 __construct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x113e7d950 <col:29, col:39> col:39 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| |-ParmVarDecl 0x113e7d9c0 <col:44, col:60> col:60 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-AlwaysInlineAttr 0x113e7db08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-FunctionTemplateDecl 0x113e7e088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:773:5, line:779:92> col:9 __construct_at_end
| |-TemplateTypeParmDecl 0x113e7db50 <line:773:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x113e7dff0 <line:774:9, line:779:92> col:9 __construct_at_end 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value, void>::type (_ForwardIterator, _ForwardIterator, std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
|   |-ParmVarDecl 0x113e7ddd0 <col:28, col:45> col:45 __first '_ForwardIterator'
|   |-ParmVarDecl 0x113e7de40 <col:54, col:71> col:71 __last '_ForwardIterator'
|   `-ParmVarDecl 0x113e7deb0 <col:79, col:89> col:89 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x113e7e210 <line:780:5, col:32> col:10 __append 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x113e7e188 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x113e7e3d0 <line:781:5, col:53> col:10 __append 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x113e7e2d0 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x113e7e340 <col:34, col:50> col:50 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x113e7e5a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:783:20 __make_iter 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x113e7e498 <col:32, col:40> col:40 __p 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x113e7e658 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e7e7b8 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:785:20 __make_iter 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_pointer) const noexcept'
| |-ParmVarDecl 0x113e7e6b0 <col:32, col:46> col:46 __p 'std::__1::vector<int, class std::__1::allocator<int> >::const_pointer':'const int *'
| `-AlwaysInlineAttr 0x113e7e868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e7ec30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:786:5, col:85> col:10 __swap_out_circular_buffer 'void (__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &)'
| `-ParmVarDecl 0x113e7eb28 <col:37, col:82> col:82 __v '__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &'
|-CXXMethodDecl 0x113e7ef60 <line:787:5, col:101> col:13 __swap_out_circular_buffer 'std::__1::vector<int, class std::__1::allocator<int> >::pointer (__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &, std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x113e7edd8 <col:40, col:85> col:85 __v '__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &'
| `-ParmVarDecl 0x113e7ee48 <col:90, col:98> col:98 __p 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|-CXXMethodDecl 0x113e7f240 <line:788:5, col:71> col:10 __move_range 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer, std::__1::vector<int, class std::__1::allocator<int> >::pointer, std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x113e7f028 <col:23, col:31> col:31 __from_s 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| |-ParmVarDecl 0x113e7f098 <col:41, col:49> col:49 __from_e 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-ParmVarDecl 0x113e7f108 <col:59, col:67> col:67 __to 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|-CXXMethodDecl 0x113e7f490 <line:789:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:739:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:789:10 __move_assign 'void (class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::true_type)' noexcept-uninstantiated 0x7fa66c25dc08
| |-ParmVarDecl 0x113e7f310 <col:24, col:32> col:32 __c 'class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x113e7f370 <col:37> col:46 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
|-CXXMethodDecl 0x113e7f730 <line:791:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:739:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:791:10 __move_assign 'void (class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::false_type)' noexcept-uninstantiated 0x7fa66c25de48
| |-ParmVarDecl 0x113e7f5b0 <col:24, col:32> col:32 __c 'class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x113e7f610 <col:37> col:47 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
|-CXXMethodDecl 0x113e7f918 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:800:5> line:794:10 __destruct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x113e7f850 <col:28, col:36> col:36 __new_last 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x113e7f9c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x113e7fc28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:801:5, line:804:40> col:9 __push_back_slow_path
| |-TemplateTypeParmDecl 0x113e7fa10 <line:801:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXMethodDecl 0x113e7fb90 <line:802:9, line:804:40> col:9 __push_back_slow_path 'void (_Up &&)'
|   `-ParmVarDecl 0x113e7fac8 <col:31, col:37> col:37 __x '_Up &&'
|-FunctionTemplateDecl 0x113e7ff78 <line:809:5, line:811:51> col:9 __emplace_back_slow_path
| |-TemplateTypeParmDecl 0x113e7fd08 <line:809:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x113e7fee0 <line:810:9, line:811:51> col:9 __emplace_back_slow_path 'void (_Args &&...)'
|   `-ParmVarDecl 0x113e7fe18 <col:34, col:45> col:45 __args '_Args &&...'
|-CXXMethodDecl 0x113e80218 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:829:62> line:828:10 __annotate_contiguous_container 'void (const void *, const void *, const void *, const void *) const'
| |-ParmVarDecl 0x113e80058 <col:42, col:52> col:53 'const void *'
| |-ParmVarDecl 0x113e800b8 <col:55, col:65> col:66 'const void *'
| |-ParmVarDecl 0x113e80118 <col:68, col:78> col:79 'const void *'
| |-ParmVarDecl 0x113e80178 <line:829:42, col:52> col:53 'const void *'
| `-AlwaysInlineAttr 0x113e802e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e80440 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:835:5> line:832:10 __annotate_new 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x113e80338 <col:25, col:35> col:35 __current_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x113e804f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e80538 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:841:5> line:838:10 __annotate_delete 'void (void) const'
| `-AlwaysInlineAttr 0x113e805e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e806c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:848:5> line:844:10 __annotate_increase 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x113e80638 <col:30, col:40> col:40 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x113e80770 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e80850 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:855:5> line:851:10 __annotate_shrink 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x113e807c8 <col:28, col:38> col:38 __old_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x113e80900 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXRecordDecl 0x113e80948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:874:5, col:12> col:12 struct __RAII_IncreaseAnnotator
`-CXXDestructorDecl 0x113e80a30 <line:452:28> col:28 implicit used ~vector 'void (void) noexcept' inline default
  `-CompoundStmt 0x113e82768 <col:28>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::vector" = type { %"class.std::__1::__vector_base" }
  NonVirtualBaseLLVMType:%"class.std::__1::vector" = type { %"class.std::__1::__vector_base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__atomic_base<_Bool, false>
         0 |   _Atomic(_Bool) __a_
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::atomic<_Bool>
         0 |   struct std::__1::__atomic_base<_Bool, false> (base)
         0 |     _Atomic(_Bool) __a_
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x113e843b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:877:1, line:980:1> line:878:8 struct __atomic_base definition
|-TemplateArgument type '_Bool'
|-TemplateArgument integral 0
|-CXXRecordDecl 0x113e845f0 prev 0x113e843b8 <col:1, col:8> col:8 implicit struct __atomic_base
|-FieldDecl 0x113e846d0 <line:880:5, col:26> col:26 __a_ '_Atomic(_Bool)' mutable
|-CXXMethodDecl 0x113e84718 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:894:5> line:887:10 is_lock_free '_Bool (void) const volatile noexcept'
| `-AlwaysInlineAttr 0x113e847e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e84830 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:897:82> line:896:10 is_lock_free '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x113e848d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e84aa8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:901:46> line:899:10 store 'void (_Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x113e84930 <col:16, col:20> col:20 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x113e84990 <col:25, col:44> col:38 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x113e84b60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-DiagnoseIfAttr 0x113e85b40 <line:1070:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x113e84aa8 'store' 'void (_Bool, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x113e85b18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:900:40, line:566:35> '_Bool' '||'
|     |-BinaryOperator 0x113e855d8 <line:900:40, line:565:35> '_Bool' '||'
|     | |-BinaryOperator 0x113e85098 <line:900:40, line:564:35> '_Bool' '=='
|     | | |-ImplicitCastExpr 0x113e85068 <line:900:40> 'int' <IntegralCast>
|     | | | `-ImplicitCastExpr 0x113e85050 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | | |   `-DeclRefExpr 0x113e84ba8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x113e84990 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | | `-ImplicitCastExpr 0x113e85080 <line:564:35> 'int' <IntegralCast>
|     | |   `-DeclRefExpr 0x7fa66a8d58d8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fa66a8cb340 'memory_order_consume' 'enum std::__1::memory_order'
|     | `-BinaryOperator 0x113e855b0 <line:900:40, line:565:35> '_Bool' '=='
|     |   |-ImplicitCastExpr 0x113e85580 <line:900:40> 'int' <IntegralCast>
|     |   | `-ImplicitCastExpr 0x113e85568 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     |   |   `-DeclRefExpr 0x113e850c0 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x113e84990 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     |   `-ImplicitCastExpr 0x113e85598 <line:565:35> 'int' <IntegralCast>
|     |     `-DeclRefExpr 0x7fa66a8d5998 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fa66a8cb390 'memory_order_acquire' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x113e85af0 <line:900:40, line:566:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x113e85ac0 <line:900:40> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x113e85aa8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x113e85600 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x113e84990 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x113e85ad8 <line:566:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fa66a8d5a80 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fa66a8cb430 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x113e85d38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:905:46> line:903:10 store 'void (_Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x113e85bc0 <col:16, col:20> col:20 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x113e85c20 <col:25, col:44> col:38 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x113e85df0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-DiagnoseIfAttr 0x113e86dd0 <line:1070:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x113e85d38 'store' 'void (_Bool, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x113e86da8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:904:40, line:566:35> '_Bool' '||'
|     |-BinaryOperator 0x113e86868 <line:904:40, line:565:35> '_Bool' '||'
|     | |-BinaryOperator 0x113e86328 <line:904:40, line:564:35> '_Bool' '=='
|     | | |-ImplicitCastExpr 0x113e862f8 <line:904:40> 'int' <IntegralCast>
|     | | | `-ImplicitCastExpr 0x113e862e0 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | | |   `-DeclRefExpr 0x113e85e38 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x113e85c20 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | | `-ImplicitCastExpr 0x113e86310 <line:564:35> 'int' <IntegralCast>
|     | |   `-DeclRefExpr 0x7fa66a8d5ce0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fa66a8cb340 'memory_order_consume' 'enum std::__1::memory_order'
|     | `-BinaryOperator 0x113e86840 <line:904:40, line:565:35> '_Bool' '=='
|     |   |-ImplicitCastExpr 0x113e86810 <line:904:40> 'int' <IntegralCast>
|     |   | `-ImplicitCastExpr 0x113e867f8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     |   |   `-DeclRefExpr 0x113e86350 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x113e85c20 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     |   `-ImplicitCastExpr 0x113e86828 <line:565:35> 'int' <IntegralCast>
|     |     `-DeclRefExpr 0x7fa66a8d5da0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fa66a8cb390 'memory_order_acquire' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x113e86d80 <line:904:40, line:566:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x113e86d50 <line:904:40> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x113e86d38 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x113e86890 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x113e85c20 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x113e86d68 <line:566:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fa66a8d5e88 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fa66a8cb430 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x113e86f48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:909:47> line:907:9 load '_Bool (std::__1::memory_order) const volatile noexcept'
| |-ParmVarDecl 0x113e86e40 <col:14, col:33> col:27 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x113e86ff8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-DiagnoseIfAttr 0x113e87a98 <line:1070:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x113e86f48 'load' '_Bool (std::__1::memory_order) const volatile noexcept'
|   `-BinaryOperator 0x113e87a70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:908:39, line:571:35> '_Bool' '||'
|     |-BinaryOperator 0x113e87530 <line:908:39, line:570:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x113e87500 <line:908:39> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x113e874e8 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x113e87040 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x113e86e40 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x113e87518 <line:570:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fa66a8d6070 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fa66a8cb3e0 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x113e87a48 <line:908:39, line:571:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x113e87a18 <line:908:39> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x113e87a00 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x113e87558 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x113e86e40 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x113e87a30 <line:571:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fa66a8d6130 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fa66a8cb430 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x113e87c18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:913:47> line:911:9 load '_Bool (std::__1::memory_order) const noexcept'
| |-ParmVarDecl 0x113e87b08 <col:14, col:33> col:27 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x113e87cc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-DiagnoseIfAttr 0x113e88768 <line:1070:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x113e87c18 'load' '_Bool (std::__1::memory_order) const noexcept'
|   `-BinaryOperator 0x113e88740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:912:39, line:571:35> '_Bool' '||'
|     |-BinaryOperator 0x113e88200 <line:912:39, line:570:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x113e881d0 <line:912:39> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x113e881b8 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x113e87d10 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x113e87b08 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x113e881e8 <line:570:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fa66a8d6318 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fa66a8cb3e0 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x113e88718 <line:912:39, line:571:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x113e886e8 <line:912:39> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x113e886d0 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x113e88228 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x113e87b08 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x113e88700 <line:571:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fa66a8d63d8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fa66a8cb430 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXConversionDecl 0x113e88848 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:915:60> col:5 operator bool '_Bool (void) const volatile noexcept'
| `-AlwaysInlineAttr 0x113e888f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConversionDecl 0x113e889a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:917:60> col:5 operator bool '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x113e88a50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e88c38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:920:56> line:919:9 exchange '_Bool (_Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x113e88ab8 <col:18, col:22> col:22 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x113e88b18 <col:27, col:46> col:40 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x113e88cf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e88ec8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:923:56> line:922:9 exchange '_Bool (_Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x113e88d48 <col:18, col:22> col:22 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x113e88da8 <col:27, col:46> col:40 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x113e88f80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113e89288 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:928:80> line:925:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x113e89008 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x113e89078 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x113e890d8 <line:926:32, col:45> col:45 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x113e89138 <col:50, col:63> col:63 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x113e89350 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-DiagnoseIfAttr 0x113e89df0 <line:1070:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x113e89288 'compare_exchange_weak' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x113e89dc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:927:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x113e89888 <line:927:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x113e89858 <line:927:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x113e89840 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x113e89398 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x113e89138 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x113e89870 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fa66a8dd7c0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fa66a8cb3e0 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x113e89da0 <line:927:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x113e89d70 <line:927:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x113e89d58 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x113e898b0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x113e89138 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x113e89d88 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fa66a8dd880 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fa66a8cb430 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x113e8a0e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:933:80> line:930:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x113e89e70 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x113e89ee0 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x113e89f40 <line:931:32, col:45> col:45 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x113e89fa0 <col:50, col:63> col:63 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x113e8a1b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-DiagnoseIfAttr 0x113e8ac50 <line:1070:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x113e8a0e8 'compare_exchange_weak' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x113e8ac28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:932:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x113e8a6e8 <line:932:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x113e8a6b8 <line:932:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x113e8a6a0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x113e8a1f8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x113e89fa0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x113e8a6d0 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fa66a8dda68 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fa66a8cb3e0 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x113e8ac00 <line:932:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x113e8abd0 <line:932:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x113e8abb8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x113e8a710 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x113e89fa0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x113e8abe8 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fa66a8ddb28 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fa66a8cb430 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x113e8aea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:938:82> line:935:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x113e8acd0 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x113e8ad40 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x113e8ada0 <line:936:34, col:47> col:47 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x113e8ae00 <col:52, col:65> col:65 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x113e8af70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-DiagnoseIfAttr 0x113b69a30 <line:1070:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x113e8aea8 'compare_exchange_strong' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x113b69a08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:937:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x113b694c8 <line:937:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x113b69498 <line:937:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x113b69480 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x113e8afb8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x113e8ae00 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x113b694b0 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fa66a8ddd10 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fa66a8cb3e0 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x113b699e0 <line:937:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x113b699b0 <line:937:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x113b69998 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x113b694f0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x113e8ae00 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x113b699c8 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fa66a8dddd0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fa66a8cb430 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x113b69c88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:943:82> line:940:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x113b69ab0 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x113b69b20 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x113b69b80 <line:941:34, col:47> col:47 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x113b69be0 <col:52, col:65> col:65 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x113b69d50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-DiagnoseIfAttr 0x113b6a7f0 <line:1070:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x113b69c88 'compare_exchange_strong' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x113b6a7c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:942:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x113b6a288 <line:942:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x113b6a258 <line:942:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x113b6a240 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x113b69d98 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x113b69be0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x113b6a270 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fa66a8ddfb8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fa66a8cb3e0 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x113b6a7a0 <line:942:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x113b6a770 <line:942:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x113b6a758 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x113b6a2b0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x113b69be0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x113b6a788 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fa66a8de078 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fa66a8cb430 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x113b6aa78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:947:80> line:945:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x113b6a870 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x113b6a8e0 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x113b6a940 <line:946:31, col:50> col:44 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x113b6ab38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113b6ad98 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:951:80> line:949:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x113b6ab90 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x113b6ac00 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x113b6ac60 <line:950:32, col:51> col:45 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x113b6ae58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113b6b020 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:955:82> line:953:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x113b6aeb0 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x113b6af20 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x113b6af80 <line:954:31, col:50> col:44 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x113b6b0e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113b6b2a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:959:82> line:957:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x113b6b138 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x113b6b1a8 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x113b6b208 <line:958:34, col:53> col:47 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x113b6b368 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113b6b3f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:963:39> col:5 __atomic_base 'void (void) noexcept' default trivial
| `-AlwaysInlineAttr 0x113b6b4a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113b6b5e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:969:69> col:23 used constexpr __atomic_base 'void (_Bool) noexcept'
| |-ParmVarDecl 0x113b6b500 <col:37, col:41> col:41 used __d '_Bool':'_Bool'
| |-CXXCtorInitializer Field 0x113e846d0 '__a_' '_Atomic(_Bool)'
| | `-ImplicitCastExpr 0x113b6d0c8 <col:63> '_Atomic(_Bool)' <NonAtomicToAtomic>
| |   `-ImplicitCastExpr 0x113b6d0b0 <col:63> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x113b6d058 <col:63> '_Bool':'_Bool' lvalue ParmVar 0x113b6b500 '__d' '_Bool':'_Bool'
| |-CompoundStmt 0x7fa66a8d73d8 <col:68, col:69>
| `-AlwaysInlineAttr 0x113b6b6a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113b6b810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:971:5, col:48> col:5 __atomic_base 'void (const struct std::__1::__atomic_base<_Bool, false> &)' delete trivial
| `-ParmVarDecl 0x113b6b728 <col:19, col:38> col:39 'const struct std::__1::__atomic_base<_Bool, false> &'
|-CXXMethodDecl 0x113b6b9d0 <line:972:5, col:59> col:20 operator= 'struct std::__1::__atomic_base<_Bool, false> &(const struct std::__1::__atomic_base<_Bool, false> &)' delete trivial
| `-ParmVarDecl 0x113b6b908 <col:30, col:49> col:50 'const struct std::__1::__atomic_base<_Bool, false> &'
|-CXXMethodDecl 0x113b6bb50 <line:973:5, col:68> col:20 operator= 'struct std::__1::__atomic_base<_Bool, false> &(const struct std::__1::__atomic_base<_Bool, false> &) volatile' delete trivial
| `-ParmVarDecl 0x113b6ba90 <col:30, col:49> col:50 'const struct std::__1::__atomic_base<_Bool, false> &'
`-CXXDestructorDecl 0x113b6ced8 <line:878:8> col:8 implicit ~__atomic_base 'void (void)' inline default trivial noexcept-unevaluated 0x113b6ced8

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__atomic_base" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__atomic_base" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fa66a8f18a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1070:1, line:1086:1> line:1071:8 struct atomic definition
|-public '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>'
|-TemplateArgument type '_Bool'
|-CXXRecordDecl 0x113b6bc88 prev 0x7fa66a8f18a8 <col:1, col:8> col:8 implicit struct atomic
|-TypedefDecl 0x113b6c028 <line:1074:5, col:32> col:32 __base '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>'
| `-TemplateSpecializationType 0x113b6bfb0 '__atomic_base<_Bool>' sugar __atomic_base
|   |-TemplateArgument type '_Bool':'_Bool'
|   `-RecordType 0x113e844c0 'struct std::__1::__atomic_base<_Bool, false>'
|     `-ClassTemplateSpecialization 0x113e843b8 '__atomic_base'
|-CXXConstructorDecl 0x113b6c0c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, line:798:33> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1076:5 atomic 'void (void)' default trivial noexcept-unevaluated 0x113b6c0c0
| `-AlwaysInlineAttr 0x113b6c1a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113b6c2e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1078:64> col:23 used constexpr atomic 'void (_Bool) noexcept'
| |-ParmVarDecl 0x113b6c200 <col:30, col:34> col:34 used __d '_Bool':'_Bool'
| |-CXXCtorInitializer 'std::__1::atomic<_Bool>::__base':'struct std::__1::__atomic_base<_Bool, false>'
| | `-CXXConstructExpr 0x113b6d110 <col:51, col:61> '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>' 'void (_Bool) noexcept'
| |   `-ImplicitCastExpr 0x113b6d040 <col:58> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x113b6cfb8 <col:58> '_Bool':'_Bool' lvalue ParmVar 0x113b6c200 '__d' '_Bool':'_Bool'
| |-CompoundStmt 0x7fa66a830f00 <col:63, col:64>
| `-AlwaysInlineAttr 0x113b6c3a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113b6c508 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1082:41> line:1081:9 operator= '_Bool (_Bool) volatile noexcept'
| |-ParmVarDecl 0x113b6c400 <col:19, col:23> col:23 __d '_Bool':'_Bool'
| `-AlwaysInlineAttr 0x113b6c5b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x113b6c6d8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1085:41> line:1084:9 operator= '_Bool (_Bool) noexcept'
| |-ParmVarDecl 0x113b6c610 <col:19, col:23> col:23 __d '_Bool':'_Bool'
| `-AlwaysInlineAttr 0x113b6c788 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x113b6c7f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1071:8> col:8 implicit atomic 'void (const struct std::__1::atomic<_Bool> &)' inline default_delete trivial noexcept-unevaluated 0x113b6c7f8
| `-ParmVarDecl 0x113b6c920 <col:8> col:8 'const struct std::__1::atomic<_Bool> &'
|-CXXConstructorDecl 0x113b6c9b8 <col:8> col:8 implicit atomic 'void (struct std::__1::atomic<_Bool> &&)' inline default_delete trivial noexcept-unevaluated 0x113b6c9b8
| `-ParmVarDecl 0x113b6cae0 <col:8> col:8 'struct std::__1::atomic<_Bool> &&'
|-CXXMethodDecl 0x113b6cb78 <col:8, <invalid sloc>> col:8 implicit operator= 'struct std::__1::atomic<_Bool> &(const struct std::__1::atomic<_Bool> &)' inline default_delete trivial noexcept-unevaluated 0x113b6cb78
| `-ParmVarDecl 0x113b6cc90 <col:8> col:8 'const struct std::__1::atomic<_Bool> &'
`-CXXMethodDecl 0x113b6ccf8 <col:8, <invalid sloc>> col:8 implicit operator= 'struct std::__1::atomic<_Bool> &(struct std::__1::atomic<_Bool> &&)' inline default_delete trivial noexcept-unevaluated 0x113b6ccf8
  `-ParmVarDecl 0x113b6ce10 <col:8> col:8 'struct std::__1::atomic<_Bool> &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::atomic" = type { %"struct.std::__1::__atomic_base" }
  NonVirtualBaseLLVMType:%"struct.std::__1::atomic" = type { %"struct.std::__1::__atomic_base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fa66b0b2580 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:487:1, line:588:1> line:488:28 class duration definition
|-TemplateArgument type 'long long'
|-TemplateArgument type 'class std::__1::ratio<1, 1000>'
|-CXXRecordDecl 0x7fa66ad1ca58 prev 0x7fa66b0b2580 <col:1, col:28> col:28 implicit class duration
|-StaticAssertDecl 0x7fa66ad1cc10 <line:490:5, col:97> col:5
| |-UnaryOperator 0x7fa66ad1cbf0 <col:19, col:41> '_Bool' prefix '!'
| | `-ImplicitCastExpr 0x7fa66ad1cbd8 <col:20, col:41> '_Bool':'_Bool' <LValueToRValue>
| |   `-DeclRefExpr 0x7fa66ad1cba0 <col:20, col:41> 'const _Bool':'const _Bool' lvalue Var 0x7fa66a9ed548 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fa66b0a9828 <col:48> 'const char [48]' lvalue "A duration representation can not be a duration"
|-StaticAssertDecl 0x7fa66ad1d198 <line:491:5, col:107> col:5
| |-DeclRefExpr 0x7fa66ad1d148 <col:19, col:40> 'const _Bool':'const _Bool' lvalue Var 0x7fa66b0d6110 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fa66b0a9a98 <col:47> 'const char [59]' lvalue "Second template parameter of duration must be a std::ratio"
|-StaticAssertDecl 0x7fa66ad20070 <line:492:5, col:71> col:5
| |-BinaryOperator 0x7fa66ad20048 <col:19, col:34> '_Bool' '>'
| | |-ImplicitCastExpr 0x7fa66ad20018 <col:19, col:28> 'intmax_t':'long' <LValueToRValue>
| | | `-DeclRefExpr 0x7fa66ad1ffe0 <col:19, col:28> 'const intmax_t':'const long' lvalue Var 0x7fa66ad1fa50 'num' 'const intmax_t':'const long'
| | `-ImplicitCastExpr 0x7fa66ad20030 <col:34> 'long' <IntegralCast>
| |   `-IntegerLiteral 0x7fa66b0a9bc8 <col:34> 'int' 0
| `-StringLiteral 0x7fa66b0a9ce0 <col:37> 'const char [33]' lvalue "duration period must be positive"
|-ClassTemplateDecl 0x7fa66ad20240 <line:494:5, line:495:12> col:12 __no_overflow
| |-TemplateTypeParmDecl 0x7fa66ad200a8 <line:494:15, col:21> col:21 class depth 0 index 0 _R1
| |-TemplateTypeParmDecl 0x7fa66ad20118 <col:26, col:32> col:32 class depth 0 index 1 _R2
| |-CXXRecordDecl 0x7fa66ad201a8 <line:495:5, col:12> col:12 struct __no_overflow
| `-ClassTemplateSpecializationDecl 0x7fa66ad27978 <line:494:5, line:495:12> col:12 struct __no_overflow definition
|   |-TemplateArgument type 'class std::__1::ratio<1, 1000>'
|   |-TemplateArgument type 'class std::__1::ratio<1, 1000>'
|   |-CXXRecordDecl 0x7fa66ad27bd8 prev 0x7fa66ad27978 <col:5, col:12> col:12 implicit struct __no_overflow
|   |-AccessSpecDecl 0x7fa66ad27c70 <line:497:5, col:12> col:5 private
|   |-VarDecl 0x7fa66ad27c98 <line:498:9, col:79> col:31 referenced __gcd_n1_n2 'const intmax_t':'const long' static cinit
|   | `-ImplicitCastExpr 0x7fa66ad27f88 <col:45, col:79> 'intmax_t':'long' <LValueToRValue>
|   |   `-DeclRefExpr 0x7fa66ad27f50 <col:45, col:79> 'const intmax_t':'const long' lvalue Var 0x7fa66b0eb430 'value' 'const intmax_t':'const long'
|   |-VarDecl 0x7fa66ad27ff8 <line:499:9, col:79> col:31 referenced __gcd_d1_d2 'const intmax_t':'const long' static cinit
|   | `-ImplicitCastExpr 0x7fa66ad28258 <col:45, col:79> 'intmax_t':'long' <LValueToRValue>
|   |   `-DeclRefExpr 0x7fa66ad28220 <col:45, col:79> 'const intmax_t':'const long' lvalue Var 0x7fa66ad24390 'value' 'const intmax_t':'const long'
|   |-VarDecl 0x7fa66ad282c8 <line:500:9, col:49> col:31 referenced __n1 'const intmax_t':'const long' static cinit
|   | `-BinaryOperator 0x7fa66ad283e8 <col:38, col:49> 'long' '/'
|   |   |-ImplicitCastExpr 0x7fa66ad283b8 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
|   |   | `-DeclRefExpr 0x7fa66ad28358 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fa66ad1fa50 'num' 'const intmax_t':'const long'
|   |   `-ImplicitCastExpr 0x7fa66ad283d0 <col:49> 'intmax_t':'long' <LValueToRValue>
|   |     `-DeclRefExpr 0x7fa66ad28390 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fa66ad27c98 '__gcd_n1_n2' 'const intmax_t':'const long'
|   |-VarDecl 0x7fa66ad28468 <line:501:9, col:49> col:31 referenced __d1 'const intmax_t':'const long' static cinit
|   | `-BinaryOperator 0x7fa66ad28588 <col:38, col:49> 'long' '/'
|   |   |-ImplicitCastExpr 0x7fa66ad28558 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
|   |   | `-DeclRefExpr 0x7fa66ad284f8 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fa66ad1fc80 'den' 'const intmax_t':'const long'
|   |   `-ImplicitCastExpr 0x7fa66ad28570 <col:49> 'intmax_t':'long' <LValueToRValue>
|   |     `-DeclRefExpr 0x7fa66ad28530 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fa66ad27ff8 '__gcd_d1_d2' 'const intmax_t':'const long'
|   |-VarDecl 0x7fa66ad28608 <line:502:9, col:49> col:31 referenced __n2 'const intmax_t':'const long' static cinit
|   | `-BinaryOperator 0x7fa66ad28728 <col:38, col:49> 'long' '/'
|   |   |-ImplicitCastExpr 0x7fa66ad286f8 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
|   |   | `-DeclRefExpr 0x7fa66ad28698 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fa66ad1fa50 'num' 'const intmax_t':'const long'
|   |   `-ImplicitCastExpr 0x7fa66ad28710 <col:49> 'intmax_t':'long' <LValueToRValue>
|   |     `-DeclRefExpr 0x7fa66ad286d0 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fa66ad27c98 '__gcd_n1_n2' 'const intmax_t':'const long'
|   |-VarDecl 0x7fa66ad287a8 <line:503:9, col:49> col:31 referenced __d2 'const intmax_t':'const long' static cinit
|   | `-BinaryOperator 0x7fa66ad288c8 <col:38, col:49> 'long' '/'
|   |   |-ImplicitCastExpr 0x7fa66ad28898 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
|   |   | `-DeclRefExpr 0x7fa66ad28838 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fa66ad1fc80 'den' 'const intmax_t':'const long'
|   |   `-ImplicitCastExpr 0x7fa66ad288b0 <col:49> 'intmax_t':'long' <LValueToRValue>
|   |     `-DeclRefExpr 0x7fa66ad28870 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fa66ad27ff8 '__gcd_d1_d2' 'const intmax_t':'const long'
|   |-VarDecl 0x7fa66ad28948 <line:504:9, col:93> col:31 referenced max 'const intmax_t':'const long' static cinit
|   | `-UnaryOperator 0x7fa66ad28b40 <col:37, col:93> 'long' prefix '-'
|   |   `-ParenExpr 0x7fa66ad28b20 <col:38, col:93> 'long'
|   |     `-BinaryOperator 0x7fa66ad28af8 <col:39, col:92> 'long' '+'
|   |       |-ParenExpr 0x7fa66ad28ac0 <col:39, col:88> 'intmax_t':'long'
|   |       | `-BinaryOperator 0x7fa66ad28a98 <col:40, col:87> 'intmax_t':'long' '<<'
|   |       |   |-CXXFunctionalCastExpr 0x7fa66ad289d0 <col:40, col:50> 'intmax_t':'long' functional cast to intmax_t <NoOp>
|   |       |   | `-ImplicitCastExpr 0x7fa66ad289b8 <col:49> 'intmax_t':'long' <IntegralCast>
|   |       |   |   `-IntegerLiteral 0x7fa66b0aae18 <col:49> 'int' 1
|   |       |   `-ParenExpr 0x7fa66ad28a78 <col:55, col:87> 'unsigned long'
|   |       |     `-BinaryOperator 0x7fa66ad28a50 <col:56, col:86> 'unsigned long' '-'
|   |       |       |-BinaryOperator 0x7fa66ad28a10 <col:56, <built-in>:66:22> 'unsigned long' '*'
|   |       |       | |-UnaryExprOrTypeTraitExpr 0x7fa66b0aae88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:504:56, col:71> 'unsigned long' sizeof 'intmax_t':'long'
|   |       |       | `-ImplicitCastExpr 0x7fa66ad289f8 <<built-in>:66:22> 'unsigned long' <IntegralCast>
|   |       |       |   `-IntegerLiteral 0x7fa66b0aaea8 <col:22> 'int' 8
|   |       |       `-ImplicitCastExpr 0x7fa66ad28a38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:504:86> 'unsigned long' <IntegralCast>
|   |       |         `-IntegerLiteral 0x7fa66b0aaf08 <col:86> 'int' 1
|   |       `-ImplicitCastExpr 0x7fa66ad28ae0 <col:92> 'long' <IntegralCast>
|   |         `-IntegerLiteral 0x7fa66b0aafd0 <col:92> 'int' 1
|   |-ClassTemplateDecl 0x7fa66ad28d80 <line:506:9, line:507:16> col:16 __mul
|   | |-NonTypeTemplateParmDecl 0x7fa66ad28bb8 <line:506:19, col:28> col:28 'intmax_t':'long' depth 0 index 0 _Xp
|   | |-NonTypeTemplateParmDecl 0x7fa66ad28c10 <col:33, col:42> col:42 'intmax_t':'long' depth 0 index 1 _Yp
|   | |-NonTypeTemplateParmDecl 0x7fa66ad28c68 <col:47, col:52> col:52 '_Bool' depth 0 index 2 __overflow
|   | |-CXXRecordDecl 0x7fa66ad28ce8 <line:507:9, col:16> col:16 struct __mul
|   | `-ClassTemplateSpecializationDecl 0x7fa66ad299e8 <line:506:9, line:507:16> col:16 struct __mul definition
|   |   |-TemplateArgument integral 1
|   |   |-TemplateArgument integral 1
|   |   |-TemplateArgument integral 0
|   |   |-CXXRecordDecl 0x7fa66c17f2c0 prev 0x7fa66ad299e8 <col:9, col:16> col:16 implicit struct __mul
|   |   `-VarDecl 0x7fa66c17f358 <line:509:13, col:49> col:35 referenced value 'const intmax_t':'const long' static cinit
|   |     `-BinaryOperator 0x7fa66c17f458 <col:43, col:49> 'long' '*'
|   |       |-SubstNonTypeTemplateParmExpr 0x7fa66c17f3e8 <col:43> 'long'
|   |       | `-IntegerLiteral 0x7fa66c17f3c8 <col:43> 'long' 1
|   |       `-SubstNonTypeTemplateParmExpr 0x7fa66c17f430 <col:49> 'long'
|   |         `-IntegerLiteral 0x7fa66c17f410 <col:49> 'long' 1
|   |-AccessSpecDecl 0x7fa66ad29590 <line:518:5, col:11> col:5 public
|   |-VarDecl 0x7fa66ad295b8 <line:519:9, col:78> col:27 referenced value 'const _Bool' static cinit
|   | `-BinaryOperator 0x7fa66ad29888 <col:35, col:78> '_Bool' '&&'
|   |   |-ParenExpr 0x7fa66ad29738 <col:35, col:54> '_Bool'
|   |   | `-BinaryOperator 0x7fa66ad29710 <col:36, col:50> '_Bool' '<='
|   |   |   |-ImplicitCastExpr 0x7fa66ad296f8 <col:36> 'intmax_t':'long' <LValueToRValue>
|   |   |   | `-DeclRefExpr 0x7fa66ad29628 <col:36> 'const intmax_t':'const long' lvalue Var 0x7fa66ad282c8 '__n1' 'const intmax_t':'const long'
|   |   |   `-BinaryOperator 0x7fa66ad296d0 <col:44, col:50> 'long' '/'
|   |   |     |-ImplicitCastExpr 0x7fa66ad296a0 <col:44> 'intmax_t':'long' <LValueToRValue>
|   |   |     | `-DeclRefExpr 0x7fa66ad29650 <col:44> 'const intmax_t':'const long' lvalue Var 0x7fa66ad28948 'max' 'const intmax_t':'const long'
|   |   |     `-ImplicitCastExpr 0x7fa66ad296b8 <col:50> 'intmax_t':'long' <LValueToRValue>
|   |   |       `-DeclRefExpr 0x7fa66ad29678 <col:50> 'const intmax_t':'const long' lvalue Var 0x7fa66ad287a8 '__d2' 'const intmax_t':'const long'
|   |   `-ParenExpr 0x7fa66ad29868 <col:59, col:78> '_Bool'
|   |     `-BinaryOperator 0x7fa66ad29840 <col:60, col:74> '_Bool' '<='
|   |       |-ImplicitCastExpr 0x7fa66ad29828 <col:60> 'intmax_t':'long' <LValueToRValue>
|   |       | `-DeclRefExpr 0x7fa66ad29758 <col:60> 'const intmax_t':'const long' lvalue Var 0x7fa66ad28608 '__n2' 'const intmax_t':'const long'
|   |       `-BinaryOperator 0x7fa66ad29800 <col:68, col:74> 'long' '/'
|   |         |-ImplicitCastExpr 0x7fa66ad297d0 <col:68> 'intmax_t':'long' <LValueToRValue>
|   |         | `-DeclRefExpr 0x7fa66ad29780 <col:68> 'const intmax_t':'const long' lvalue Var 0x7fa66ad28948 'max' 'const intmax_t':'const long'
|   |         `-ImplicitCastExpr 0x7fa66ad297e8 <col:74> 'intmax_t':'long' <LValueToRValue>
|   |           `-DeclRefExpr 0x7fa66ad297a8 <col:74> 'const intmax_t':'const long' lvalue Var 0x7fa66ad28468 '__d1' 'const intmax_t':'const long'
|   `-TypedefDecl 0x7fa66c17f828 <line:520:9, line:521:57> col:57 referenced type 'ratio<__mul<__n1, __d2, !value>::value, __mul<__n2, __d1, !value>::value>':'class std::__1::ratio<1, 1>'
|     `-TemplateSpecializationType 0x7fa66c17f780 'ratio<__mul<__n1, __d2, !value>::value, __mul<__n2, __d1, !value>::value>' sugar ratio
|       |-TemplateArgument expr
|       | `-ImplicitCastExpr 0x7fa66c17f748 <line:520:23, col:50> 'intmax_t':'long' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fa66c17f4f8 <col:23, col:50> 'const intmax_t':'const long' lvalue Var 0x7fa66c17f358 'value' 'const intmax_t':'const long'
|       |-TemplateArgument expr
|       | `-ImplicitCastExpr 0x7fa66c17f760 <line:521:23, col:50> 'intmax_t':'long' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fa66c17f710 <col:23, col:50> 'const intmax_t':'const long' lvalue Var 0x7fa66c17f358 'value' 'const intmax_t':'const long'
|       `-RecordType 0x7fa66c151060 'class std::__1::ratio<1, 1>'
|         `-ClassTemplateSpecialization 0x7fa66c150f58 'ratio'
|-AccessSpecDecl 0x7fa66ad20478 <line:524:1, col:7> col:1 public
|-TypedefDecl 0x7fa66ad204b0 <line:525:5, col:18> col:18 referenced rep 'long long':'long long'
| `-SubstTemplateTypeParmType 0x7fa66b0d5730 'long long' sugar
|   |-TemplateTypeParmType 0x7fa66b0a9360 '_Rep' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fa66b0a9318 '_Rep'
|   `-BuiltinType 0x7fa66b019e00 'long long'
|-TypedefDecl 0x7fa66ad205a0 <line:526:5, col:36> col:36 period 'typename class ratio<1, 1000>::type':'class std::__1::ratio<1, 1000>'
| `-ElaboratedType 0x7fa66ad20550 'typename class ratio<1, 1000>::type' sugar
|   `-TypedefType 0x7fa66ad20530 'std::__1::ratio<1, 1000>::type' sugar
|     |-Typedef 0x7fa66ad1ff68 'type'
|     `-TemplateSpecializationType 0x7fa66ad1fec0 'ratio<num, den>' sugar ratio
|       |-TemplateArgument expr
|       | `-ImplicitCastExpr 0x7fa66ad1fe88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ratio:260:19> 'intmax_t':'long' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fa66ad1fa28 <col:19> 'const intmax_t':'const long' lvalue Var 0x7fa66ad1f6e0 'num' 'const intmax_t':'const long'
|       |-TemplateArgument expr
|       | `-ImplicitCastExpr 0x7fa66ad1fea0 <col:24> 'intmax_t':'long' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fa66ad1fc58 <col:24> 'const intmax_t':'const long' lvalue Var 0x7fa66ad1f8b8 'den' 'const intmax_t':'const long'
|       `-RecordType 0x7fa66c139080 'class std::__1::ratio<1, 1000>'
|         `-ClassTemplateSpecialization 0x7fa66c138f78 'ratio'
|-AccessSpecDecl 0x7fa66ad205f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:527:1, col:8> col:1 private
|-FieldDecl 0x7fa66ad20650 <line:528:5, col:9> col:9 referenced __rep_ 'std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep':'long long'
|-AccessSpecDecl 0x7fa66ad20698 <line:529:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fa66ad20700 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:533:28> col:9 duration 'void (void)' default trivial noexcept-unevaluated 0x7fa66ad20700
| `-AlwaysInlineAttr 0x7fa66ad207e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7fa66ad20fa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:538:5, line:547:32> line:540:18 duration
| |-TemplateTypeParmDecl 0x7fa66ad20830 <line:538:15, col:21> col:21 class depth 0 index 0 _Rep2
| |-CXXConstructorDecl 0x7fa66ad20f00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:547:32> line:540:18 constexpr duration 'void (const _Rep2 &, typename enable_if<is_convertible<_Rep2, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<_Rep2>::value)>::type *)'
| | |-ParmVarDecl 0x7fa66ad208e8 <col:27, col:40> col:40 __r 'const _Rep2 &'
| | |-ParmVarDecl 0x7fa66ad20e10 <line:541:13, line:546:24> col:22 'typename enable_if<is_convertible<_Rep2, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<_Rep2>::value)>::type *'
| | `-AlwaysInlineAttr 0x7fa66ad21008 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| |-CXXConstructorDecl 0x7fa66ad27320 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:547:32> line:540:18 used constexpr duration 'void (const long long &, typename enable_if<is_convertible<long long, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<long long>::value)>::type *)'
| | |-TemplateArgument type 'long long'
| | |-ParmVarDecl 0x7fa66ad26de8 <col:27, col:40> col:40 used __r 'const long long &'
| | |-ParmVarDecl 0x7fa66ad27250 <line:541:13, line:546:24> col:22 'typename enable_if<is_convertible<long long, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<long long>::value)>::type *' cinit
| | | `-ImplicitCastExpr 0x7fa66ad27520 <col:24> 'typename enable_if<is_convertible<long long, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<long long>::value)>::type *' <NullToPointer>
| | |   `-IntegerLiteral 0x7fa66b0b05e0 <col:24> 'int' 0
| | |-CXXCtorInitializer Field 0x7fa66ad20650 '__rep_' 'std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep':'long long'
| | | `-ImplicitCastExpr 0x7fa66ad275b0 <line:547:26> 'long long':'long long' <LValueToRValue>
| | |   `-DeclRefExpr 0x7fa66ad27558 <col:26> 'const long long':'const long long' lvalue ParmVar 0x7fa66ad26de8 '__r' 'const long long &'
| | |-CompoundStmt 0x7fa66b0b06a8 <col:31, col:32>
| | `-AlwaysInlineAttr 0x7fa66ad27430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-CXXConstructorDecl 0x113b6e5c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:547:32> line:540:18 used constexpr duration 'void (const int &, typename enable_if<is_convertible<int, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<int>::value)>::type *)'
|   |-TemplateArgument type 'int'
|   |-ParmVarDecl 0x113b6d7d8 <col:27, col:40> col:40 used __r 'const int &'
|   |-ParmVarDecl 0x113b6e4b0 <line:541:13, line:546:24> col:22 'typename enable_if<is_convertible<int, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<int>::value)>::type *' cinit
|   | `-ImplicitCastExpr 0x113b6e7c0 <col:24> 'typename enable_if<is_convertible<int, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<int>::value)>::type *' <NullToPointer>
|   |   `-IntegerLiteral 0x7fa66b0b05e0 <col:24> 'int' 0
|   |-CXXCtorInitializer Field 0x7fa66ad20650 '__rep_' 'std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep':'long long'
|   | `-ImplicitCastExpr 0x113b6e868 <line:547:26> 'std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep':'long long' <IntegralCast>
|   |   `-ImplicitCastExpr 0x113b6e850 <col:26> 'int':'int' <LValueToRValue>
|   |     `-DeclRefExpr 0x113b6e7f8 <col:26> 'const int':'const int' lvalue ParmVar 0x113b6d7d8 '__r' 'const int &'
|   |-CompoundStmt 0x7fa66b0b06a8 <col:31, col:32>
|   `-AlwaysInlineAttr 0x113b6e6d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7fa66ad21f28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:550:5, line:560:80> line:552:9 duration
| |-TemplateTypeParmDecl 0x7fa66ad210d8 <line:550:15, col:21> col:21 class depth 0 index 0 _Rep2
| |-TemplateTypeParmDecl 0x7fa66ad21148 <col:28, col:34> col:34 class depth 0 index 1 _Period2
| |-CXXConstructorDecl 0x7fa66ad21e80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:560:80> line:552:9 constexpr duration 'void (const duration<_Rep2, _Period2> &, typename enable_if<__no_overflow<_Period2, period>::value && (treat_as_floating_point<rep>::value || (__no_overflow<_Period2, period>::type::den == 1 && !treat_as_floating_point<_Rep2>::value))>::type *)'
| | |-ParmVarDecl 0x7fa66ad212d8 <col:18, col:51> col:51 __d 'const duration<_Rep2, _Period2> &'
| | |-ParmVarDecl 0x7fa66ad21d50 <line:553:13, line:559:24> col:22 'typename enable_if<__no_overflow<_Period2, period>::value && (treat_as_floating_point<rep>::value || (__no_overflow<_Period2, period>::type::den == 1 && !treat_as_floating_point<_Rep2>::value))>::type *'
| | `-AlwaysInlineAttr 0x7fa66ad21f88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-CXXConstructorDecl 0x7fa66c17ffc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:560:80> line:552:9 constexpr duration 'void (const duration<long long, class std::__1::ratio<1, 1000> > &, typename enable_if<__no_overflow<class ratio<1, 1000>, period>::value && (treat_as_floating_point<rep>::value || (__no_overflow<class ratio<1, 1000>, period>::type::den == 1 && !treat_as_floating_point<long long>::value))>::type *)'
|   |-TemplateArgument type 'long long'
|   |-TemplateArgument type 'class std::__1::ratio<1, 1000>'
|   |-ParmVarDecl 0x7fa66ad27908 <col:18, col:51> col:51 __d 'const duration<long long, class std::__1::ratio<1, 1000> > &'
|   |-ParmVarDecl 0x7fa66c17feb0 <line:553:13, line:559:24> col:22 'typename enable_if<__no_overflow<class ratio<1, 1000>, period>::value && (treat_as_floating_point<rep>::value || (__no_overflow<class ratio<1, 1000>, period>::type::den == 1 && !treat_as_floating_point<long long>::value))>::type *'
|   `-AlwaysInlineAttr 0x7fa66c1800e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66ad220b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:564:82> col:53 constexpr count 'std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep (void) const'
| `-AlwaysInlineAttr 0x7fa66ad22158 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66ad25130 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:568:156> col:86 constexpr operator+ 'typename common_type<class duration<long long, class ratio<1, 1000> > >::type (void) const'
| `-AlwaysInlineAttr 0x7fa66ad251d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66ad25380 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:569:158> col:86 constexpr operator- 'typename common_type<class duration<long long, class ratio<1, 1000> > >::type (void) const'
| `-AlwaysInlineAttr 0x7fa66ad25428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66ad254f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:570:113> col:71 operator++ 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &(void)'
| `-AlwaysInlineAttr 0x7fa66ad25598 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66ad256a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:571:116> col:71 operator++ 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > (int)'
| |-ParmVarDecl 0x7fa66ad255e0 <col:82> col:85 'int'
| `-AlwaysInlineAttr 0x7fa66ad25750 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66ad257b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:572:113> col:71 operator-- 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &(void)'
| `-AlwaysInlineAttr 0x7fa66ad25860 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66ad25930 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:573:116> col:71 operator-- 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > (int)'
| |-ParmVarDecl 0x7fa66ad258a8 <col:82> col:85 'int'
| `-AlwaysInlineAttr 0x7fa66ad259e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66ad25b30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:575:140> col:71 operator+= 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &(const class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &)'
| |-ParmVarDecl 0x7fa66ad25a68 <col:82, col:98> col:98 __d 'const class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &'
| `-AlwaysInlineAttr 0x7fa66ad25be0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66ad25cc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:576:140> col:71 operator-= 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &(const class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &)'
| |-ParmVarDecl 0x7fa66ad25c38 <col:82, col:98> col:98 __d 'const class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &'
| `-AlwaysInlineAttr 0x7fa66ad25d70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66ad25f00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:578:127> col:71 operator*= 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &(const std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep &)'
| |-ParmVarDecl 0x7fa66ad25df8 <col:82, col:93> col:93 rhs 'const std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep &'
| `-AlwaysInlineAttr 0x7fa66ad25fb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66ad26090 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:579:127> col:71 operator/= 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &(const std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep &)'
| |-ParmVarDecl 0x7fa66ad26008 <col:82, col:93> col:93 rhs 'const std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep &'
| `-AlwaysInlineAttr 0x7fa66ad26140 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66ad26220 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:580:127> col:71 operator%= 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &(const std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep &)'
| |-ParmVarDecl 0x7fa66ad26198 <col:82, col:93> col:93 rhs 'const std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep &'
| `-AlwaysInlineAttr 0x7fa66ad262d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66ad263b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:581:140> col:71 operator%= 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &(const class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &)'
| |-ParmVarDecl 0x7fa66ad26328 <col:82, col:98> col:98 rhs 'const class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &'
| `-AlwaysInlineAttr 0x7fa66ad26460 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66ad26500 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:585:119> col:65 constexpr zero 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > (void)' static
| `-AlwaysInlineAttr 0x7fa66ad265a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66ad26610 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:586:118> col:65 constexpr min 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > (void)' static
| `-AlwaysInlineAttr 0x7fa66ad266b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66ad26720 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:587:118> col:65 constexpr max 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > (void)' static
| `-AlwaysInlineAttr 0x7fa66ad267c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fa66ad269e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:488:28> col:28 implicit constexpr duration 'void (const class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &)' inline default trivial noexcept-unevaluated 0x7fa66ad269e8
| `-ParmVarDecl 0x7fa66ad26b10 <col:28> col:28 'const class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &'
|-CXXConstructorDecl 0x7fa66ad26ba8 <col:28> col:28 implicit used constexpr duration 'void (class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7fa66ad26cd0 <col:28> col:28 used 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &&'
| |-CXXCtorInitializer Field 0x7fa66ad20650 '__rep_' 'std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep':'long long'
| | `-ImplicitCastExpr 0x7fa66c180240 <col:28> 'std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep':'long long' <LValueToRValue>
| |   `-MemberExpr 0x7fa66c1801f0 <col:28> 'std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep':'long long' xvalue .__rep_ 0x7fa66ad20650
| |     `-CXXStaticCastExpr 0x7fa66c1801c0 <col:28> 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >' xvalue static_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &&> <NoOp>
| |       `-DeclRefExpr 0x7fa66c180188 <col:28> 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >' lvalue ParmVar 0x7fa66ad26cd0 '' 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &&'
| `-CompoundStmt 0x7fa66c180288 <col:28>
`-CXXDestructorDecl 0x7fa66ad27638 <col:28> col:28 implicit referenced ~duration 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::chrono::duration" = type { i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::chrono::duration" = type { i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::ios_base
         0 |   (ios_base vtable pointer)
         8 |   std::__1::ios_base::fmtflags __fmtflags_
        16 |   std::__1::streamsize __precision_
        24 |   std::__1::streamsize __width_
        32 |   std::__1::ios_base::iostate __rdstate_
        36 |   std::__1::ios_base::iostate __exceptions_
        40 |   void * __rdbuf_
        48 |   void * __loc_
        56 |   std::__1::ios_base::event_callback * __fn_
        64 |   int * __index_
        72 |   size_t __event_size_
        80 |   size_t __event_cap_
        88 |   long * __iarray_
        96 |   size_t __iarray_size_
       104 |   size_t __iarray_cap_
       112 |   void ** __parray_
       120 |   size_t __parray_size_
       128 |   size_t __parray_cap_
           | [sizeof=136, dsize=136, align=8,
           |  nvsize=136, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ios<char>
         0 |   class std::__1::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     std::__1::ios_base::fmtflags __fmtflags_
        16 |     std::__1::streamsize __precision_
        24 |     std::__1::streamsize __width_
        32 |     std::__1::ios_base::iostate __rdstate_
        36 |     std::__1::ios_base::iostate __exceptions_
        40 |     void * __rdbuf_
        48 |     void * __loc_
        56 |     std::__1::ios_base::event_callback * __fn_
        64 |     int * __index_
        72 |     size_t __event_size_
        80 |     size_t __event_cap_
        88 |     long * __iarray_
        96 |     size_t __iarray_size_
       104 |     size_t __iarray_cap_
       112 |     void ** __parray_
       120 |     size_t __parray_size_
       128 |     size_t __parray_cap_
       136 |   basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       144 |   std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=152, dsize=148, align=8,
           |  nvsize=148, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ostream<char>
         0 |   (basic_ostream vtable pointer)
         8 |   class std::__1::basic_ios<char> (virtual base)
         8 |     class std::__1::ios_base (primary base)
         8 |       (ios_base vtable pointer)
        16 |       std::__1::ios_base::fmtflags __fmtflags_
        24 |       std::__1::streamsize __precision_
        32 |       std::__1::streamsize __width_
        40 |       std::__1::ios_base::iostate __rdstate_
        44 |       std::__1::ios_base::iostate __exceptions_
        48 |       void * __rdbuf_
        56 |       void * __loc_
        64 |       std::__1::ios_base::event_callback * __fn_
        72 |       int * __index_
        80 |       size_t __event_size_
        88 |       size_t __event_cap_
        96 |       long * __iarray_
       104 |       size_t __iarray_size_
       112 |       size_t __iarray_cap_
       120 |       void ** __parray_
       128 |       size_t __parray_size_
       136 |       size_t __parray_cap_
       144 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       152 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=160, dsize=156, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fa66bc755a0 prev 0x7fa66a9e0240 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, line:386:1> line:231:24 referenced class ios_base definition
|-VisibilityAttr 0x7fa66bc756a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7fa66bc756e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, col:24> col:24 implicit referenced class ios_base
|-AccessSpecDecl 0x7fa66bc75780 <line:233:1, col:7> col:1 public
|-CXXRecordDecl 0x7fa66bc757d8 <line:234:5, col:33> col:33 class failure
| `-VisibilityAttr 0x7fa66bc75890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:681:47, col:71> Default
|-TypedefDecl 0x7fa66bc758f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:236:5, col:26> col:26 referenced fmtflags 'unsigned int'
| `-BuiltinType 0x7fa66b019e60 'unsigned int'
|-VarDecl 0x7fa66bc75980 <line:237:5, col:41> col:27 referenced boolalpha 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc75a00 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc759e0 <col:41> 'int' 1
|-VarDecl 0x7fa66bc75a80 <line:238:5, col:41> col:27 referenced dec 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc75b00 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc75ae0 <col:41> 'int' 2
|-VarDecl 0x7fa66bc75b80 <line:239:5, col:41> col:27 referenced fixed 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc75c00 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc75be0 <col:41> 'int' 4
|-VarDecl 0x7fa66bc75c80 <line:240:5, col:41> col:27 referenced hex 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc75d00 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc75ce0 <col:41> 'int' 8
|-VarDecl 0x7fa66bc75d80 <line:241:5, col:41> col:27 referenced internal 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc75e00 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc75de0 <col:41> 'int' 16
|-VarDecl 0x7fa66bc75e80 <line:242:5, col:41> col:27 referenced left 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc75f00 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc75ee0 <col:41> 'int' 32
|-VarDecl 0x7fa66bc75f80 <line:243:5, col:41> col:27 referenced oct 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc76000 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc75fe0 <col:41> 'int' 64
|-VarDecl 0x7fa66bc76080 <line:244:5, col:41> col:27 referenced right 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc76100 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc760e0 <col:41> 'int' 128
|-VarDecl 0x7fa66bc76180 <line:245:5, col:41> col:27 referenced scientific 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc76200 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc761e0 <col:41> 'int' 256
|-VarDecl 0x7fa66bc76280 <line:246:5, col:41> col:27 referenced showbase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc76300 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc762e0 <col:41> 'int' 512
|-VarDecl 0x7fa66bc76380 <line:247:5, col:41> col:27 referenced showpoint 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc76400 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc763e0 <col:41> 'int' 1024
|-VarDecl 0x7fa66bc76480 <line:248:5, col:41> col:27 referenced showpos 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc76500 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc764e0 <col:41> 'int' 2048
|-VarDecl 0x7fa66bc76580 <line:249:5, col:41> col:27 referenced skipws 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc76600 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc765e0 <col:41> 'int' 4096
|-VarDecl 0x7fa66bc76680 <line:250:5, col:41> col:27 referenced unitbuf 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc76700 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc766e0 <col:41> 'int' 8192
|-VarDecl 0x7fa66bc76780 <line:251:5, col:41> col:27 referenced uppercase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc76800 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc767e0 <col:41> 'int' 16384
|-VarDecl 0x7fa66bc76880 <line:252:5, col:56> col:27 referenced adjustfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7fa66bc769c8 <col:41, col:56> 'unsigned int' '|'
|   |-BinaryOperator 0x7fa66bc76960 <col:41, col:48> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7fa66bc76930 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7fa66bc768e0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fa66bc75e80 'left' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7fa66bc76948 <col:48> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7fa66bc76908 <col:48> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fa66bc76080 'right' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7fa66bc769b0 <col:56> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fa66bc76988 <col:56> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fa66bc75d80 'internal' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7fa66bc76a58 <line:253:5, col:53> col:27 referenced basefield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7fa66bc76ba0 <col:41, col:53> 'unsigned int' '|'
|   |-BinaryOperator 0x7fa66bc76b38 <col:41, col:47> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7fa66bc76b08 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7fa66bc76ab8 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fa66bc75a80 'dec' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7fa66bc76b20 <col:47> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7fa66bc76ae0 <col:47> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fa66bc75f80 'oct' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7fa66bc76b88 <col:53> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fa66bc76b60 <col:53> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fa66bc75c80 'hex' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7fa66bc76c30 <line:254:5, col:54> col:27 referenced floatfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7fa66bc76d10 <col:41, col:54> 'unsigned int' '|'
|   |-ImplicitCastExpr 0x7fa66bc76ce0 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | `-DeclRefExpr 0x7fa66bc76c90 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fa66bc76180 'scientific' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7fa66bc76cf8 <col:54> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fa66bc76cb8 <col:54> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7fa66bc75b80 'fixed' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-TypedefDecl 0x7fa66bc76da8 <line:256:5, col:26> col:26 referenced iostate 'unsigned int'
| `-BuiltinType 0x7fa66b019e60 'unsigned int'
|-VarDecl 0x7fa66bc76e30 <line:257:5, col:36> col:26 referenced badbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc76eb0 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc76e90 <col:36> 'int' 1
|-VarDecl 0x7fa66bc76f30 <line:258:5, col:36> col:26 referenced eofbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc76fb0 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc76f90 <col:36> 'int' 2
|-VarDecl 0x7fa66bc77030 <line:259:5, col:36> col:26 referenced failbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc770b0 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc77090 <col:36> 'int' 4
|-VarDecl 0x7fa66bc77130 <line:260:5, col:36> col:26 referenced goodbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc771b0 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc77190 <col:36> 'int' 0
|-TypedefDecl 0x7fa66bc77238 <line:262:5, col:26> col:26 referenced openmode 'unsigned int'
| `-BuiltinType 0x7fa66b019e60 'unsigned int'
|-VarDecl 0x7fa66bc772c0 <line:263:5, col:36> col:27 app 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc77340 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc77320 <col:36> 'int' 1
|-VarDecl 0x7fa66bc773c0 <line:264:5, col:36> col:27 ate 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc77440 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc77420 <col:36> 'int' 2
|-VarDecl 0x7fa66bc774c0 <line:265:5, col:36> col:27 binary 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc77540 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc77520 <col:36> 'int' 4
|-VarDecl 0x7fa66bc775c0 <line:266:5, col:36> col:27 referenced in 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc77640 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc77620 <col:36> 'int' 8
|-VarDecl 0x7fa66bc776c0 <line:267:5, col:36> col:27 referenced out 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc77740 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc77720 <col:36> 'int' 16
|-VarDecl 0x7fa66bc777c0 <line:268:5, col:36> col:27 trunc 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7fa66bc77840 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7fa66bc77820 <col:36> 'int' 32
|-EnumDecl 0x7fa66bc778b0 <line:270:5, col:32> col:10 referenced seekdir
| |-EnumConstantDecl 0x7fa66bc77970 <col:19> col:19 referenced beg 'enum std::__1::ios_base::seekdir'
| |-EnumConstantDecl 0x7fa66bc779c0 <col:24> col:24 referenced cur 'enum std::__1::ios_base::seekdir'
| `-EnumConstantDecl 0x7fa66bc77a10 <col:29> col:29 referenced end 'enum std::__1::ios_base::seekdir'
|-TypedefDecl 0x7fa66bc77a70 <line:273:5, col:26> col:26 io_state 'std::__1::ios_base::iostate':'unsigned int'
| `-TypedefType 0x7fa66bc76e00 'std::__1::ios_base::iostate' sugar
|   |-Typedef 0x7fa66bc76da8 'iostate'
|   `-BuiltinType 0x7fa66b019e60 'unsigned int'
|-TypedefDecl 0x7fa66bc77ad8 <line:274:5, col:26> col:26 open_mode 'std::__1::ios_base::openmode':'unsigned int'
| `-TypedefType 0x7fa66bc77290 'std::__1::ios_base::openmode' sugar
|   |-Typedef 0x7fa66bc77238 'openmode'
|   `-BuiltinType 0x7fa66b019e60 'unsigned int'
|-TypedefDecl 0x7fa66bc77b40 <line:275:5, col:26> col:26 seek_dir 'enum std::__1::ios_base::seekdir'
| `-EnumType 0x7fa66bc77950 'enum std::__1::ios_base::seekdir'
|   `-Enum 0x7fa66bc778b0 'seekdir'
|-TypedefDecl 0x7fa66bc77c50 <line:277:5, col:30> col:30 streamoff 'std::__1::streamoff':'long long'
| `-ElaboratedType 0x7fa66bc77be0 'std::__1::streamoff' sugar
|   `-TypedefType 0x7fa66bab0070 'std::__1::streamoff' sugar
|     |-Typedef 0x7fa66a9f1a98 'streamoff'
|     `-BuiltinType 0x7fa66b019e00 'long long'
|-TypedefDecl 0x7fa66bc77d30 <line:278:5, col:30> col:30 streampos 'std::__1::streampos':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fa66bc77cc0 'std::__1::streampos' sugar
|   `-TypedefType 0x7fa66bab0100 'std::__1::streampos' sugar
|     |-Typedef 0x7fa66a843cd8 'streampos'
|     `-TemplateSpecializationType 0x7fa66a843c30 'fpos<mbstate_t>' sugar fpos
|       |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|       `-RecordType 0x7fa66a843c10 'class std::__1::fpos<__mbstate_t>'
|         `-ClassTemplateSpecialization 0x7fa66a843b20 'fpos'
|-CXXRecordDecl 0x7fa66bc77db8 <line:281:5, col:28> col:28 class Init
| `-VisibilityAttr 0x7fa66bc77e70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXMethodDecl 0x7fa66bc77fa0 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:284:48> col:40 flags 'std::__1::ios_base::fmtflags (void) const'
| |-AlwaysInlineAttr 0x7fa66bc78038 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fa66bc78080 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fa66bc781c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:285:62> col:40 flags 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fa66bc780d0 <col:46, col:55> col:55 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fa66bc78260 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fa66bc782a8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fa66bc78380 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:286:61> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fa66bc782f8 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fa66bc78420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fa66bc78468 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fa66bc78640 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:287:78> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags, std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fa66bc784b8 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-ParmVarDecl 0x7fa66bc78528 <col:63, col:72> col:72 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fa66bc786e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fa66bc78730 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fa66bc78840 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:288:58> col:36 used unsetf 'void (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7fa66bc78780 <col:43, col:52> col:52 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7fa66bc788e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fa66bc78928 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fa66bc789e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:290:54> col:42 precision 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7fa66bc78a78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fa66bc78ac0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fa66bc78bd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:291:69> col:42 precision 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7fa66bc78b10 <col:52, col:63> col:63 __prec 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7fa66bc78c70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fa66bc78cb8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fa66bc78d18 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:292:50> col:42 width 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7fa66bc78db0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fa66bc78df8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fa66bc78ed0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:293:65> col:42 width 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7fa66bc78e48 <col:48, col:59> col:59 __wide 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7fa66bc78f70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fa66bc78fb8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fa66bc79060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:296:5, col:37> col:12 referenced imbue 'class std::__1::locale (const class std::__1::locale &)'
| `-ParmVarDecl 0x7fa66bc78fd8 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7fa66bc79150 <line:297:5, col:21> col:12 referenced getloc 'class std::__1::locale (void) const'
|-CXXMethodDecl 0x7fa66bc79210 <line:300:5, col:23> col:16 xalloc 'int (void)' static
|-CXXMethodDecl 0x7fa66bc79350 <line:301:5, col:28> col:11 iword 'long &(int)'
| `-ParmVarDecl 0x7fa66bc792c0 <col:17, col:21> col:21 __index 'int'
|-CXXMethodDecl 0x7fa66bc794d8 <line:302:5, col:29> col:12 pword 'void *&(int)'
| `-ParmVarDecl 0x7fa66bc79408 <col:18, col:22> col:22 __index 'int'
|-CXXDestructorDecl 0x7fa66bc795c8 <line:305:5, col:23> col:13 ~ios_base 'void (void) noexcept' virtual
|-EnumDecl 0x7fa66bc79668 <line:308:5, col:58> col:10 referenced event
| |-EnumConstantDecl 0x7fa66bc79720 <col:18> col:18 referenced erase_event 'enum std::__1::ios_base::event'
| |-EnumConstantDecl 0x7fa66bc79770 <col:31> col:31 imbue_event 'enum std::__1::ios_base::event'
| `-EnumConstantDecl 0x7fa66bc797c0 <col:44> col:44 referenced copyfmt_event 'enum std::__1::ios_base::event'
|-TypedefDecl 0x7fa66bc79a90 <line:309:5, col:65> col:20 referenced event_callback 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-PointerType 0x7fa66bc79a20 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
|   `-ParenType 0x7fa66bc799c0 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' sugar
|     `-FunctionProtoType 0x7fa66bc79970 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' cdecl
|       |-BuiltinType 0x7fa66b019d20 'void'
|       |-EnumType 0x7fa66bc79700 'enum std::__1::ios_base::event'
|       | `-Enum 0x7fa66bc79668 'event'
|       |-LValueReferenceType 0x7fa66abdab40 'class std::__1::ios_base &'
|       | `-RecordType 0x7fa66a9e02e0 'class std::__1::ios_base'
|       |   `-CXXRecord 0x7fa66bc755a0 'ios_base'
|       `-BuiltinType 0x7fa66b019dc0 'int'
|-CXXMethodDecl 0x7fa66bc79cb0 <line:310:5, col:60> col:10 register_callback 'void (std::__1::ios_base::event_callback, int)'
| |-ParmVarDecl 0x7fa66bc79b20 <col:28, col:43> col:43 __fn 'std::__1::ios_base::event_callback':'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-ParmVarDecl 0x7fa66bc79b98 <col:49, col:53> col:53 __index 'int'
|-AccessSpecDecl 0x7fa66bc79d58 <line:312:1, col:8> col:1 private
|-CXXConstructorDecl 0x7fa66bc79ea0 <line:313:5, col:29> col:5 ios_base 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fa66bc79db8 <col:14, col:28> col:29 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7fa66bc7a020 <line:314:5, col:40> col:15 operator= 'class std::__1::ios_base &(const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fa66bc79f60 <col:25, col:39> col:40 'const class std::__1::ios_base &'
|-AccessSpecDecl 0x7fa66bc7a0c0 <line:316:1, col:7> col:1 public
|-CXXMethodDecl 0x7fa66bc7a1c0 <line:317:5, col:51> col:17 sync_with_stdio '_Bool (_Bool)' static
| `-ParmVarDecl 0x7fa66bc7a0f8 <col:33, col:47> col:38 __sync '_Bool' cinit
|   `-CXXBoolLiteralExpr 0x7fa66bc7c5b8 <col:47> '_Bool' true
|-CXXMethodDecl 0x7fa66bc7a2e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:319:49> col:39 rdstate 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7fa66bc7a378 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fa66bc7a3c0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fa66bc7a4a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:320:5, col:41> col:10 used clear 'void (std::__1::ios_base::iostate)'
| `-ParmVarDecl 0x7fa66bc7a3e0 <col:16, col:34> col:24 __state 'std::__1::ios_base::iostate':'unsigned int' cinit
|   `-ImplicitCastExpr 0x7fa66bc7c5f8 <col:34> 'std::__1::ios_base::iostate':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7fa66bc7c5d0 <col:34> 'const std::__1::ios_base::iostate':'const unsigned int' lvalue Var 0x7fa66bc77130 'goodbit' 'const std::__1::ios_base::iostate':'const unsigned int'
|-CXXMethodDecl 0x7fa66bc7a608 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:321:60> col:36 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fa66bc7a580 <col:45, col:53> col:53 __state 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7fa66bc7a6a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fa66bc7a6f0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fa66bc7a750 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:323:43> col:36 good '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fa66bc7a7e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fa66bc7a830 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fa66bc7a890 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:324:42> col:36 eof '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fa66bc7a928 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fa66bc7a970 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fa66bc7a9d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:325:43> col:36 fail '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fa66bc7aa68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fa66bc7aab0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fa66bc7ab10 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:326:42> col:36 bad '_Bool (void) const'
| |-AlwaysInlineAttr 0x7fa66bc7aba8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fa66bc7abf0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fa66bc7ac50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:328:52> col:39 exceptions 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7fa66bc7ace8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fa66bc7ad30 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fa66bc7ae08 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:329:64> col:36 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fa66bc7ad80 <col:47, col:55> col:55 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7fa66bc7aea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fa66bc7aef0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fa66bc7af20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:331:5, col:44> col:10 __set_badbit_and_consider_rethrow 'void (void)'
|-CXXMethodDecl 0x7fa66bc7afd8 <line:332:5, col:45> col:10 __set_failbit_and_consider_rethrow 'void (void)'
|-AccessSpecDecl 0x7fa66bc7b070 <line:334:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fa66bc7b0e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:337:16> line:336:5 ios_base 'void (void)'
| |-CompoundStmt 0x7fa66bc7c610 <col:16, line:337:16>
| |-AlwaysInlineAttr 0x7fa66bc7b190 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fa66bc7b1d8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fa66bc7b288 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:339:5, col:25> col:10 referenced init 'void (void *)'
| `-ParmVarDecl 0x7fa66bc7b200 <col:15, col:21> col:21 __sb 'void *'
|-CXXMethodDecl 0x7fa66bc7b3b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:340:64> col:33 rdbuf 'void *(void) const'
| |-CompoundStmt 0x7fa66bc7c6a8 <col:47, col:64>
| | `-ReturnStmt 0x7fa66bc7c690 <col:48, col:55>
| |   `-ImplicitCastExpr 0x7fa66bc7c678 <col:55> 'void *' <LValueToRValue>
| |     `-MemberExpr 0x7fa66bc7c640 <col:55> 'void *const' lvalue ->__rdbuf_ 0x7fa66bc7bfc8
| |       `-CXXThisExpr 0x7fa66bc7c628 <col:55> 'const class std::__1::ios_base *' this
| |-AlwaysInlineAttr 0x7fa66bc7b450 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7fa66bc7b498 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fa66bc7b578 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:347:5> line:343:10 rdbuf 'void (void *)'
| |-ParmVarDecl 0x7fa66bc7b4f0 <col:16, col:22> col:22 used __sb 'void *'
| |-CompoundStmt 0x7fa66bc7c828 <line:344:5, line:347:5>
| | |-BinaryOperator 0x7fa66bc7c758 <line:345:9, col:20> 'void *' lvalue '='
| | | |-MemberExpr 0x7fa66bc7c6e0 <col:9> 'void *' lvalue ->__rdbuf_ 0x7fa66bc7bfc8
| | | | `-CXXThisExpr 0x7fa66bc7c6c8 <col:9> 'class std::__1::ios_base *' this
| | | `-ImplicitCastExpr 0x7fa66bc7c740 <col:20> 'void *' <LValueToRValue>
| | |   `-DeclRefExpr 0x7fa66bc7c718 <col:20> 'void *' lvalue ParmVar 0x7fa66bc7b4f0 '__sb' 'void *'
| | `-CXXMemberCallExpr 0x7fa66bc7c7d0 <line:346:9, col:15> 'void'
| |   |-MemberExpr 0x7fa66bc7c798 <col:9> '<bound member function type>' ->clear 0x7fa66bc7a4a0
| |   | `-CXXThisExpr 0x7fa66bc7c780 <col:9> 'class std::__1::ios_base *' this
| |   `-CXXDefaultArgExpr 0x7fa66bc7c808 <<invalid sloc>> 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7fa66bc7b618 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7fa66bc7b660 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7fa66bc7b740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:349:5, col:32> col:10 referenced __call_callbacks 'void (enum std::__1::ios_base::event)'
| `-ParmVarDecl 0x7fa66bc7b680 <col:27> col:32 'enum std::__1::ios_base::event'
|-CXXMethodDecl 0x7fa66bc7b878 <line:350:5, col:33> col:10 referenced copyfmt 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fa66bc7b7f0 <col:18, col:32> col:33 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7fa66bc7b9f0 <line:351:5, col:24> col:10 referenced move 'void (class std::__1::ios_base &)'
| `-ParmVarDecl 0x7fa66bc7b928 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7fa66bc7bb68 <line:352:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:352:10 referenced swap 'void (class std::__1::ios_base &) noexcept'
| `-ParmVarDecl 0x7fa66bc7baa0 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7fa66bc7bcd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:358:5> line:355:10 referenced set_rdbuf 'void (void *)'
| |-ParmVarDecl 0x7fa66bc7bc50 <col:20, col:26> col:26 used __sb 'void *'
| |-CompoundStmt 0x7fa66bc7c908 <line:356:5, line:358:5>
| | `-BinaryOperator 0x7fa66bc7c8e0 <line:357:9, col:20> 'void *' lvalue '='
| |   |-MemberExpr 0x7fa66bc7c868 <col:9> 'void *' lvalue ->__rdbuf_ 0x7fa66bc7bfc8
| |   | `-CXXThisExpr 0x7fa66bc7c850 <col:9> 'class std::__1::ios_base *' this
| |   `-ImplicitCastExpr 0x7fa66bc7c8c8 <col:20> 'void *' <LValueToRValue>
| |     `-DeclRefExpr 0x7fa66bc7c8a0 <col:20> 'void *' lvalue ParmVar 0x7fa66bc7bc50 '__sb' 'void *'
| |-AlwaysInlineAttr 0x7fa66bc7bd78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7fa66bc7bdc0 <col:48, col:71> Hidden
|-AccessSpecDecl 0x7fa66bc7bdd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:360:1, col:8> col:1 private
|-FieldDecl 0x7fa66bc7be08 <line:362:5, col:21> col:21 referenced __fmtflags_ 'std::__1::ios_base::fmtflags':'unsigned int'
|-FieldDecl 0x7fa66bc7be60 <line:363:5, col:21> col:21 referenced __precision_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7fa66bc7beb8 <line:364:5, col:21> col:21 referenced __width_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7fa66bc7bf10 <line:365:5, col:21> col:21 referenced __rdstate_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7fa66bc7bf68 <line:366:5, col:21> col:21 referenced __exceptions_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7fa66bc7bfc8 <line:367:5, col:21> col:21 referenced __rdbuf_ 'void *'
|-FieldDecl 0x7fa66bc7c028 <line:368:5, col:21> col:21 __loc_ 'void *'
|-FieldDecl 0x7fa66bc7c0d8 <line:369:5, col:21> col:21 __fn_ 'std::__1::ios_base::event_callback *'
|-FieldDecl 0x7fa66bc7c138 <line:370:5, col:21> col:21 __index_ 'int *'
|-FieldDecl 0x7fa66bc7c190 <line:371:5, col:21> col:21 __event_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7fa66bc7c1e8 <line:372:5, col:21> col:21 __event_cap_ 'size_t':'unsigned long'
|-VarDecl 0x7fa66bc7c2f8 <line:376:5, col:24> col:24 __xindex_ 'atomic<int>':'struct std::__1::atomic<int>' static
|-FieldDecl 0x7fa66bc7c370 <line:380:5, col:21> col:21 __iarray_ 'long *'
|-FieldDecl 0x7fa66bc7c3c8 <line:381:5, col:21> col:21 __iarray_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7fa66bc7c420 <line:382:5, col:21> col:21 __iarray_cap_ 'size_t':'unsigned long'
|-FieldDecl 0x7fa66bc7c480 <line:383:5, col:21> col:21 __parray_ 'void **'
|-FieldDecl 0x7fa66bc7c4d8 <line:384:5, col:21> col:21 __parray_size_ 'size_t':'unsigned long'
`-FieldDecl 0x7fa66bc7c530 <line:385:5, col:21> col:21 __parray_cap_ 'size_t':'unsigned long'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fa66a9e5dc8 parent 0x7fa66a9e01a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:482:78> col:64 class basic_ios definition
|-public 'class std::__1::ios_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fa66b2e41a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7fa66b2e4298 prev 0x7fa66a9e5dc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:583:1, col:28> col:28 implicit class basic_ios
|-AccessSpecDecl 0x7fa66b2e4330 <line:586:1, col:7> col:1 public
|-TypedefDecl 0x7fa66b2e4398 <line:588:5, col:20> col:20 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fa66b2e4360 'char' sugar
|   |-TemplateTypeParmType 0x7fa66b2b6b40 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fa66b2b6b00 '_CharT'
|   `-BuiltinType 0x7fa66b019d60 'char'
|-TypedefDecl 0x7fa66b2e4428 <line:589:5, col:21> col:21 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fa66b2e43f0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fa66b2b6bb0 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fa66b2b6b68 '_Traits'
|   `-RecordType 0x7fa66a9e5d30 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fa66bab6768 'char_traits'
|-TypedefDecl 0x7fa66b2e4530 <line:591:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fa66b2e44e0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fa66bab82b0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fa66bab6ac8 'int_type'
|     `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x7fa66b2e4600 <line:592:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fa66b2e45b0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fa66b2da0c0 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fa66bab6b98 'pos_type'
|     `-TypedefType 0x7fa66bab0100 'std::__1::streampos' sugar
|       |-Typedef 0x7fa66a843cd8 'streampos'
|       `-TemplateSpecializationType 0x7fa66a843c30 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fa66a843c10 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fa66a843b20 'fpos'
|-TypedefDecl 0x7fa66b2e46d0 <line:593:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fa66b2e4680 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fa66b2da1b0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fa66bab6b30 'off_type'
|     `-TypedefType 0x7fa66bab0070 'std::__1::streamoff' sugar
|       |-Typedef 0x7fa66a9f1a98 'streamoff'
|       `-BuiltinType 0x7fa66b019e00 'long long'
|-CXXConversionDecl 0x7fa66b2e4728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:605:60> col:22 operator bool '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fa66b2e47f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fa66b2e4848 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:608:69> col:32 operator! '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fa66b2e48f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fa66b2e4938 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:609:81> col:35 rdstate 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7fa66b2e49e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fa66b2e4ab0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:610:91> col:32 clear 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fa66b2e4a28 <col:38, col:56> col:46 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7fa66b2e4b60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fa66b2e4c30 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:611:87> col:32 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fa66b2e4ba8 <col:41, col:49> col:49 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7fa66b2e4ce0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fa66b2e4d28 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:612:70> col:32 good '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fa66b2e4dd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fa66b2e4e18 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:613:69> col:32 eof '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fa66b2e4ec0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fa66b2e4f08 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:614:70> col:32 fail '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fa66b2e4fb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fa66b2e4ff8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:615:69> col:32 bad '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fa66b2e50a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fa66b2e50e8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:617:85> col:35 exceptions 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7fa66b2e5190 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fa66b2e5260 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:618:95> col:32 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7fa66b2e51d8 <col:43, col:51> col:51 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7fa66b2e5310 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXConstructorDecl 0x7fa66b2e55c0 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:622:68> col:14 basic_ios 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fa66b2e5478 <col:24, col:64> col:64 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fa66b2e5680 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7fa66b2e56f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:623:5, col:24> col:13 ~basic_ios 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7fa66b2e5950 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:627:50> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7fa66b2e59f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66b2e5d30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:629:95> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fa66b2e5be8 <col:48, col:87> col:87 __tiestr 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fa66b2e5de0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66b2e5fa0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:632:54> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7fa66b2e6048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66b2e6380 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:634:97> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fa66b2e6238 <col:52, col:93> col:93 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fa66b2e6430 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66b2e65b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:636:5, col:46> col:16 copyfmt 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)'
| `-ParmVarDecl 0x7fa66b2e64e8 <col:24, col:41> col:41 __rhs 'const class std::__1::basic_ios<char> &'
|-CXXMethodDecl 0x7fa66b2e66b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:639:22> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (void) const'
| `-AlwaysInlineAttr 0x7fa66b2e6758 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66b2e68b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:641:34> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7fa66b2e67b0 <col:20, col:30> col:30 __ch 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7fa66b2e6960 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66b2e6a30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:644:37> col:12 imbue 'class std::__1::locale (const class std::__1::locale &)'
| |-ParmVarDecl 0x7fa66b2e69a8 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7fa66b2e6ae0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66b2e6c70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:647:47> col:10 narrow 'char (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, char) const'
| |-ParmVarDecl 0x7fa66b2e6b38 <col:17, col:27> col:27 __c 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| |-ParmVarDecl 0x7fa66b2e6b98 <col:32, col:37> col:37 __dfault 'char'
| `-AlwaysInlineAttr 0x7fa66b2e6d28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66b2e6e30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:649:31> col:15 widen 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (char) const'
| |-ParmVarDecl 0x7fa66b2e6d70 <col:21, col:26> col:26 __c 'char'
| `-AlwaysInlineAttr 0x7fa66b2e6ee0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-AccessSpecDecl 0x7fa66b2e6f28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:651:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fa66b2e6f70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:654:17> line:653:5 basic_ios 'void (void)'
| `-AlwaysInlineAttr 0x7fa66b2e7028 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fa66b2e7230 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:656:60> col:10 init 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fa66b2e7168 <col:15, col:56> col:56 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fa66b2e72e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66b2e7400 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:659:31> col:10 move 'void (class std::__1::basic_ios<char> &)'
| |-ParmVarDecl 0x7fa66b2e7338 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7fa66b2e74b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66b2e7600 <line:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:662:47> col:10 move 'void (class std::__1::basic_ios<char> &&)'
| |-ParmVarDecl 0x7fa66b2e7538 <col:15, col:27> col:27 __rhs 'class std::__1::basic_ios<char> &&'
| `-AlwaysInlineAttr 0x7fa66b2e76b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fa66b2e77d8 <line:709:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:665:10 swap 'void (class std::__1::basic_ios<char> &) noexcept'
| |-ParmVarDecl 0x7fa66b2e7708 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7fa66b2e7888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fa66b2e7a90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:667:65> col:10 set_rdbuf 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7fa66b2e79c8 <col:20, col:61> col:61 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fa66b2e7b40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-AccessSpecDecl 0x7fa66b2e7b88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:668:1, col:8> col:1 private
|-FieldDecl 0x7fa66b2e7ca8 <line:669:5, col:44> col:44 __tie_ 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
|-FieldDecl 0x7fa66b2e7d20 <line:670:6, col:23> col:23 __fill_ 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' mutable
|-CXXConstructorDecl 0x7fa66b2e7da8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:482:64> col:64 implicit basic_ios 'void (const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7fa66b2e7da8
| `-ParmVarDecl 0x7fa66b2e7ed0 <col:64> col:64 'const class std::__1::basic_ios<char> &'
`-CXXMethodDecl 0x7fa66b2e7f38 <col:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7fa66b2e7f38
  `-ParmVarDecl 0x7fa66b2e8010 <col:64> col:64 'const class std::__1::basic_ios<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ios" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fa66a9e6a88 parent 0x7fa66a9e01a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:1085:82> col:64 class basic_ostream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7fa66bd33e78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7fa66bd340f0 prev 0x7fa66a9e6a88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:151:1, col:28> col:28 implicit class basic_ostream
|-AccessSpecDecl 0x7fa66bd34188 <line:154:1, col:7> col:1 public
|-TypedefDecl 0x7fa66bd341c0 <line:156:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7fa66bd33f40 'char' sugar
|   |-TemplateTypeParmType 0x7fa66bcf58f0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fa66bcf58a8 '_CharT'
|   `-BuiltinType 0x7fa66b019d60 'char'
|-TypedefDecl 0x7fa66bd34228 <line:157:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7fa66bd33f80 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7fa66bcf5960 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fa66bcf5918 '_Traits'
|   `-RecordType 0x7fa66a9e5d30 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7fa66bab6768 'char_traits'
|-TypedefDecl 0x7fa66bd34330 <line:158:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7fa66bd342e0 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7fa66bab82b0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7fa66bab6ac8 'int_type'
|     `-BuiltinType 0x7fa66b019dc0 'int'
|-TypedefDecl 0x7fa66bd34400 <line:159:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7fa66bd343b0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7fa66b2da0c0 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7fa66bab6b98 'pos_type'
|     `-TypedefType 0x7fa66bab0100 'std::__1::streampos' sugar
|       |-Typedef 0x7fa66a843cd8 'streampos'
|       `-TemplateSpecializationType 0x7fa66a843c30 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7fa66a843c10 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7fa66a843b20 'fpos'
|-TypedefDecl 0x7fa66bd344d0 <line:160:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7fa66bd34480 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7fa66b2da1b0 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7fa66bab6b30 'off_type'
|     `-TypedefType 0x7fa66bab0070 'std::__1::streamoff' sugar
|       |-Typedef 0x7fa66a9f1a98 'streamoff'
|       `-BuiltinType 0x7fa66b019e00 'long long'
|-CXXConstructorDecl 0x7fa66bd34750 <line:163:5, line:165:25> line:164:14 basic_ostream 'void (basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7fa66bd34648 <col:28, col:69> col:69 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7fa66bd34810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXDestructorDecl 0x7fa66bd34888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:166:5, col:28> col:13 ~basic_ostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7fa66bd34938 <line:167:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fa66bd34a80 <line:169:5, line:170:40> col:5 basic_ostream 'void (class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7fa66bd34998 <col:19, col:35> col:35 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7fa66bd34b40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7fa66bd34c90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:175:5, line:176:51> col:20 operator= 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7fa66bd34bc8 <col:30, col:46> col:46 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7fa66bd34d40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7fa66bd34e60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:178:5, line:180:55> line:179:10 swap 'void (class std::__1::basic_ostream<char> &)' inline
| |-ParmVarDecl 0x7fa66bd34d98 <col:15, col:30> col:30 __rhs 'class std::__1::basic_ostream<char> &'
| `-AlwaysInlineAttr 0x7fa66bd34f10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXConstructorDecl 0x7fa66bd35080 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:183:5, col:65> col:5 basic_ostream 'void (const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7fa66bd34f98 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-CXXMethodDecl 0x7fa66bd35210 <line:184:5, col:65> col:20 operator= 'class std::__1::basic_ostream<char> &(const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7fa66bd35150 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-AccessSpecDecl 0x7fa66bd352c0 <line:189:1, col:7> col:1 public
|-CXXRecordDecl 0x7fa66bd352e8 <line:192:5, col:32> col:32 class sentry definition
| |-CXXRecordDecl 0x7fa66bd38170 prev 0x7fa66bd352e8 <line:242:1, col:60> col:60 implicit class sentry
| |-FieldDecl 0x7fa66bd38208 <line:244:5, col:10> col:10 __ok_ '_Bool'
| |-FieldDecl 0x7fa66bd383a8 <line:245:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXConstructorDecl 0x7fa66bd38530 <line:247:5, col:25> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7fa66bd38428 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x7fa66bd386f0 <line:248:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7fa66bd38628 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x7fa66bd387a0 <line:250:1, col:7> col:1 public
| |-CXXConstructorDecl 0x7fa66bd389b0 <line:251:5, col:57> col:14 sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| | `-ParmVarDecl 0x7fa66bd388c8 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXDestructorDecl 0x7fa66bd38aa0 <line:252:5, col:13> col:5 ~sentry 'void (void)' noexcept-unevaluated 0x7fa66bd38aa0
| `-CXXConversionDecl 0x7fa66bd38b50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:256:45> col:9 operator bool '_Bool (void) const'
|   `-AlwaysInlineAttr 0x7fa66bd38c28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fa66bd35620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:195:5, line:197:27> line:196:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &))' inline
| |-ParmVarDecl 0x7fa66bd35520 <col:31, col:68> col:48 __pf 'class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &)'
| `-AlwaysInlineAttr 0x7fa66bd356d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fa66bd35bb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:199:5, line:202:34> line:200:20 operator<< 'class std::__1::basic_ostream<char> &(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &))' inline
| |-ParmVarDecl 0x7fa66bd35ab0 <col:31, line:201:72> col:33 __pf 'basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &)'
| `-AlwaysInlineAttr 0x7fa66bd35c60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fa66bd35db0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:204:5, line:206:34> line:205:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))' inline
| |-ParmVarDecl 0x7fa66bd35ca8 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x7fa66bd35e60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7fa66bd35f70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:208:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(_Bool)'
| `-ParmVarDecl 0x7fa66bd35ea8 <col:31, col:36> col:36 __n '_Bool'
|-CXXMethodDecl 0x7fa66bd360e0 <line:209:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(short)'
| `-ParmVarDecl 0x7fa66bd36020 <col:31, col:37> col:37 __n 'short'
|-CXXMethodDecl 0x7fa66bd36250 <line:210:5, col:49> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned short)'
| `-ParmVarDecl 0x7fa66bd36190 <col:31, col:46> col:46 __n 'unsigned short'
|-CXXMethodDecl 0x7fa66bd363c0 <line:211:5, col:38> col:20 used operator<< 'class std::__1::basic_ostream<char> &(int)'
| `-ParmVarDecl 0x7fa66bd36300 <col:31, col:35> col:35 __n 'int'
|-CXXMethodDecl 0x7fa66bd36530 <line:212:5, col:47> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned int)'
| `-ParmVarDecl 0x7fa66bd36470 <col:31, col:44> col:44 __n 'unsigned int'
|-CXXMethodDecl 0x7fa66bd366a0 <line:213:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(long)'
| `-ParmVarDecl 0x7fa66bd365e0 <col:31, col:36> col:36 __n 'long'
|-CXXMethodDecl 0x7fa66bd36810 <line:214:5, col:48> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long)'
| `-ParmVarDecl 0x7fa66bd36750 <col:31, col:45> col:45 __n 'unsigned long'
|-CXXMethodDecl 0x7fa66bd36980 <line:215:5, col:44> col:20 operator<< 'class std::__1::basic_ostream<char> &(long long)'
| `-ParmVarDecl 0x7fa66bd368c0 <col:31, col:41> col:41 __n 'long long'
|-CXXMethodDecl 0x7fa66bd36af0 <line:216:5, col:53> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long long)'
| `-ParmVarDecl 0x7fa66bd36a30 <col:31, col:50> col:50 __n 'unsigned long long'
|-CXXMethodDecl 0x7fa66bd36c60 <line:217:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(float)'
| `-ParmVarDecl 0x7fa66bd36ba0 <col:31, col:37> col:37 __f 'float'
|-CXXMethodDecl 0x7fa66bd36dd0 <line:218:5, col:41> col:20 operator<< 'class std::__1::basic_ostream<char> &(double)'
| `-ParmVarDecl 0x7fa66bd36d10 <col:31, col:38> col:38 __f 'double'
|-CXXMethodDecl 0x7fa66bd36f40 <line:219:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(long double)'
| `-ParmVarDecl 0x7fa66bd36e80 <col:31, col:43> col:43 __f 'long double'
|-CXXMethodDecl 0x7fa66bd370b0 <line:220:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(const void *)'
| `-ParmVarDecl 0x7fa66bd36ff0 <col:31, col:43> col:43 __p 'const void *'
|-CXXMethodDecl 0x7fa66bd37360 <line:221:5, col:76> col:20 operator<< 'class std::__1::basic_ostream<char> &(basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)'
| `-ParmVarDecl 0x7fa66bd37258 <col:31, col:72> col:72 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
|-CXXMethodDecl 0x7fa66bd37520 <line:224:5, col:37> col:20 put 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type)'
| `-ParmVarDecl 0x7fa66bd37420 <col:24, col:34> col:34 __c 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7fa66bd37780 <line:225:5, col:62> col:20 write 'class std::__1::basic_ostream<char> &(const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7fa66bd37608 <col:26, col:43> col:43 __s 'const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7fa66bd37668 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7fa66bd37890 <line:226:5, col:26> col:20 flush 'class std::__1::basic_ostream<char> &(void)'
|-CXXMethodDecl 0x7fa66bd379e0 <line:229:5, line:230:20> col:14 tellp 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type (void)' inline
| `-AlwaysInlineAttr 0x7fa66bd37a88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-CXXMethodDecl 0x7fa66bd37be0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:231:5, line:232:40> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type)' inline
| |-ParmVarDecl 0x7fa66bd37ae0 <col:26, col:35> col:35 __pos 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-AlwaysInlineAttr 0x7fa66bd37c90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-CXXMethodDecl 0x7fa66bd37e80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:233:5, line:234:65> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir)' inline
| |-ParmVarDecl 0x7fa66bd37d10 <col:26, col:35> col:35 __off 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7fa66bd37d70 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-AlwaysInlineAttr 0x7fa66bd37f38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-AccessSpecDecl 0x7fa66bd37f80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:236:1, col:10> col:1 protected
`-CXXConstructorDecl 0x7fa66bd37fc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:238:22> col:5 basic_ostream 'void (void)'
  `-AlwaysInlineAttr 0x7fa66bd38080 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream.base" = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::thread
         0 |   std::__1::__libcpp_thread_t __t_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_t
         0 |   long __sig
         8 |   struct __darwin_pthread_handler_rec * __cleanup_stack
        16 |   char [8176] __opaque
           | [sizeof=8192, dsize=8192, align=8,
           |  nvsize=8192, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __darwin_pthread_handler_rec
         0 |   void (*)(void *) __routine
         8 |   void * __arg
        16 |   struct __darwin_pthread_handler_rec * __next
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fa66b81a960 </usr/include/sys/_pthread/_pthread_types.h:57:1, line:61:1> line:57:8 struct __darwin_pthread_handler_rec definition
|-CXXRecordDecl 0x7fa66b81aa88 <col:1, col:8> col:8 implicit struct __darwin_pthread_handler_rec
|-FieldDecl 0x7fa66b81acd0 <line:58:2, col:26> col:9 __routine 'void (*)(void *)'
|-FieldDecl 0x7fa66b81ad30 <line:59:2, col:8> col:8 __arg 'void *'
`-FieldDecl 0x7fa66b81ae00 <line:60:2, col:39> col:39 __next 'struct __darwin_pthread_handler_rec *'

Layout: <CGRecordLayout
  LLVMType:%struct.__darwin_pthread_handler_rec = type { void (i8*)*, i8*, %struct.__darwin_pthread_handler_rec* }
  NonVirtualBaseLLVMType:%struct.__darwin_pthread_handler_rec = type { void (i8*)*, i8*, %struct.__darwin_pthread_handler_rec* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fa66b81f260 </usr/include/sys/_pthread/_pthread_types.h:103:1, line:107:1> line:103:8 struct _opaque_pthread_t definition
|-CXXRecordDecl 0x7fa66b81f388 <col:1, col:8> col:8 implicit struct _opaque_pthread_t
|-FieldDecl 0x7fa66b81f438 <line:104:2, col:7> col:7 __sig 'long'
|-FieldDecl 0x7fa66b81f4a8 <line:105:2, col:40> col:40 __cleanup_stack 'struct __darwin_pthread_handler_rec *'
`-FieldDecl 0x7fa66b81f568 <line:106:2, col:32> col:7 __opaque 'char [8176]'

Layout: <CGRecordLayout
  LLVMType:%struct._opaque_pthread_t = type { i64, %struct.__darwin_pthread_handler_rec*, [8176 x i8] }
  NonVirtualBaseLLVMType:%struct._opaque_pthread_t = type { i64, %struct.__darwin_pthread_handler_rec*, [8176 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fa66ad401f8 prev 0x7fa66ad39f08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:282:1, line:330:1> line:282:24 referenced class thread definition
|-VisibilityAttr 0x7fa66ad402f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7fa66ad40340 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:282:1, col:24> col:24 implicit referenced class thread
|-FieldDecl 0x7fa66ad403e8 <line:284:5, col:23> col:23 referenced __t_ 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
|-CXXConstructorDecl 0x7fa66ad40580 <line:286:5, col:25> col:5 thread 'void (const class std::__1::thread &)'
| `-ParmVarDecl 0x7fa66ad40468 <col:12, col:24> col:25 'const class std::__1::thread &'
|-CXXMethodDecl 0x7fa66ad40730 <line:287:5, col:36> col:13 operator= 'class std::__1::thread &(const class std::__1::thread &)'
| `-ParmVarDecl 0x7fa66ad40640 <col:23, col:35> col:36 'const class std::__1::thread &'
|-AccessSpecDecl 0x7fa66ad407d0 <line:288:1, col:7> col:1 public
|-TypedefDecl 0x7fa66ad40808 <line:289:5, col:25> col:25 referenced id 'class std::__1::__thread_id'
| `-RecordType 0x7fa66ad37b30 'class std::__1::__thread_id'
|   `-CXXRecord 0x7fa66ad37fc8 '__thread_id'
|-TypedefDecl 0x7fa66ad40870 <line:290:5, col:31> col:31 referenced native_handle_type 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| `-TypedefType 0x7fa66b9aa5c0 'std::__1::__libcpp_thread_t' sugar
|   |-Typedef 0x7fa66b9a7e90 '__libcpp_thread_t'
|   `-TypedefType 0x7fa66b978bd0 'pthread_t' sugar
|     |-Typedef 0x7fa66b9771e0 'pthread_t'
|     `-TypedefType 0x7fa66b9771b0 '__darwin_pthread_t' sugar
|       |-Typedef 0x7fa66b820c80 '__darwin_pthread_t'
|       `-PointerType 0x7fa66b820c30 'struct _opaque_pthread_t *'
|         `-ElaboratedType 0x7fa66b81fbc0 'struct _opaque_pthread_t' sugar
|           `-RecordType 0x7fa66b81f300 'struct _opaque_pthread_t'
|             `-CXXRecord 0x7fa66b81f260 '_opaque_pthread_t'
|-CXXConstructorDecl 0x7fa66ad40920 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:293:53> col:5 thread 'void (void) noexcept'
