
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__scalar_hash<struct std::__1::_PairT, 2> (empty)
         0 |   struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1509:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1000000000, 1>, false, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_mutex_t
         0 |   long __sig
         8 |   char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_cond_t
         0 |   long __sig
         8 |   char [40] __opaque
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1, 1>, true, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct _opaque_pthread_t *, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::hash<struct _opaque_pthread_t *> (empty)
         0 |   struct std::__1::unary_function<struct _opaque_pthread_t *, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__thread_struct
         0 |   class std::__1::__thread_struct_imp * __p_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<unsigned long, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__vector_base_common<true> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<int *, 0, false>
         0 |   int * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<int> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (empty)
         0 |   class std::__1::allocator<int> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<int *, class std::__1::allocator<int> >
         0 |   struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
         0 |     int * __value_
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<int> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__vector_base<int, class std::__1::allocator<int> >
         0 |   class std::__1::__vector_base_common<true> (base) (empty)
         0 |   std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __begin_
         8 |   std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __end_
        16 |   class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > __end_cap_
        16 |     struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
        16 |       int * __value_
        16 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (base) (empty)
        16 |       class std::__1::allocator<int> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::vector<int, class std::__1::allocator<int> >
         0 |   class std::__1::__vector_base<int, class std::__1::allocator<int> > (base)
         0 |     class std::__1::__vector_base_common<true> (base) (empty)
         0 |     std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __begin_
         8 |     std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __end_
        16 |     class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > __end_cap_
        16 |       struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
        16 |         int * __value_
        16 |       struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (base) (empty)
        16 |         class std::__1::allocator<int> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fdeb89e3a00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:317:89> col:64 class __vector_base_common definition
|-TemplateArgument integral 1
|-VisibilityAttr 0x7fdeb89e3b98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fdeb89e3c48 prev 0x7fdeb89e3a00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:291:1, col:7> col:7 implicit class __vector_base_common
|-AccessSpecDecl 0x7fdeb89e3ce0 <line:293:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fdeb89e3d48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:294:51> col:27 __vector_base_common 'void (void)'
| `-AlwaysInlineAttr 0x7fdeb89e3e28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fdeb89e3e70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:295:22, col:50> col:27 __throw_length_error 'void (void) const'
| `-CXX11NoReturnAttr 0x7fdeb89e3f18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
|-CXXMethodDecl 0x7fdeb89e3f60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:296:22, col:50> col:27 __throw_out_of_range 'void (void) const'
| `-CXX11NoReturnAttr 0x7fdeb89e4008 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
`-CXXDestructorDecl 0x7fdeb8ad9cd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:317:64> col:64 implicit ~__vector_base_common 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__vector_base_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__vector_base_common.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fdeb8abbbe0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2034:1, line:2067:1> line:2037:8 struct __compressed_pair_elem definition
|-TemplateArgument type 'int *'
|-TemplateArgument integral 0
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7fdeb8abbe60 prev 0x7fdeb8abbbe0 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7fdeb8abbf08 <line:2038:3, col:15> col:15 _ParamT 'int *':'int *'
| `-SubstTemplateTypeParmType 0x7fdeb8abb260 'int *' sugar
|   |-TemplateTypeParmType 0x7fdeb9567580 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fdeb9567538 '_Tp'
|   `-PointerType 0x7fdeb90589d0 'int *'
|     `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeb8abbfc8 <line:2039:3, col:16> col:16 referenced reference 'int *&'
| `-LValueReferenceType 0x7fdeb8abbf90 'int *&'
|   `-SubstTemplateTypeParmType 0x7fdeb8abb260 'int *' sugar
|     |-TemplateTypeParmType 0x7fdeb9567580 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fdeb9567538 '_Tp'
|     `-PointerType 0x7fdeb90589d0 'int *'
|       `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeb8abc088 <line:2040:3, col:22> col:22 referenced const_reference 'int *const &'
| `-LValueReferenceType 0x7fdeb8abc050 'int *const &'
|   `-QualType 0x7fdeb8abb261 'int *const' const
|     `-SubstTemplateTypeParmType 0x7fdeb8abb260 'int *' sugar
|       |-TemplateTypeParmType 0x7fdeb9567580 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fdeb9567538 '_Tp'
|       `-PointerType 0x7fdeb90589d0 'int *'
|         `-BuiltinType 0x7fdeb78335c0 'int'
|-CXXConstructorDecl 0x7fdeb8abc120 <line:2043:3, col:52> col:13 constexpr __compressed_pair_elem 'void (void)'
|-FunctionTemplateDecl 0x7fdeb8abc908 <line:2045:3, line:2050:44> line:2049:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fdeb8abc1d8 <line:2045:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fdeb8abc248 <col:24, line:2047:6> line:2045:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<int *, 0, false>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7fdeb8abc860 <line:2048:3, line:2050:44> line:2049:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7fdeb8abc778 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7fdeb8abcf38 <line:2052:3, line:2056:75> line:2054:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fdeb8abc9e8 <line:2052:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7fdeb8abca58 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7fdeb8abce90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2056:75> line:2054:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7fdeb8abcad0 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fdeb8abcc38 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7fdeb8abcd88 <line:2055:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7fdeb8abcfc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8abd148 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2062:3, col:50> col:13 __get 'std::__1::__compressed_pair_elem<int *, 0, false>::reference (void) noexcept'
|-CXXMethodDecl 0x7fdeb8abd298 <line:2063:3, col:62> col:19 __get 'std::__1::__compressed_pair_elem<int *, 0, false>::const_reference (void) const noexcept'
|-AccessSpecDecl 0x7fdeb8abd340 <line:2065:1, col:8> col:1 private
|-FieldDecl 0x7fdeb8abd378 <line:2066:3, col:7> col:7 __value_ 'int *':'int *'
`-CXXDestructorDecl 0x7fdeb8ad9e98 <line:2037:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem" = type { i32* }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem" = type { i32* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fdeb8aa57c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:101:1, col:52> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28 class allocator definition
|-TemplateArgument type 'int'
|-CXXRecordDecl 0x7fdeb8aa67f8 prev 0x7fdeb8aa57c8 <col:1, col:28> col:28 implicit class allocator
|-AccessSpecDecl 0x7fdeb8aa6890 <line:1722:1, col:7> col:1 public
|-TypedefDecl 0x7fdeb8aa68b8 <line:1723:5, col:31> col:31 referenced size_type 'size_t':'unsigned long'
| `-TypedefType 0x7fdeb9016e10 'size_t' sugar
|   |-Typedef 0x7fdeb78687b0 'size_t'
|   `-BuiltinType 0x7fdeb7833680 'unsigned long'
|-TypedefDecl 0x7fdeb8aa6910 <line:1724:5, col:31> col:31 referenced difference_type 'ptrdiff_t':'long'
| `-TypedefType 0x7fdeb909c750 'ptrdiff_t' sugar
|   |-Typedef 0x7fdeb7868740 'ptrdiff_t'
|   `-BuiltinType 0x7fdeb78335e0 'long'
|-TypedefDecl 0x7fdeb8aa69d8 <line:1725:5, col:31> col:31 referenced pointer 'int *'
| `-PointerType 0x7fdeb8aa69a0 'int *'
|   `-SubstTemplateTypeParmType 0x7fdeb8aa6970 'int' sugar
|     |-TemplateTypeParmType 0x7fdeb9557660 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fdeb9557618 '_Tp'
|     `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeb8aa6a68 <line:1726:5, col:31> col:31 referenced const_pointer 'const int *'
| `-PointerType 0x7fdeb8aa6a30 'const int *'
|   `-QualType 0x7fdeb8aa6971 'const int' const
|     `-SubstTemplateTypeParmType 0x7fdeb8aa6970 'int' sugar
|       |-TemplateTypeParmType 0x7fdeb9557660 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fdeb9557618 '_Tp'
|       `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeb8aa6af8 <line:1727:5, col:31> col:31 reference 'int &'
| `-LValueReferenceType 0x7fdeb8aa6ac0 'int &'
|   `-SubstTemplateTypeParmType 0x7fdeb8aa6970 'int' sugar
|     |-TemplateTypeParmType 0x7fdeb9557660 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fdeb9557618 '_Tp'
|     `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeb8aa6b88 <line:1728:5, col:31> col:31 const_reference 'const int &'
| `-LValueReferenceType 0x7fdeb8aa6b50 'const int &'
|   `-QualType 0x7fdeb8aa6971 'const int' const
|     `-SubstTemplateTypeParmType 0x7fdeb8aa6970 'int' sugar
|       |-TemplateTypeParmType 0x7fdeb9557660 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fdeb9557618 '_Tp'
|       `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeb8aa6bf0 <line:1729:5, col:31> col:31 referenced value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7fdeb8aa6970 'int' sugar
|   |-TemplateTypeParmType 0x7fdeb9557660 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fdeb9557618 '_Tp'
|   `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeb8aa6c48 <line:1731:5, col:23> col:23 referenced propagate_on_container_move_assignment 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fdeb8001b40 'std::__1::true_type' sugar
|   |-Typedef 0x7fdeb8802448 'true_type'
|   `-TemplateSpecializationType 0x7fdeb8801f30 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fdeb8801d98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fdeb8801d80 <line:528:31> '_Bool' true
|     `-RecordType 0x7fdeb8801f10 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fdeb8801e08 'integral_constant'
|-TypedefDecl 0x7fdeb8aa6ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1732:5, col:23> col:23 referenced is_always_equal 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fdeb8001b40 'std::__1::true_type' sugar
|   |-Typedef 0x7fdeb8802448 'true_type'
|   `-TemplateSpecializationType 0x7fdeb8801f30 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fdeb8801d98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fdeb8801d80 <line:528:31> '_Bool' true
|     `-RecordType 0x7fdeb8801f10 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fdeb8801e08 'integral_constant'
|-ClassTemplateDecl 0x7fdeb8aa6e18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1734:5, col:33> col:33 rebind
| |-TemplateTypeParmDecl 0x7fdeb8aa6cf8 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXRecordDecl 0x7fdeb8aa6d80 <col:26, col:33> col:33 struct rebind
|-CXXConstructorDecl 0x7fdeb8aa7068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1736:54> col:31 referenced allocator 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fdeb8aa7148 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fdeb8aa7460 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:5, col:96> col:52 allocator
| |-TemplateTypeParmDecl 0x7fdeb8aa7190 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXConstructorDecl 0x7fdeb8aa73b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:96> col:52 allocator 'void (const allocator<_Up> &) noexcept'
|   |-ParmVarDecl 0x7fdeb8aa72d0 <col:62, col:82> col:83 'const allocator<_Up> &'
|   `-AlwaysInlineAttr 0x7fdeb8aa74b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8aa76e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1739:39> line:1738:39 address 'std::__1::allocator<int>::pointer (std::__1::allocator<int>::reference) const noexcept'
| |-ParmVarDecl 0x7fdeb8aa75e0 <col:47, col:57> col:57 __x 'std::__1::allocator<int>::reference':'int &'
| `-AlwaysInlineAttr 0x7fdeb8aa7798 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8aa7938 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1741:39> line:1740:45 address 'std::__1::allocator<int>::const_pointer (std::__1::allocator<int>::const_reference) const noexcept'
| |-ParmVarDecl 0x7fdeb8aa7830 <col:53, col:69> col:69 __x 'std::__1::allocator<int>::const_reference':'const int &'
| `-AlwaysInlineAttr 0x7fdeb8aa79e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8aa7ba0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1748:9> line:1742:39 allocate 'std::__1::allocator<int>::pointer (std::__1::allocator::size_type, allocator<void>::const_pointer)'
| |-ParmVarDecl 0x7fdeb8aa7a30 <col:48, col:58> col:58 __n 'std::__1::allocator::size_type':'unsigned long'
| |-ParmVarDecl 0x7fdeb8aa7a90 <col:63, col:96> col:94 'allocator<void>::const_pointer':'const void *'
| `-AlwaysInlineAttr 0x7fdeb8aa7c58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8aa7e28 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1750:49> line:1749:36 deallocate 'void (std::__1::allocator<int>::pointer, std::__1::allocator::size_type) noexcept'
| |-ParmVarDecl 0x7fdeb8aa7cb0 <col:47, col:55> col:55 __p 'std::__1::allocator<int>::pointer':'int *'
| |-ParmVarDecl 0x7fdeb8aa7d10 <col:60> col:69 'std::__1::allocator::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fdeb8aa7ee0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8aa7f28 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1752:45> line:1751:41 max_size 'std::__1::allocator::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8aa7fd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fdeb8aa83b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1754:5, line:1760:9> line:1757:9 construct
| |-TemplateTypeParmDecl 0x7fdeb8aa8018 <line:1754:15, col:21> col:21 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fdeb8aa8088 <col:26, col:35> col:35 class depth 0 index 1 ... _Args
| `-CXXMethodDecl 0x7fdeb8aa8320 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1760:9> line:1757:9 construct 'void (_Up *, _Args &&...)'
|   |-ParmVarDecl 0x7fdeb8aa8158 <col:19, col:24> col:24 __p '_Up *'
|   |-ParmVarDecl 0x7fdeb8aa8248 <col:29, col:40> col:40 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7fdeb8aa8418 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8aa8600 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1814:70> col:36 destroy 'void (std::__1::allocator<int>::pointer)'
| |-ParmVarDecl 0x7fdeb8aa84f8 <col:44, col:52> col:52 __p 'std::__1::allocator<int>::pointer':'int *'
| `-AlwaysInlineAttr 0x7fdeb8aa86b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fdeb8abf698 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28> col:28 implicit referenced ~allocator 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fdeb8ad8b48 <col:28> col:28 implicit constexpr allocator 'void (const class std::__1::allocator<int> &)' inline default trivial noexcept-unevaluated 0x7fdeb8ad8b48
| `-ParmVarDecl 0x7fdeb8ad8c30 <col:28> col:28 'const class std::__1::allocator<int> &'
`-CXXConstructorDecl 0x7fdeb8ad8cc8 <col:28> col:28 implicit constexpr allocator 'void (class std::__1::allocator<int> &&)' inline default trivial noexcept-unevaluated 0x7fdeb8ad8cc8
  `-ParmVarDecl 0x7fdeb8ad8df0 <col:28> col:28 'class std::__1::allocator<int> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fdeb8abddc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2069:1, line:2099:1> line:2070:8 struct __compressed_pair_elem definition
|-private 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-TemplateArgument integral 1
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7fdeb8abe158 prev 0x7fdeb8abddc0 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7fdeb8abe200 <line:2071:3, col:15> col:15 _ParamT 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7fdeb8abe020 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7fdeb95699b0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fdeb9569970 '_Tp'
|   `-RecordType 0x7fdeb8aa58b0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fdeb8aa57c8 'allocator'
|-TypedefDecl 0x7fdeb8abe298 <line:2072:3, col:16> col:16 referenced reference 'class std::__1::allocator<int> &'
| `-LValueReferenceType 0x7fdeb8abe260 'class std::__1::allocator<int> &'
|   `-SubstTemplateTypeParmType 0x7fdeb8abe020 'class std::__1::allocator<int>' sugar
|     |-TemplateTypeParmType 0x7fdeb95699b0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fdeb9569970 '_Tp'
|     `-RecordType 0x7fdeb8aa58b0 'class std::__1::allocator<int>'
|       `-ClassTemplateSpecialization 0x7fdeb8aa57c8 'allocator'
|-TypedefDecl 0x7fdeb8abe328 <line:2073:3, col:22> col:22 referenced const_reference 'const class std::__1::allocator<int> &'
| `-LValueReferenceType 0x7fdeb8abe2f0 'const class std::__1::allocator<int> &'
|   `-QualType 0x7fdeb8abe021 'const class std::__1::allocator<int>' const
|     `-SubstTemplateTypeParmType 0x7fdeb8abe020 'class std::__1::allocator<int>' sugar
|       |-TemplateTypeParmType 0x7fdeb95699b0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fdeb9569970 '_Tp'
|       `-RecordType 0x7fdeb8aa58b0 'class std::__1::allocator<int>'
|         `-ClassTemplateSpecialization 0x7fdeb8aa57c8 'allocator'
|-TypedefDecl 0x7fdeb8abe390 <line:2074:3, col:15> col:15 __value_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7fdeb8abe020 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7fdeb95699b0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fdeb9569970 '_Tp'
|   `-RecordType 0x7fdeb8aa58b0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fdeb8aa57c8 'allocator'
|-CXXConstructorDecl 0x7fdeb8abe428 <line:2077:3, col:46> col:13 __compressed_pair_elem 'void (void)' default noexcept-unevaluated 0x7fdeb8abe428
|-FunctionTemplateDecl 0x7fdeb8abec08 <line:2079:3, line:2084:48> line:2083:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fdeb8abe4e0 <line:2079:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fdeb8abe548 <col:24, line:2081:6> line:2079:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<class allocator<int>, 1, true>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7fdeb8abeb60 <line:2082:3, line:2084:48> line:2083:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7fdeb8abea78 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7fdeb8abf238 <line:2086:3, line:2090:79> line:2088:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fdeb8abece8 <line:2086:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7fdeb8abed58 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7fdeb8abf190 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2090:79> line:2088:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7fdeb8abedd0 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fdeb8abef38 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7fdeb8abf088 <line:2089:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7fdeb8abf2c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8abf448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2097:3, col:47> col:13 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>::reference (void) noexcept'
|-CXXMethodDecl 0x7fdeb8abf598 <line:2098:3, col:59> col:19 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>::const_reference (void) const noexcept'
`-CXXDestructorDecl 0x7fdeb8ad9f78 <line:2070:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem.0" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem.0" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fdeb8abafe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2104:1, line:2201:1> line:2105:7 class __compressed_pair definition
|-private '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|-private '__compressed_pair_elem<class std::__1::allocator<int>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>'
|-TemplateArgument type 'int *'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x7fdeb8abf7c0 prev 0x7fdeb8abafe8 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7fdeb8abfb68 <line:2107:3, col:42> col:42 _Base1 '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
| `-TemplateSpecializationType 0x7fdeb8abfac0 '__compressed_pair_elem<int *, 0>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'int *':'int *'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fdeb956ce00 <col:39> 'int' 0
|   `-RecordType 0x7fdeb8abbd00 'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|     `-ClassTemplateSpecialization 0x7fdeb8abbbe0 '__compressed_pair_elem'
|-TypedefDecl 0x7fdeb8abfec8 <line:2108:3, col:42> col:42 _Base2 '__compressed_pair_elem<class std::__1::allocator<int>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>'
| `-TemplateSpecializationType 0x7fdeb8abfe20 '__compressed_pair_elem<class std::__1::allocator<int>, 1>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fdeb956d1a8 <col:39> 'int' 1
|   `-RecordType 0x7fdeb8abdee0 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>'
|     `-ClassTemplateSpecialization 0x7fdeb8abddc0 '__compressed_pair_elem'
|-StaticAssertDecl 0x7fdeb8ac0348 <line:2114:3, line:2117:44> line:2114:3
| |-ParenExpr 0x7fdeb8ac0328 <col:17, col:43> '_Bool'
| | `-UnaryOperator 0x7fdeb8ac0308 <col:18, col:38> '_Bool' prefix '!'
| |   `-ImplicitCastExpr 0x7fdeb8ac02f0 <col:19, col:38> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7fdeb8ac02b8 <col:19, col:38> 'const _Bool':'const _Bool' lvalue Var 0x7fdeb971ddc8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fdeb956d6d8 <line:2115:5, line:2117:5> 'const char [179]' lvalue "__compressed_pair cannot be instantated when T1 and T2 are the same type; The current implementation is NOT ABI-compatible with the previous implementation for this configuration"
|-AccessSpecDecl 0x7fdeb8ac0380 <line:2119:1, col:7> col:1 public
|-FunctionTemplateDecl 0x7fdeb8ac0dc8 <line:2121:3, line:2128:34> col:13 __compressed_pair
| |-NonTypeTemplateParmDecl 0x7fdeb8ac03a8 <line:2121:13, col:27> col:18 referenced '_Bool' depth 0 index 0 _Dummy
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fdeb956d820 <col:27> '_Bool' true
| |-TemplateTypeParmDecl 0x7fdeb8ac0400 <line:2122:7, line:2125:10> line:2122:7 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<__dependent_type<is_default_constructible<int *>, _Dummy>::value && __dependent_type<is_default_constructible<class allocator<int> >, _Dummy>::value>::type'
| `-CXXConstructorDecl 0x7fdeb8ac0d20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2128:34> col:13 constexpr __compressed_pair 'void (void)'
|   `-AlwaysInlineAttr 0x7fdeb8ac0e48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fdeb8ac1668 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2130:3, line:2135:51> line:2134:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fdeb8ac0f18 <line:2130:13, col:19> col:19 class depth 0 index 0 _Tp
| |-NonTypeTemplateParmDecl 0x7fdeb8ac1420 <col:24, line:2132:57> col:55 'typename enable_if<!is_same<typename decay<_Tp>::type, class __compressed_pair<int *, class allocator<int> > >::value, _Bool>::type' depth 0 index 1
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fdeb956e740 <col:57> '_Bool' true
| `-CXXConstructorDecl 0x7fdeb8ac15c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2135:51> line:2134:3 constexpr __compressed_pair 'void (_Tp &&)'
|   |-ParmVarDecl 0x7fdeb8ac14d8 <col:21, col:27> col:27 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fdeb8ac16c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fdeb8ac1a48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2137:3, line:2140:51> line:2139:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fdeb8ac1790 <line:2137:13, col:19> col:19 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7fdeb8ac19a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2140:51> line:2139:3 constexpr __compressed_pair 'void (struct std::__1::__second_tag, _Tp &&)'
|   |-ParmVarDecl 0x7fdeb8ac1810 <col:21> col:33 'struct std::__1::__second_tag'
|   |-ParmVarDecl 0x7fdeb8ac18a8 <col:35, col:41> col:41 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fdeb8ac1aa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fdeb8ac1ef8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2142:3, line:2145:75> line:2144:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fdeb8ac1b78 <line:2142:13, col:19> col:19 class depth 0 index 0 _U1
| |-TemplateTypeParmDecl 0x7fdeb8ac1be8 <col:24, col:30> col:30 class depth 0 index 1 _U2
| `-CXXConstructorDecl 0x7fdeb8ac1e50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 constexpr __compressed_pair 'void (_U1 &&, _U2 &&)'
|   |-ParmVarDecl 0x7fdeb8ac1cb8 <col:21, col:27> col:27 __t1 '_U1 &&'
|   |-ParmVarDecl 0x7fdeb8ac1d58 <col:33, col:39> col:39 __t2 '_U2 &&'
|   `-AlwaysInlineAttr 0x7fdeb8ac1f58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fdeb8ac25b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2147:3, line:2154:75> line:2149:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fdeb8ac2028 <line:2147:13, col:22> col:22 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7fdeb8ac2098 <col:30, col:39> col:39 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7fdeb8ac2510 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2154:75> line:2149:3 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7fdeb8ac2128 <col:21, col:43> col:43 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fdeb8ac2298 <col:49, col:66> col:66 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7fdeb8ac2408 <line:2150:21, col:38> col:38 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7fdeb8ac2620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ac27e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2175:3> line:2173:30 first 'typename _Base1::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ac2890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ac2998 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2180:3> line:2178:36 first 'typename _Base1::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ac2a40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ac2b88 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2185:3> line:2183:30 second 'typename _Base2::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ac2c30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ac2d38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2190:3> line:2188:36 second 'typename _Base2::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ac2de0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ac2f80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2200:3> line:2193:8 swap 'void (class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > &)' noexcept-uninstantiated 0x7fdeb9570848
| |-ParmVarDecl 0x7fdeb8ac2e68 <col:13, col:32> col:32 __x 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7fdeb8ac3078 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
`-CXXDestructorDecl 0x7fdeb8ad9db8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2105:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fdeb8aa5d18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:322:1, line:411:1> line:323:7 class __vector_base definition
|-protected '__vector_base_common<true>':'class std::__1::__vector_base_common<true>'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x7fdeb8aa5f80 prev 0x7fdeb8aa5d18 <col:1, col:7> col:7 implicit class __vector_base
|-AccessSpecDecl 0x7fdeb8aa6018 <line:326:1, col:10> col:1 protected
|-TypedefDecl 0x7fdeb8aa6078 <line:327:5, col:54> col:54 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7fdeb8aa6040 'int' sugar
|   |-TemplateTypeParmType 0x7fdeb89e40b0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fdeb89e4070 '_Tp'
|   `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeb8aa6108 <line:328:5, col:54> col:54 allocator_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7fdeb8aa60d0 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7fdeb89e4120 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fdeb89e40d8 '_Allocator'
|   `-RecordType 0x7fdeb8aa58b0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fdeb8aa57c8 'allocator'
|-TypedefDecl 0x7fdeb8aa6318 <line:329:5, col:54> col:54 referenced __alloc_traits 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x7fdeb8aa62a0 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type':'class std::__1::allocator<int>'
|   `-RecordType 0x7fdeb8aa6280 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x7fdeb8aa6190 'allocator_traits'
|-TypedefDecl 0x7fdeb8aa63f8 <line:330:5, col:54> col:54 referenced reference 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-LValueReferenceType 0x7fdeb8aa63c0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|   `-TypedefType 0x7fdeb8aa6370 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|     |-Typedef 0x7fdeb8aa6078 'value_type'
|     `-SubstTemplateTypeParmType 0x7fdeb8aa6040 'int' sugar
|       |-TemplateTypeParmType 0x7fdeb89e40b0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fdeb89e4070 '_Tp'
|       `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeb8aa64b8 <line:331:5, col:54> col:54 referenced const_reference 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-LValueReferenceType 0x7fdeb8aa6480 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|   `-QualType 0x7fdeb8aa6371 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' const
|     `-TypedefType 0x7fdeb8aa6370 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|       |-Typedef 0x7fdeb8aa6078 'value_type'
|       `-SubstTemplateTypeParmType 0x7fdeb8aa6040 'int' sugar
|         |-TemplateTypeParmType 0x7fdeb89e40b0 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7fdeb89e4070 '_Tp'
|         `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeb8abab10 <line:332:5, col:54> col:54 referenced size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7fdeb8abaac0 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7fdeb8ab3210 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x7fdeb8aafba0 'size_type'
|     `-ElaboratedType 0x7fdeb8aafb50 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7fdeb8aafb30 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|         |-Typedef 0x7fdeb8aafab0 'type'
|         `-ElaboratedType 0x7fdeb8aafa60 'typename class allocator<int>::size_type' sugar
|           `-TypedefType 0x7fdeb8aaf340 'std::__1::allocator<int>::size_type' sugar
|             |-Typedef 0x7fdeb8aa68b8 'size_type'
|             `-TypedefType 0x7fdeb9016e10 'size_t' sugar
|               |-Typedef 0x7fdeb78687b0 'size_t'
|               `-BuiltinType 0x7fdeb7833680 'unsigned long'
|-TypedefDecl 0x7fdeb8ababe0 <line:333:5, col:54> col:54 referenced difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7fdeb8abab90 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7fdeb8aaf060 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x7fdeb8aaeff0 'difference_type'
|     `-ElaboratedType 0x7fdeb8aaefa0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7fdeb8aaef80 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|         |-Typedef 0x7fdeb8aaef00 'type'
|         `-ElaboratedType 0x7fdeb8aaeeb0 'typename class allocator<int>::difference_type' sugar
|           `-TypedefType 0x7fdeb8aae760 'std::__1::allocator<int>::difference_type' sugar
|             |-Typedef 0x7fdeb8aa6910 'difference_type'
|             `-TypedefType 0x7fdeb909c750 'ptrdiff_t' sugar
|               |-Typedef 0x7fdeb7868740 'ptrdiff_t'
|               `-BuiltinType 0x7fdeb78335e0 'long'
|-TypedefDecl 0x7fdeb8abacb0 <line:334:5, col:54> col:54 referenced pointer 'typename __alloc_traits::pointer':'int *'
| `-ElaboratedType 0x7fdeb8abac60 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7fdeb8aa9e30 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x7fdeb8aa9dc0 'pointer'
|     `-ElaboratedType 0x7fdeb8aa9d70 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7fdeb8aa9d50 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|         |-Typedef 0x7fdeb8aa9cd0 'type'
|         `-ElaboratedType 0x7fdeb8aa9c80 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|           `-TypedefType 0x7fdeb8aa9c60 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x7fdeb8aa9be0 'type'
|             `-ElaboratedType 0x7fdeb8aa9b90 'typename class allocator<int>::pointer' sugar
|               `-TypedefType 0x7fdeb8aa7590 'std::__1::allocator<int>::pointer' sugar
|                 |-Typedef 0x7fdeb8aa69d8 'pointer'
|                 `-PointerType 0x7fdeb8aa69a0 'int *'
|                   `-SubstTemplateTypeParmType 0x7fdeb8aa6970 'int' sugar
|                     |-TemplateTypeParmType 0x7fdeb9557660 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fdeb9557618 '_Tp'
|                     `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeb8abada0 <line:335:5, col:54> col:54 referenced const_pointer 'typename __alloc_traits::const_pointer':'const int *'
| `-ElaboratedType 0x7fdeb8abad50 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7fdeb8abad30 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x7fdeb8aaabc0 'const_pointer'
|     `-ElaboratedType 0x7fdeb8aaab70 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7fdeb8aaab50 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|         |-Typedef 0x7fdeb8aaaad0 'type'
|         `-ElaboratedType 0x7fdeb8aaaa80 'typename class allocator<int>::const_pointer' sugar
|           `-TypedefType 0x7fdeb8aa77e0 'std::__1::allocator<int>::const_pointer' sugar
|             |-Typedef 0x7fdeb8aa6a68 'const_pointer'
|             `-PointerType 0x7fdeb8aa6a30 'const int *'
|               `-QualType 0x7fdeb8aa6971 'const int' const
|                 `-SubstTemplateTypeParmType 0x7fdeb8aa6970 'int' sugar
|                   |-TemplateTypeParmType 0x7fdeb9557660 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7fdeb9557618 '_Tp'
|                   `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeb8abae30 <line:336:5, col:54> col:54 iterator 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
| `-TypedefType 0x7fdeb8abae00 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer' sugar
|   |-Typedef 0x7fdeb8abacb0 'pointer'
|   `-ElaboratedType 0x7fdeb8abac60 'typename __alloc_traits::pointer' sugar
|     `-TypedefType 0x7fdeb8aa9e30 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|       |-Typedef 0x7fdeb8aa9dc0 'pointer'
|       `-ElaboratedType 0x7fdeb8aa9d70 'typename __pointer_type<value_type, allocator_type>::type' sugar
|         `-TypedefType 0x7fdeb8aa9d50 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|           |-Typedef 0x7fdeb8aa9cd0 'type'
|           `-ElaboratedType 0x7fdeb8aa9c80 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|             `-TypedefType 0x7fdeb8aa9c60 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|               |-Typedef 0x7fdeb8aa9be0 'type'
|               `-ElaboratedType 0x7fdeb8aa9b90 'typename class allocator<int>::pointer' sugar
|                 `-TypedefType 0x7fdeb8aa7590 'std::__1::allocator<int>::pointer' sugar
|                   |-Typedef 0x7fdeb8aa69d8 'pointer'
|                   `-PointerType 0x7fdeb8aa69a0 'int *'
|                     `-SubstTemplateTypeParmType 0x7fdeb8aa6970 'int' sugar
|                       |-TemplateTypeParmType 0x7fdeb9557660 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7fdeb9557618 '_Tp'
|                       `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeb8abaec0 <line:337:5, col:54> col:54 const_iterator 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer':'const int *'
| `-TypedefType 0x7fdeb8abae90 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer' sugar
|   |-Typedef 0x7fdeb8abada0 'const_pointer'
|   `-ElaboratedType 0x7fdeb8abad50 'typename __alloc_traits::const_pointer' sugar
|     `-TypedefType 0x7fdeb8abad30 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|       |-Typedef 0x7fdeb8aaabc0 'const_pointer'
|       `-ElaboratedType 0x7fdeb8aaab70 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|         `-TypedefType 0x7fdeb8aaab50 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|           |-Typedef 0x7fdeb8aaaad0 'type'
|           `-ElaboratedType 0x7fdeb8aaaa80 'typename class allocator<int>::const_pointer' sugar
|             `-TypedefType 0x7fdeb8aa77e0 'std::__1::allocator<int>::const_pointer' sugar
|               |-Typedef 0x7fdeb8aa6a68 'const_pointer'
|               `-PointerType 0x7fdeb8aa6a30 'const int *'
|                 `-QualType 0x7fdeb8aa6971 'const int' const
|                   `-SubstTemplateTypeParmType 0x7fdeb8aa6970 'int' sugar
|                     |-TemplateTypeParmType 0x7fdeb9557660 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fdeb9557618 '_Tp'
|                     `-BuiltinType 0x7fdeb78335c0 'int'
|-FieldDecl 0x7fdeb8abaf28 <line:339:5, col:53> col:53 __begin_ 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
|-FieldDecl 0x7fdeb8abaf80 <line:340:5, col:53> col:53 __end_ 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
|-FieldDecl 0x7fdeb8ac30e0 <line:341:5, col:48> col:48 __end_cap_ '__compressed_pair<std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer, std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> >'
|-CXXMethodDecl 0x7fdeb8ac31b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:345:37> line:344:21 __alloc 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &(void) noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ac3288 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ac3358 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:348:37> line:347:27 __alloc 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &(void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ac3400 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ac34d8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:351:36> line:350:14 __end_cap 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer &(void) noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ac3580 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ac3658 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:354:36> line:353:20 __end_cap 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer &(void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ac3700 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fdeb8ac37b0 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:357:5 __vector_base 'void (void)' noexcept-uninstantiated 0x7fdeb89e59f0
| `-AlwaysInlineAttr 0x7fdeb8ac38b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fdeb8ac3a30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:359:70> col:31 __vector_base 'void (const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fdeb8ac3908 <col:45, col:67> col:67 __a 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fdeb8ac3af0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fdeb8ac3b68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:360:5, col:20> col:5 used ~__vector_base 'void (void) noexcept'
|-CXXMethodDecl 0x7fdeb8ac3c18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:363:57> col:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ac3cc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ac3d88 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:366:64> line:365:15 capacity 'std::__1::__vector_base<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ac3e30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ac3f58 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:369:10 __destruct_at_end 'void (std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x7fdeb8ac3e88 <col:28, col:36> col:36 __new_last 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7fdeb8ac4008 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ac4150 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:374:89> line:372:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &)'
| |-ParmVarDecl 0x7fdeb8ac4088 <col:30, col:51> col:51 __c 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7fdeb8ac4200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ac43a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:382:89> line:377:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &)' noexcept-uninstantiated 0x7fdeb89e66e8
| |-ParmVarDecl 0x7fdeb8ac4288 <col:30, col:45> col:45 __c 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7fdeb8ac4498 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7fdeb8ac44e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:383:1, col:8> col:1 private
|-CXXMethodDecl 0x7fdeb8ac4690 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:394:9> line:385:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::true_type)'
| |-ParmVarDecl 0x7fdeb8ac4518 <col:30, col:51> col:51 __c 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7fdeb8ac4578 <col:56> col:65 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fdeb8ac4748 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ac4910 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:398:10> line:397:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::false_type)'
| |-ParmVarDecl 0x7fdeb8ac47a0 <col:30, col:49> col:50 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7fdeb8ac4800 <col:52> col:62 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7fdeb8ac49c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ac4ba0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:405:9> line:401:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::true_type)' noexcept-uninstantiated 0x7fdeb89f2578
| |-ParmVarDecl 0x7fdeb8ac4a20 <col:30, col:45> col:45 __c 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7fdeb8ac4a80 <col:50> col:59 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fdeb8ac4cb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
`-CXXMethodDecl 0x7fdeb8ac4e88 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:410:10> line:408:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::false_type) noexcept'
  |-ParmVarDecl 0x7fdeb8ac4d08 <col:30, col:43> col:44 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
  |-ParmVarDecl 0x7fdeb8ac4d68 <col:46> col:56 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
  `-AlwaysInlineAttr 0x7fdeb8ac4f40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__vector_base" = type { i32*, i32*, %"class.std::__1::__compressed_pair" }
  NonVirtualBaseLLVMType:%"class.std::__1::__vector_base" = type { i32*, i32*, %"class.std::__1::__compressed_pair" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fdeb8aa5948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:453:1, line:887:1> line:454:28 class vector definition
|-private '__vector_base<int, class std::__1::allocator<int> >':'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x7fdeb8ac4ff8 prev 0x7fdeb8aa5948 <col:1, col:28> col:28 implicit class vector
|-AccessSpecDecl 0x7fdeb8ac5090 <line:457:1, col:8> col:1 private
|-TypedefDecl 0x7fdeb8ac5188 <line:458:5, col:54> col:54 __base '__vector_base<int, class std::__1::allocator<int> >':'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x7fdeb8ac50e0 '__vector_base<int, class std::__1::allocator<int> >' sugar __vector_base
|   |-TemplateArgument type 'int':'int'
|   |-TemplateArgument type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|   `-RecordType 0x7fdeb8aa5e20 'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x7fdeb8aa5d18 '__vector_base'
|-TypedefDecl 0x7fdeb8ac5268 <line:459:5, col:54> col:54 __default_allocator_type 'allocator<int>':'class std::__1::allocator<int>'
| `-TemplateSpecializationType 0x7fdeb8ac51f0 'allocator<int>' sugar allocator
|   |-TemplateArgument type 'int':'int'
|   `-RecordType 0x7fdeb8aa58b0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fdeb8aa57c8 'allocator'
|-AccessSpecDecl 0x7fdeb8ac52c0 <line:460:1, col:7> col:1 public
|-TypedefDecl 0x7fdeb8ac52f8 <line:461:5, col:54> col:54 __self 'class std::__1::vector<int, class std::__1::allocator<int> >'
| `-RecordType 0x7fdeb8aa5a50 'class std::__1::vector<int, class std::__1::allocator<int> >'
|   `-ClassTemplateSpecialization 0x7fdeb8aa5948 'vector'
|-TypedefDecl 0x7fdeb8ac5360 <line:462:5, col:54> col:54 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7fdeb8aa5ca0 'int' sugar
|   |-TemplateTypeParmType 0x7fdeb89f6cf0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fdeb89f6cb0 '_Tp'
|   `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeb8ac53c8 <line:463:5, col:54> col:54 allocator_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7fdeb8aa5ce0 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7fdeb89f6d60 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fdeb89f6d18 '_Allocator'
|   `-RecordType 0x7fdeb8aa58b0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fdeb8aa57c8 'allocator'
|-TypedefDecl 0x7fdeb8ac54d0 <line:464:5, col:54> col:54 __alloc_traits 'typename __base::__alloc_traits':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-ElaboratedType 0x7fdeb8ac5480 'typename __base::__alloc_traits' sugar
|   `-TypedefType 0x7fdeb8aa6510 'std::__1::__vector_base<int, class std::__1::allocator<int> >::__alloc_traits' sugar
|     |-Typedef 0x7fdeb8aa6318 '__alloc_traits'
|     `-TemplateSpecializationType 0x7fdeb8aa62a0 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>' sugar allocator_traits
|       |-TemplateArgument type 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type':'class std::__1::allocator<int>'
|       `-RecordType 0x7fdeb8aa6280 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|         `-ClassTemplateSpecialization 0x7fdeb8aa6190 'allocator_traits'
|-TypedefDecl 0x7fdeb8ac55c0 <line:465:5, col:54> col:54 reference 'typename __base::reference':'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ElaboratedType 0x7fdeb8ac5570 'typename __base::reference' sugar
|   `-TypedefType 0x7fdeb8ac5550 'std::__1::__vector_base<int, class std::__1::allocator<int> >::reference' sugar
|     |-Typedef 0x7fdeb8aa63f8 'reference'
|     `-LValueReferenceType 0x7fdeb8aa63c0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|       `-TypedefType 0x7fdeb8aa6370 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|         |-Typedef 0x7fdeb8aa6078 'value_type'
|         `-SubstTemplateTypeParmType 0x7fdeb8aa6040 'int' sugar
|           |-TemplateTypeParmType 0x7fdeb89e40b0 '_Tp' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x7fdeb89e4070 '_Tp'
|           `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeb8ac56b0 <line:466:5, col:54> col:54 const_reference 'typename __base::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ElaboratedType 0x7fdeb8ac5660 'typename __base::const_reference' sugar
|   `-TypedefType 0x7fdeb8ac5640 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_reference' sugar
|     |-Typedef 0x7fdeb8aa64b8 'const_reference'
|     `-LValueReferenceType 0x7fdeb8aa6480 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|       `-QualType 0x7fdeb8aa6371 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' const
|         `-TypedefType 0x7fdeb8aa6370 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|           |-Typedef 0x7fdeb8aa6078 'value_type'
|           `-SubstTemplateTypeParmType 0x7fdeb8aa6040 'int' sugar
|             |-TemplateTypeParmType 0x7fdeb89e40b0 '_Tp' dependent depth 0 index 0
|             | `-TemplateTypeParm 0x7fdeb89e4070 '_Tp'
|             `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeb8ac5780 <line:467:5, col:54> col:54 size_type 'typename __base::size_type':'unsigned long'
| `-ElaboratedType 0x7fdeb8ac5730 'typename __base::size_type' sugar
|   `-TypedefType 0x7fdeb8ac3d10 'std::__1::__vector_base<int, class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x7fdeb8abab10 'size_type'
|     `-ElaboratedType 0x7fdeb8abaac0 'typename __alloc_traits::size_type' sugar
|       `-TypedefType 0x7fdeb8ab3210 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|         |-Typedef 0x7fdeb8aafba0 'size_type'
|         `-ElaboratedType 0x7fdeb8aafb50 'typename __size_type<allocator_type, difference_type>::type' sugar
|           `-TypedefType 0x7fdeb8aafb30 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|             |-Typedef 0x7fdeb8aafab0 'type'
|             `-ElaboratedType 0x7fdeb8aafa60 'typename class allocator<int>::size_type' sugar
|               `-TypedefType 0x7fdeb8aaf340 'std::__1::allocator<int>::size_type' sugar
|                 |-Typedef 0x7fdeb8aa68b8 'size_type'
|                 `-TypedefType 0x7fdeb9016e10 'size_t' sugar
|                   |-Typedef 0x7fdeb78687b0 'size_t'
|                   `-BuiltinType 0x7fdeb7833680 'unsigned long'
|-TypedefDecl 0x7fdeb8ac5870 <line:468:5, col:54> col:54 difference_type 'typename __base::difference_type':'long'
| `-ElaboratedType 0x7fdeb8ac5820 'typename __base::difference_type' sugar
|   `-TypedefType 0x7fdeb8ac5800 'std::__1::__vector_base<int, class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x7fdeb8ababe0 'difference_type'
|     `-ElaboratedType 0x7fdeb8abab90 'typename __alloc_traits::difference_type' sugar
|       `-TypedefType 0x7fdeb8aaf060 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|         |-Typedef 0x7fdeb8aaeff0 'difference_type'
|         `-ElaboratedType 0x7fdeb8aaefa0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|           `-TypedefType 0x7fdeb8aaef80 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|             |-Typedef 0x7fdeb8aaef00 'type'
|             `-ElaboratedType 0x7fdeb8aaeeb0 'typename class allocator<int>::difference_type' sugar
|               `-TypedefType 0x7fdeb8aae760 'std::__1::allocator<int>::difference_type' sugar
|                 |-Typedef 0x7fdeb8aa6910 'difference_type'
|                 `-TypedefType 0x7fdeb909c750 'ptrdiff_t' sugar
|                   |-Typedef 0x7fdeb7868740 'ptrdiff_t'
|                   `-BuiltinType 0x7fdeb78335e0 'long'
|-TypedefDecl 0x7fdeb8ac5940 <line:469:5, col:54> col:54 pointer 'typename __base::pointer':'int *'
| `-ElaboratedType 0x7fdeb8ac58f0 'typename __base::pointer' sugar
|   `-TypedefType 0x7fdeb8abae00 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x7fdeb8abacb0 'pointer'
|     `-ElaboratedType 0x7fdeb8abac60 'typename __alloc_traits::pointer' sugar
|       `-TypedefType 0x7fdeb8aa9e30 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|         |-Typedef 0x7fdeb8aa9dc0 'pointer'
|         `-ElaboratedType 0x7fdeb8aa9d70 'typename __pointer_type<value_type, allocator_type>::type' sugar
|           `-TypedefType 0x7fdeb8aa9d50 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|             |-Typedef 0x7fdeb8aa9cd0 'type'
|             `-ElaboratedType 0x7fdeb8aa9c80 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|               `-TypedefType 0x7fdeb8aa9c60 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|                 |-Typedef 0x7fdeb8aa9be0 'type'
|                 `-ElaboratedType 0x7fdeb8aa9b90 'typename class allocator<int>::pointer' sugar
|                   `-TypedefType 0x7fdeb8aa7590 'std::__1::allocator<int>::pointer' sugar
|                     |-Typedef 0x7fdeb8aa69d8 'pointer'
|                     `-PointerType 0x7fdeb8aa69a0 'int *'
|                       `-SubstTemplateTypeParmType 0x7fdeb8aa6970 'int' sugar
|                         |-TemplateTypeParmType 0x7fdeb9557660 '_Tp' dependent depth 0 index 0
|                         | `-TemplateTypeParm 0x7fdeb9557618 '_Tp'
|                         `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeb8ac5a10 <line:470:5, col:54> col:54 const_pointer 'typename __base::const_pointer':'const int *'
| `-ElaboratedType 0x7fdeb8ac59c0 'typename __base::const_pointer' sugar
|   `-TypedefType 0x7fdeb8abae90 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x7fdeb8abada0 'const_pointer'
|     `-ElaboratedType 0x7fdeb8abad50 'typename __alloc_traits::const_pointer' sugar
|       `-TypedefType 0x7fdeb8abad30 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|         |-Typedef 0x7fdeb8aaabc0 'const_pointer'
|         `-ElaboratedType 0x7fdeb8aaab70 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|           `-TypedefType 0x7fdeb8aaab50 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x7fdeb8aaaad0 'type'
|             `-ElaboratedType 0x7fdeb8aaaa80 'typename class allocator<int>::const_pointer' sugar
|               `-TypedefType 0x7fdeb8aa77e0 'std::__1::allocator<int>::const_pointer' sugar
|                 |-Typedef 0x7fdeb8aa6a68 'const_pointer'
|                 `-PointerType 0x7fdeb8aa6a30 'const int *'
|                   `-QualType 0x7fdeb8aa6971 'const int' const
|                     `-SubstTemplateTypeParmType 0x7fdeb8aa6970 'int' sugar
|                       |-TemplateTypeParmType 0x7fdeb9557660 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7fdeb9557618 '_Tp'
|                       `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeb8ac5c28 <line:471:5, col:54> col:54 iterator '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::pointer>':'class std::__1::__wrap_iter<int *>'
| `-TemplateSpecializationType 0x7fdeb8ac5bb0 '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|   `-RecordType 0x7fdeb8ac5b90 'class std::__1::__wrap_iter<int *>'
|     `-ClassTemplateSpecialization 0x7fdeb8ac5aa0 '__wrap_iter'
|-TypedefDecl 0x7fdeb8ac5e38 <line:472:5, col:54> col:54 const_iterator '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::const_pointer>':'class std::__1::__wrap_iter<const int *>'
| `-TemplateSpecializationType 0x7fdeb8ac5dc0 '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::const_pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::const_pointer':'const int *'
|   `-RecordType 0x7fdeb8ac5da0 'class std::__1::__wrap_iter<const int *>'
|     `-ClassTemplateSpecialization 0x7fdeb8ac5cb0 '__wrap_iter'
|-TypedefDecl 0x7fdeb8ac6090 <line:473:5, col:55> col:55 reverse_iterator 'std::__1::reverse_iterator<iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<int *> >'
| `-ElaboratedType 0x7fdeb8ac6020 'std::__1::reverse_iterator<iterator>' sugar
|   `-TemplateSpecializationType 0x7fdeb8ac5fd0 'reverse_iterator<std::__1::vector<int, class std::__1::allocator<int> >::iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::iterator':'class std::__1::__wrap_iter<int *>'
|     `-RecordType 0x7fdeb8ac5fb0 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<int *> >'
|       `-ClassTemplateSpecialization 0x7fdeb8ac5ec0 'reverse_iterator'
|-TypedefDecl 0x7fdeb8ac62f0 <line:474:5, col:55> col:55 const_reverse_iterator 'std::__1::reverse_iterator<const_iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const int *> >'
| `-ElaboratedType 0x7fdeb8ac6280 'std::__1::reverse_iterator<const_iterator>' sugar
|   `-TemplateSpecializationType 0x7fdeb8ac6230 'reverse_iterator<std::__1::vector<int, class std::__1::allocator<int> >::const_iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|     `-RecordType 0x7fdeb8ac6210 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const int *> >'
|       `-ClassTemplateSpecialization 0x7fdeb8ac6120 'reverse_iterator'
|-StaticAssertDecl 0x7fdeb8ac7c78 <line:476:5, line:477:74> line:476:5
| |-ParenExpr 0x7fdeb8ac7c40 <col:19, col:83> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7fdeb8ac7c08 <col:20, col:78> 'const _Bool':'const _Bool' lvalue Var 0x7fdeb97aea20 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fdeb89f8700 <line:477:19> 'const char [54]' lvalue "Allocator::value_type must be same type as value_type"
|-CXXConstructorDecl 0x7fdeb8ac7d18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:485:9> line:480:5 used vector 'void (void) noexcept(is_nothrow_default_constructible<allocator_type>::value)'
| `-AlwaysInlineAttr 0x7fdeb8ac7e38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fdeb8ac7fb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:497:5> line:486:40 vector 'void (const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)' noexcept-uninstantiated 0x7fdeb89f8a78
| |-ParmVarDecl 0x7fdeb8ac7eb8 <col:47, col:69> col:69 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fdeb8ac80b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fdeb8ac8210 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:498:5, col:34> col:14 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fdeb8ac8130 <col:21, col:31> col:31 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXConstructorDecl 0x7fdeb8ac8480 <line:500:5, col:61> col:14 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fdeb8ac82e0 <col:21, col:31> col:31 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fdeb8ac8350 <col:36, col:58> col:58 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-CXXConstructorDecl 0x7fdeb8ac8720 <line:502:5, col:46> col:5 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fdeb8ac8558 <col:12, col:22> col:22 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fdeb8ac85f0 <col:27, col:43> col:43 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXConstructorDecl 0x7fdeb8ac8a30 <line:503:5, col:73> col:5 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fdeb8ac87f8 <col:12, col:22> col:22 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fdeb8ac8868 <col:27, col:43> col:43 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ParmVarDecl 0x7fdeb8ac88d8 <col:48, col:70> col:70 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-FunctionTemplateDecl 0x7fdeb8ac94c8 <line:504:5, line:511:62> line:505:9 vector
| |-TemplateTypeParmDecl 0x7fdeb8ac8b00 <line:504:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7fdeb8ac9420 <line:505:9, line:511:62> line:505:9 vector 'void (_InputIterator, typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, _InputIterator>::type)'
|   |-ParmVarDecl 0x7fdeb8ac8b90 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x7fdeb8ac92f0 <line:506:16, line:511:56> col:56 __last 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, _InputIterator>::type'
|-FunctionTemplateDecl 0x7fdeb8aca038 <line:512:5, line:518:108> line:513:9 vector
| |-TemplateTypeParmDecl 0x7fdeb8ac95b0 <line:512:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7fdeb8ac9f90 <line:513:9, line:518:108> line:513:9 vector 'void (_InputIterator, _InputIterator, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &, typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value>::type *)'
|   |-ParmVarDecl 0x7fdeb8ac9640 <col:16, col:31> col:31 __first '_InputIterator'
|   |-ParmVarDecl 0x7fdeb8ac96b0 <col:40, col:55> col:55 __last '_InputIterator'
|   |-ParmVarDecl 0x7fdeb8ac9720 <col:63, col:85> col:85 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|   `-ParmVarDecl 0x7fdeb8ac9e30 <line:514:16, line:518:107> col:105 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value>::type *'
|-FunctionTemplateDecl 0x7fdeb8aca948 <line:519:5, line:525:64> line:520:9 vector
| |-TemplateTypeParmDecl 0x7fdeb8aca130 <line:519:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXConstructorDecl 0x7fdeb8aca8a0 <line:520:9, line:525:64> line:520:9 vector 'void (_ForwardIterator, typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, _ForwardIterator>::type)'
|   |-ParmVarDecl 0x7fdeb8aca1c0 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fdeb8aca770 <line:521:16, line:525:58> col:58 __last 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, _ForwardIterator>::type'
|-FunctionTemplateDecl 0x7fdeb8acb378 <line:526:5, line:531:110> line:527:9 vector
| |-TemplateTypeParmDecl 0x7fdeb8acaa30 <line:526:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXConstructorDecl 0x7fdeb8acb2d0 <line:527:9, line:531:110> line:527:9 vector 'void (_ForwardIterator, _ForwardIterator, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &, typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value>::type *)'
|   |-ParmVarDecl 0x7fdeb8acaac0 <col:16, col:33> col:33 __first '_ForwardIterator'
|   |-ParmVarDecl 0x7fdeb8acab30 <col:42, col:59> col:59 __last '_ForwardIterator'
|   |-ParmVarDecl 0x7fdeb8acaba0 <col:67, col:89> col:89 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|   `-ParmVarDecl 0x7fdeb8acb170 <line:528:16, line:531:109> col:107 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value>::type *'
|-CXXConstructorDecl 0x7fdeb8acb590 <line:541:5, col:29> col:5 vector 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &)'
| `-ParmVarDecl 0x7fdeb8acb4a8 <col:12, col:26> col:26 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
|-CXXConstructorDecl 0x7fdeb8acb800 <line:542:5, col:56> col:5 vector 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fdeb8acb660 <col:12, col:26> col:26 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x7fdeb8acb6d0 <col:31, col:53> col:53 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-CXXMethodDecl 0x7fdeb8acb9d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:544:40> col:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(const class std::__1::vector<int, class std::__1::allocator<int> > &)'
| |-ParmVarDecl 0x7fdeb8acb908 <col:23, col:37> col:37 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7fdeb8acba80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fdeb8acbd80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:548:45> col:5 vector 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7fdeb8acbc58 <col:12, col:41> col:41 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7fdeb8acbe40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fdeb8acc0c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:551:72> col:5 vector 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fdeb8acbf18 <col:12, col:41> col:41 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| |-ParmVarDecl 0x7fdeb8acbf88 <col:47, col:69> col:69 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fdeb8acc188 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fdeb8acc340 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:554:5 vector 'void (class std::__1::vector<int, class std::__1::allocator<int> > &&)' noexcept-uninstantiated 0x7fdeb89fcbc8
| |-ParmVarDecl 0x7fdeb8acc208 <col:12, col:21> col:21 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| `-AlwaysInlineAttr 0x7fdeb8acc448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fdeb8acc640 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:562:51> col:5 vector 'void (class std::__1::vector<int, class std::__1::allocator<int> > &&, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fdeb8acc4a0 <col:12, col:21> col:21 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| |-ParmVarDecl 0x7fdeb8acc510 <col:26, col:48> col:48 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fdeb8acc708 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8acc870 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:564:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(class std::__1::vector<int, class std::__1::allocator<int> > &&)' noexcept-uninstantiated 0x7fdeb89fd0e8
| |-ParmVarDecl 0x7fdeb8acc760 <col:23, col:32> col:32 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| `-AlwaysInlineAttr 0x7fdeb8acc968 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8accb40 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:569:57> line:568:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7fdeb8acca38 <col:23, col:52> col:52 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7fdeb8accbf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fdeb8acd4a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:573:5, line:583:61> col:9 assign
| |-TemplateTypeParmDecl 0x7fdeb8accc38 <line:573:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fdeb8acd410 <line:574:9, line:583:61> col:9 assign 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, void>::type (_InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x7fdeb8acd280 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x7fdeb8acd2f0 <col:40, col:55> col:55 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fdeb8acdcb8 <line:584:5, line:593:65> col:9 assign
| |-TemplateTypeParmDecl 0x7fdeb8acd590 <line:584:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fdeb8acdc20 <line:585:9, line:593:65> col:9 assign 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, void>::type (_ForwardIterator, _ForwardIterator)'
|   |-ParmVarDecl 0x7fdeb8acda90 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fdeb8acdb00 <col:42, col:59> col:59 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fdeb8acdeb0 <line:595:5, col:51> col:10 assign 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fdeb8acddb0 <col:17, col:27> col:27 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fdeb8acde20 <col:32, col:48> col:48 __u 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7fdeb8ace0c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:600:43> line:599:10 assign 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7fdeb8acdff8 <col:17, col:46> col:46 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7fdeb8ace170 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ace248 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:605:33> line:604:20 get_allocator 'std::__1::vector<int, class std::__1::allocator<int> >::allocator_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ace2f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ace3c8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:607:54 begin 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ace470 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ace548 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:608:54 begin 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ace5f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ace660 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:609:54 end 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ace708 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ace778 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:610:54 end 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ace820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ace918 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:614:47> line:613:28 rbegin 'std::__1::vector<int, class std::__1::allocator<int> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ace9c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8aceab8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:617:47> line:616:28 rbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8aceb60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8acebd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:620:49> line:619:28 rend 'std::__1::vector<int, class std::__1::allocator<int> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fdeb8acec78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8acece8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:623:49> line:622:28 rend 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8aced90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8acee00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:627:25> line:626:28 cbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8aceea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8acef18 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:630:23> line:629:28 cend 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8acefc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8acf030 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:633:26> line:632:28 crbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8acf0d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8acf148 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:636:24> line:635:28 crend 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8acf1f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8acf298 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:640:71> line:639:15 size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8acf340 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8acf3b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:643:36> line:642:15 capacity 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8acf458 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8acf4a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:646:48> line:645:10 empty '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8acf548 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8acf5b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:647:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:647:15 max_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
|-CXXMethodDecl 0x7fdeb8acf6f8 <line:648:5, col:31> col:10 reserve 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fdeb8acf670 <col:18, col:28> col:28 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fdeb8acf7a8 <line:649:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:649:10 shrink_to_fit 'void (void) noexcept'
|-CXXMethodDecl 0x7fdeb8acf980 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:651:71> col:47 operator[] 'std::__1::vector<int, class std::__1::allocator<int> >::reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| |-ParmVarDecl 0x7fdeb8acf880 <col:58, col:68> col:68 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fdeb8acfa30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8acfb90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:652:73> col:47 operator[] 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fdeb8acfa88 <col:58, col:68> col:68 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fdeb8acfc40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8acfd20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:653:5, col:37> col:21 at 'std::__1::vector<int, class std::__1::allocator<int> >::reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fdeb8acfc98 <col:24, col:34> col:34 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fdeb8acfe68 <line:654:5, col:39> col:21 at 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| `-ParmVarDecl 0x7fdeb8acfde0 <col:24, col:34> col:34 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fdeb8acffa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:660:5> line:656:47 front 'std::__1::vector<int, class std::__1::allocator<int> >::reference (void)'
| `-AlwaysInlineAttr 0x7fdeb8ad0048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad0110 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:665:5> line:661:47 front 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7fdeb8ad01b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad0220 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:670:5> line:666:47 back 'std::__1::vector<int, class std::__1::allocator<int> >::reference (void)'
| `-AlwaysInlineAttr 0x7fdeb8ad02c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad0330 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:675:5> line:671:47 back 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7fdeb8ad03d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad04a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:679:57> line:678:23 data 'std::__1::vector<int, class std::__1::allocator<int> >::value_type *(void) noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ad0550 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad0658 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:682:57> line:681:23 data 'const std::__1::vector<int, class std::__1::allocator<int> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ad0700 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad0860 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:684:65> col:36 push_back 'void (std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fdeb8ad0758 <col:46, col:62> col:62 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-AlwaysInlineAttr 0x7fdeb8ad0910 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad0ad0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:687:62> col:36 push_back 'void (std::__1::vector<int, class std::__1::allocator<int> >::value_type &&)'
| |-ParmVarDecl 0x7fdeb8ad09c8 <col:46, col:59> col:59 __x 'std::__1::vector<int, class std::__1::allocator<int> >::value_type &&'
| `-AlwaysInlineAttr 0x7fdeb8ad0b80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fdeb8ad0e38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:689:5, line:694:49> col:19 emplace_back
| |-TemplateTypeParmDecl 0x7fdeb8ad0bc8 <line:689:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x7fdeb8ad0da0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:694:49> col:19 emplace_back 'void (_Args &&...)'
|   |-ParmVarDecl 0x7fdeb8ad0cd8 <col:32, col:43> col:43 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7fdeb8ad0e90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fdeb8ad0f60 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:699:19> col:10 pop_back 'void (void)'
| `-AlwaysInlineAttr 0x7fdeb8ad1008 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fdeb8ad11e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:701:5, col:67> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fdeb8ad1060 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x7fdeb8ad10d0 <col:48, col:64> col:64 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7fdeb8ad1430 <line:704:5, col:64> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::value_type &&)'
| |-ParmVarDecl 0x7fdeb8ad12a8 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x7fdeb8ad1318 <col:48, col:61> col:61 __x 'std::__1::vector<int, class std::__1::allocator<int> >::value_type &&'
|-FunctionTemplateDecl 0x7fdeb8ad1818 <line:705:5, line:706:70> col:18 emplace
| |-TemplateTypeParmDecl 0x7fdeb8ad14e8 <line:705:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x7fdeb8ad1780 <line:706:9, col:70> col:18 emplace 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _Args &&...)'
|   |-ParmVarDecl 0x7fdeb8ad1580 <col:26, col:41> col:41 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   `-ParmVarDecl 0x7fdeb8ad1668 <col:53, col:64> col:64 __args '_Args &&...'
|-CXXMethodDecl 0x7fdeb8ad1b20 <line:709:5, col:82> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fdeb8ad1910 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| |-ParmVarDecl 0x7fdeb8ad1980 <col:48, col:58> col:58 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fdeb8ad19f0 <col:63, col:79> col:79 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-FunctionTemplateDecl 0x7fdeb8ad2598 <line:710:5, line:720:88> col:9 insert
| |-TemplateTypeParmDecl 0x7fdeb8ad1be0 <line:710:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fdeb8ad2500 <line:711:9, line:720:88> col:9 insert 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, iterator>::type (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x7fdeb8ad22e0 <col:16, col:31> col:31 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   |-ParmVarDecl 0x7fdeb8ad2350 <col:43, col:58> col:58 __first '_InputIterator'
|   `-ParmVarDecl 0x7fdeb8ad23c0 <col:67, col:82> col:82 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fdeb8ad2f08 <line:721:5, line:730:92> col:9 insert
| |-TemplateTypeParmDecl 0x7fdeb8ad2688 <line:721:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fdeb8ad2e70 <line:722:9, line:730:92> col:9 insert 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, iterator>::type (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _ForwardIterator, _ForwardIterator)'
|   |-ParmVarDecl 0x7fdeb8ad2c50 <col:16, col:31> col:31 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   |-ParmVarDecl 0x7fdeb8ad2cc0 <col:43, col:60> col:60 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fdeb8ad2d30 <col:69, col:86> col:86 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fdeb8ad3210 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:735:62> line:734:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7fdeb8ad3008 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| |-ParmVarDecl 0x7fdeb8ad30f8 <col:48, col:77> col:77 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7fdeb8ad32c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad3420 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:738:71> col:40 erase 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator)'
| |-ParmVarDecl 0x7fdeb8ad3320 <col:46, col:61> col:61 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-AlwaysInlineAttr 0x7fdeb8ad34d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad36b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:739:5, col:65> col:14 erase 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::const_iterator)'
| |-ParmVarDecl 0x7fdeb8ad3528 <col:20, col:35> col:35 __first 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x7fdeb8ad3598 <col:44, col:59> col:59 __last 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|-CXXMethodDecl 0x7fdeb8ad3768 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:748:5> line:742:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ad3810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad38f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:750:5, col:31> col:10 resize 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fdeb8ad3868 <col:17, col:27> col:27 __sz 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fdeb8ad3ab0 <line:751:5, col:52> col:10 resize 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fdeb8ad39b0 <col:17, col:27> col:27 __sz 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fdeb8ad3a20 <col:33, col:49> col:49 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7fdeb8ad3c88 <line:753:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:753:10 swap 'void (class std::__1::vector<int, class std::__1::allocator<int> > &) noexcept'
| `-ParmVarDecl 0x7fdeb8ad3b78 <col:15, col:21> col:22 'class std::__1::vector<int, class std::__1::allocator<int> > &'
|-CXXMethodDecl 0x7fdeb8ad3d38 <line:761:5, col:25> col:10 __invariants '_Bool (void) const'
|-AccessSpecDecl 0x7fdeb8ad3de0 <line:772:1, col:8> col:1 private
|-CXXMethodDecl 0x7fdeb8ad3e08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:773:63> col:36 __invalidate_all_iterators 'void (void)'
| `-AlwaysInlineAttr 0x7fdeb8ad3eb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad3fd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:774:82> col:36 __invalidate_iterators_past 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x7fdeb8ad3f08 <col:64, col:72> col:72 __new_last 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7fdeb8ad4080 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad4160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:775:5, col:32> col:10 allocate 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fdeb8ad40d8 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fdeb8ad4210 <line:776:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:776:10 deallocate 'void (void) noexcept'
|-CXXMethodDecl 0x7fdeb8ad4390 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:777:75> col:41 __recommend 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fdeb8ad42c8 <col:53, col:63> col:63 __new_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fdeb8ad4440 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad4520 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:778:5, col:42> col:10 __construct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fdeb8ad4498 <col:29, col:39> col:39 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fdeb8ad46e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:780:63> col:10 __construct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fdeb8ad45e0 <col:29, col:39> col:39 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fdeb8ad4650 <col:44, col:60> col:60 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-AlwaysInlineAttr 0x7fdeb8ad4798 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-FunctionTemplateDecl 0x7fdeb8ad4d18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:781:5, line:787:92> col:9 __construct_at_end
| |-TemplateTypeParmDecl 0x7fdeb8ad47e0 <line:781:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fdeb8ad4c80 <line:782:9, line:787:92> col:9 __construct_at_end 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value, void>::type (_ForwardIterator, _ForwardIterator, std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
|   |-ParmVarDecl 0x7fdeb8ad4a60 <col:28, col:45> col:45 __first '_ForwardIterator'
|   |-ParmVarDecl 0x7fdeb8ad4ad0 <col:54, col:71> col:71 __last '_ForwardIterator'
|   `-ParmVarDecl 0x7fdeb8ad4b40 <col:79, col:89> col:89 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fdeb8ad4ea0 <line:788:5, col:32> col:10 __append 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fdeb8ad4e18 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fdeb8ad5060 <line:789:5, col:53> col:10 __append 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fdeb8ad4f60 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fdeb8ad4fd0 <col:34, col:50> col:50 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7fdeb8ad5238 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:791:20 __make_iter 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x7fdeb8ad5128 <col:32, col:40> col:40 __p 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7fdeb8ad52e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad5448 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:793:20 __make_iter 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_pointer) const noexcept'
| |-ParmVarDecl 0x7fdeb8ad5340 <col:32, col:46> col:46 __p 'std::__1::vector<int, class std::__1::allocator<int> >::const_pointer':'const int *'
| `-AlwaysInlineAttr 0x7fdeb8ad54f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad58c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:794:5, col:85> col:10 __swap_out_circular_buffer 'void (__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &)'
| `-ParmVarDecl 0x7fdeb8ad57b8 <col:37, col:82> col:82 __v '__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &'
|-CXXMethodDecl 0x7fdeb8ad5bf0 <line:795:5, col:101> col:13 __swap_out_circular_buffer 'std::__1::vector<int, class std::__1::allocator<int> >::pointer (__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &, std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x7fdeb8ad5a68 <col:40, col:85> col:85 __v '__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &'
| `-ParmVarDecl 0x7fdeb8ad5ad8 <col:90, col:98> col:98 __p 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|-CXXMethodDecl 0x7fdeb8ad5ed0 <line:796:5, col:71> col:10 __move_range 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer, std::__1::vector<int, class std::__1::allocator<int> >::pointer, std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x7fdeb8ad5cb8 <col:23, col:31> col:31 __from_s 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| |-ParmVarDecl 0x7fdeb8ad5d28 <col:41, col:49> col:49 __from_e 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-ParmVarDecl 0x7fdeb8ad5d98 <col:59, col:67> col:67 __to 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|-CXXMethodDecl 0x7fdeb8ad6120 <line:797:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:797:10 __move_assign 'void (class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::true_type)' noexcept-uninstantiated 0x7fdeb8a06fd8
| |-ParmVarDecl 0x7fdeb8ad5fa0 <col:24, col:32> col:32 __c 'class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x7fdeb8ad6000 <col:37> col:46 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
|-CXXMethodDecl 0x7fdeb8ad63c0 <line:799:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:799:10 __move_assign 'void (class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::false_type)' noexcept-uninstantiated 0x7fdeb8a07218
| |-ParmVarDecl 0x7fdeb8ad6240 <col:24, col:32> col:32 __c 'class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x7fdeb8ad62a0 <col:37> col:47 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
|-CXXMethodDecl 0x7fdeb8ad65a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:808:5> line:802:10 __destruct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x7fdeb8ad64e0 <col:28, col:36> col:36 __new_last 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7fdeb8ad6658 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fdeb8ad68b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:811:5, col:62> col:31 __push_back_slow_path
| |-TemplateTypeParmDecl 0x7fdeb8ad66a0 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXMethodDecl 0x7fdeb8ad6820 <col:26, col:62> col:31 __push_back_slow_path 'void (_Up &&)'
|   `-ParmVarDecl 0x7fdeb8ad6758 <col:53, col:59> col:59 __x '_Up &&'
|-FunctionTemplateDecl 0x7fdeb8ad6c08 <line:813:5, line:814:52> col:10 __emplace_back_slow_path
| |-TemplateTypeParmDecl 0x7fdeb8ad6998 <line:813:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x7fdeb8ad6b70 <line:814:5, col:52> col:10 __emplace_back_slow_path 'void (_Args &&...)'
|   `-ParmVarDecl 0x7fdeb8ad6aa8 <col:35, col:46> col:46 __args '_Args &&...'
|-CXXMethodDecl 0x7fdeb8ad6ea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:835:62> line:834:10 __annotate_contiguous_container 'void (const void *, const void *, const void *, const void *) const'
| |-ParmVarDecl 0x7fdeb8ad6ce8 <col:42, col:52> col:53 'const void *'
| |-ParmVarDecl 0x7fdeb8ad6d48 <col:55, col:65> col:66 'const void *'
| |-ParmVarDecl 0x7fdeb8ad6da8 <col:68, col:78> col:79 'const void *'
| |-ParmVarDecl 0x7fdeb8ad6e08 <line:835:42, col:52> col:53 'const void *'
| `-AlwaysInlineAttr 0x7fdeb8ad6f70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad70d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:841:5> line:838:10 __annotate_new 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fdeb8ad6fc8 <col:25, col:35> col:35 __current_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fdeb8ad7180 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad71c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:847:5> line:844:10 __annotate_delete 'void (void) const'
| `-AlwaysInlineAttr 0x7fdeb8ad7270 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad7350 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:854:5> line:850:10 __annotate_increase 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fdeb8ad72c8 <col:30, col:40> col:40 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fdeb8ad7400 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ad74e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:861:5> line:857:10 __annotate_shrink 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fdeb8ad7458 <col:28, col:38> col:38 __old_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fdeb8ad7590 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXRecordDecl 0x7fdeb8ad75d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:880:5, col:12> col:12 struct __RAII_IncreaseAnnotator
`-CXXDestructorDecl 0x7fdeb8ad76c0 <line:454:28> col:28 implicit used ~vector 'void (void) noexcept' inline default
  `-CompoundStmt 0x7fdeb8ada058 <col:28>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::vector" = type { %"class.std::__1::__vector_base" }
  NonVirtualBaseLLVMType:%"class.std::__1::vector" = type { %"class.std::__1::__vector_base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__atomic_base<_Bool, false>
         0 |   _Atomic(_Bool) __a_
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::atomic<_Bool>
         0 |   struct std::__1::__atomic_base<_Bool, false> (base)
         0 |     _Atomic(_Bool) __a_
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fdeb8adbcf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:890:1, line:993:1> line:891:8 struct __atomic_base definition
|-TemplateArgument type '_Bool'
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7fdeb8adbf30 prev 0x7fdeb8adbcf8 <col:1, col:8> col:8 implicit struct __atomic_base
|-FieldDecl 0x7fdeb8adc010 <line:893:5, col:26> col:26 __a_ '_Atomic(_Bool)' mutable
|-CXXMethodDecl 0x7fdeb8adc058 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:907:5> line:900:10 is_lock_free '_Bool (void) const volatile noexcept'
| `-AlwaysInlineAttr 0x7fdeb8adc128 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8adc170 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:910:82> line:909:10 is_lock_free '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8adc218 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8adc3e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:914:46> line:912:10 store 'void (_Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fdeb8adc270 <col:16, col:20> col:20 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fdeb8adc2d0 <col:25, col:44> col:38 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fdeb8adc4a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fdeb8add480 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fdeb8adc3e8 'store' 'void (_Bool, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7fdeb8add458 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:913:40, line:566:35> '_Bool' '||'
|     |-BinaryOperator 0x7fdeb8adcf18 <line:913:40, line:565:35> '_Bool' '||'
|     | |-BinaryOperator 0x7fdeb8adc9d8 <line:913:40, line:564:35> '_Bool' '=='
|     | | |-ImplicitCastExpr 0x7fdeb8adc9a8 <line:913:40> 'int' <IntegralCast>
|     | | | `-ImplicitCastExpr 0x7fdeb8adc990 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | | |   `-DeclRefExpr 0x7fdeb8adc4e8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fdeb8adc2d0 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | | `-ImplicitCastExpr 0x7fdeb8adc9c0 <line:564:35> 'int' <IntegralCast>
|     | |   `-DeclRefExpr 0x7fdeb9130cd8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fdeb9127138 'memory_order_consume' 'enum std::__1::memory_order'
|     | `-BinaryOperator 0x7fdeb8adcef0 <line:913:40, line:565:35> '_Bool' '=='
|     |   |-ImplicitCastExpr 0x7fdeb8adcec0 <line:913:40> 'int' <IntegralCast>
|     |   | `-ImplicitCastExpr 0x7fdeb8adcea8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     |   |   `-DeclRefExpr 0x7fdeb8adca00 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fdeb8adc2d0 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     |   `-ImplicitCastExpr 0x7fdeb8adced8 <line:565:35> 'int' <IntegralCast>
|     |     `-DeclRefExpr 0x7fdeb9130d98 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fdeb9127180 'memory_order_acquire' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fdeb8add430 <line:913:40, line:566:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fdeb8add400 <line:913:40> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fdeb8add3e8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fdeb8adcf40 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fdeb8adc2d0 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fdeb8add418 <line:566:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fdeb9130e80 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fdeb9127210 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fdeb8add678 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:918:46> line:916:10 store 'void (_Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fdeb8add500 <col:16, col:20> col:20 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fdeb8add560 <col:25, col:44> col:38 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fdeb8add730 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fdeb8ade710 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fdeb8add678 'store' 'void (_Bool, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7fdeb8ade6e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:917:40, line:566:35> '_Bool' '||'
|     |-BinaryOperator 0x7fdeb8ade1a8 <line:917:40, line:565:35> '_Bool' '||'
|     | |-BinaryOperator 0x7fdeb8addc68 <line:917:40, line:564:35> '_Bool' '=='
|     | | |-ImplicitCastExpr 0x7fdeb8addc38 <line:917:40> 'int' <IntegralCast>
|     | | | `-ImplicitCastExpr 0x7fdeb8addc20 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | | |   `-DeclRefExpr 0x7fdeb8add778 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fdeb8add560 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | | `-ImplicitCastExpr 0x7fdeb8addc50 <line:564:35> 'int' <IntegralCast>
|     | |   `-DeclRefExpr 0x7fdeb91310e0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fdeb9127138 'memory_order_consume' 'enum std::__1::memory_order'
|     | `-BinaryOperator 0x7fdeb8ade180 <line:917:40, line:565:35> '_Bool' '=='
|     |   |-ImplicitCastExpr 0x7fdeb8ade150 <line:917:40> 'int' <IntegralCast>
|     |   | `-ImplicitCastExpr 0x7fdeb8ade138 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     |   |   `-DeclRefExpr 0x7fdeb8addc90 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fdeb8add560 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     |   `-ImplicitCastExpr 0x7fdeb8ade168 <line:565:35> 'int' <IntegralCast>
|     |     `-DeclRefExpr 0x7fdeb91311a0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fdeb9127180 'memory_order_acquire' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fdeb8ade6c0 <line:917:40, line:566:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fdeb8ade690 <line:917:40> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fdeb8ade678 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fdeb8ade1d0 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fdeb8add560 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fdeb8ade6a8 <line:566:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fdeb9131288 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fdeb9127210 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fdeb8ade888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:922:47> line:920:9 load '_Bool (std::__1::memory_order) const volatile noexcept'
| |-ParmVarDecl 0x7fdeb8ade780 <col:14, col:33> col:27 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fdeb8ade938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fdeb8adf3d8 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fdeb8ade888 'load' '_Bool (std::__1::memory_order) const volatile noexcept'
|   `-BinaryOperator 0x7fdeb8adf3b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:921:39, line:571:35> '_Bool' '||'
|     |-BinaryOperator 0x7fdeb8adee70 <line:921:39, line:570:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fdeb8adee40 <line:921:39> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fdeb8adee28 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fdeb8ade980 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fdeb8ade780 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fdeb8adee58 <line:570:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fdeb9131470 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fdeb91271c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fdeb8adf388 <line:921:39, line:571:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fdeb8adf358 <line:921:39> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fdeb8adf340 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fdeb8adee98 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fdeb8ade780 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fdeb8adf370 <line:571:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fdeb9131530 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fdeb9127210 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fdeb8adf558 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:926:47> line:924:9 load '_Bool (std::__1::memory_order) const noexcept'
| |-ParmVarDecl 0x7fdeb8adf448 <col:14, col:33> col:27 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fdeb8adf608 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fdeb8ae00a8 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fdeb8adf558 'load' '_Bool (std::__1::memory_order) const noexcept'
|   `-BinaryOperator 0x7fdeb8ae0080 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:925:39, line:571:35> '_Bool' '||'
|     |-BinaryOperator 0x7fdeb8adfb40 <line:925:39, line:570:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fdeb8adfb10 <line:925:39> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fdeb8adfaf8 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fdeb8adf650 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fdeb8adf448 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fdeb8adfb28 <line:570:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fdeb9131718 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fdeb91271c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fdeb8ae0058 <line:925:39, line:571:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fdeb8ae0028 <line:925:39> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fdeb8ae0010 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fdeb8adfb68 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fdeb8adf448 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fdeb8ae0040 <line:571:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fdeb91317d8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fdeb9127210 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXConversionDecl 0x7fdeb8ae0188 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:928:60> col:5 operator bool '_Bool (void) const volatile noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ae0230 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConversionDecl 0x7fdeb8ae02e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:930:60> col:5 operator bool '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8ae0390 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ae0578 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:933:56> line:932:9 exchange '_Bool (_Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fdeb8ae03f8 <col:18, col:22> col:22 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fdeb8ae0458 <col:27, col:46> col:40 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fdeb8ae0630 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ae0808 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:936:56> line:935:9 exchange '_Bool (_Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fdeb8ae0688 <col:18, col:22> col:22 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fdeb8ae06e8 <col:27, col:46> col:40 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fdeb8ae08c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ae0bc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:941:80> line:938:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fdeb8ae0948 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7fdeb8ae09b8 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fdeb8ae0a18 <line:939:32, col:45> col:45 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fdeb8ae0a78 <col:50, col:63> col:63 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fdeb8ae0c90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fdeb8ae1730 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fdeb8ae0bc8 'compare_exchange_weak' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7fdeb8ae1708 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:940:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fdeb8ae11c8 <line:940:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fdeb8ae1198 <line:940:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fdeb8ae1180 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fdeb8ae0cd8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fdeb8ae0a78 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fdeb8ae11b0 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fdeb91389c0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fdeb91271c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fdeb8ae16e0 <line:940:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fdeb8ae16b0 <line:940:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fdeb8ae1698 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fdeb8ae11f0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fdeb8ae0a78 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fdeb8ae16c8 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fdeb9138a80 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fdeb9127210 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fdeb8ae1a28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:946:80> line:943:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fdeb8ae17b0 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7fdeb8ae1820 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fdeb8ae1880 <line:944:32, col:45> col:45 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fdeb8ae18e0 <col:50, col:63> col:63 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fdeb8ae1af0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fdeb8ae2590 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fdeb8ae1a28 'compare_exchange_weak' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7fdeb8ae2568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:945:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fdeb8ae2028 <line:945:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fdeb8ae1ff8 <line:945:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fdeb8ae1fe0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fdeb8ae1b38 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fdeb8ae18e0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fdeb8ae2010 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fdeb9138c68 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fdeb91271c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fdeb8ae2540 <line:945:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fdeb8ae2510 <line:945:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fdeb8ae24f8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fdeb8ae2050 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fdeb8ae18e0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fdeb8ae2528 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fdeb9138d28 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fdeb9127210 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fdeb8ae27e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:951:82> line:948:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fdeb8ae2610 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7fdeb8ae2680 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fdeb8ae26e0 <line:949:34, col:47> col:47 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fdeb8ae2740 <col:52, col:65> col:65 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fdeb8ae28b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fdeb8ae3350 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fdeb8ae27e8 'compare_exchange_strong' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7fdeb8ae3328 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:950:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fdeb8ae2de8 <line:950:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fdeb8ae2db8 <line:950:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fdeb8ae2da0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fdeb8ae28f8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fdeb8ae2740 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fdeb8ae2dd0 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fdeb9138f10 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fdeb91271c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fdeb8ae3300 <line:950:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fdeb8ae32d0 <line:950:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fdeb8ae32b8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fdeb8ae2e10 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fdeb8ae2740 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fdeb8ae32e8 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fdeb9138fd0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fdeb9127210 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fdeb8ae35a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:956:82> line:953:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fdeb8ae33d0 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7fdeb8ae3440 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fdeb8ae34a0 <line:954:34, col:47> col:47 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fdeb8ae3500 <col:52, col:65> col:65 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fdeb8ae3670 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fdeb8ae4110 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fdeb8ae35a8 'compare_exchange_strong' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7fdeb8ae40e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:955:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fdeb8ae3ba8 <line:955:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fdeb8ae3b78 <line:955:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fdeb8ae3b60 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fdeb8ae36b8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fdeb8ae3500 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fdeb8ae3b90 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fdeb91391b8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fdeb91271c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fdeb8ae40c0 <line:955:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fdeb8ae4090 <line:955:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fdeb8ae4078 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fdeb8ae3bd0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fdeb8ae3500 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fdeb8ae40a8 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fdeb9139278 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fdeb9127210 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fdeb8ae4398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:960:80> line:958:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fdeb8ae4190 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7fdeb8ae4200 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fdeb8ae4260 <line:959:31, col:50> col:44 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fdeb8ae4458 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ae46b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:964:80> line:962:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fdeb8ae44b0 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7fdeb8ae4520 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fdeb8ae4580 <line:963:32, col:51> col:45 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fdeb8ae4778 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ae4940 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:968:82> line:966:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fdeb8ae47d0 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7fdeb8ae4840 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fdeb8ae48a0 <line:967:31, col:50> col:44 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fdeb8ae4a00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ae4bc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:972:82> line:970:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fdeb8ae4a58 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7fdeb8ae4ac8 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fdeb8ae4b28 <line:971:34, col:53> col:47 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fdeb8ae4c88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fdeb8ae4d10 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:976:39> col:5 __atomic_base 'void (void) noexcept' default trivial
| `-AlwaysInlineAttr 0x7fdeb8ae4dc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fdeb8ae4f08 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:982:69> col:23 used constexpr __atomic_base 'void (_Bool) noexcept'
| |-ParmVarDecl 0x7fdeb8ae4e20 <col:37, col:41> col:41 used __d '_Bool':'_Bool'
| |-CXXCtorInitializer Field 0x7fdeb8adc010 '__a_' '_Atomic(_Bool)'
| | `-ImplicitCastExpr 0x7fdeb8ae6a28 <col:63> '_Atomic(_Bool)' <NonAtomicToAtomic>
| |   `-ImplicitCastExpr 0x7fdeb8ae6a10 <col:63> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7fdeb8ae69b8 <col:63> '_Bool':'_Bool' lvalue ParmVar 0x7fdeb8ae4e20 '__d' '_Bool':'_Bool'
| |-CompoundStmt 0x7fdeb91327d8 <col:68, col:69>
| `-AlwaysInlineAttr 0x7fdeb8ae4fc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fdeb8ae5130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:984:5, col:48> col:5 __atomic_base 'void (const struct std::__1::__atomic_base<_Bool, false> &)' delete trivial
| `-ParmVarDecl 0x7fdeb8ae5048 <col:19, col:38> col:39 'const struct std::__1::__atomic_base<_Bool, false> &'
|-CXXMethodDecl 0x7fdeb8ae52f0 <line:985:5, col:59> col:20 operator= 'struct std::__1::__atomic_base<_Bool, false> &(const struct std::__1::__atomic_base<_Bool, false> &)' delete trivial
| `-ParmVarDecl 0x7fdeb8ae5228 <col:30, col:49> col:50 'const struct std::__1::__atomic_base<_Bool, false> &'
|-CXXMethodDecl 0x7fdeb8ae5470 <line:986:5, col:68> col:20 operator= 'struct std::__1::__atomic_base<_Bool, false> &(const struct std::__1::__atomic_base<_Bool, false> &) volatile' delete trivial
| `-ParmVarDecl 0x7fdeb8ae53b0 <col:30, col:49> col:50 'const struct std::__1::__atomic_base<_Bool, false> &'
`-CXXDestructorDecl 0x7fdeb8ae6838 <line:891:8> col:8 implicit ~__atomic_base 'void (void)' inline default trivial noexcept-unevaluated 0x7fdeb8ae6838

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__atomic_base" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__atomic_base" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fdeb914daa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1083:1, line:1099:1> line:1084:8 struct atomic definition
|-public '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>'
|-TemplateArgument type '_Bool'
|-CXXRecordDecl 0x7fdeb8ae55a8 prev 0x7fdeb914daa8 <col:1, col:8> col:8 implicit struct atomic
|-TypedefDecl 0x7fdeb8ae5948 <line:1087:5, col:32> col:32 __base '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>'
| `-TemplateSpecializationType 0x7fdeb8ae58d0 '__atomic_base<_Bool>' sugar __atomic_base
|   |-TemplateArgument type '_Bool':'_Bool'
|   `-RecordType 0x7fdeb8adbe00 'struct std::__1::__atomic_base<_Bool, false>'
|     `-ClassTemplateSpecialization 0x7fdeb8adbcf8 '__atomic_base'
|-CXXConstructorDecl 0x7fdeb8ae59e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:818:33> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1089:5 atomic 'void (void)' default trivial noexcept-unevaluated 0x7fdeb8ae59e0
| `-AlwaysInlineAttr 0x7fdeb8ae5ac8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fdeb8ae5c08 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1091:64> col:23 used constexpr atomic 'void (_Bool) noexcept'
| |-ParmVarDecl 0x7fdeb8ae5b20 <col:30, col:34> col:34 used __d '_Bool':'_Bool'
| |-CXXCtorInitializer 'std::__1::atomic<_Bool>::__base':'struct std::__1::__atomic_base<_Bool, false>'
| | `-CXXConstructExpr 0x7fdeb8ae6a70 <col:51, col:61> '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>' 'void (_Bool) noexcept'
| |   `-ImplicitCastExpr 0x7fdeb8ae69a0 <col:58> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7fdeb8ae6918 <col:58> '_Bool':'_Bool' lvalue ParmVar 0x7fdeb8ae5b20 '__d' '_Bool':'_Bool'
| |-CompoundStmt 0x7fdeb909af00 <col:63, col:64>
| `-AlwaysInlineAttr 0x7fdeb8ae5cc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ae5e28 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1095:41> line:1094:9 operator= '_Bool (_Bool) volatile noexcept'
| |-ParmVarDecl 0x7fdeb8ae5d20 <col:19, col:23> col:23 __d '_Bool':'_Bool'
| `-AlwaysInlineAttr 0x7fdeb8ae5ed8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8ae6038 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1098:41> line:1097:9 operator= '_Bool (_Bool) noexcept'
| |-ParmVarDecl 0x7fdeb8ae5f30 <col:19, col:23> col:23 __d '_Bool':'_Bool'
| `-AlwaysInlineAttr 0x7fdeb8ae60e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fdeb8ae6158 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1084:8> col:8 implicit atomic 'void (const struct std::__1::atomic<_Bool> &)' inline default_delete trivial noexcept-unevaluated 0x7fdeb8ae6158
| `-ParmVarDecl 0x7fdeb8ae6280 <col:8> col:8 'const struct std::__1::atomic<_Bool> &'
|-CXXConstructorDecl 0x7fdeb8ae6318 <col:8> col:8 implicit atomic 'void (struct std::__1::atomic<_Bool> &&)' inline default_delete trivial noexcept-unevaluated 0x7fdeb8ae6318
| `-ParmVarDecl 0x7fdeb8ae6440 <col:8> col:8 'struct std::__1::atomic<_Bool> &&'
|-CXXMethodDecl 0x7fdeb8ae64d8 <col:8, <invalid sloc>> col:8 implicit operator= 'struct std::__1::atomic<_Bool> &(const struct std::__1::atomic<_Bool> &)' inline default_delete trivial noexcept-unevaluated 0x7fdeb8ae64d8
| `-ParmVarDecl 0x7fdeb8ae65f0 <col:8> col:8 'const struct std::__1::atomic<_Bool> &'
`-CXXMethodDecl 0x7fdeb8ae6658 <col:8, <invalid sloc>> col:8 implicit operator= 'struct std::__1::atomic<_Bool> &(struct std::__1::atomic<_Bool> &&)' inline default_delete trivial noexcept-unevaluated 0x7fdeb8ae6658
  `-ParmVarDecl 0x7fdeb8ae6770 <col:8> col:8 'struct std::__1::atomic<_Bool> &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::atomic" = type { %"struct.std::__1::__atomic_base" }
  NonVirtualBaseLLVMType:%"struct.std::__1::atomic" = type { %"struct.std::__1::__atomic_base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::thread
         0 |   std::__1::__libcpp_thread_t __t_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_t
         0 |   long __sig
         8 |   struct __darwin_pthread_handler_rec * __cleanup_stack
        16 |   char [8176] __opaque
           | [sizeof=8192, dsize=8192, align=8,
           |  nvsize=8192, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __darwin_pthread_handler_rec
         0 |   void (*)(void *) __routine
         8 |   void * __arg
        16 |   struct __darwin_pthread_handler_rec * __next
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fdeb78c6960 </usr/include/sys/_pthread/_pthread_types.h:57:1, line:61:1> line:57:8 struct __darwin_pthread_handler_rec definition
|-CXXRecordDecl 0x7fdeb78c6a88 <col:1, col:8> col:8 implicit struct __darwin_pthread_handler_rec
|-FieldDecl 0x7fdeb78c6cd0 <line:58:2, col:26> col:9 __routine 'void (*)(void *)'
|-FieldDecl 0x7fdeb78c6d30 <line:59:2, col:8> col:8 __arg 'void *'
`-FieldDecl 0x7fdeb78c6e00 <line:60:2, col:39> col:39 __next 'struct __darwin_pthread_handler_rec *'

Layout: <CGRecordLayout
  LLVMType:%struct.__darwin_pthread_handler_rec = type { void (i8*)*, i8*, %struct.__darwin_pthread_handler_rec* }
  NonVirtualBaseLLVMType:%struct.__darwin_pthread_handler_rec = type { void (i8*)*, i8*, %struct.__darwin_pthread_handler_rec* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fdeb78cbe60 </usr/include/sys/_pthread/_pthread_types.h:103:1, line:107:1> line:103:8 struct _opaque_pthread_t definition
|-CXXRecordDecl 0x7fdeb78cbf88 <col:1, col:8> col:8 implicit struct _opaque_pthread_t
|-FieldDecl 0x7fdeb78cc038 <line:104:2, col:7> col:7 __sig 'long'
|-FieldDecl 0x7fdeb78cc0a8 <line:105:2, col:40> col:40 __cleanup_stack 'struct __darwin_pthread_handler_rec *'
`-FieldDecl 0x7fdeb78cc168 <line:106:2, col:32> col:7 __opaque 'char [8176]'

Layout: <CGRecordLayout
  LLVMType:%struct._opaque_pthread_t = type { i64, %struct.__darwin_pthread_handler_rec*, [8176 x i8] }
  NonVirtualBaseLLVMType:%struct._opaque_pthread_t = type { i64, %struct.__darwin_pthread_handler_rec*, [8176 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fdeba832458 prev 0x7fdeba82a3f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:285:1, line:333:1> line:285:24 referenced class thread definition
|-VisibilityAttr 0x7fdeba832558 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fdeba8325a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:285:1, col:24> col:24 implicit referenced class thread
|-FieldDecl 0x7fdeba832648 <line:287:5, col:23> col:23 referenced __t_ 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
|-CXXConstructorDecl 0x7fdeba8327e0 <line:289:5, col:25> col:5 thread 'void (const class std::__1::thread &)'
| `-ParmVarDecl 0x7fdeba8326c8 <col:12, col:24> col:25 'const class std::__1::thread &'
|-CXXMethodDecl 0x7fdeba832990 <line:290:5, col:36> col:13 operator= 'class std::__1::thread &(const class std::__1::thread &)'
| `-ParmVarDecl 0x7fdeba8328a0 <col:23, col:35> col:36 'const class std::__1::thread &'
|-AccessSpecDecl 0x7fdeba832a30 <line:291:1, col:7> col:1 public
|-TypedefDecl 0x7fdeba832a68 <line:292:5, col:25> col:25 referenced id 'class std::__1::__thread_id'
| `-RecordType 0x7fdeba828030 'class std::__1::__thread_id'
|   `-CXXRecord 0x7fdeba8284c8 '__thread_id'
|-TypedefDecl 0x7fdeba832ad0 <line:293:5, col:31> col:31 referenced native_handle_type 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| `-TypedefType 0x7fdeba0c73b0 'std::__1::__libcpp_thread_t' sugar
|   |-Typedef 0x7fdeba0c4c80 '__libcpp_thread_t'
|   `-TypedefType 0x7fdeba087770 'pthread_t' sugar
|     |-Typedef 0x7fdeba085db0 'pthread_t'
|     `-TypedefType 0x7fdeba085d80 '__darwin_pthread_t' sugar
|       |-Typedef 0x7fdeb78cd880 '__darwin_pthread_t'
|       `-PointerType 0x7fdeb78cd830 'struct _opaque_pthread_t *'
|         `-ElaboratedType 0x7fdeb78cc7c0 'struct _opaque_pthread_t' sugar
|           `-RecordType 0x7fdeb78cbf00 'struct _opaque_pthread_t'
|             `-CXXRecord 0x7fdeb78cbe60 '_opaque_pthread_t'
|-CXXConstructorDecl 0x7fdeba832b80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:296:53> col:5 thread 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7fdeba832648 '__t_' 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| | `-ImplicitCastExpr 0x7fdeba834608 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__threading_support:73:29> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <NullToPointer>
| |   `-IntegerLiteral 0x7fdeba8345b8 <col:29> 'unsigned int' 0
| |-CompoundStmt 0x7fdeba834650 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:296:52, col:53>
| |-AlwaysInlineAttr 0x7fdeba832c28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fdeba832c70 <col:51, col:74> Hidden
|-FunctionTemplateDecl 0x7fdeba833598 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:298:5, line:305:53> col:18 thread
| |-TemplateTypeParmDecl 0x7fdeba832c80 <line:298:15, col:21> col:21 referenced class depth 0 index 0 _Fp
| |-TemplateTypeParmDecl 0x7fdeba832ce8 <col:26, col:35> col:35 referenced class depth 0 index 1 ... _Args
| |-TemplateTypeParmDecl 0x7fdeba833200 <line:299:15, line:302:18> line:299:15 class depth 0 index 2
| | `-TemplateArgument type 'typename enable_if<!is_same<typename decay<_Fp>::type, class thread>::value>::type'
| |-CXXConstructorDecl 0x7fdeba8334f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:305:53> col:18 thread 'void (_Fp &&, _Args &&...)' inline
| | |-ParmVarDecl 0x7fdeba8332f8 <col:25, col:31> col:31 __f '_Fp &&'
| | |-ParmVarDecl 0x7fdeba8333d8 <col:36, col:47> col:47 __args '_Args &&...'
| | `-VisibilityAttr 0x7fdeba8335f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:644:40, col:63> Hidden
| `-CXXConstructorDecl 0x7fdeb8af5710 parent 0x7fdeba832458 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:359:1, line:373:1> line:359:9 used thread 'void (void (&&)(void))'
|   |-TemplateArgument type 'void (&)(void)'
|   |-TemplateArgument pack
|   |-TemplateArgument type 'void'
|   `-ParmVarDecl 0x7fdeb8af5608 <col:16, col:19> col:22 __f 'void (&&)(void)'
|-CXXDestructorDecl 0x7fdeba833690 <line:311:5, col:13> col:5 used ~thread 'void (void) noexcept'
|-CXXConstructorDecl 0x7fdeba8338a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:315:85> col:5 thread 'void (class std::__1::thread &&) noexcept'
| |-ParmVarDecl 0x7fdeba833798 <col:12, col:21> col:21 used __t 'class std::__1::thread &&'
| |-CXXCtorInitializer Field 0x7fdeba832648 '__t_' 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| | `-ImplicitCastExpr 0x7fdeba8346f8 <col:43, col:47> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <LValueToRValue>
| |   `-MemberExpr 0x7fdeba834690 <col:43, col:47> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue .__t_ 0x7fdeba832648
| |     `-DeclRefExpr 0x7fdeba834668 <col:43> 'class std::__1::thread' lvalue ParmVar 0x7fdeba833798 '__t' 'class std::__1::thread &&'
| |-CompoundStmt 0x7fdeba834800 <col:53, col:85>
| | `-BinaryOperator 0x7fdeba8347d8 <col:54, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__threading_support:73:29> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue '='
| |   |-MemberExpr 0x7fdeba834768 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:315:54, col:58> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue .__t_ 0x7fdeba832648
| |   | `-DeclRefExpr 0x7fdeba834740 <col:54> 'class std::__1::thread' lvalue ParmVar 0x7fdeba833798 '__t' 'class std::__1::thread &&'
| |   `-ImplicitCastExpr 0x7fdeba8347c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__threading_support:73:29> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <NullToPointer>
| |     `-IntegerLiteral 0x7fdeba8347a0 <col:29> 'unsigned int' 0
| |-AlwaysInlineAttr 0x7fdeba833958 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fdeba8339a0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fdeba833af8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:317:13 operator= 'class std::__1::thread &(class std::__1::thread &&) noexcept'
| |-ParmVarDecl 0x7fdeba8339f0 <col:23, col:32> col:32 __t 'class std::__1::thread &&'
| |-AlwaysInlineAttr 0x7fdeba833b98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fdeba833be0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fdeba833d38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:67> col:10 used swap 'void (class std::__1::thread &) noexcept'
| |-ParmVarDecl 0x7fdeba833c30 <col:15, col:23> col:23 used __t 'class std::__1::thread &'
| |-CompoundStmt 0x7fdeba8434f8 <col:38, col:67>
| | `-CallExpr 0x7fdeba8434c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:65> 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type':'void'
| |   |-ImplicitCastExpr 0x7fdeba8434a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:46> 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type (*)(struct _opaque_pthread_t *&, struct _opaque_pthread_t *&) noexcept(is_nothrow_move_constructible<struct _opaque_pthread_t *>::value && is_nothrow_move_assignable<struct _opaque_pthread_t *>::value)' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7fdeba843408 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:46> 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type (struct _opaque_pthread_t *&, struct _opaque_pthread_t *&) noexcept(is_nothrow_move_constructible<struct _opaque_pthread_t *>::value && is_nothrow_move_assignable<struct _opaque_pthread_t *>::value)' lvalue Function 0x7fdeba83fc10 'swap' 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type (struct _opaque_pthread_t *&, struct _opaque_pthread_t *&) noexcept(is_nothrow_move_constructible<struct _opaque_pthread_t *>::value && is_nothrow_move_assignable<struct _opaque_pthread_t *>::value)' (FunctionTemplate 0x7fdeb9115eb8 'swap')
| |   |-MemberExpr 0x7fdeba834940 <col:51> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue ->__t_ 0x7fdeba832648
| |   | `-CXXThisExpr 0x7fdeba834928 <col:51> 'class std::__1::thread *' this
| |   `-MemberExpr 0x7fdeba8349a0 <col:57, col:61> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue .__t_ 0x7fdeba832648
| |     `-DeclRefExpr 0x7fdeba834978 <col:57> 'class std::__1::thread' lvalue ParmVar 0x7fdeba833c30 '__t' 'class std::__1::thread &'
| |-AlwaysInlineAttr 0x7fdeba833dd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fdeba833e20 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fdeba833eb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:324:76> col:10 joinable '_Bool (void) const noexcept'
| |-CompoundStmt 0x7fdeba8436e8 <col:37, col:76>
| | `-ReturnStmt 0x7fdeba8436d0 <col:38, col:74>
| |   `-UnaryOperator 0x7fdeba8436b0 <col:45, col:74> '_Bool' prefix '!'
| |     `-CallExpr 0x7fdeba843680 <col:46, col:74> '_Bool'
| |       |-ImplicitCastExpr 0x7fdeba843668 <col:46> '_Bool (*)(const std::__1::__libcpp_thread_t *)' <FunctionToPointerDecay>
| |       | `-DeclRefExpr 0x7fdeba8435e0 <col:46> '_Bool (const std::__1::__libcpp_thread_t *)' lvalue Function 0x7fdeba0cdad0 '__libcpp_thread_isnull' '_Bool (const std::__1::__libcpp_thread_t *)'
| |       `-UnaryOperator 0x7fdeba8435c0 <col:69, col:70> 'const std::__1::__libcpp_thread_t *' prefix '&'
| |         `-MemberExpr 0x7fdeba843588 <col:70> 'const std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *const' lvalue ->__t_ 0x7fdeba832648
| |           `-CXXThisExpr 0x7fdeba843570 <col:70> 'const class std::__1::thread *' this
| |-AlwaysInlineAttr 0x7fdeba833f48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fdeba833f90 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fdeba833fc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:325:5, col:15> col:10 used join 'void (void)'
|-CXXMethodDecl 0x7fdeba834078 <line:326:5, col:17> col:10 detach 'void (void)'
|-CXXMethodDecl 0x7fdeba8341e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:328:71> col:8 get_id 'std::__1::thread::id (void) const noexcept'
| |-CompoundStmt 0x7fdeba843970 <col:33, col:71>
| | `-ReturnStmt 0x7fdeba843958 <col:34, col:69>
| |   `-ExprWithCleanups 0x7fdeba843940 <col:34, col:69> 'std::__1::thread::id':'class std::__1::__thread_id'
| |     `-CXXConstructExpr 0x7fdeba843908 <col:34, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' 'void (class std::__1::__thread_id &&) noexcept' elidable
| |       `-MaterializeTemporaryExpr 0x7fdeba8438f0 <col:41, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' xvalue
| |         `-ImplicitCastExpr 0x7fdeba8438d8 <col:41, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' <ConstructorConversion>
| |           `-CXXConstructExpr 0x7fdeba8438a0 <col:41, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' 'void (std::__1::__libcpp_thread_id)'
| |             `-CallExpr 0x7fdeba843870 <col:41, col:69> 'std::__1::__libcpp_thread_id':'struct _opaque_pthread_t *'
| |               |-ImplicitCastExpr 0x7fdeba843858 <col:41> 'std::__1::__libcpp_thread_id (*)(const std::__1::__libcpp_thread_t *)' <FunctionToPointerDecay>
| |               | `-DeclRefExpr 0x7fdeba8437d0 <col:41> 'std::__1::__libcpp_thread_id (const std::__1::__libcpp_thread_t *)' lvalue Function 0x7fdeba0ce588 '__libcpp_thread_get_id' 'std::__1::__libcpp_thread_id (const std::__1::__libcpp_thread_t *)'
| |               `-UnaryOperator 0x7fdeba8437b0 <col:64, col:65> 'const std::__1::__libcpp_thread_t *' prefix '&'
| |                 `-MemberExpr 0x7fdeba843778 <col:65> 'const std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *const' lvalue ->__t_ 0x7fdeba832648
| |                   `-CXXThisExpr 0x7fdeba843760 <col:65> 'const class std::__1::thread *' this
| |-AlwaysInlineAttr 0x7fdeba834280 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fdeba8342c8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fdeba834388 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:330:63> col:24 native_handle 'std::__1::thread::native_handle_type (void) noexcept'
| |-CompoundStmt 0x7fdeba843a10 <col:50, col:63>
| | `-ReturnStmt 0x7fdeba8439f8 <col:51, col:58>
| |   `-ImplicitCastExpr 0x7fdeba8439e0 <col:58> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <LValueToRValue>
| |     `-MemberExpr 0x7fdeba8439a8 <col:58> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue ->__t_ 0x7fdeba832648
| |       `-CXXThisExpr 0x7fdeba843990 <col:58> 'class std::__1::thread *' this
| |-AlwaysInlineAttr 0x7fdeba834420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fdeba834468 <col:51, col:74> Hidden
`-CXXMethodDecl 0x7fdeba8344e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:332:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:332:21 hardware_concurrency 'unsigned int (void) noexcept' static

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::thread" = type { %struct._opaque_pthread_t* }
  NonVirtualBaseLLVMType:%"class.std::__1::thread" = type { %struct._opaque_pthread_t* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1225:9)
         0 |   struct std::__1::_PairT __t
         0 |     size_t first
         8 |     size_t second
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__murmur2_or_cityhash<unsigned long, 64> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1190:9)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1208:9)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1303:9)
         0 |   struct _opaque_pthread_t * __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |       union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __l
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __s
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw __r
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__rep
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __l
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |     struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __s
         0 |       union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw __r
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__split_buffer_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>
         0 |   class std::__1::allocator<int> & __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>
         0 |   struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
         0 |     int * __value_
         8 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> (base)
         8 |     class std::__1::allocator<int> & __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__split_buffer<int, class std::__1::allocator<int> &>
         0 |   class std::__1::__split_buffer_common<true> (base) (empty)
         0 |   std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer __first_
         8 |   std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer __begin_
        16 |   std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer __end_
        24 |   class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> __end_cap_
        24 |     struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
        24 |       int * __value_
        32 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> (base)
        32 |       class std::__1::allocator<int> & __value_
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false>
         0 |   class std::__1::__thread_struct * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::default_delete<class std::__1::__thread_struct> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (empty)
         0 |   struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> >
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |     class std::__1::__thread_struct * __value_
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |     struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >
         0 |   class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |       class std::__1::__thread_struct * __value_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |       struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__tuple_leaf<0, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, false>
         0 |   class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> > __value_
         0 |     class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |       struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |         class std::__1::__thread_struct * __value_
         0 |       struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |         struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__tuple_leaf<1, void (*)(void), false>
         0 |   void (*)(void) __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__tuple_impl<struct std::__1::__tuple_indices<0, 1>, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)>
         0 |   class std::__1::__tuple_leaf<0, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, false> (base)
         0 |     class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> > __value_
         0 |       class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |         struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |           class std::__1::__thread_struct * __value_
         0 |         struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |           struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
         8 |   class std::__1::__tuple_leaf<1, void (*)(void), false> (base)
         8 |     void (*)(void) __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)>
         0 |   struct std::__1::__tuple_impl<struct std::__1::__tuple_indices<0, 1>, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> __base_
         0 |     class std::__1::__tuple_leaf<0, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, false> (base)
         0 |       class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> > __value_
         0 |         class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |           struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |             class std::__1::__thread_struct * __value_
         0 |           struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |             struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
         8 |     class std::__1::__tuple_leaf<1, void (*)(void), false> (base)
         8 |       void (*)(void) __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> >, 1, true> (empty)
         0 |   struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> *, 0, false>
         0 |   class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> *, struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > >
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> *, 0, false> (base)
         0 |     class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> * __value_
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> >, 1, true> (base) (empty)
         0 |     struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::integral_constant<_Bool, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fdeb8801e08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:503:1, line:515:1> line:504:29 struct integral_constant definition
|-TemplateArgument type '_Bool'
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7fdeb8001bd8 prev 0x7fdeb8801e08 <col:1, col:29> col:29 implicit struct integral_constant
|-VarDecl 0x7fdeb8001c80 <line:506:5, col:53> col:45 used value 'const _Bool':'const _Bool' static constexpr cinit
| `-SubstNonTypeTemplateParmExpr 0x7fdeb8001d08 <col:53> '_Bool'
|   `-CXXBoolLiteralExpr 0x7fdeb8001cf0 <col:53> '_Bool' true
|-TypedefDecl 0x7fdeb8001d98 <line:507:5, col:31> col:31 value_type '_Bool':'_Bool'
| `-SubstTemplateTypeParmType 0x7fdeb8801dd0 '_Bool' sugar
|   |-TemplateTypeParmType 0x7fdeb8800e00 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fdeb8800dc0 '_Tp'
|   `-BuiltinType 0x7fdeb7833540 '_Bool'
|-TypedefDecl 0x7fdeb8001e00 <line:508:5, col:31> col:31 referenced type 'struct std::__1::integral_constant<_Bool, true>'
| `-RecordType 0x7fdeb8801f10 'struct std::__1::integral_constant<_Bool, true>'
|   `-ClassTemplateSpecialization 0x7fdeb8801e08 'integral_constant'
|-CXXConversionDecl 0x7fdeb8001ee8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:510:79> col:27 constexpr operator bool 'std::__1::integral_constant<_Bool, true>::value_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb8001fb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeb8002030 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:513:75> col:31 constexpr operator() 'std::__1::integral_constant<_Bool, true>::value_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeb80020d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fdeb9542a90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:504:29> col:29 implicit referenced constexpr integral_constant 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fdeb9542ba8 <col:29> col:29 implicit constexpr integral_constant 'void (const struct std::__1::integral_constant<_Bool, true> &)' inline default trivial noexcept-unevaluated 0x7fdeb9542ba8
| `-ParmVarDecl 0x7fdeb9542cd0 <col:29> col:29 'const struct std::__1::integral_constant<_Bool, true> &'
|-CXXConstructorDecl 0x7fdeb9542d68 <col:29> col:29 implicit used constexpr integral_constant 'void (struct std::__1::integral_constant<_Bool, true> &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7fdeb9542e90 <col:29> col:29 'struct std::__1::integral_constant<_Bool, true> &&'
| `-CompoundStmt 0x7fdeb8b83008 <col:29>
`-CXXDestructorDecl 0x7fdeb9542f80 <col:29> col:29 implicit referenced ~integral_constant 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::integral_constant" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::integral_constant" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> (empty)
         0 |   struct std::__1::integral_constant<_Bool, true> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fdeba2a57e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1366:1, line:1374:1> line:1367:8 struct __has_destroy definition
|-public 'integral_constant<_Bool, is_same<decltype(__has_destroy_test(declval<class allocator<int> >(), declval<int *>())), true_type>::value>':'struct std::__1::integral_constant<_Bool, true>'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-TemplateArgument type 'int *'
|-CXXRecordDecl 0x7fdeba2a86d8 prev 0x7fdeba2a57e8 <col:1, col:8> col:8 implicit struct __has_destroy
|-CXXConstructorDecl 0x7fdeba2a87b0 <col:8> col:8 implicit referenced constexpr __has_destroy 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fdeba2a88c8 <col:8> col:8 implicit constexpr __has_destroy 'void (const struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &)' inline default trivial noexcept-unevaluated 0x7fdeba2a88c8
| `-ParmVarDecl 0x7fdeba2a89f0 <col:8> col:8 'const struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &'
|-CXXConstructorDecl 0x7fdeba2a8a88 <col:8> col:8 implicit constexpr __has_destroy 'void (struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &&)' inline default trivial noexcept-unevaluated 0x7fdeba2a8a88
| `-ParmVarDecl 0x7fdeba2a8bb0 <col:8> col:8 'struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &&'
`-CXXDestructorDecl 0x7fdeba2a8c50 <col:8> col:8 implicit referenced ~__has_destroy 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__has_destroy" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__has_destroy" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fdeb8ad75d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:880:5, line:884:5> line:880:12 struct __RAII_IncreaseAnnotator definition
|-CXXRecordDecl 0x7fdeba2aab50 prev 0x7fdeb8ad75d8 <col:5, col:12> col:12 implicit struct __RAII_IncreaseAnnotator
|-CXXConstructorDecl 0x7fdeba2aadc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:882:64> col:7 used __RAII_IncreaseAnnotator 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| |-ParmVarDecl 0x7fdeba2aabf8 <col:32, col:45> col:46 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7fdeba2aac68 <col:48, col:60> col:58 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7fdeba2ab3a0 <col:60> 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7fdeb8a095f8 <col:60> 'int' 1
| |-CompoundStmt 0x7fdeb8a0de68 <col:63, col:64>
| `-AlwaysInlineAttr 0x7fdeba2aaeb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2aaf00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:883:48> col:38 used __done 'void (void)'
| |-CompoundStmt 0x7fdeb8a0de80 <col:47, col:48>
| `-AlwaysInlineAttr 0x7fdeba2aafa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fdeba2ab038 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:880:12> col:12 implicit constexpr __RAII_IncreaseAnnotator 'void (const struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &)' inline default trivial noexcept-unevaluated 0x7fdeba2ab038
| `-ParmVarDecl 0x7fdeba2ab160 <col:12> col:12 'const struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &'
`-CXXConstructorDecl 0x7fdeba2ab1f8 <col:12> col:12 implicit constexpr __RAII_IncreaseAnnotator 'void (struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &&)' inline default trivial noexcept-unevaluated 0x7fdeba2ab1f8
  `-ParmVarDecl 0x7fdeba2ab320 <col:12> col:12 'struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::vector<int, std::__1::allocator<int> >::__RAII_IncreaseAnnotator" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::vector<int, std::__1::allocator<int> >::__RAII_IncreaseAnnotator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> (empty)
         0 |   struct std::__1::integral_constant<_Bool, true> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fdeba2ad660 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1345:1, line:1354:1> line:1346:8 struct __has_construct definition
|-public 'integral_constant<_Bool, is_same<decltype(__has_construct_test(declval<class allocator<int> >(), declval<int *>(), declval<int>())), true_type>::value>':'struct std::__1::integral_constant<_Bool, true>'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-TemplateArgument type 'int *'
|-TemplateArgument pack
| `-TemplateArgument type 'int'
|-CXXRecordDecl 0x7fdeba2b16e8 prev 0x7fdeba2ad660 <col:1, col:8> col:8 implicit struct __has_construct
|-CXXConstructorDecl 0x7fdeba2b17c0 <col:8> col:8 implicit referenced constexpr __has_construct 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fdeba2b18d8 <col:8> col:8 implicit constexpr __has_construct 'void (const struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &)' inline default trivial noexcept-unevaluated 0x7fdeba2b18d8
| `-ParmVarDecl 0x7fdeba2b1a00 <col:8> col:8 'const struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &'
|-CXXConstructorDecl 0x7fdeba2b1a98 <col:8> col:8 implicit constexpr __has_construct 'void (struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &&)' inline default trivial noexcept-unevaluated 0x7fdeba2b1a98
| `-ParmVarDecl 0x7fdeba2b1bc0 <col:8> col:8 'struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &&'
`-CXXDestructorDecl 0x7fdeba2b1c60 <col:8> col:8 implicit referenced ~__has_construct 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__has_construct" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__has_construct" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fdeb89b24d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:19:1, line:25:1> line:20:7 class __split_buffer_common definition
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7fdeb89b26c0 prev 0x7fdeb89b24d8 <col:1, col:7> col:7 implicit class __split_buffer_common
|-AccessSpecDecl 0x7fdeb89b2758 <line:22:1, col:10> col:1 protected
|-CXXMethodDecl 0x7fdeb89b6800 <line:23:5, col:33> col:10 __throw_length_error 'void (void) const'
|-CXXMethodDecl 0x7fdeb89b68a8 <line:24:5, col:33> col:10 __throw_out_of_range 'void (void) const'
|-CXXDestructorDecl 0x7fdeba2c3e30 <line:20:7> col:7 implicit ~__split_buffer_common 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fdeba2e19d8 <col:7> col:7 implicit used constexpr __split_buffer_common 'void (void) noexcept' inline default trivial
| `-CompoundStmt 0x7fdeba2e1e38 <col:7>
|-CXXConstructorDecl 0x7fdeba2e1ae8 <col:7> col:7 implicit constexpr __split_buffer_common 'void (const class std::__1::__split_buffer_common<true> &)' inline default trivial noexcept-unevaluated 0x7fdeba2e1ae8
| `-ParmVarDecl 0x7fdeba2e1c10 <col:7> col:7 'const class std::__1::__split_buffer_common<true> &'
`-CXXConstructorDecl 0x7fdeba2e1ca8 <col:7> col:7 implicit constexpr __split_buffer_common 'void (class std::__1::__split_buffer_common<true> &&)' inline default trivial noexcept-unevaluated 0x7fdeba2e1ca8
  `-ParmVarDecl 0x7fdeba2e1dd0 <col:7> col:7 'class std::__1::__split_buffer_common<true> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__split_buffer_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__split_buffer_common" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fdeba2b72b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2034:1, line:2067:1> line:2037:8 struct __compressed_pair_elem definition
|-TemplateArgument type 'class std::__1::allocator<int> &'
|-TemplateArgument integral 1
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7fdeba2b7530 prev 0x7fdeba2b72b0 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7fdeba2b75d8 <line:2038:3, col:15> col:15 _ParamT 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
| `-SubstTemplateTypeParmType 0x7fdeba2b6930 'class std::__1::allocator<int> &' sugar
|   |-TemplateTypeParmType 0x7fdeb9567580 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fdeb9567538 '_Tp'
|   `-LValueReferenceType 0x7fdeb8ab3140 'class std::__1::allocator<int> &'
|     `-RecordType 0x7fdeb8aa58b0 'class std::__1::allocator<int>'
|       `-ClassTemplateSpecialization 0x7fdeb8aa57c8 'allocator'
|-TypedefDecl 0x7fdeba2b7668 <line:2039:3, col:16> col:16 referenced reference 'class std::__1::allocator<int> &&'
| `-LValueReferenceType 0x7fdeba2b7630 'class std::__1::allocator<int> &&'
|   `-RecordType 0x7fdeb8aa58b0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fdeb8aa57c8 'allocator'
|-TypedefDecl 0x7fdeba2b76d0 <line:2040:3, col:22> col:22 referenced const_reference 'class std::__1::allocator<int> &&'
| `-LValueReferenceType 0x7fdeba2b7630 'class std::__1::allocator<int> &&'
|   `-RecordType 0x7fdeb8aa58b0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fdeb8aa57c8 'allocator'
|-CXXConstructorDecl 0x7fdeba2b7768 <line:2043:3, col:52> col:13 constexpr __compressed_pair_elem 'void (void)'
|-FunctionTemplateDecl 0x7fdeba2b7f48 <line:2045:3, line:2050:44> line:2049:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fdeba2b7820 <line:2045:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fdeba2b7888 <col:24, line:2047:6> line:2045:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<class allocator<int> &, 1, false>, typename decay<_Up>::type>::value>::type'
| |-CXXConstructorDecl 0x7fdeba2b7ea0 <line:2048:3, line:2050:44> line:2049:3 constexpr __compressed_pair_elem 'void (_Up &&)'
| | `-ParmVarDecl 0x7fdeba2b7db8 <col:26, col:32> col:32 __u '_Up &&'
| `-CXXConstructorDecl 0x7fdeba2e11a0 <line:2048:3, line:2050:44> line:2049:3 used constexpr __compressed_pair_elem 'void (class std::__1::allocator<int> &&)'
|   |-TemplateArgument type 'class std::__1::allocator<int> &'
|   |-TemplateArgument type 'void'
|   |-ParmVarDecl 0x7fdeba2e10d8 <col:26, col:32> col:32 used __u 'class std::__1::allocator<int> &&'
|   |-CXXCtorInitializer Field 0x7fdeba2b8988 '__value_' 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
|   | `-CallExpr 0x7fdeba2e1838 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2050:41> 'class std::__1::allocator<int>' lvalue
|   |   |-ImplicitCastExpr 0x7fdeba2e1820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2050:36> 'class std::__1::allocator<int> &&(*)(typename remove_reference<class allocator<int> &>::type &) noexcept' <FunctionToPointerDecay>
|   |   | `-DeclRefExpr 0x7fdeba2e17a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2050:36> 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' lvalue Function 0x7fdeba2da568 'forward' 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' (FunctionTemplate 0x7fdeb90acce0 'forward')
|   |   `-DeclRefExpr 0x7fdeba2e1398 <col:38> 'class std::__1::allocator<int>' lvalue ParmVar 0x7fdeba2e10d8 '__u' 'class std::__1::allocator<int> &&'
|   `-CompoundStmt 0x7fdeb95693c0 <col:43, col:44>
|-FunctionTemplateDecl 0x7fdeba2b8578 <line:2052:3, line:2056:75> line:2054:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fdeba2b8028 <line:2052:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7fdeba2b8098 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7fdeba2b84d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2056:75> line:2054:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7fdeba2b8110 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fdeba2b8278 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7fdeba2b83c8 <line:2055:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7fdeba2b8608 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2b8758 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2062:3, col:50> col:13 used __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>::reference (void) noexcept'
| `-CompoundStmt 0x7fdeba2e2d50 <col:31, col:50>
|   `-ReturnStmt 0x7fdeba2e2d38 <col:33, col:40>
|     `-MemberExpr 0x7fdeba2e2d00 <col:40> 'class std::__1::allocator<int>' lvalue ->__value_ 0x7fdeba2b8988
|       `-CXXThisExpr 0x7fdeba2e2ce8 <col:40> 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> *' this
|-CXXMethodDecl 0x7fdeba2b88a8 <line:2063:3, col:62> col:19 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>::const_reference (void) const noexcept'
|-AccessSpecDecl 0x7fdeba2b8950 <line:2065:1, col:8> col:1 private
|-FieldDecl 0x7fdeba2b8988 <line:2066:3, col:7> col:7 referenced __value_ 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
|-CXXMethodDecl 0x7fdeba2bc538 <line:2037:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &(const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &)' inline default_delete trivial noexcept-unevaluated 0x7fdeba2bc538
| `-ParmVarDecl 0x7fdeba2bc650 <col:8> col:8 'const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &'
|-CXXMethodDecl 0x7fdeba2bc6e8 <col:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &(struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&)' inline default_delete trivial noexcept-unevaluated 0x7fdeba2bc6e8
| `-ParmVarDecl 0x7fdeba2bc800 <col:8> col:8 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&'
|-CXXDestructorDecl 0x7fdeba2c3fe8 <col:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fdeba2cb6d8 <col:8> col:8 implicit constexpr __compressed_pair_elem 'void (const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &)' inline default trivial noexcept-unevaluated 0x7fdeba2cb6d8
| `-ParmVarDecl 0x7fdeba2cb800 <col:8> col:8 'const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &'
`-CXXConstructorDecl 0x7fdeba2cb868 <col:8> col:8 implicit constexpr __compressed_pair_elem 'void (struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&)' inline default trivial noexcept-unevaluated 0x7fdeba2cb868
  `-ParmVarDecl 0x7fdeba2cb990 <col:8> col:8 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem.2" = type { %"class.std::__1::allocator"* }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem.2" = type { %"class.std::__1::allocator"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fdeba2b63a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2104:1, line:2201:1> line:2105:7 class __compressed_pair definition
|-private '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|-private '__compressed_pair_elem<class std::__1::allocator<int> &, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
|-TemplateArgument type 'int *'
|-TemplateArgument type 'class std::__1::allocator<int> &'
|-CXXRecordDecl 0x7fdeba2b8a38 prev 0x7fdeba2b63a0 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7fdeba2b8dd8 <line:2107:3, col:42> col:42 _Base1 '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
| `-TemplateSpecializationType 0x7fdeba2b8d30 '__compressed_pair_elem<int *, 0>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'int *':'int *'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fdeb956ce00 <col:39> 'int' 0
|   `-RecordType 0x7fdeb8abbd00 'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|     `-ClassTemplateSpecialization 0x7fdeb8abbbe0 '__compressed_pair_elem'
|-TypedefDecl 0x7fdeba2b9138 <line:2108:3, col:42> col:42 _Base2 '__compressed_pair_elem<class std::__1::allocator<int> &, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
| `-TemplateSpecializationType 0x7fdeba2b9090 '__compressed_pair_elem<class std::__1::allocator<int> &, 1>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fdeb956d1a8 <col:39> 'int' 1
|   `-RecordType 0x7fdeba2b73d0 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
|     `-ClassTemplateSpecialization 0x7fdeba2b72b0 '__compressed_pair_elem'
|-StaticAssertDecl 0x7fdeba2b95b8 <line:2114:3, line:2117:44> line:2114:3
| |-ParenExpr 0x7fdeba2b9598 <col:17, col:43> '_Bool'
| | `-UnaryOperator 0x7fdeba2b9578 <col:18, col:38> '_Bool' prefix '!'
| |   `-ImplicitCastExpr 0x7fdeba2b9560 <col:19, col:38> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7fdeba2b9528 <col:19, col:38> 'const _Bool':'const _Bool' lvalue Var 0x7fdeb971ddc8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fdeb956d6d8 <line:2115:5, line:2117:5> 'const char [179]' lvalue "__compressed_pair cannot be instantated when T1 and T2 are the same type; The current implementation is NOT ABI-compatible with the previous implementation for this configuration"
|-AccessSpecDecl 0x7fdeba2b95f0 <line:2119:1, col:7> col:1 public
|-FunctionTemplateDecl 0x7fdeba2b9eb8 <line:2121:3, line:2128:34> col:13 __compressed_pair
| |-NonTypeTemplateParmDecl 0x7fdeba2b9618 <line:2121:13, col:27> col:18 referenced '_Bool' depth 0 index 0 _Dummy
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fdeb956d820 <col:27> '_Bool' true
| |-TemplateTypeParmDecl 0x7fdeba2b9670 <line:2122:7, line:2125:10> line:2122:7 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<__dependent_type<is_default_constructible<int *>, _Dummy>::value && __dependent_type<is_default_constructible<class allocator<int> &>, _Dummy>::value>::type'
| `-CXXConstructorDecl 0x7fdeba2b9e10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2128:34> col:13 constexpr __compressed_pair 'void (void)'
|   `-AlwaysInlineAttr 0x7fdeba2b9f38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fdeba2ba758 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2130:3, line:2135:51> line:2134:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fdeba2ba008 <line:2130:13, col:19> col:19 class depth 0 index 0 _Tp
| |-NonTypeTemplateParmDecl 0x7fdeba2ba510 <col:24, line:2132:57> col:55 'typename enable_if<!is_same<typename decay<_Tp>::type, class __compressed_pair<int *, class allocator<int> &> >::value, _Bool>::type' depth 0 index 1
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fdeb956e740 <col:57> '_Bool' true
| `-CXXConstructorDecl 0x7fdeba2ba6b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2135:51> line:2134:3 constexpr __compressed_pair 'void (_Tp &&)'
|   |-ParmVarDecl 0x7fdeba2ba5c8 <col:21, col:27> col:27 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fdeba2ba7b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fdeba2bab38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2137:3, line:2140:51> line:2139:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fdeba2ba880 <line:2137:13, col:19> col:19 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7fdeba2baa90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2140:51> line:2139:3 constexpr __compressed_pair 'void (struct std::__1::__second_tag, _Tp &&)'
|   |-ParmVarDecl 0x7fdeba2ba900 <col:21> col:33 'struct std::__1::__second_tag'
|   |-ParmVarDecl 0x7fdeba2ba998 <col:35, col:41> col:41 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fdeba2bab98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fdeba2bafe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2142:3, line:2145:75> line:2144:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fdeba2bac68 <line:2142:13, col:19> col:19 class depth 0 index 0 _U1
| |-TemplateTypeParmDecl 0x7fdeba2bacd8 <col:24, col:30> col:30 class depth 0 index 1 _U2
| |-CXXConstructorDecl 0x7fdeba2baf40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 constexpr __compressed_pair 'void (_U1 &&, _U2 &&)'
| | |-ParmVarDecl 0x7fdeba2bada8 <col:21, col:27> col:27 __t1 '_U1 &&'
| | |-ParmVarDecl 0x7fdeba2bae48 <col:33, col:39> col:39 __t2 '_U2 &&'
| | `-AlwaysInlineAttr 0x7fdeba2bb048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-CXXConstructorDecl 0x7fdeba2d93e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 used constexpr __compressed_pair 'void (nullptr_t &&, class std::__1::allocator<int> &&)'
|   |-TemplateArgument type 'nullptr_t'
|   |-TemplateArgument type 'class std::__1::allocator<int> &'
|   |-ParmVarDecl 0x7fdeba2d91f8 <col:21, col:27> col:27 used __t1 'nullptr_t &&'
|   |-ParmVarDecl 0x7fdeba2d92c8 <col:33, col:39> col:39 used __t2 'class std::__1::allocator<int> &&'
|   |-CXXCtorInitializer 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|   | `-CXXConstructExpr 0x7fdeba2d9f60 <line:2145:9, col:39> '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>' 'void (nullptr_t &&)'
|   |   `-CallExpr 0x7fdeba2d9b68 <col:16, col:38> 'nullptr_t':'nullptr_t' xvalue
|   |     |-ImplicitCastExpr 0x7fdeba2d9b50 <col:16, col:32> 'nullptr_t &&(*)(typename remove_reference<nullptr_t>::type &) noexcept' <FunctionToPointerDecay>
|   |     | `-DeclRefExpr 0x7fdeba2d9ad0 <col:16, col:32> 'nullptr_t &&(typename remove_reference<nullptr_t>::type &) noexcept' lvalue Function 0x7fdeba2a21c8 'forward' 'nullptr_t &&(typename remove_reference<nullptr_t>::type &) noexcept' (FunctionTemplate 0x7fdeb90acce0 'forward')
|   |     `-DeclRefExpr 0x7fdeba2d96c8 <col:34> 'nullptr_t':'nullptr_t' lvalue ParmVar 0x7fdeba2d91f8 '__t1' 'nullptr_t &&'
|   |-CXXCtorInitializer 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
|   | `-CXXConstructExpr 0x7fdeba2e18c8 <col:42, col:72> '__compressed_pair_elem<class std::__1::allocator<int> &, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>' 'void (class std::__1::allocator<int> &&)'
|   |   `-CallExpr 0x7fdeba2daa70 <col:49, col:71> 'class std::__1::allocator<int>' lvalue
|   |     |-ImplicitCastExpr 0x7fdeba2daa58 <col:49, col:65> 'class std::__1::allocator<int> &&(*)(typename remove_reference<class allocator<int> &>::type &) noexcept' <FunctionToPointerDecay>
|   |     | `-DeclRefExpr 0x7fdeba2da8e0 <col:49, col:65> 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' lvalue Function 0x7fdeba2da568 'forward' 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' (FunctionTemplate 0x7fdeb90acce0 'forward')
|   |     `-DeclRefExpr 0x7fdeba2da098 <col:67> 'class std::__1::allocator<int>' lvalue ParmVar 0x7fdeba2d92c8 '__t2' 'class std::__1::allocator<int> &&'
|   |-CompoundStmt 0x7fdeb95713f8 <col:74, col:75>
|   `-AlwaysInlineAttr 0x7fdeba2d9508 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fdeba2bb6a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2147:3, line:2154:75> line:2149:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fdeba2bb118 <line:2147:13, col:22> col:22 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7fdeba2bb188 <col:30, col:39> col:39 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7fdeba2bb600 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2154:75> line:2149:3 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7fdeba2bb218 <col:21, col:43> col:43 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fdeba2bb388 <col:49, col:66> col:66 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7fdeba2bb4f8 <line:2150:21, col:38> col:38 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7fdeba2bb710 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2bb8d8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2175:3> line:2173:30 used first 'typename _Base1::reference (void) noexcept'
| |-CompoundStmt 0x7fdeba2f3738 <col:48, line:2175:3>
| | `-ReturnStmt 0x7fdeba2f3720 <line:2174:5, col:46>
| |   `-CXXMemberCallExpr 0x7fdeba2f36f8 <col:12, col:46> 'int *':'int *' lvalue
| |     `-MemberExpr 0x7fdeba2f36c0 <col:12, col:40> '<bound member function type>' .__get 0x7fdeb8abd148
| |       `-CXXStaticCastExpr 0x7fdeba2f3620 <col:12, col:38> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue static_cast<std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1 &> <NoOp>
| |         `-ImplicitCastExpr 0x7fdeba2f3600 <col:33, col:34> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue <DerivedToBase (__compressed_pair_elem)>
| |           `-UnaryOperator 0x7fdeba2e33e0 <col:33, col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue prefix '*'
| |             `-CXXThisExpr 0x7fdeba2e33c8 <col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fdeba2bb980 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2bba88 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2180:3> line:2178:36 used first 'typename _Base1::const_reference (void) const noexcept'
| |-CompoundStmt 0x7fdeba2f4f28 <col:60, line:2180:3>
| | `-ReturnStmt 0x7fdeba2f4f10 <line:2179:5, col:52>
| |   `-CXXMemberCallExpr 0x7fdeba2f4ee8 <col:12, col:52> 'int *const':'int *const' lvalue
| |     `-MemberExpr 0x7fdeba2f4eb0 <col:12, col:46> '<bound member function type>' .__get 0x7fdeb8abd298
| |       `-CXXStaticCastExpr 0x7fdeba2f4e10 <col:12, col:44> 'const std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'const struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue static_cast<const std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1 &> <NoOp>
| |         `-ImplicitCastExpr 0x7fdeba2f4df0 <col:39, col:40> 'const std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'const struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue <DerivedToBase (__compressed_pair_elem)>
| |           `-UnaryOperator 0x7fdeba2f4dd0 <col:39, col:40> 'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue prefix '*'
| |             `-CXXThisExpr 0x7fdeba2f4db8 <col:40> 'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fdeba2bbb30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2bbc78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2185:3> line:2183:30 used second 'typename _Base2::reference (void) noexcept'
| |-CompoundStmt 0x7fdeba2e2cc8 <col:49, line:2185:3>
| | `-ReturnStmt 0x7fdeba2e2cb0 <line:2184:5, col:46>
| |   `-CXXMemberCallExpr 0x7fdeba2e2c88 <col:12, col:46> 'class std::__1::allocator<int>' lvalue
| |     `-MemberExpr 0x7fdeba2e2c50 <col:12, col:40> '<bound member function type>' .__get 0x7fdeba2b8758
| |       `-CXXStaticCastExpr 0x7fdeba2e2bb0 <col:12, col:38> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>' lvalue static_cast<std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2 &> <NoOp>
| |         `-ImplicitCastExpr 0x7fdeba2e2b90 <col:33, col:34> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>' lvalue <DerivedToBase (__compressed_pair_elem)>
| |           `-UnaryOperator 0x7fdeba2e2b70 <col:33, col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue prefix '*'
| |             `-CXXThisExpr 0x7fdeba2e2b58 <col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fdeba2bbd20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2bbe28 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2190:3> line:2188:36 second 'typename _Base2::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeba2bbed0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2bc070 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2200:3> line:2193:8 swap 'void (class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &)' noexcept-uninstantiated 0x7fdeb9570848
| |-ParmVarDecl 0x7fdeba2bbf58 <col:13, col:32> col:32 __x 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &'
| `-AlwaysInlineAttr 0x7fdeba2bc168 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2bc868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2105:7, <invalid sloc>> col:7 implicit constexpr operator= 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &(class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&)' inline default_delete trivial noexcept-unevaluated 0x7fdeba2bc868
| `-ParmVarDecl 0x7fdeba2bc980 <col:7> col:7 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&'
|-CXXDestructorDecl 0x7fdeba2c3f08 <col:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fdeba2d2ca8 <col:7> col:7 implicit constexpr __compressed_pair 'void (const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &)' inline default trivial noexcept-unevaluated 0x7fdeba2d2ca8
| `-ParmVarDecl 0x7fdeba2d2dd0 <col:7> col:7 'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &'
`-CXXConstructorDecl 0x7fdeba2d8f88 <col:7> col:7 implicit constexpr __compressed_pair 'void (class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&)' inline default trivial noexcept-unevaluated 0x7fdeba2d8f88
  `-ParmVarDecl 0x7fdeba2d90b0 <col:7> col:7 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair.1" = type { %"struct.std::__1::__compressed_pair_elem", %"struct.std::__1::__compressed_pair_elem.2" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair.1" = type { %"struct.std::__1::__compressed_pair_elem", %"struct.std::__1::__compressed_pair_elem.2" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fdeb8ad5588 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:27:1, line:164:1> line:28:8 struct __split_buffer definition
|-private '__split_buffer_common<true>':'class std::__1::__split_buffer_common<true>'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int> &'
|-CXXRecordDecl 0x7fdeba2b50e8 prev 0x7fdeb8ad5588 <col:1, col:8> col:8 implicit struct __split_buffer
|-AccessSpecDecl 0x7fdeba2b5180 <line:31:1, col:8> col:1 private
|-CXXConstructorDecl 0x7fdeba2b52f0 <line:32:5, col:41> col:5 __split_buffer 'void (const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &)'
| `-ParmVarDecl 0x7fdeba2b51e8 <col:20, col:40> col:41 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &'
|-CXXMethodDecl 0x7fdeba2b5480 <line:33:5, col:52> col:21 operator= 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &(const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &)'
| `-ParmVarDecl 0x7fdeba2b53c0 <col:31, col:51> col:52 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &'
|-AccessSpecDecl 0x7fdeba2b5530 <line:34:1, col:7> col:1 public
|-TypedefDecl 0x7fdeba2b5598 <line:35:5, col:61> col:61 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7fdeba2b5560 'int' sugar
|   |-TemplateTypeParmType 0x7fdeb89b2010 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fdeb89b1fc8 '_Tp'
|   `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeba2b5628 <line:36:5, col:61> col:61 allocator_type 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
| `-SubstTemplateTypeParmType 0x7fdeba2b55f0 'class std::__1::allocator<int> &' sugar
|   |-TemplateTypeParmType 0x7fdeb89b2140 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fdeb89b20f8 '_Allocator'
|   `-LValueReferenceType 0x7fdeb8ab3140 'class std::__1::allocator<int> &'
|     `-RecordType 0x7fdeb8aa58b0 'class std::__1::allocator<int>'
|       `-ClassTemplateSpecialization 0x7fdeb8aa57c8 'allocator'
|-TypedefDecl 0x7fdeba2b5b40 <line:37:5, col:61> col:61 __alloc_rr 'typename remove_reference<allocator_type>::type':'class std::__1::allocator<int>'
| `-ElaboratedType 0x7fdeba2b5af0 'typename remove_reference<allocator_type>::type' sugar
|   `-TypedefType 0x7fdeba2b5ad0 'std::__1::remove_reference<class std::__1::allocator<int> &>::type' sugar
|     |-Typedef 0x7fdeba2b5a58 'type'
|     `-SubstTemplateTypeParmType 0x7fdeba2b58a0 'class std::__1::allocator<int>' sugar
|       |-TemplateTypeParmType 0x7fdeb9031a20 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fdeb90319d8 '_Tp'
|       `-RecordType 0x7fdeb8aa58b0 'class std::__1::allocator<int>'
|         `-ClassTemplateSpecialization 0x7fdeb8aa57c8 'allocator'
|-TypedefDecl 0x7fdeba2b5c48 <line:38:5, col:61> col:61 __alloc_traits 'allocator_traits<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr>':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x7fdeba2b5bd0 'allocator_traits<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>'
|   `-RecordType 0x7fdeb8aa6280 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x7fdeb8aa6190 'allocator_traits'
|-TypedefDecl 0x7fdeba2b5cf8 <line:39:5, col:61> col:61 reference 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
| `-LValueReferenceType 0x7fdeba2b5cc0 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
|   `-TypedefType 0x7fdeba2b5ca0 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type' sugar
|     |-Typedef 0x7fdeba2b5598 'value_type'
|     `-SubstTemplateTypeParmType 0x7fdeba2b5560 'int' sugar
|       |-TemplateTypeParmType 0x7fdeb89b2010 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fdeb89b1fc8 '_Tp'
|       `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeba2b5d88 <line:40:5, col:61> col:61 const_reference 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
| `-LValueReferenceType 0x7fdeba2b5d50 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
|   `-QualType 0x7fdeba2b5ca1 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type' const
|     `-TypedefType 0x7fdeba2b5ca0 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type' sugar
|       |-Typedef 0x7fdeba2b5598 'value_type'
|       `-SubstTemplateTypeParmType 0x7fdeba2b5560 'int' sugar
|         |-TemplateTypeParmType 0x7fdeb89b2010 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7fdeb89b1fc8 '_Tp'
|         `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeba2b5e90 <line:41:5, col:61> col:61 size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7fdeba2b5e40 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7fdeb8ab3210 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x7fdeb8aafba0 'size_type'
|     `-ElaboratedType 0x7fdeb8aafb50 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7fdeb8aafb30 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|         |-Typedef 0x7fdeb8aafab0 'type'
|         `-ElaboratedType 0x7fdeb8aafa60 'typename class allocator<int>::size_type' sugar
|           `-TypedefType 0x7fdeb8aaf340 'std::__1::allocator<int>::size_type' sugar
|             |-Typedef 0x7fdeb8aa68b8 'size_type'
|             `-TypedefType 0x7fdeb9016e10 'size_t' sugar
|               |-Typedef 0x7fdeb78687b0 'size_t'
|               `-BuiltinType 0x7fdeb7833680 'unsigned long'
|-TypedefDecl 0x7fdeba2b5f60 <line:42:5, col:61> col:61 difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7fdeba2b5f10 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7fdeb8aaf060 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x7fdeb8aaeff0 'difference_type'
|     `-ElaboratedType 0x7fdeb8aaefa0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7fdeb8aaef80 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|         |-Typedef 0x7fdeb8aaef00 'type'
|         `-ElaboratedType 0x7fdeb8aaeeb0 'typename class allocator<int>::difference_type' sugar
|           `-TypedefType 0x7fdeb8aae760 'std::__1::allocator<int>::difference_type' sugar
|             |-Typedef 0x7fdeb8aa6910 'difference_type'
|             `-TypedefType 0x7fdeb909c750 'ptrdiff_t' sugar
|               |-Typedef 0x7fdeb7868740 'ptrdiff_t'
|               `-BuiltinType 0x7fdeb78335e0 'long'
|-TypedefDecl 0x7fdeba2b6030 <line:43:5, col:61> col:61 pointer 'typename __alloc_traits::pointer':'int *'
| `-ElaboratedType 0x7fdeba2b5fe0 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7fdeb8aa9e30 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x7fdeb8aa9dc0 'pointer'
|     `-ElaboratedType 0x7fdeb8aa9d70 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7fdeb8aa9d50 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|         |-Typedef 0x7fdeb8aa9cd0 'type'
|         `-ElaboratedType 0x7fdeb8aa9c80 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|           `-TypedefType 0x7fdeb8aa9c60 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x7fdeb8aa9be0 'type'
|             `-ElaboratedType 0x7fdeb8aa9b90 'typename class allocator<int>::pointer' sugar
|               `-TypedefType 0x7fdeb8aa7590 'std::__1::allocator<int>::pointer' sugar
|                 |-Typedef 0x7fdeb8aa69d8 'pointer'
|                 `-PointerType 0x7fdeb8aa69a0 'int *'
|                   `-SubstTemplateTypeParmType 0x7fdeb8aa6970 'int' sugar
|                     |-TemplateTypeParmType 0x7fdeb9557660 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fdeb9557618 '_Tp'
|                     `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeba2b6100 <line:44:5, col:61> col:61 const_pointer 'typename __alloc_traits::const_pointer':'const int *'
| `-ElaboratedType 0x7fdeba2b60b0 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7fdeb8abad30 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x7fdeb8aaabc0 'const_pointer'
|     `-ElaboratedType 0x7fdeb8aaab70 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7fdeb8aaab50 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|         |-Typedef 0x7fdeb8aaaad0 'type'
|         `-ElaboratedType 0x7fdeb8aaaa80 'typename class allocator<int>::const_pointer' sugar
|           `-TypedefType 0x7fdeb8aa77e0 'std::__1::allocator<int>::const_pointer' sugar
|             |-Typedef 0x7fdeb8aa6a68 'const_pointer'
|             `-PointerType 0x7fdeb8aa6a30 'const int *'
|               `-QualType 0x7fdeb8aa6971 'const int' const
|                 `-SubstTemplateTypeParmType 0x7fdeb8aa6970 'int' sugar
|                   |-TemplateTypeParmType 0x7fdeb9557660 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7fdeb9557618 '_Tp'
|                   `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeba2b6190 <line:45:5, col:61> col:61 iterator 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
| `-TypedefType 0x7fdeba2b6160 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer' sugar
|   |-Typedef 0x7fdeba2b6030 'pointer'
|   `-ElaboratedType 0x7fdeba2b5fe0 'typename __alloc_traits::pointer' sugar
|     `-TypedefType 0x7fdeb8aa9e30 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|       |-Typedef 0x7fdeb8aa9dc0 'pointer'
|       `-ElaboratedType 0x7fdeb8aa9d70 'typename __pointer_type<value_type, allocator_type>::type' sugar
|         `-TypedefType 0x7fdeb8aa9d50 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|           |-Typedef 0x7fdeb8aa9cd0 'type'
|           `-ElaboratedType 0x7fdeb8aa9c80 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|             `-TypedefType 0x7fdeb8aa9c60 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|               |-Typedef 0x7fdeb8aa9be0 'type'
|               `-ElaboratedType 0x7fdeb8aa9b90 'typename class allocator<int>::pointer' sugar
|                 `-TypedefType 0x7fdeb8aa7590 'std::__1::allocator<int>::pointer' sugar
|                   |-Typedef 0x7fdeb8aa69d8 'pointer'
|                   `-PointerType 0x7fdeb8aa69a0 'int *'
|                     `-SubstTemplateTypeParmType 0x7fdeb8aa6970 'int' sugar
|                       |-TemplateTypeParmType 0x7fdeb9557660 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7fdeb9557618 '_Tp'
|                       `-BuiltinType 0x7fdeb78335c0 'int'
|-TypedefDecl 0x7fdeba2b6220 <line:46:5, col:61> col:61 const_iterator 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_pointer':'const int *'
| `-TypedefType 0x7fdeba2b61f0 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_pointer' sugar
|   |-Typedef 0x7fdeba2b6100 'const_pointer'
|   `-ElaboratedType 0x7fdeba2b60b0 'typename __alloc_traits::const_pointer' sugar
|     `-TypedefType 0x7fdeb8abad30 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|       |-Typedef 0x7fdeb8aaabc0 'const_pointer'
|       `-ElaboratedType 0x7fdeb8aaab70 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|         `-TypedefType 0x7fdeb8aaab50 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|           |-Typedef 0x7fdeb8aaaad0 'type'
|           `-ElaboratedType 0x7fdeb8aaaa80 'typename class allocator<int>::const_pointer' sugar
|             `-TypedefType 0x7fdeb8aa77e0 'std::__1::allocator<int>::const_pointer' sugar
|               |-Typedef 0x7fdeb8aa6a68 'const_pointer'
|               `-PointerType 0x7fdeb8aa6a30 'const int *'
|                 `-QualType 0x7fdeb8aa6971 'const int' const
|                   `-SubstTemplateTypeParmType 0x7fdeb8aa6970 'int' sugar
|                     |-TemplateTypeParmType 0x7fdeb9557660 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fdeb9557618 '_Tp'
|                     `-BuiltinType 0x7fdeb78335c0 'int'
|-FieldDecl 0x7fdeba2b6288 <line:48:5, col:53> col:53 referenced __first_ 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
|-FieldDecl 0x7fdeba2b62e0 <line:49:5, col:53> col:53 referenced __begin_ 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
|-FieldDecl 0x7fdeba2b6338 <line:50:5, col:53> col:53 referenced __end_ 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
|-FieldDecl 0x7fdeba2bca08 <line:51:5, col:48> col:48 referenced __end_cap_ '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>'
|-TypedefDecl 0x7fdeba2be190 <line:53:5, col:65> col:65 __alloc_ref 'typename add_lvalue_reference<allocator_type>::type':'class std::__1::allocator<int> &&'
| `-ElaboratedType 0x7fdeba2be140 'typename add_lvalue_reference<allocator_type>::type' sugar
|   `-TypedefType 0x7fdeba2be120 'std::__1::add_lvalue_reference<class std::__1::allocator<int> &>::type' sugar
|     |-Typedef 0x7fdeba2be0a0 'type'
|     `-ElaboratedType 0x7fdeba2be050 'typename __add_lvalue_reference_impl<class allocator<int> &>::type' sugar
|       `-TypedefType 0x7fdeba2be030 'std::__1::__add_lvalue_reference_impl<class std::__1::allocator<int> &, true>::type' sugar
|         |-Typedef 0x7fdeba2bdfb8 'type'
|         `-LValueReferenceType 0x7fdeba2bdf80 'class std::__1::allocator<int> &&'
|           `-RecordType 0x7fdeb8aa58b0 'class std::__1::allocator<int>'
|             `-ClassTemplateSpecialization 0x7fdeb8aa57c8 'allocator'
|-TypedefDecl 0x7fdeba2be2f0 <line:54:5, col:65> col:65 __alloc_const_ref 'typename add_lvalue_reference<allocator_type>::type':'class std::__1::allocator<int> &&'
| `-ElaboratedType 0x7fdeba2be2a0 'typename add_lvalue_reference<allocator_type>::type' sugar
|   `-TypedefType 0x7fdeba2be120 'std::__1::add_lvalue_reference<class std::__1::allocator<int> &>::type' sugar
|     |-Typedef 0x7fdeba2be0a0 'type'
|     `-ElaboratedType 0x7fdeba2be050 'typename __add_lvalue_reference_impl<class allocator<int> &>::type' sugar
|       `-TypedefType 0x7fdeba2be030 'std::__1::__add_lvalue_reference_impl<class std::__1::allocator<int> &, true>::type' sugar
|         |-Typedef 0x7fdeba2bdfb8 'type'
|         `-LValueReferenceType 0x7fdeba2bdf80 'class std::__1::allocator<int> &&'
|           `-RecordType 0x7fdeb8aa58b0 'class std::__1::allocator<int>'
|             `-ClassTemplateSpecialization 0x7fdeb8aa57c8 'allocator'
|-CXXMethodDecl 0x7fdeba2be3d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:56:109> col:53 used __alloc 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &(void) noexcept'
| |-CompoundStmt 0x7fdeba2e2b00 <col:81, col:109>
| | `-ReturnStmt 0x7fdeba2e2ae8 <col:82, col:107>
| |   `-CXXMemberCallExpr 0x7fdeba2e2ac0 <col:89, col:107> 'class std::__1::allocator<int>' lvalue
| |     `-MemberExpr 0x7fdeba2e2a88 <col:89, col:100> '<bound member function type>' .second 0x7fdeba2bbc78
| |       `-MemberExpr 0x7fdeba2e29e0 <col:89> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue ->__end_cap_ 0x7fdeba2bca08
| |         `-CXXThisExpr 0x7fdeba2e29c8 <col:89> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fdeba2be4a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2be578 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:57:109> col:53 __alloc 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &(void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeba2be620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2be6f8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:58:108> col:53 used __end_cap 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer &(void) noexcept'
| |-CompoundStmt 0x7fdeba2e3370 <col:81, col:108>
| | `-ReturnStmt 0x7fdeba2e3358 <col:82, col:106>
| |   `-CXXMemberCallExpr 0x7fdeba2e3330 <col:89, col:106> 'int *':'int *' lvalue
| |     `-MemberExpr 0x7fdeba2e32f8 <col:89, col:100> '<bound member function type>' .first 0x7fdeba2bb8d8
| |       `-MemberExpr 0x7fdeba2e3250 <col:89> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue ->__end_cap_ 0x7fdeba2bca08
| |         `-CXXThisExpr 0x7fdeba2e3238 <col:89> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fdeba2be7a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2be878 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:59:108> col:53 used __end_cap 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer &(void) const noexcept'
| |-CompoundStmt 0x7fdeba2f4d60 <col:81, col:108>
| | `-ReturnStmt 0x7fdeba2f4d48 <col:82, col:106>
| |   `-CXXMemberCallExpr 0x7fdeba2f4cf8 <col:89, col:106> 'int *const':'int *const' lvalue
| |     `-MemberExpr 0x7fdeba2f4cc0 <col:89, col:100> '<bound member function type>' .first 0x7fdeba2bba88
| |       `-MemberExpr 0x7fdeba2f4c18 <col:89> 'const __compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue ->__end_cap_ 0x7fdeba2bca08
| |         `-CXXThisExpr 0x7fdeba2f4c00 <col:89> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fdeba2be920 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fdeba2be9b0 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:62:5 __split_buffer 'void (void)' noexcept-uninstantiated 0x7fdeb89b87a0
| `-AlwaysInlineAttr 0x7fdeba2beab0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fdeba2bec30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:65:44> col:14 __split_buffer 'void (std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7fdeba2beb08 <col:29, col:41> col:41 __a 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| `-AlwaysInlineAttr 0x7fdeba2becf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fdeba2bee30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:67:50> col:14 __split_buffer 'void (const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7fdeba2bed48 <col:29, col:47> col:47 __a 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| `-AlwaysInlineAttr 0x7fdeba2beef0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fdeba2bf1a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:308:1, line:314:1> line:68:5 used __split_buffer 'void (std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7fdeba2bef70 <col:20, col:30> col:30 used __cap 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
| |-ParmVarDecl 0x7fdeba2befe0 <col:37, col:47> col:47 used __start 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
| |-ParmVarDecl 0x7fdeba2bf050 <col:56, col:68> col:68 used __a 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| |-CXXCtorInitializer '__split_buffer_common<true>':'class std::__1::__split_buffer_common<true>'
| | `-CXXConstructExpr 0x7fdeba2e1e50 <col:5> '__split_buffer_common<true>':'class std::__1::__split_buffer_common<true>' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7fdeba2bca08 '__end_cap_' '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>'
| | `-ExprWithCleanups 0x7fdeba2e1978 <line:309:7, col:30> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>'
| |   `-CXXConstructExpr 0x7fdeba2e1938 <col:7, col:30> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' 'void (nullptr_t &&, class std::__1::allocator<int> &&)'
| |     |-MaterializeTemporaryExpr 0x7fdeba2d9550 <col:18> 'nullptr_t':'nullptr_t' xvalue
| |     | `-CXXNullPtrLiteralExpr 0x7fdeb89c9d38 <col:18> 'nullptr_t'
| |     `-DeclRefExpr 0x7fdeba2cb648 <col:27> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>' lvalue ParmVar 0x7fdeba2bf050 '__a' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| `-CompoundStmt 0x7fdeba2e2998 <line:310:1, line:314:1>
|   |-BinaryOperator 0x7fdeba2e2408 <line:311:5, col:74> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|   | |-MemberExpr 0x7fdeba2e1f00 <col:5> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7fdeba2b6288
|   | | `-CXXThisExpr 0x7fdeba2e1ee8 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   | `-ConditionalOperator 0x7fdeba2e23d8 <col:16, col:74> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer':'int *'
|   |   |-BinaryOperator 0x7fdeba2e20b8 <col:16, col:25> '_Bool' '!='
|   |   | |-ImplicitCastExpr 0x7fdeba2e2088 <col:16> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|   |   | | `-DeclRefExpr 0x7fdeba2e2060 <col:16> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7fdeba2bef70 '__cap' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|   |   | `-ImplicitCastExpr 0x7fdeba2e20a0 <col:25> 'unsigned long' <IntegralCast>
|   |   |   `-IntegerLiteral 0x7fdeb89c9e58 <col:25> 'int' 0
|   |   |-CallExpr 0x7fdeba2e2370 <col:29, col:70> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer':'int *'
|   |   | |-ImplicitCastExpr 0x7fdeba2e2358 <col:29, col:45> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer (*)(std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type)' <FunctionToPointerDecay>
|   |   | | `-DeclRefExpr 0x7fdeba2e22c0 <col:29, col:45> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type)' lvalue CXXMethod 0x7fdeb8ab3350 'allocate' 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type)'
|   |   | |-CXXMemberCallExpr 0x7fdeba2e2270 <col:54, col:62> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>' lvalue
|   |   | | `-MemberExpr 0x7fdeba2e2238 <col:54> '<bound member function type>' ->__alloc 0x7fdeba2be3d8
|   |   | |   `-CXXThisExpr 0x7fdeba2e2220 <col:54> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   |   | `-ImplicitCastExpr 0x7fdeba2e23a8 <col:65> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|   |   |   `-DeclRefExpr 0x7fdeba2e2298 <col:65> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7fdeba2bef70 '__cap' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|   |   `-ImplicitCastExpr 0x7fdeba2e23c0 <col:74> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer':'int *' <NullToPointer>
|   |     `-CXXNullPtrLiteralExpr 0x7fdeb89ca188 <col:74> 'nullptr_t'
|   |-BinaryOperator 0x7fdeba2e26a8 <line:312:5, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|   | |-MemberExpr 0x7fdeba2e2448 <col:5> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__begin_ 0x7fdeba2b62e0
|   | | `-CXXThisExpr 0x7fdeba2e2430 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   | `-ImplicitCastExpr 0x7fdeba2e2690 <col:16, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|   |   `-BinaryOperator 0x7fdeba2e2668 <col:16, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|   |     |-MemberExpr 0x7fdeba2e2498 <col:16> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__end_ 0x7fdeba2b6338
|   |     | `-CXXThisExpr 0x7fdeba2e2480 <col:16> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   |     `-BinaryOperator 0x7fdeba2e2640 <col:25, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' '+'
|   |       |-ImplicitCastExpr 0x7fdeba2e2610 <col:25> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|   |       | `-MemberExpr 0x7fdeba2e25b0 <col:25> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7fdeba2b6288
|   |       |   `-CXXThisExpr 0x7fdeba2e2598 <col:25> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   |       `-ImplicitCastExpr 0x7fdeba2e2628 <col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|   |         `-DeclRefExpr 0x7fdeba2e25e8 <col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7fdeba2befe0 '__start' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|   `-BinaryOperator 0x7fdeba2e2970 <line:313:5, col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|     |-CXXMemberCallExpr 0x7fdeba2e27b0 <col:5, col:15> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue
|     | `-MemberExpr 0x7fdeba2e2778 <col:5> '<bound member function type>' ->__end_cap 0x7fdeba2be6f8
|     |   `-CXXThisExpr 0x7fdeba2e2760 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     `-BinaryOperator 0x7fdeba2e2948 <col:19, col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' '+'
|       |-ImplicitCastExpr 0x7fdeba2e2918 <col:19> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|       | `-MemberExpr 0x7fdeba2e28b8 <col:19> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7fdeba2b6288
|       |   `-CXXThisExpr 0x7fdeba2e28a0 <col:19> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|       `-ImplicitCastExpr 0x7fdeba2e2930 <col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|         `-DeclRefExpr 0x7fdeba2e28f0 <col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7fdeba2bef70 '__cap' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|-CXXDestructorDecl 0x7fdeba2bf2a0 <line:339:1, line:344:1> line:69:5 used ~__split_buffer 'void (void) noexcept'
| `-CompoundStmt 0x7fdeba2f3d08 <line:340:1, line:344:1>
|   |-CXXMemberCallExpr 0x7fdeba2f3928 <line:341:5, col:11> 'void'
|   | `-MemberExpr 0x7fdeba2f38f0 <col:5> '<bound member function type>' ->clear 0x7fdeba2bff78
|   |   `-CXXThisExpr 0x7fdeba2f38d8 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   `-IfStmt 0x7fdeba2f3cd0 <line:342:5, line:343:67>
|     |-<<<NULL>>>
|     |-<<<NULL>>>
|     |-ImplicitCastExpr 0x7fdeba2f39b8 <line:342:9> '_Bool' <PointerToBoolean>
|     | `-ImplicitCastExpr 0x7fdeba2f39a0 <col:9> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|     |   `-MemberExpr 0x7fdeba2f3968 <col:9> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7fdeba2b6288
|     |     `-CXXThisExpr 0x7fdeba2f3950 <col:9> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     |-CallExpr 0x7fdeba2f3c78 <line:343:9, col:67> 'void'
|     | |-ImplicitCastExpr 0x7fdeba2f3c60 <col:9, col:25> 'void (*)(std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::pointer, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type) noexcept' <FunctionToPointerDecay>
|     | | `-DeclRefExpr 0x7fdeba2f3a10 <col:9, col:25> 'void (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::pointer, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type) noexcept' lvalue CXXMethod 0x7fdeb8ab39c8 'deallocate' 'void (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::pointer, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type) noexcept'
|     | |-CXXMemberCallExpr 0x7fdeba2f3b28 <col:36, col:44> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>' lvalue
|     | | `-MemberExpr 0x7fdeba2f3af0 <col:36> '<bound member function type>' ->__alloc 0x7fdeba2be3d8
|     | |   `-CXXThisExpr 0x7fdeba2f3ad8 <col:36> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     | |-ImplicitCastExpr 0x7fdeba2f3cb8 <col:47> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|     | | `-MemberExpr 0x7fdeba2f3b68 <col:47> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7fdeba2b6288
|     | |   `-CXXThisExpr 0x7fdeba2f3b50 <col:47> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     | `-CXXMemberCallExpr 0x7fdeba2f3bf0 <col:57, col:66> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|     |   `-MemberExpr 0x7fdeba2f3bb8 <col:57> '<bound member function type>' ->capacity 0x7fdeba2c02c0
|     |     `-ImplicitCastExpr 0x7fdeba2f3c48 <col:57> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' <NoOp>
|     |       `-CXXThisExpr 0x7fdeba2f3ba0 <col:57> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     `-<<<NULL>>>
|-CXXConstructorDecl 0x7fdeba2bf4c0 <line:72:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:72:5 __split_buffer 'void (struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&)' noexcept-uninstantiated 0x7fdeb89b9278
| `-ParmVarDecl 0x7fdeba2bf388 <col:20, col:37> col:37 __c 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&'
|-CXXConstructorDecl 0x7fdeba2bf780 <line:74:5, col:63> col:5 __split_buffer 'void (struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&, const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7fdeba2bf5d8 <col:20, col:37> col:37 __c 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&'
| `-ParmVarDecl 0x7fdeba2bf648 <col:42, col:60> col:60 __a 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
|-CXXMethodDecl 0x7fdeba2bf970 <line:75:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:75:21 operator= 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &(struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&)' noexcept-uninstantiated 0x7fdeb89b9698
| `-ParmVarDecl 0x7fdeba2bf858 <col:31, col:48> col:48 __c 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&'
|-CXXMethodDecl 0x7fdeba2bfae8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:81:87> col:46 begin 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fdeba2bfb90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2bfc58 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:82:87> col:46 begin 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeba2bfd00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2bfd70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:83:85> col:46 end 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fdeba2bfe18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2bfe88 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:84:85> col:46 end 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fdeba2bff30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2bff78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:88:38> line:87:10 used clear 'void (void) noexcept'
| |-CompoundStmt 0x7fdeba2f3eb0 <line:88:9, col:38>
| | `-CXXMemberCallExpr 0x7fdeba2f3e68 <col:10, col:36> 'void'
| |   |-MemberExpr 0x7fdeba2f3e30 <col:10> '<bound member function type>' ->__destruct_at_end 0x7fdeba2c2fe8
| |   | `-CXXThisExpr 0x7fdeba2f3e18 <col:10> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| |   `-ImplicitCastExpr 0x7fdeba2f3e98 <col:28> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
| |     `-MemberExpr 0x7fdeba2f3de0 <col:28> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__begin_ 0x7fdeba2b62e0
| |       `-CXXThisExpr 0x7fdeba2f3dc8 <col:28> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fdeba2c0020 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2c00c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:89:104> col:41 size 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| `-AlwaysInlineAttr 0x7fdeba2c0168 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2c01b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:90:81> col:36 empty '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fdeba2c0258 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2c02c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:91:113> col:41 used capacity 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| |-CompoundStmt 0x7fdeba2f4be0 <col:58, col:113>
| | `-ReturnStmt 0x7fdeba2f4bc8 <col:59, col:111>
| |   `-CXXStaticCastExpr 0x7fdeba2f4b98 <col:66, col:111> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' static_cast<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type> <NoOp>
| |     `-ImplicitCastExpr 0x7fdeba2f4b80 <col:89, col:103> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <IntegralCast>
| |       `-BinaryOperator 0x7fdeba2f4b58 <col:89, col:103> 'long' '-'
| |         |-ImplicitCastExpr 0x7fdeba2f4b28 <col:89, col:99> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
| |         | `-CXXMemberCallExpr 0x7fdeba2f4ab0 <col:89, col:99> 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *const' lvalue
| |         |   `-MemberExpr 0x7fdeba2f4a78 <col:89> '<bound member function type>' ->__end_cap 0x7fdeba2be878
| |         |     `-CXXThisExpr 0x7fdeba2f4a60 <col:89> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| |         `-ImplicitCastExpr 0x7fdeba2f4b40 <col:103> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
| |           `-MemberExpr 0x7fdeba2f4af0 <col:103> 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *const' lvalue ->__first_ 0x7fdeba2b6288
| |             `-CXXThisExpr 0x7fdeba2f4ad8 <col:103> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fdeba2c0368 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2c03d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:92:115> col:41 __front_spare 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| `-AlwaysInlineAttr 0x7fdeba2c0478 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2c04e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:93:115> col:41 __back_spare 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| `-AlwaysInlineAttr 0x7fdeba2c0588 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fdeba2c0640 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:95:79> col:47 front 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::reference (void)'
| `-AlwaysInlineAttr 0x7fdeba2c06e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
