
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1507:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1504:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1507:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__thread_struct
         0 |   class std::__1::__thread_struct_imp * __p_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<int> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<int> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<int> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<int> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__vector_base_common<true> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<int> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>
         0 |   class std::__1::allocator<int> (base) (empty)
         0 |   int * __first_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<int *, class std::__1::allocator<int> >
         0 |   class std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2> (base)
         0 |     class std::__1::allocator<int> (base) (empty)
         0 |     int * __first_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__vector_base<int, class std::__1::allocator<int> >
         0 |   class std::__1::__vector_base_common<true> (base) (empty)
         0 |   std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __begin_
         8 |   std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __end_
        16 |   class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > __end_cap_
        16 |     class std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2> (base)
        16 |       class std::__1::allocator<int> (base) (empty)
        16 |       int * __first_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::vector<int, class std::__1::allocator<int> >
         0 |   class std::__1::__vector_base<int, class std::__1::allocator<int> > (base)
         0 |     class std::__1::__vector_base_common<true> (base) (empty)
         0 |     std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __begin_
         8 |     std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __end_
        16 |     class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > __end_cap_
        16 |       class std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2> (base)
        16 |         class std::__1::allocator<int> (base) (empty)
        16 |         int * __first_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb39049d1f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:315:89> col:64 class __vector_base_common definition
|-TemplateArgument integral 1
|-VisibilityAttr 0x7fb39049d388 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7fb39049d438 prev 0x7fb39049d1f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:289:1, col:7> col:7 implicit class __vector_base_common
|-AccessSpecDecl 0x7fb39049d4d0 <line:291:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fb39049d538 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:292:51> col:27 __vector_base_common 'void (void)'
| `-AlwaysInlineAttr 0x7fb39049d618 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7fb39049d660 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:293:22, col:50> col:27 __throw_length_error 'void (void) const'
| `-CXX11NoReturnAttr 0x7fb39049d708 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:313:30> Inherited
|-CXXMethodDecl 0x7fb39049d750 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:294:22, col:50> col:27 __throw_out_of_range 'void (void) const'
| `-CXX11NoReturnAttr 0x7fb39049d7f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:313:30> Inherited
`-CXXDestructorDecl 0x7fb38fd881d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:315:64> col:64 implicit ~__vector_base_common 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__vector_base_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__vector_base_common.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb38fd47ff8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:101:1, col:52> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1759:28 class allocator definition
|-TemplateArgument type 'int'
|-CXXRecordDecl 0x7fb38fd48ff8 prev 0x7fb38fd47ff8 <col:1, col:28> col:28 implicit class allocator
|-AccessSpecDecl 0x7fb38fd49090 <line:1761:1, col:7> col:1 public
|-TypedefDecl 0x7fb38fd490b8 <line:1762:5, col:31> col:31 referenced size_type 'size_t':'unsigned long'
| `-TypedefType 0x7fb38f85a210 'size_t' sugar
|   |-Typedef 0x7fb38f0673b0 'size_t'
|   `-BuiltinType 0x7fb38f032c80 'unsigned long'
|-TypedefDecl 0x7fb38fd49110 <line:1763:5, col:31> col:31 referenced difference_type 'ptrdiff_t':'long'
| `-TypedefType 0x7fb38f128f50 'ptrdiff_t' sugar
|   |-Typedef 0x7fb38f067340 'ptrdiff_t'
|   `-BuiltinType 0x7fb38f032be0 'long'
|-TypedefDecl 0x7fb38fd491d8 <line:1764:5, col:31> col:31 referenced pointer 'int *'
| `-PointerType 0x7fb38fd491a0 'int *'
|   `-SubstTemplateTypeParmType 0x7fb38fd49170 'int' sugar
|     |-TemplateTypeParmType 0x7fb39024afa0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fb39024af58 '_Tp'
|     `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd49268 <line:1765:5, col:31> col:31 referenced const_pointer 'const int *'
| `-PointerType 0x7fb38fd49230 'const int *'
|   `-QualType 0x7fb38fd49171 'const int' const
|     `-SubstTemplateTypeParmType 0x7fb38fd49170 'int' sugar
|       |-TemplateTypeParmType 0x7fb39024afa0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fb39024af58 '_Tp'
|       `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd492f8 <line:1766:5, col:31> col:31 reference 'int &'
| `-LValueReferenceType 0x7fb38fd492c0 'int &'
|   `-SubstTemplateTypeParmType 0x7fb38fd49170 'int' sugar
|     |-TemplateTypeParmType 0x7fb39024afa0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fb39024af58 '_Tp'
|     `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd49388 <line:1767:5, col:31> col:31 const_reference 'const int &'
| `-LValueReferenceType 0x7fb38fd49350 'const int &'
|   `-QualType 0x7fb38fd49171 'const int' const
|     `-SubstTemplateTypeParmType 0x7fb38fd49170 'int' sugar
|       |-TemplateTypeParmType 0x7fb39024afa0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fb39024af58 '_Tp'
|       `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd493f0 <line:1768:5, col:31> col:31 referenced value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7fb38fd49170 'int' sugar
|   |-TemplateTypeParmType 0x7fb39024afa0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fb39024af58 '_Tp'
|   `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd49448 <line:1770:5, col:23> col:23 referenced propagate_on_container_move_assignment 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fb38f83d540 'std::__1::true_type' sugar
|   |-Typedef 0x7fb38f83aa48 'true_type'
|   `-TemplateSpecializationType 0x7fb38f837530 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fb38f837398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:522:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fb38f837380 <line:525:31> '_Bool' true
|     `-RecordType 0x7fb38f837510 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fb38f837408 'integral_constant'
|-TypedefDecl 0x7fb38fd494a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1771:5, col:23> col:23 referenced is_always_equal 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fb38f83d540 'std::__1::true_type' sugar
|   |-Typedef 0x7fb38f83aa48 'true_type'
|   `-TemplateSpecializationType 0x7fb38f837530 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fb38f837398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:522:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fb38f837380 <line:525:31> '_Bool' true
|     `-RecordType 0x7fb38f837510 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fb38f837408 'integral_constant'
|-ClassTemplateDecl 0x7fb38fd49618 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1773:5, col:33> col:33 rebind
| |-TemplateTypeParmDecl 0x7fb38fd494f8 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXRecordDecl 0x7fb38fd49580 <col:26, col:33> col:33 struct rebind
|-CXXConstructorDecl 0x7fb38fd49868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1775:54> col:31 referenced allocator 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fb38fd49948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7fb38fd49c60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:5, col:96> col:52 allocator
| |-TemplateTypeParmDecl 0x7fb38fd49990 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXConstructorDecl 0x7fb38fd49bb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:96> col:52 allocator 'void (const allocator<_Up> &) noexcept'
|   |-ParmVarDecl 0x7fb38fd49ad0 <col:62, col:82> col:83 'const allocator<_Up> &'
|   `-AlwaysInlineAttr 0x7fb38fd49cb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd49ee8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1778:39> line:1777:39 address 'std::__1::allocator<int>::pointer (std::__1::allocator<int>::reference) const noexcept'
| |-ParmVarDecl 0x7fb38fd49de0 <col:47, col:57> col:57 __x 'std::__1::allocator<int>::reference':'int &'
| `-AlwaysInlineAttr 0x7fb38fd49f98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd4a138 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1780:39> line:1779:45 address 'std::__1::allocator<int>::const_pointer (std::__1::allocator<int>::const_reference) const noexcept'
| |-ParmVarDecl 0x7fb38fd4a030 <col:53, col:69> col:69 __x 'std::__1::allocator<int>::const_reference':'const int &'
| `-AlwaysInlineAttr 0x7fb38fd4a1e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd4a3a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1787:9> line:1781:39 allocate 'std::__1::allocator<int>::pointer (std::__1::allocator::size_type, allocator<void>::const_pointer)'
| |-ParmVarDecl 0x7fb38fd4a230 <col:48, col:58> col:58 __n 'std::__1::allocator::size_type':'unsigned long'
| |-ParmVarDecl 0x7fb38fd4a290 <col:63, col:96> col:94 'allocator<void>::const_pointer':'const void *'
| `-AlwaysInlineAttr 0x7fb38fd4a458 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd4a628 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:49> line:1788:36 deallocate 'void (std::__1::allocator<int>::pointer, std::__1::allocator::size_type) noexcept'
| |-ParmVarDecl 0x7fb38fd4a4b0 <col:47, col:55> col:55 __p 'std::__1::allocator<int>::pointer':'int *'
| |-ParmVarDecl 0x7fb38fd4a510 <col:60> col:69 'std::__1::allocator::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fb38fd4a6e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd4a728 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1791:45> line:1790:41 max_size 'std::__1::allocator::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd4a7d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7fb38fd4bbd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1793:5, line:1799:9> line:1796:9 construct
| |-TemplateTypeParmDecl 0x7fb38fd4b838 <line:1793:15, col:21> col:21 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fb38fd4b8a8 <col:26, col:35> col:35 class depth 0 index 1 ... _Args
| `-CXXMethodDecl 0x7fb38fd4bb40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1799:9> line:1796:9 construct 'void (_Up *, _Args &&...)'
|   |-ParmVarDecl 0x7fb38fd4b978 <col:19, col:24> col:24 __p '_Up *'
|   |-ParmVarDecl 0x7fb38fd4ba68 <col:29, col:40> col:40 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7fb38fd4bc38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd4be20 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1853:70> col:36 destroy 'void (std::__1::allocator<int>::pointer)'
| |-ParmVarDecl 0x7fb38fd4bd18 <col:44, col:52> col:52 __p 'std::__1::allocator<int>::pointer':'int *'
| `-AlwaysInlineAttr 0x7fb38fd4bed0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb38fd86f68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1759:28> col:28 implicit constexpr allocator 'void (const class std::__1::allocator<int> &)' inline default trivial noexcept-unevaluated 0x7fb38fd86f68
| `-ParmVarDecl 0x7fb38fd87050 <col:28> col:28 'const class std::__1::allocator<int> &'
|-CXXConstructorDecl 0x7fb38fd870e8 <col:28> col:28 implicit constexpr allocator 'void (class std::__1::allocator<int> &&)' inline default trivial noexcept-unevaluated 0x7fb38fd870e8
| `-ParmVarDecl 0x7fb38fd87210 <col:28> col:28 'class std::__1::allocator<int> &&'
`-CXXDestructorDecl 0x7fb38fd872b0 <col:28> col:28 implicit referenced ~allocator 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb38fd6ce58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2209:1, line:2264:1> line:2210:7 class __libcpp_compressed_pair_imp definition
|-private 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|-TemplateArgument type 'int *'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-TemplateArgument integral 2
|-CXXRecordDecl 0x7fb38fd6d278 prev 0x7fb38fd6ce58 <col:1, col:7> col:7 implicit class __libcpp_compressed_pair_imp
|-AccessSpecDecl 0x7fb38fd6d310 <line:2213:1, col:8> col:1 private
|-FieldDecl 0x7fb38fd6d348 <line:2214:5, col:9> col:9 __first_ 'int *':'int *'
|-AccessSpecDecl 0x7fb38fd6d390 <line:2215:1, col:7> col:1 public
|-TypedefDecl 0x7fb38fd6d3c8 <line:2216:5, col:17> col:17 referenced _T1_param 'int *':'int *'
| `-SubstTemplateTypeParmType 0x7fb38fd6d100 'int *' sugar
|   |-TemplateTypeParmType 0x7fb39026e010 '_T1' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fb39026dfd0 '_T1'
|   `-PointerType 0x7fb38f8997d0 'int *'
|     `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd6d430 <line:2217:5, col:17> col:17 referenced _T2_param 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7fb38fd6d140 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7fb39026e080 '_T2' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fb39026e038 '_T2'
|   `-RecordType 0x7fb38fd480e0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fb38fd47ff8 'allocator'
|-TypedefDecl 0x7fb38fd6d920 <line:2219:5, col:51> col:51 referenced _T1_reference 'typename remove_reference<int *>::type &'
| `-LValueReferenceType 0x7fb38fd6d8d0 'typename remove_reference<int *>::type &'
|   `-ElaboratedType 0x7fb38fd6d870 'typename remove_reference<int *>::type' sugar
|     `-TypedefType 0x7fb38fd6d850 'std::__1::remove_reference<int *>::type' sugar
|       |-Typedef 0x7fb38fd6d7d8 'type'
|       `-SubstTemplateTypeParmType 0x7fb38fd6d7a0 'int *' sugar
|         |-TemplateTypeParmType 0x7fb38f8734f0 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7fb38f8734b0 '_Tp'
|         `-PointerType 0x7fb38f8997d0 'int *'
|           `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd6d9b8 <line:2220:5, col:57> col:57 referenced _T2_reference 'class std::__1::allocator<int> &'
| `-LValueReferenceType 0x7fb38fd6d980 'class std::__1::allocator<int> &'
|   `-SubstTemplateTypeParmType 0x7fb38fd6d140 'class std::__1::allocator<int>' sugar
|     |-TemplateTypeParmType 0x7fb39026e080 '_T2' dependent depth 0 index 1
|     | `-TemplateTypeParm 0x7fb39026e038 '_T2'
|     `-RecordType 0x7fb38fd480e0 'class std::__1::allocator<int>'
|       `-ClassTemplateSpecialization 0x7fb38fd47ff8 'allocator'
|-TypedefDecl 0x7fb38fd6db70 <line:2222:5, col:57> col:57 referenced _T1_const_reference 'const typename remove_reference<int *>::type &'
| `-LValueReferenceType 0x7fb38fd6db20 'const typename remove_reference<int *>::type &'
|   `-QualType 0x7fb38fd6dac1 'const typename remove_reference<int *>::type' const
|     `-ElaboratedType 0x7fb38fd6dac0 'typename remove_reference<int *>::type' sugar
|       `-TypedefType 0x7fb38fd6d850 'std::__1::remove_reference<int *>::type' sugar
|         |-Typedef 0x7fb38fd6d7d8 'type'
|         `-SubstTemplateTypeParmType 0x7fb38fd6d7a0 'int *' sugar
|           |-TemplateTypeParmType 0x7fb38f8734f0 '_Tp' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x7fb38f8734b0 '_Tp'
|           `-PointerType 0x7fb38f8997d0 'int *'
|             `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd6dc08 <line:2223:5, col:63> col:63 referenced _T2_const_reference 'const class std::__1::allocator<int> &'
| `-LValueReferenceType 0x7fb38fd6dbd0 'const class std::__1::allocator<int> &'
|   `-QualType 0x7fb38fd6d141 'const class std::__1::allocator<int>' const
|     `-SubstTemplateTypeParmType 0x7fb38fd6d140 'class std::__1::allocator<int>' sugar
|       |-TemplateTypeParmType 0x7fb39026e080 '_T2' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x7fb39026e038 '_T2'
|       `-RecordType 0x7fb38fd480e0 'class std::__1::allocator<int>'
|         `-ClassTemplateSpecialization 0x7fb38fd47ff8 'allocator'
|-CXXConstructorDecl 0x7fb38fd6dca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2225:76> col:31 __libcpp_compressed_pair_imp 'void (void)'
| `-AlwaysInlineAttr 0x7fb38fd6dd88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb38fd6dee0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2227:54> line:2226:40 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T1_param)'
| |-ParmVarDecl 0x7fb38fd6de00 <col:69, col:79> col:79 __t1 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T1_param':'int *'
| `-AlwaysInlineAttr 0x7fb38fd6dfa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb38fd6e140 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2229:61> line:2228:40 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T2_param)'
| |-ParmVarDecl 0x7fb38fd6e020 <col:69, col:79> col:79 __t2 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T2_param':'class std::__1::allocator<int>'
| `-AlwaysInlineAttr 0x7fb38fd6e200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb38fd6e410 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2233:92> line:2230:31 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T1_param, std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T2_param)' noexcept-uninstantiated 0x7fb39026f408
| |-ParmVarDecl 0x7fb38fd6e258 <col:60, col:70> col:70 __t1 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T1_param':'int *'
| |-ParmVarDecl 0x7fb38fd6e2c8 <col:76, col:86> col:86 __t2 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T2_param':'class std::__1::allocator<int>'
| `-AlwaysInlineAttr 0x7fb38fd6e530 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7fb38fd6ee88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2237:5, line:2247:14> line:2239:9 __libcpp_compressed_pair_imp
| |-TemplateTypeParmDecl 0x7fb38fd6e578 <line:2237:15, col:24> col:24 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7fb38fd6e5e8 <col:32, col:41> col:41 class depth 0 index 1 ... _Args2
| |-NonTypeTemplateParmDecl 0x7fb38fd6e658 <col:49, col:59> col:59 referenced 'size_t':'unsigned long' depth 0 index 2 ... _I1
| |-NonTypeTemplateParmDecl 0x7fb38fd6e6b0 <col:64, col:74> col:74 referenced 'size_t':'unsigned long' depth 0 index 3 ... _I2
| `-CXXConstructorDecl 0x7fb38fd6ede0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2247:14> line:2239:9 __libcpp_compressed_pair_imp 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>, __tuple_indices<_I1...>, __tuple_indices<_I2...>)'
|   |-ParmVarDecl 0x7fb38fd6e738 <col:38> col:59 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fb38fd6e8a8 <line:2240:38, col:55> col:55 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7fb38fd6ea18 <line:2241:38, col:55> col:55 __second_args 'tuple<_Args2...>'
|   |-ParmVarDecl 0x7fb38fd6eb68 <line:2242:38, col:60> col:61 '__tuple_indices<_I1...>'
|   |-ParmVarDecl 0x7fb38fd6ecb8 <line:2243:38, col:60> col:61 '__tuple_indices<_I2...>'
|   `-AlwaysInlineAttr 0x7fb38fd6ef00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd6f078 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2251:92> col:51 first 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T1_reference (void) noexcept'
| `-AlwaysInlineAttr 0x7fb38fd6f120 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd6f218 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2252:92> col:51 first 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T1_const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd6f2c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd70400 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2254:90> col:51 second 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T2_reference (void) noexcept'
| `-AlwaysInlineAttr 0x7fb38fd704a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd70598 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2255:90> col:51 second 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T2_const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd70640 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd707e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2263:5> line:2257:36 swap 'void (class std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2> &)' noexcept-uninstantiated 0x7fb390270808
| |-ParmVarDecl 0x7fb38fd706c8 <col:41, col:71> col:71 __x 'class std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2> &'
| `-AlwaysInlineAttr 0x7fb38fd708d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
`-CXXDestructorDecl 0x7fb38fd88398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2210:7> col:7 implicit ~__libcpp_compressed_pair_imp 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__libcpp_compressed_pair_imp" = type { i32* }
  NonVirtualBaseLLVMType:%"class.std::__1::__libcpp_compressed_pair_imp" = type { i32* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb38fd69558 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2317:1, line:2363:1> line:2318:7 class __compressed_pair definition
|-private '__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int> >':'class std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>'
|-TemplateArgument type 'int *'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x7fb38fd70970 prev 0x7fb38fd69558 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7fb38fd713d8 <line:2321:5, col:52> col:52 base '__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int> >':'class std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>'
| `-TemplateSpecializationType 0x7fb38fd71330 '__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int> >' sugar __libcpp_compressed_pair_imp
|   |-TemplateArgument type 'int *':'int *'
|   |-TemplateArgument type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|   `-RecordType 0x7fb38fd6cf70 'class std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>'
|     `-ClassTemplateSpecialization 0x7fb38fd6ce58 '__libcpp_compressed_pair_imp'
|-AccessSpecDecl 0x7fb38fd71430 <line:2322:1, col:7> col:1 public
|-TypedefDecl 0x7fb38fd71510 <line:2323:5, col:38> col:38 _T1_param 'typename base::_T1_param':'int *'
| `-ElaboratedType 0x7fb38fd714c0 'typename base::_T1_param' sugar
|   `-TypedefType 0x7fb38fd6ddd0 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T1_param' sugar
|     |-Typedef 0x7fb38fd6d3c8 '_T1_param'
|     `-SubstTemplateTypeParmType 0x7fb38fd6d100 'int *' sugar
|       |-TemplateTypeParmType 0x7fb39026e010 '_T1' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fb39026dfd0 '_T1'
|       `-PointerType 0x7fb38f8997d0 'int *'
|         `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd715e0 <line:2324:5, col:38> col:38 _T2_param 'typename base::_T2_param':'class std::__1::allocator<int>'
| `-ElaboratedType 0x7fb38fd71590 'typename base::_T2_param' sugar
|   `-TypedefType 0x7fb38fd6dff0 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T2_param' sugar
|     |-Typedef 0x7fb38fd6d430 '_T2_param'
|     `-SubstTemplateTypeParmType 0x7fb38fd6d140 'class std::__1::allocator<int>' sugar
|       |-TemplateTypeParmType 0x7fb39026e080 '_T2' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x7fb39026e038 '_T2'
|       `-RecordType 0x7fb38fd480e0 'class std::__1::allocator<int>'
|         `-ClassTemplateSpecialization 0x7fb38fd47ff8 'allocator'
|-TypedefDecl 0x7fb38fd716b0 <line:2326:5, col:42> col:42 _T1_reference 'typename base::_T1_reference':'typename remove_reference<int *>::type &'
| `-ElaboratedType 0x7fb38fd71660 'typename base::_T1_reference' sugar
|   `-TypedefType 0x7fb38fd6efd0 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T1_reference' sugar
|     |-Typedef 0x7fb38fd6d920 '_T1_reference'
|     `-LValueReferenceType 0x7fb38fd6d8d0 'typename remove_reference<int *>::type &'
|       `-ElaboratedType 0x7fb38fd6d870 'typename remove_reference<int *>::type' sugar
|         `-TypedefType 0x7fb38fd6d850 'std::__1::remove_reference<int *>::type' sugar
|           |-Typedef 0x7fb38fd6d7d8 'type'
|           `-SubstTemplateTypeParmType 0x7fb38fd6d7a0 'int *' sugar
|             |-TemplateTypeParmType 0x7fb38f8734f0 '_Tp' dependent depth 0 index 0
|             | `-TemplateTypeParm 0x7fb38f8734b0 '_Tp'
|             `-PointerType 0x7fb38f8997d0 'int *'
|               `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd71780 <line:2327:5, col:42> col:42 _T2_reference 'typename base::_T2_reference':'class std::__1::allocator<int> &'
| `-ElaboratedType 0x7fb38fd71730 'typename base::_T2_reference' sugar
|   `-TypedefType 0x7fb38fd6f310 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T2_reference' sugar
|     |-Typedef 0x7fb38fd6d9b8 '_T2_reference'
|     `-LValueReferenceType 0x7fb38fd6d980 'class std::__1::allocator<int> &'
|       `-SubstTemplateTypeParmType 0x7fb38fd6d140 'class std::__1::allocator<int>' sugar
|         |-TemplateTypeParmType 0x7fb39026e080 '_T2' dependent depth 0 index 1
|         | `-TemplateTypeParm 0x7fb39026e038 '_T2'
|         `-RecordType 0x7fb38fd480e0 'class std::__1::allocator<int>'
|           `-ClassTemplateSpecialization 0x7fb38fd47ff8 'allocator'
|-TypedefDecl 0x7fb38fd71850 <line:2329:5, col:48> col:48 _T1_const_reference 'typename base::_T1_const_reference':'const typename remove_reference<int *>::type &'
| `-ElaboratedType 0x7fb38fd71800 'typename base::_T1_const_reference' sugar
|   `-TypedefType 0x7fb38fd6f170 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T1_const_reference' sugar
|     |-Typedef 0x7fb38fd6db70 '_T1_const_reference'
|     `-LValueReferenceType 0x7fb38fd6db20 'const typename remove_reference<int *>::type &'
|       `-QualType 0x7fb38fd6dac1 'const typename remove_reference<int *>::type' const
|         `-ElaboratedType 0x7fb38fd6dac0 'typename remove_reference<int *>::type' sugar
|           `-TypedefType 0x7fb38fd6d850 'std::__1::remove_reference<int *>::type' sugar
|             |-Typedef 0x7fb38fd6d7d8 'type'
|             `-SubstTemplateTypeParmType 0x7fb38fd6d7a0 'int *' sugar
|               |-TemplateTypeParmType 0x7fb38f8734f0 '_Tp' dependent depth 0 index 0
|               | `-TemplateTypeParm 0x7fb38f8734b0 '_Tp'
|               `-PointerType 0x7fb38f8997d0 'int *'
|                 `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd71920 <line:2330:5, col:48> col:48 _T2_const_reference 'typename base::_T2_const_reference':'const class std::__1::allocator<int> &'
| `-ElaboratedType 0x7fb38fd718d0 'typename base::_T2_const_reference' sugar
|   `-TypedefType 0x7fb38fd704f0 'std::__1::__libcpp_compressed_pair_imp<int *, class std::__1::allocator<int>, 2>::_T2_const_reference' sugar
|     |-Typedef 0x7fb38fd6dc08 '_T2_const_reference'
|     `-LValueReferenceType 0x7fb38fd6dbd0 'const class std::__1::allocator<int> &'
|       `-QualType 0x7fb38fd6d141 'const class std::__1::allocator<int>' const
|         `-SubstTemplateTypeParmType 0x7fb38fd6d140 'class std::__1::allocator<int>' sugar
|           |-TemplateTypeParmType 0x7fb39026e080 '_T2' dependent depth 0 index 1
|           | `-TemplateTypeParm 0x7fb39026e038 '_T2'
|           `-RecordType 0x7fb38fd480e0 'class std::__1::allocator<int>'
|             `-ClassTemplateSpecialization 0x7fb38fd47ff8 'allocator'
|-CXXConstructorDecl 0x7fb38fd719b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2332:52> col:31 __compressed_pair 'void (void)'
| `-AlwaysInlineAttr 0x7fb38fd71a98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb38fd71bf0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2334:50> line:2333:40 __compressed_pair 'void (std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T1_param)'
| |-ParmVarDecl 0x7fb38fd71b10 <col:58, col:68> col:68 __t1 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T1_param':'int *'
| `-AlwaysInlineAttr 0x7fb38fd71cb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb38fd71e10 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2336:50> line:2335:40 __compressed_pair 'void (std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T2_param)'
| |-ParmVarDecl 0x7fb38fd71d30 <col:58, col:68> col:68 __t2 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T2_param':'class std::__1::allocator<int>'
| `-AlwaysInlineAttr 0x7fb38fd71ed0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb38fd72090 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2338:83> line:2337:31 __compressed_pair 'void (std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T1_param, std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T2_param)'
| |-ParmVarDecl 0x7fb38fd71f28 <col:49, col:59> col:59 __t1 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T1_param':'int *'
| |-ParmVarDecl 0x7fb38fd71f98 <col:65, col:75> col:75 __t2 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T2_param':'class std::__1::allocator<int>'
| `-AlwaysInlineAttr 0x7fb38fd72158 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7fb38fd72728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2342:5, line:2349:14> line:2344:9 __compressed_pair
| |-TemplateTypeParmDecl 0x7fb38fd721a0 <line:2342:15, col:24> col:24 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7fb38fd72208 <col:32, col:41> col:41 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7fb38fd72680 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2349:14> line:2344:9 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7fb38fd72298 <col:27, col:49> col:49 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fb38fd72408 <col:55, col:72> col:72 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7fb38fd72578 <line:2345:55, col:72> col:72 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7fb38fd72790 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd728d8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2353:97> col:51 first 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T1_reference (void) noexcept'
| `-AlwaysInlineAttr 0x7fb38fd72980 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd72a48 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2354:97> col:51 first 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T1_const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd72af0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd72bb8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2356:99> col:51 second 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T2_reference (void) noexcept'
| `-AlwaysInlineAttr 0x7fb38fd72c60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd72d28 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2357:99> col:51 second 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> >::_T2_const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd72dd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd72f70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2362:26> line:2359:36 swap 'void (class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > &)' noexcept-uninstantiated 0x7fb390281518
| |-ParmVarDecl 0x7fb38fd72e58 <col:41, col:60> col:60 __x 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7fb38fd73068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
`-CXXDestructorDecl 0x7fb38fd882b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2318:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair" = type { %"class.std::__1::__libcpp_compressed_pair_imp" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair" = type { %"class.std::__1::__libcpp_compressed_pair_imp" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb38fd48518 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:320:1, line:409:1> line:321:7 class __vector_base definition
|-protected '__vector_base_common<true>':'class std::__1::__vector_base_common<true>'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x7fb38fd48780 prev 0x7fb38fd48518 <col:1, col:7> col:7 implicit class __vector_base
|-AccessSpecDecl 0x7fb38fd48818 <line:324:1, col:10> col:1 protected
|-TypedefDecl 0x7fb38fd48878 <line:325:5, col:54> col:54 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7fb38fd48840 'int' sugar
|   |-TemplateTypeParmType 0x7fb39049d8a0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fb39049d860 '_Tp'
|   `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd48908 <line:326:5, col:54> col:54 allocator_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7fb38fd488d0 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7fb39049d910 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fb39049d8c8 '_Allocator'
|   `-RecordType 0x7fb38fd480e0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fb38fd47ff8 'allocator'
|-TypedefDecl 0x7fb38fd48b18 <line:327:5, col:54> col:54 referenced __alloc_traits 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x7fb38fd48aa0 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type':'class std::__1::allocator<int>'
|   `-RecordType 0x7fb38fd48a80 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x7fb38fd48990 'allocator_traits'
|-TypedefDecl 0x7fb38fd48bf8 <line:328:5, col:54> col:54 referenced reference 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-LValueReferenceType 0x7fb38fd48bc0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|   `-TypedefType 0x7fb38fd48b70 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|     |-Typedef 0x7fb38fd48878 'value_type'
|     `-SubstTemplateTypeParmType 0x7fb38fd48840 'int' sugar
|       |-TemplateTypeParmType 0x7fb39049d8a0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fb39049d860 '_Tp'
|       `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd48cb8 <line:329:5, col:54> col:54 referenced const_reference 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-LValueReferenceType 0x7fb38fd48c80 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|   `-QualType 0x7fb38fd48b71 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' const
|     `-TypedefType 0x7fb38fd48b70 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|       |-Typedef 0x7fb38fd48878 'value_type'
|       `-SubstTemplateTypeParmType 0x7fb38fd48840 'int' sugar
|         |-TemplateTypeParmType 0x7fb39049d8a0 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7fb39049d860 '_Tp'
|         `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd69080 <line:330:5, col:54> col:54 referenced size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7fb38fd69030 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7fb38fd61f90 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x7fb38fd57790 'size_type'
|     `-ElaboratedType 0x7fb38fd57740 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7fb38fd57720 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|         |-Typedef 0x7fb38fd576a0 'type'
|         `-ElaboratedType 0x7fb38fd57650 'typename class allocator<int>::size_type' sugar
|           `-TypedefType 0x7fb38fd56b90 'std::__1::allocator<int>::size_type' sugar
|             |-Typedef 0x7fb38fd490b8 'size_type'
|             `-TypedefType 0x7fb38f85a210 'size_t' sugar
|               |-Typedef 0x7fb38f0673b0 'size_t'
|               `-BuiltinType 0x7fb38f032c80 'unsigned long'
|-TypedefDecl 0x7fb38fd69150 <line:331:5, col:54> col:54 referenced difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7fb38fd69100 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7fb38fd55fb0 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x7fb38fd55f40 'difference_type'
|     `-ElaboratedType 0x7fb38fd55ef0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7fb38fd55ed0 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|         |-Typedef 0x7fb38fd55e50 'type'
|         `-ElaboratedType 0x7fb38fd55e00 'typename class allocator<int>::difference_type' sugar
|           `-TypedefType 0x7fb38fd55310 'std::__1::allocator<int>::difference_type' sugar
|             |-Typedef 0x7fb38fd49110 'difference_type'
|             `-TypedefType 0x7fb38f128f50 'ptrdiff_t' sugar
|               |-Typedef 0x7fb38f067340 'ptrdiff_t'
|               `-BuiltinType 0x7fb38f032be0 'long'
|-TypedefDecl 0x7fb38fd69220 <line:332:5, col:54> col:54 referenced pointer 'typename __alloc_traits::pointer':'int *'
| `-ElaboratedType 0x7fb38fd691d0 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7fb38fd4da30 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x7fb38fd4d9c0 'pointer'
|     `-ElaboratedType 0x7fb38fd4d970 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7fb38fd4d950 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|         |-Typedef 0x7fb38fd4d8d0 'type'
|         `-ElaboratedType 0x7fb38fd4d880 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|           `-TypedefType 0x7fb38fd4d860 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x7fb38fd4d7e0 'type'
|             `-ElaboratedType 0x7fb38fd4d790 'typename class allocator<int>::pointer' sugar
|               `-TypedefType 0x7fb38fd49d90 'std::__1::allocator<int>::pointer' sugar
|                 |-Typedef 0x7fb38fd491d8 'pointer'
|                 `-PointerType 0x7fb38fd491a0 'int *'
|                   `-SubstTemplateTypeParmType 0x7fb38fd49170 'int' sugar
|                     |-TemplateTypeParmType 0x7fb39024afa0 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fb39024af58 '_Tp'
|                     `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd69310 <line:333:5, col:54> col:54 referenced const_pointer 'typename __alloc_traits::const_pointer':'const int *'
| `-ElaboratedType 0x7fb38fd692c0 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7fb38fd692a0 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x7fb38fd4f250 'const_pointer'
|     `-ElaboratedType 0x7fb38fd4f200 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7fb38fd4f1e0 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|         |-Typedef 0x7fb38fd4f160 'type'
|         `-ElaboratedType 0x7fb38fd4f110 'typename class allocator<int>::const_pointer' sugar
|           `-TypedefType 0x7fb38fd49fe0 'std::__1::allocator<int>::const_pointer' sugar
|             |-Typedef 0x7fb38fd49268 'const_pointer'
|             `-PointerType 0x7fb38fd49230 'const int *'
|               `-QualType 0x7fb38fd49171 'const int' const
|                 `-SubstTemplateTypeParmType 0x7fb38fd49170 'int' sugar
|                   |-TemplateTypeParmType 0x7fb39024afa0 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7fb39024af58 '_Tp'
|                   `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd693a0 <line:334:5, col:54> col:54 iterator 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
| `-TypedefType 0x7fb38fd69370 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer' sugar
|   |-Typedef 0x7fb38fd69220 'pointer'
|   `-ElaboratedType 0x7fb38fd691d0 'typename __alloc_traits::pointer' sugar
|     `-TypedefType 0x7fb38fd4da30 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|       |-Typedef 0x7fb38fd4d9c0 'pointer'
|       `-ElaboratedType 0x7fb38fd4d970 'typename __pointer_type<value_type, allocator_type>::type' sugar
|         `-TypedefType 0x7fb38fd4d950 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|           |-Typedef 0x7fb38fd4d8d0 'type'
|           `-ElaboratedType 0x7fb38fd4d880 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|             `-TypedefType 0x7fb38fd4d860 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|               |-Typedef 0x7fb38fd4d7e0 'type'
|               `-ElaboratedType 0x7fb38fd4d790 'typename class allocator<int>::pointer' sugar
|                 `-TypedefType 0x7fb38fd49d90 'std::__1::allocator<int>::pointer' sugar
|                   |-Typedef 0x7fb38fd491d8 'pointer'
|                   `-PointerType 0x7fb38fd491a0 'int *'
|                     `-SubstTemplateTypeParmType 0x7fb38fd49170 'int' sugar
|                       |-TemplateTypeParmType 0x7fb39024afa0 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7fb39024af58 '_Tp'
|                       `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd69430 <line:335:5, col:54> col:54 const_iterator 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer':'const int *'
| `-TypedefType 0x7fb38fd69400 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer' sugar
|   |-Typedef 0x7fb38fd69310 'const_pointer'
|   `-ElaboratedType 0x7fb38fd692c0 'typename __alloc_traits::const_pointer' sugar
|     `-TypedefType 0x7fb38fd692a0 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|       |-Typedef 0x7fb38fd4f250 'const_pointer'
|       `-ElaboratedType 0x7fb38fd4f200 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|         `-TypedefType 0x7fb38fd4f1e0 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|           |-Typedef 0x7fb38fd4f160 'type'
|           `-ElaboratedType 0x7fb38fd4f110 'typename class allocator<int>::const_pointer' sugar
|             `-TypedefType 0x7fb38fd49fe0 'std::__1::allocator<int>::const_pointer' sugar
|               |-Typedef 0x7fb38fd49268 'const_pointer'
|               `-PointerType 0x7fb38fd49230 'const int *'
|                 `-QualType 0x7fb38fd49171 'const int' const
|                   `-SubstTemplateTypeParmType 0x7fb38fd49170 'int' sugar
|                     |-TemplateTypeParmType 0x7fb39024afa0 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fb39024af58 '_Tp'
|                     `-BuiltinType 0x7fb38f032bc0 'int'
|-FieldDecl 0x7fb38fd69498 <line:337:5, col:53> col:53 __begin_ 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
|-FieldDecl 0x7fb38fd694f0 <line:338:5, col:53> col:53 __end_ 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
|-FieldDecl 0x7fb38fd730d0 <line:339:5, col:48> col:48 __end_cap_ '__compressed_pair<std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer, std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> >'
|-CXXMethodDecl 0x7fb38fd731a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:343:37> line:342:21 __alloc 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &(void) noexcept'
| `-AlwaysInlineAttr 0x7fb38fd73278 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd73348 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:346:37> line:345:27 __alloc 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &(void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd733f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd734c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:349:36> line:348:14 __end_cap 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer &(void) noexcept'
| `-AlwaysInlineAttr 0x7fb38fd73570 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd73648 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:352:36> line:351:20 __end_cap 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer &(void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd736f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb38fd737a0 <col:35, line:739:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:355:5 __vector_base 'void (void)' noexcept-uninstantiated 0x7fb39049f1e0
| `-AlwaysInlineAttr 0x7fb38fd738a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb38fd73a20 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:357:70> col:31 __vector_base 'void (const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fb38fd738f8 <col:45, col:67> col:67 __a 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fb38fd73ae0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7fb38fd73b58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:358:5, col:20> col:5 used ~__vector_base 'void (void) noexcept'
|-CXXMethodDecl 0x7fb38fd73c08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:361:57> col:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fb38fd73cb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd73d78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:364:64> line:363:15 capacity 'std::__1::__vector_base<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd73e20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd73f48 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:367:10 __destruct_at_end 'void (std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x7fb38fd73e78 <col:28, col:36> col:36 __new_last 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7fb38fd73ff8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd74140 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:372:89> line:370:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &)'
| |-ParmVarDecl 0x7fb38fd74078 <col:30, col:51> col:51 __c 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7fb38fd741f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd74390 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:380:89> line:375:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &)' noexcept-uninstantiated 0x7fb39049fed8
| |-ParmVarDecl 0x7fb38fd74278 <col:30, col:45> col:45 __c 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7fb38fd74488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-AccessSpecDecl 0x7fb38fd744d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:381:1, col:8> col:1 private
|-CXXMethodDecl 0x7fb38fd74680 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:392:9> line:383:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::true_type)'
| |-ParmVarDecl 0x7fb38fd74508 <col:30, col:51> col:51 __c 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7fb38fd74568 <col:56> col:65 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fb38fd74738 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd74900 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:396:10> line:395:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::false_type)'
| |-ParmVarDecl 0x7fb38fd74790 <col:30, col:49> col:50 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7fb38fd747f0 <col:52> col:62 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7fb38fd749b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd74b90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:403:9> line:399:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::true_type)' noexcept-uninstantiated 0x7fb3904a0748
| |-ParmVarDecl 0x7fb38fd74a10 <col:30, col:45> col:45 __c 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7fb38fd74a70 <col:50> col:59 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fb38fd74ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
`-CXXMethodDecl 0x7fb38fd74e78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:408:10> line:406:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::false_type) noexcept'
  |-ParmVarDecl 0x7fb38fd74cf8 <col:30, col:43> col:44 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
  |-ParmVarDecl 0x7fb38fd74d58 <col:46> col:56 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
  `-AlwaysInlineAttr 0x7fb38fd74f30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__vector_base" = type { i32*, i32*, %"class.std::__1::__compressed_pair" }
  NonVirtualBaseLLVMType:%"class.std::__1::__vector_base" = type { i32*, i32*, %"class.std::__1::__compressed_pair" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb38fd48178 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:451:1, line:881:1> line:452:28 class vector definition
|-private '__vector_base<int, class std::__1::allocator<int> >':'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x7fb38fd74fe8 prev 0x7fb38fd48178 <col:1, col:28> col:28 implicit class vector
|-AccessSpecDecl 0x7fb38fd75080 <line:455:1, col:8> col:1 private
|-TypedefDecl 0x7fb38fd75178 <line:456:5, col:54> col:54 __base '__vector_base<int, class std::__1::allocator<int> >':'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x7fb38fd750d0 '__vector_base<int, class std::__1::allocator<int> >' sugar __vector_base
|   |-TemplateArgument type 'int':'int'
|   |-TemplateArgument type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|   `-RecordType 0x7fb38fd48620 'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x7fb38fd48518 '__vector_base'
|-TypedefDecl 0x7fb38fd75258 <line:457:5, col:54> col:54 __default_allocator_type 'allocator<int>':'class std::__1::allocator<int>'
| `-TemplateSpecializationType 0x7fb38fd751e0 'allocator<int>' sugar allocator
|   |-TemplateArgument type 'int':'int'
|   `-RecordType 0x7fb38fd480e0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fb38fd47ff8 'allocator'
|-AccessSpecDecl 0x7fb38fd752b0 <line:458:1, col:7> col:1 public
|-TypedefDecl 0x7fb38fd752e8 <line:459:5, col:54> col:54 __self 'class std::__1::vector<int, class std::__1::allocator<int> >'
| `-RecordType 0x7fb38fd48280 'class std::__1::vector<int, class std::__1::allocator<int> >'
|   `-ClassTemplateSpecialization 0x7fb38fd48178 'vector'
|-TypedefDecl 0x7fb38fd75350 <line:460:5, col:54> col:54 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7fb38fd484a0 'int' sugar
|   |-TemplateTypeParmType 0x7fb3904a4ed0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fb3904a4e90 '_Tp'
|   `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd753b8 <line:461:5, col:54> col:54 allocator_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7fb38fd484e0 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7fb3904a4f40 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fb3904a4ef8 '_Allocator'
|   `-RecordType 0x7fb38fd480e0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fb38fd47ff8 'allocator'
|-TypedefDecl 0x7fb38fd754c0 <line:462:5, col:54> col:54 __alloc_traits 'typename __base::__alloc_traits':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-ElaboratedType 0x7fb38fd75470 'typename __base::__alloc_traits' sugar
|   `-TypedefType 0x7fb38fd48d10 'std::__1::__vector_base<int, class std::__1::allocator<int> >::__alloc_traits' sugar
|     |-Typedef 0x7fb38fd48b18 '__alloc_traits'
|     `-TemplateSpecializationType 0x7fb38fd48aa0 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>' sugar allocator_traits
|       |-TemplateArgument type 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type':'class std::__1::allocator<int>'
|       `-RecordType 0x7fb38fd48a80 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|         `-ClassTemplateSpecialization 0x7fb38fd48990 'allocator_traits'
|-TypedefDecl 0x7fb38fd755b0 <line:463:5, col:54> col:54 reference 'typename __base::reference':'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ElaboratedType 0x7fb38fd75560 'typename __base::reference' sugar
|   `-TypedefType 0x7fb38fd75540 'std::__1::__vector_base<int, class std::__1::allocator<int> >::reference' sugar
|     |-Typedef 0x7fb38fd48bf8 'reference'
|     `-LValueReferenceType 0x7fb38fd48bc0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|       `-TypedefType 0x7fb38fd48b70 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|         |-Typedef 0x7fb38fd48878 'value_type'
|         `-SubstTemplateTypeParmType 0x7fb38fd48840 'int' sugar
|           |-TemplateTypeParmType 0x7fb39049d8a0 '_Tp' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x7fb39049d860 '_Tp'
|           `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd756a0 <line:464:5, col:54> col:54 const_reference 'typename __base::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ElaboratedType 0x7fb38fd75650 'typename __base::const_reference' sugar
|   `-TypedefType 0x7fb38fd75630 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_reference' sugar
|     |-Typedef 0x7fb38fd48cb8 'const_reference'
|     `-LValueReferenceType 0x7fb38fd48c80 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|       `-QualType 0x7fb38fd48b71 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' const
|         `-TypedefType 0x7fb38fd48b70 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|           |-Typedef 0x7fb38fd48878 'value_type'
|           `-SubstTemplateTypeParmType 0x7fb38fd48840 'int' sugar
|             |-TemplateTypeParmType 0x7fb39049d8a0 '_Tp' dependent depth 0 index 0
|             | `-TemplateTypeParm 0x7fb39049d860 '_Tp'
|             `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd75770 <line:465:5, col:54> col:54 size_type 'typename __base::size_type':'unsigned long'
| `-ElaboratedType 0x7fb38fd75720 'typename __base::size_type' sugar
|   `-TypedefType 0x7fb38fd73d00 'std::__1::__vector_base<int, class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x7fb38fd69080 'size_type'
|     `-ElaboratedType 0x7fb38fd69030 'typename __alloc_traits::size_type' sugar
|       `-TypedefType 0x7fb38fd61f90 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|         |-Typedef 0x7fb38fd57790 'size_type'
|         `-ElaboratedType 0x7fb38fd57740 'typename __size_type<allocator_type, difference_type>::type' sugar
|           `-TypedefType 0x7fb38fd57720 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|             |-Typedef 0x7fb38fd576a0 'type'
|             `-ElaboratedType 0x7fb38fd57650 'typename class allocator<int>::size_type' sugar
|               `-TypedefType 0x7fb38fd56b90 'std::__1::allocator<int>::size_type' sugar
|                 |-Typedef 0x7fb38fd490b8 'size_type'
|                 `-TypedefType 0x7fb38f85a210 'size_t' sugar
|                   |-Typedef 0x7fb38f0673b0 'size_t'
|                   `-BuiltinType 0x7fb38f032c80 'unsigned long'
|-TypedefDecl 0x7fb38fd75860 <line:466:5, col:54> col:54 difference_type 'typename __base::difference_type':'long'
| `-ElaboratedType 0x7fb38fd75810 'typename __base::difference_type' sugar
|   `-TypedefType 0x7fb38fd757f0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x7fb38fd69150 'difference_type'
|     `-ElaboratedType 0x7fb38fd69100 'typename __alloc_traits::difference_type' sugar
|       `-TypedefType 0x7fb38fd55fb0 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|         |-Typedef 0x7fb38fd55f40 'difference_type'
|         `-ElaboratedType 0x7fb38fd55ef0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|           `-TypedefType 0x7fb38fd55ed0 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|             |-Typedef 0x7fb38fd55e50 'type'
|             `-ElaboratedType 0x7fb38fd55e00 'typename class allocator<int>::difference_type' sugar
|               `-TypedefType 0x7fb38fd55310 'std::__1::allocator<int>::difference_type' sugar
|                 |-Typedef 0x7fb38fd49110 'difference_type'
|                 `-TypedefType 0x7fb38f128f50 'ptrdiff_t' sugar
|                   |-Typedef 0x7fb38f067340 'ptrdiff_t'
|                   `-BuiltinType 0x7fb38f032be0 'long'
|-TypedefDecl 0x7fb38fd75930 <line:467:5, col:54> col:54 pointer 'typename __base::pointer':'int *'
| `-ElaboratedType 0x7fb38fd758e0 'typename __base::pointer' sugar
|   `-TypedefType 0x7fb38fd69370 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x7fb38fd69220 'pointer'
|     `-ElaboratedType 0x7fb38fd691d0 'typename __alloc_traits::pointer' sugar
|       `-TypedefType 0x7fb38fd4da30 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|         |-Typedef 0x7fb38fd4d9c0 'pointer'
|         `-ElaboratedType 0x7fb38fd4d970 'typename __pointer_type<value_type, allocator_type>::type' sugar
|           `-TypedefType 0x7fb38fd4d950 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|             |-Typedef 0x7fb38fd4d8d0 'type'
|             `-ElaboratedType 0x7fb38fd4d880 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|               `-TypedefType 0x7fb38fd4d860 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|                 |-Typedef 0x7fb38fd4d7e0 'type'
|                 `-ElaboratedType 0x7fb38fd4d790 'typename class allocator<int>::pointer' sugar
|                   `-TypedefType 0x7fb38fd49d90 'std::__1::allocator<int>::pointer' sugar
|                     |-Typedef 0x7fb38fd491d8 'pointer'
|                     `-PointerType 0x7fb38fd491a0 'int *'
|                       `-SubstTemplateTypeParmType 0x7fb38fd49170 'int' sugar
|                         |-TemplateTypeParmType 0x7fb39024afa0 '_Tp' dependent depth 0 index 0
|                         | `-TemplateTypeParm 0x7fb39024af58 '_Tp'
|                         `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd75a00 <line:468:5, col:54> col:54 const_pointer 'typename __base::const_pointer':'const int *'
| `-ElaboratedType 0x7fb38fd759b0 'typename __base::const_pointer' sugar
|   `-TypedefType 0x7fb38fd69400 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x7fb38fd69310 'const_pointer'
|     `-ElaboratedType 0x7fb38fd692c0 'typename __alloc_traits::const_pointer' sugar
|       `-TypedefType 0x7fb38fd692a0 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|         |-Typedef 0x7fb38fd4f250 'const_pointer'
|         `-ElaboratedType 0x7fb38fd4f200 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|           `-TypedefType 0x7fb38fd4f1e0 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x7fb38fd4f160 'type'
|             `-ElaboratedType 0x7fb38fd4f110 'typename class allocator<int>::const_pointer' sugar
|               `-TypedefType 0x7fb38fd49fe0 'std::__1::allocator<int>::const_pointer' sugar
|                 |-Typedef 0x7fb38fd49268 'const_pointer'
|                 `-PointerType 0x7fb38fd49230 'const int *'
|                   `-QualType 0x7fb38fd49171 'const int' const
|                     `-SubstTemplateTypeParmType 0x7fb38fd49170 'int' sugar
|                       |-TemplateTypeParmType 0x7fb39024afa0 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7fb39024af58 '_Tp'
|                       `-BuiltinType 0x7fb38f032bc0 'int'
|-TypedefDecl 0x7fb38fd75c18 <line:469:5, col:54> col:54 iterator '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::pointer>':'class std::__1::__wrap_iter<int *>'
| `-TemplateSpecializationType 0x7fb38fd75ba0 '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|   `-RecordType 0x7fb38fd75b80 'class std::__1::__wrap_iter<int *>'
|     `-ClassTemplateSpecialization 0x7fb38fd75a90 '__wrap_iter'
|-TypedefDecl 0x7fb38fd75e28 <line:470:5, col:54> col:54 const_iterator '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::const_pointer>':'class std::__1::__wrap_iter<const int *>'
| `-TemplateSpecializationType 0x7fb38fd75db0 '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::const_pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::const_pointer':'const int *'
|   `-RecordType 0x7fb38fd75d90 'class std::__1::__wrap_iter<const int *>'
|     `-ClassTemplateSpecialization 0x7fb38fd75ca0 '__wrap_iter'
|-TypedefDecl 0x7fb38fd76080 <line:471:5, col:55> col:55 reverse_iterator 'std::__1::reverse_iterator<iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<int *> >'
| `-ElaboratedType 0x7fb38fd76010 'std::__1::reverse_iterator<iterator>' sugar
|   `-TemplateSpecializationType 0x7fb38fd75fc0 'reverse_iterator<std::__1::vector<int, class std::__1::allocator<int> >::iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::iterator':'class std::__1::__wrap_iter<int *>'
|     `-RecordType 0x7fb38fd75fa0 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<int *> >'
|       `-ClassTemplateSpecialization 0x7fb38fd75eb0 'reverse_iterator'
|-TypedefDecl 0x7fb38fd762e0 <line:472:5, col:55> col:55 const_reverse_iterator 'std::__1::reverse_iterator<const_iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const int *> >'
| `-ElaboratedType 0x7fb38fd76270 'std::__1::reverse_iterator<const_iterator>' sugar
|   `-TemplateSpecializationType 0x7fb38fd76220 'reverse_iterator<std::__1::vector<int, class std::__1::allocator<int> >::const_iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|     `-RecordType 0x7fb38fd76200 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const int *> >'
|       `-ClassTemplateSpecialization 0x7fb38fd76110 'reverse_iterator'
|-StaticAssertDecl 0x7fb38fd76868 <line:474:5, line:475:74> line:474:5
| |-ParenExpr 0x7fb38fd76830 <col:19, col:83> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7fb38fd767f8 <col:20, col:78> 'const _Bool':'const _Bool' lvalue Var 0x7fb38fa83310 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fb3904a68e0 <line:475:19> 'const char [54]' lvalue "Allocator::value_type must be same type as value_type"
|-CXXConstructorDecl 0x7fb38fd76908 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:483:9> line:478:5 used vector 'void (void) noexcept(is_nothrow_default_constructible<allocator_type>::value)'
| `-AlwaysInlineAttr 0x7fb38fd76a28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb38fd76ba0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:495:5> line:484:40 vector 'void (const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)' noexcept-uninstantiated 0x7fb3904a6c58
| |-ParmVarDecl 0x7fb38fd76aa8 <col:47, col:69> col:69 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fb38fd76ca8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb38fd76e00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:496:5, col:34> col:14 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fb38fd76d20 <col:21, col:31> col:31 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXConstructorDecl 0x7fb38fd77070 <line:498:5, col:61> col:14 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fb38fd76ed0 <col:21, col:31> col:31 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fb38fd76f40 <col:36, col:58> col:58 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-CXXConstructorDecl 0x7fb38fd77310 <line:500:5, col:46> col:5 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fb38fd77148 <col:12, col:22> col:22 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fb38fd771e0 <col:27, col:43> col:43 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXConstructorDecl 0x7fb38fd77620 <line:501:5, col:73> col:5 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fb38fd773e8 <col:12, col:22> col:22 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fb38fd77458 <col:27, col:43> col:43 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ParmVarDecl 0x7fb38fd774c8 <col:48, col:70> col:70 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-FunctionTemplateDecl 0x7fb38fd780b8 <line:502:5, line:509:62> line:503:9 vector
| |-TemplateTypeParmDecl 0x7fb38fd776f0 <line:502:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7fb38fd78010 <line:503:9, line:509:62> line:503:9 vector 'void (_InputIterator, typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, _InputIterator>::type)'
|   |-ParmVarDecl 0x7fb38fd77780 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x7fb38fd77ee0 <line:504:16, line:509:56> col:56 __last 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, _InputIterator>::type'
|-FunctionTemplateDecl 0x7fb38fd78c28 <line:510:5, line:516:108> line:511:9 vector
| |-TemplateTypeParmDecl 0x7fb38fd781a0 <line:510:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7fb38fd78b80 <line:511:9, line:516:108> line:511:9 vector 'void (_InputIterator, _InputIterator, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &, typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value>::type *)'
|   |-ParmVarDecl 0x7fb38fd78230 <col:16, col:31> col:31 __first '_InputIterator'
|   |-ParmVarDecl 0x7fb38fd782a0 <col:40, col:55> col:55 __last '_InputIterator'
|   |-ParmVarDecl 0x7fb38fd78310 <col:63, col:85> col:85 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|   `-ParmVarDecl 0x7fb38fd78a20 <line:512:16, line:516:107> col:105 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value>::type *'
|-FunctionTemplateDecl 0x7fb38fd79538 <line:517:5, line:523:64> line:518:9 vector
| |-TemplateTypeParmDecl 0x7fb38fd78d20 <line:517:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXConstructorDecl 0x7fb38fd79490 <line:518:9, line:523:64> line:518:9 vector 'void (_ForwardIterator, typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, _ForwardIterator>::type)'
|   |-ParmVarDecl 0x7fb38fd78db0 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fb38fd79360 <line:519:16, line:523:58> col:58 __last 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, _ForwardIterator>::type'
|-FunctionTemplateDecl 0x7fb38fd79f68 <line:524:5, line:529:110> line:525:9 vector
| |-TemplateTypeParmDecl 0x7fb38fd79620 <line:524:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXConstructorDecl 0x7fb38fd79ec0 <line:525:9, line:529:110> line:525:9 vector 'void (_ForwardIterator, _ForwardIterator, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &, typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value>::type *)'
|   |-ParmVarDecl 0x7fb38fd796b0 <col:16, col:33> col:33 __first '_ForwardIterator'
|   |-ParmVarDecl 0x7fb38fd79720 <col:42, col:59> col:59 __last '_ForwardIterator'
|   |-ParmVarDecl 0x7fb38fd79790 <col:67, col:89> col:89 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|   `-ParmVarDecl 0x7fb38fd79d60 <line:526:16, line:529:109> col:107 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value>::type *'
|-CXXConstructorDecl 0x7fb38fd7a320 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:532:45> col:5 vector 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7fb38fd7a1f8 <col:12, col:41> col:41 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7fb38fd7a3e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb38fd7a660 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:534:72> col:5 vector 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fb38fd7a4b8 <col:12, col:41> col:41 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| |-ParmVarDecl 0x7fb38fd7a528 <col:47, col:69> col:69 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fb38fd7a728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb38fd7a890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:544:5, col:29> col:5 vector 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &)'
| `-ParmVarDecl 0x7fb38fd7a7a8 <col:12, col:26> col:26 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
|-CXXConstructorDecl 0x7fb38fd7ab00 <line:545:5, col:56> col:5 vector 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fb38fd7a960 <col:12, col:26> col:26 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x7fb38fd7a9d0 <col:31, col:53> col:53 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-CXXMethodDecl 0x7fb38fd7acd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:547:40> col:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(const class std::__1::vector<int, class std::__1::allocator<int> > &)'
| |-ParmVarDecl 0x7fb38fd7ac08 <col:23, col:37> col:37 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7fb38fd7ad80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb38fd7af40 <col:35, line:739:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:550:5 vector 'void (class std::__1::vector<int, class std::__1::allocator<int> > &&)' noexcept-uninstantiated 0x7fb3904aae38
| |-ParmVarDecl 0x7fb38fd7ae08 <col:12, col:21> col:21 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| `-AlwaysInlineAttr 0x7fb38fd7b048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb38fd7b240 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:557:51> col:5 vector 'void (class std::__1::vector<int, class std::__1::allocator<int> > &&, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fb38fd7b0a0 <col:12, col:21> col:21 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| |-ParmVarDecl 0x7fb38fd7b110 <col:26, col:48> col:48 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fb38fd7b308 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7b470 <col:35, line:739:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:559:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(class std::__1::vector<int, class std::__1::allocator<int> > &&)' noexcept-uninstantiated 0x7fb3904ab358
| |-ParmVarDecl 0x7fb38fd7b360 <col:23, col:32> col:32 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| `-AlwaysInlineAttr 0x7fb38fd7b568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7b740 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:565:57> line:564:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7fb38fd7b638 <col:23, col:52> col:52 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7fb38fd7b7f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7fb38fd7c0a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:568:5, line:578:61> col:9 assign
| |-TemplateTypeParmDecl 0x7fb38fd7b838 <line:568:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fb38fd7c010 <line:569:9, line:578:61> col:9 assign 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, void>::type (_InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x7fb38fd7be80 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x7fb38fd7bef0 <col:40, col:55> col:55 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fb38fd7c8b8 <line:579:5, line:588:65> col:9 assign
| |-TemplateTypeParmDecl 0x7fb38fd7c190 <line:579:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fb38fd7c820 <line:580:9, line:588:65> col:9 assign 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, void>::type (_ForwardIterator, _ForwardIterator)'
|   |-ParmVarDecl 0x7fb38fd7c690 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fb38fd7c700 <col:42, col:59> col:59 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fb38fd7cab0 <line:590:5, col:51> col:10 assign 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fb38fd7c9b0 <col:17, col:27> col:27 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fb38fd7ca20 <col:32, col:48> col:48 __u 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7fb38fd7ccc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:594:43> line:593:10 assign 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7fb38fd7cbf8 <col:17, col:46> col:46 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7fb38fd7cd70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7ce48 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:599:33> line:598:20 get_allocator 'std::__1::vector<int, class std::__1::allocator<int> >::allocator_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd7cef0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7cfc8 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:601:54 begin 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fb38fd7d070 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7d148 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:602:54 begin 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd7d1f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7d260 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:603:54 end 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fb38fd7d308 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7d378 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:604:54 end 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd7d420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7d518 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:608:47> line:607:28 rbegin 'std::__1::vector<int, class std::__1::allocator<int> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fb38fd7d5c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7d6b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:611:47> line:610:28 rbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd7d760 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7d7d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:614:49> line:613:28 rend 'std::__1::vector<int, class std::__1::allocator<int> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fb38fd7d878 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7d8e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:617:49> line:616:28 rend 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd7d990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7da00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:621:25> line:620:28 cbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd7daa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7db18 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:624:23> line:623:28 cend 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd7dbc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7dc30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:627:26> line:626:28 crbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd7dcd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7dd48 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:630:24> line:629:28 crend 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd7ddf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7de98 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:634:71> line:633:15 size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd7df40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7dfb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:637:36> line:636:15 capacity 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd7e058 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7e0a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:640:48> line:639:10 empty '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd7e148 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7e1b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:641:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:641:15 max_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
|-CXXMethodDecl 0x7fb38fd7e2f8 <line:642:5, col:31> col:10 reserve 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fb38fd7e270 <col:18, col:28> col:28 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fb38fd7e3a8 <line:643:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:643:10 shrink_to_fit 'void (void) noexcept'
|-CXXMethodDecl 0x7fb38fd7e580 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:645:71> col:47 operator[] 'std::__1::vector<int, class std::__1::allocator<int> >::reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| |-ParmVarDecl 0x7fb38fd7e480 <col:58, col:68> col:68 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fb38fd7e630 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7e790 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:646:73> col:47 operator[] 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fb38fd7e688 <col:58, col:68> col:68 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fb38fd7e840 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7e920 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:647:5, col:37> col:21 at 'std::__1::vector<int, class std::__1::allocator<int> >::reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fb38fd7e898 <col:24, col:34> col:34 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fb38fd7ea68 <line:648:5, col:39> col:21 at 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| `-ParmVarDecl 0x7fb38fd7e9e0 <col:24, col:34> col:34 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fb38fd7eba0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:654:5> line:650:47 front 'std::__1::vector<int, class std::__1::allocator<int> >::reference (void)'
| `-AlwaysInlineAttr 0x7fb38fd7ec48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7ed10 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:659:5> line:655:47 front 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7fb38fd7edb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7ee20 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:664:5> line:660:47 back 'std::__1::vector<int, class std::__1::allocator<int> >::reference (void)'
| `-AlwaysInlineAttr 0x7fb38fd7eec8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7ef30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:669:5> line:665:47 back 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7fb38fd7efd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7f0a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:673:57> line:672:23 data 'std::__1::vector<int, class std::__1::allocator<int> >::value_type *(void) noexcept'
| `-AlwaysInlineAttr 0x7fb38fd7f150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7f258 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:676:57> line:675:23 data 'const std::__1::vector<int, class std::__1::allocator<int> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd7f300 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7f460 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:678:65> col:36 push_back 'void (std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fb38fd7f358 <col:46, col:62> col:62 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-AlwaysInlineAttr 0x7fb38fd7f510 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd7f6d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:680:62> col:36 push_back 'void (std::__1::vector<int, class std::__1::allocator<int> >::value_type &&)'
| |-ParmVarDecl 0x7fb38fd7f5c8 <col:46, col:59> col:59 __x 'std::__1::vector<int, class std::__1::allocator<int> >::value_type &&'
| `-AlwaysInlineAttr 0x7fb38fd7f780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7fb38fd7fa38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:682:5, line:687:49> col:19 emplace_back
| |-TemplateTypeParmDecl 0x7fb38fd7f7c8 <line:682:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x7fb38fd7f9a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:687:49> col:19 emplace_back 'void (_Args &&...)'
|   |-ParmVarDecl 0x7fb38fd7f8d8 <col:32, col:43> col:43 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7fb38fd7fa90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7fb38fd7fb60 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:692:19> col:10 pop_back 'void (void)'
| `-AlwaysInlineAttr 0x7fb38fd7fc08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7fb38fd7fde0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:694:5, col:67> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fb38fd7fc60 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x7fb38fd7fcd0 <col:48, col:64> col:64 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7fb38fd80030 <line:696:5, col:64> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::value_type &&)'
| |-ParmVarDecl 0x7fb38fd7fea8 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x7fb38fd7ff18 <col:48, col:61> col:61 __x 'std::__1::vector<int, class std::__1::allocator<int> >::value_type &&'
|-FunctionTemplateDecl 0x7fb38fd80898 <line:698:5, line:699:70> col:18 emplace
| |-TemplateTypeParmDecl 0x7fb38fd800e8 <line:698:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x7fb38fd80800 <line:699:9, col:70> col:18 emplace 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _Args &&...)'
|   |-ParmVarDecl 0x7fb38fd80180 <col:26, col:41> col:41 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   `-ParmVarDecl 0x7fb38fd80268 <col:53, col:64> col:64 __args '_Args &&...'
|-CXXMethodDecl 0x7fb38fd80ba0 <line:702:5, col:82> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fb38fd80990 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| |-ParmVarDecl 0x7fb38fd80a00 <col:48, col:58> col:58 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fb38fd80a70 <col:63, col:79> col:79 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-FunctionTemplateDecl 0x7fb38fd81618 <line:703:5, line:713:88> col:9 insert
| |-TemplateTypeParmDecl 0x7fb38fd80c60 <line:703:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fb38fd81580 <line:704:9, line:713:88> col:9 insert 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, iterator>::type (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x7fb38fd81360 <col:16, col:31> col:31 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   |-ParmVarDecl 0x7fb38fd813d0 <col:43, col:58> col:58 __first '_InputIterator'
|   `-ParmVarDecl 0x7fb38fd81440 <col:67, col:82> col:82 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fb38fd81f88 <line:714:5, line:723:92> col:9 insert
| |-TemplateTypeParmDecl 0x7fb38fd81708 <line:714:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fb38fd81ef0 <line:715:9, line:723:92> col:9 insert 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, iterator>::type (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _ForwardIterator, _ForwardIterator)'
|   |-ParmVarDecl 0x7fb38fd81cd0 <col:16, col:31> col:31 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   |-ParmVarDecl 0x7fb38fd81d40 <col:43, col:60> col:60 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fb38fd81db0 <col:69, col:86> col:86 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fb38fd82290 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:727:62> line:726:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7fb38fd82088 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| |-ParmVarDecl 0x7fb38fd82178 <col:48, col:77> col:77 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7fb38fd82348 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd824a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:730:71> col:40 erase 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator)'
| |-ParmVarDecl 0x7fb38fd823a0 <col:46, col:61> col:61 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-AlwaysInlineAttr 0x7fb38fd82550 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd82730 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:731:5, col:65> col:14 erase 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::const_iterator)'
| |-ParmVarDecl 0x7fb38fd825a8 <col:20, col:35> col:35 __first 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x7fb38fd82618 <col:44, col:59> col:59 __last 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|-CXXMethodDecl 0x7fb38fd827e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:740:5> line:734:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fb38fd82890 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd82970 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:742:5, col:31> col:10 resize 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fb38fd828e8 <col:17, col:27> col:27 __sz 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fb38fd82b30 <line:743:5, col:52> col:10 resize 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fb38fd82a30 <col:17, col:27> col:27 __sz 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fb38fd82aa0 <col:33, col:49> col:49 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7fb38fd82d08 <line:745:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:745:10 swap 'void (class std::__1::vector<int, class std::__1::allocator<int> > &) noexcept'
| `-ParmVarDecl 0x7fb38fd82bf8 <col:15, col:21> col:22 'class std::__1::vector<int, class std::__1::allocator<int> > &'
|-CXXMethodDecl 0x7fb38fd82db8 <line:753:5, col:25> col:10 __invariants '_Bool (void) const'
|-AccessSpecDecl 0x7fb38fd82e60 <line:764:1, col:8> col:1 private
|-CXXMethodDecl 0x7fb38fd82e88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:765:63> col:36 __invalidate_all_iterators 'void (void)'
| `-AlwaysInlineAttr 0x7fb38fd82f30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd83050 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:766:82> col:36 __invalidate_iterators_past 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x7fb38fd82f88 <col:64, col:72> col:72 __new_last 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7fb38fd83100 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd831e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:767:5, col:32> col:10 allocate 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fb38fd83158 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fb38fd83290 <line:768:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:768:10 deallocate 'void (void) noexcept'
|-CXXMethodDecl 0x7fb38fd83410 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:769:75> col:41 __recommend 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fb38fd83348 <col:53, col:63> col:63 __new_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fb38fd834c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd835a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:770:5, col:42> col:10 __construct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fb38fd83518 <col:29, col:39> col:39 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fb38fd83760 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:772:63> col:10 __construct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fb38fd83660 <col:29, col:39> col:39 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fb38fd836d0 <col:44, col:60> col:60 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-AlwaysInlineAttr 0x7fb38fd83818 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-FunctionTemplateDecl 0x7fb38fd83d98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:773:5, line:779:92> col:9 __construct_at_end
| |-TemplateTypeParmDecl 0x7fb38fd83860 <line:773:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fb38fd83d00 <line:774:9, line:779:92> col:9 __construct_at_end 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value, void>::type (_ForwardIterator, _ForwardIterator, std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
|   |-ParmVarDecl 0x7fb38fd83ae0 <col:28, col:45> col:45 __first '_ForwardIterator'
|   |-ParmVarDecl 0x7fb38fd83b50 <col:54, col:71> col:71 __last '_ForwardIterator'
|   `-ParmVarDecl 0x7fb38fd83bc0 <col:79, col:89> col:89 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fb38fd83f20 <line:780:5, col:32> col:10 __append 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fb38fd83e98 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fb38fd840e0 <line:781:5, col:53> col:10 __append 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fb38fd83fe0 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fb38fd84050 <col:34, col:50> col:50 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7fb38fd842b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:783:20 __make_iter 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x7fb38fd841a8 <col:32, col:40> col:40 __p 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7fb38fd84368 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd844c8 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:785:20 __make_iter 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_pointer) const noexcept'
| |-ParmVarDecl 0x7fb38fd843c0 <col:32, col:46> col:46 __p 'std::__1::vector<int, class std::__1::allocator<int> >::const_pointer':'const int *'
| `-AlwaysInlineAttr 0x7fb38fd84578 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd84940 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:786:5, col:85> col:10 __swap_out_circular_buffer 'void (__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &)'
| `-ParmVarDecl 0x7fb38fd84838 <col:37, col:82> col:82 __v '__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &'
|-CXXMethodDecl 0x7fb38fd84c70 <line:787:5, col:101> col:13 __swap_out_circular_buffer 'std::__1::vector<int, class std::__1::allocator<int> >::pointer (__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &, std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x7fb38fd84ae8 <col:40, col:85> col:85 __v '__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &'
| `-ParmVarDecl 0x7fb38fd84b58 <col:90, col:98> col:98 __p 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|-CXXMethodDecl 0x7fb38fd84f50 <line:788:5, col:71> col:10 __move_range 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer, std::__1::vector<int, class std::__1::allocator<int> >::pointer, std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x7fb38fd84d38 <col:23, col:31> col:31 __from_s 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| |-ParmVarDecl 0x7fb38fd84da8 <col:41, col:49> col:49 __from_e 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-ParmVarDecl 0x7fb38fd84e18 <col:59, col:67> col:67 __to 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|-CXXMethodDecl 0x7fb38fd851a0 <line:789:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:739:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:789:10 __move_assign 'void (class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::true_type)' noexcept-uninstantiated 0x7fb391228608
| |-ParmVarDecl 0x7fb38fd85020 <col:24, col:32> col:32 __c 'class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x7fb38fd85080 <col:37> col:46 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
|-CXXMethodDecl 0x7fb38fd85440 <line:791:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:739:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:791:10 __move_assign 'void (class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::false_type)' noexcept-uninstantiated 0x7fb391228848
| |-ParmVarDecl 0x7fb38fd852c0 <col:24, col:32> col:32 __c 'class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x7fb38fd85320 <col:37> col:47 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
|-CXXMethodDecl 0x7fb38fd85628 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:800:5> line:794:10 __destruct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x7fb38fd85560 <col:28, col:36> col:36 __new_last 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7fb38fd856d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7fb38fd85938 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:801:5, line:804:40> col:9 __push_back_slow_path
| |-TemplateTypeParmDecl 0x7fb38fd85720 <line:801:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXMethodDecl 0x7fb38fd858a0 <line:802:9, line:804:40> col:9 __push_back_slow_path 'void (_Up &&)'
|   `-ParmVarDecl 0x7fb38fd857d8 <col:31, col:37> col:37 __x '_Up &&'
|-FunctionTemplateDecl 0x7fb38fd85c88 <line:809:5, line:811:51> col:9 __emplace_back_slow_path
| |-TemplateTypeParmDecl 0x7fb38fd85a18 <line:809:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x7fb38fd85bf0 <line:810:9, line:811:51> col:9 __emplace_back_slow_path 'void (_Args &&...)'
|   `-ParmVarDecl 0x7fb38fd85b28 <col:34, col:45> col:45 __args '_Args &&...'
|-CXXMethodDecl 0x7fb38fd85f28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:829:62> line:828:10 __annotate_contiguous_container 'void (const void *, const void *, const void *, const void *) const'
| |-ParmVarDecl 0x7fb38fd85d68 <col:42, col:52> col:53 'const void *'
| |-ParmVarDecl 0x7fb38fd85dc8 <col:55, col:65> col:66 'const void *'
| |-ParmVarDecl 0x7fb38fd85e28 <col:68, col:78> col:79 'const void *'
| |-ParmVarDecl 0x7fb38fd85e88 <line:829:42, col:52> col:53 'const void *'
| `-AlwaysInlineAttr 0x7fb38fd85ff0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd86150 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:835:5> line:832:10 __annotate_new 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fb38fd86048 <col:25, col:35> col:35 __current_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fb38fd86200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd86248 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:841:5> line:838:10 __annotate_delete 'void (void) const'
| `-AlwaysInlineAttr 0x7fb38fd862f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd863d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:848:5> line:844:10 __annotate_increase 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fb38fd86348 <col:30, col:40> col:40 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fb38fd86480 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd86560 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:855:5> line:851:10 __annotate_shrink 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fb38fd864d8 <col:28, col:38> col:38 __old_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fb38fd86610 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXRecordDecl 0x7fb38fd86658 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:874:5, col:12> col:12 struct __RAII_IncreaseAnnotator
`-CXXDestructorDecl 0x7fb38fd86740 <line:452:28> col:28 implicit used ~vector 'void (void) noexcept' inline default
  `-CompoundStmt 0x7fb38fd88478 <col:28>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::vector" = type { %"class.std::__1::__vector_base" }
  NonVirtualBaseLLVMType:%"class.std::__1::vector" = type { %"class.std::__1::__vector_base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__atomic_base<_Bool, false>
         0 |   _Atomic(_Bool) __a_
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::atomic<_Bool>
         0 |   struct std::__1::__atomic_base<_Bool, false> (base)
         0 |     _Atomic(_Bool) __a_
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb38fd8a0c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:877:1, line:980:1> line:878:8 struct __atomic_base definition
|-TemplateArgument type '_Bool'
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7fb38fd8a300 prev 0x7fb38fd8a0c8 <col:1, col:8> col:8 implicit struct __atomic_base
|-FieldDecl 0x7fb38fd8a3e0 <line:880:5, col:26> col:26 __a_ '_Atomic(_Bool)' mutable
|-CXXMethodDecl 0x7fb38fd8a428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:894:5> line:887:10 is_lock_free '_Bool (void) const volatile noexcept'
| `-AlwaysInlineAttr 0x7fb38fd8a4f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd8a540 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:897:82> line:896:10 is_lock_free '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd8a5e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd8a7b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:901:46> line:899:10 store 'void (_Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fb38fd8a640 <col:16, col:20> col:20 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb38fd8a6a0 <col:25, col:44> col:38 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fb38fd8a870 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-DiagnoseIfAttr 0x7fb38fd8b850 <line:1070:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fb38fd8a7b8 'store' 'void (_Bool, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7fb38fd8b828 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:900:40, line:566:35> '_Bool' '||'
|     |-BinaryOperator 0x7fb38fd8b2e8 <line:900:40, line:565:35> '_Bool' '||'
|     | |-BinaryOperator 0x7fb38fd8ada8 <line:900:40, line:564:35> '_Bool' '=='
|     | | |-ImplicitCastExpr 0x7fb38fd8ad78 <line:900:40> 'int' <IntegralCast>
|     | | | `-ImplicitCastExpr 0x7fb38fd8ad60 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | | |   `-DeclRefExpr 0x7fb38fd8a8b8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb38fd8a6a0 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | | `-ImplicitCastExpr 0x7fb38fd8ad90 <line:564:35> 'int' <IntegralCast>
|     | |   `-DeclRefExpr 0x7fb38f11a0d8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb38f10fb40 'memory_order_consume' 'enum std::__1::memory_order'
|     | `-BinaryOperator 0x7fb38fd8b2c0 <line:900:40, line:565:35> '_Bool' '=='
|     |   |-ImplicitCastExpr 0x7fb38fd8b290 <line:900:40> 'int' <IntegralCast>
|     |   | `-ImplicitCastExpr 0x7fb38fd8b278 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     |   |   `-DeclRefExpr 0x7fb38fd8add0 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb38fd8a6a0 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     |   `-ImplicitCastExpr 0x7fb38fd8b2a8 <line:565:35> 'int' <IntegralCast>
|     |     `-DeclRefExpr 0x7fb38f11a198 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb38f10fb90 'memory_order_acquire' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fb38fd8b800 <line:900:40, line:566:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fb38fd8b7d0 <line:900:40> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fb38fd8b7b8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb38fd8b310 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb38fd8a6a0 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fb38fd8b7e8 <line:566:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fb38f11a280 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb38f10fc30 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fb38fd8ba48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:905:46> line:903:10 store 'void (_Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fb38fd8b8d0 <col:16, col:20> col:20 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb38fd8b930 <col:25, col:44> col:38 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fb38fd8bb00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-DiagnoseIfAttr 0x7fb38fd8cae0 <line:1070:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fb38fd8ba48 'store' 'void (_Bool, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7fb38fd8cab8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:904:40, line:566:35> '_Bool' '||'
|     |-BinaryOperator 0x7fb38fd8c578 <line:904:40, line:565:35> '_Bool' '||'
|     | |-BinaryOperator 0x7fb38fd8c038 <line:904:40, line:564:35> '_Bool' '=='
|     | | |-ImplicitCastExpr 0x7fb38fd8c008 <line:904:40> 'int' <IntegralCast>
|     | | | `-ImplicitCastExpr 0x7fb38fd8bff0 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | | |   `-DeclRefExpr 0x7fb38fd8bb48 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb38fd8b930 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | | `-ImplicitCastExpr 0x7fb38fd8c020 <line:564:35> 'int' <IntegralCast>
|     | |   `-DeclRefExpr 0x7fb38f11a4e0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb38f10fb40 'memory_order_consume' 'enum std::__1::memory_order'
|     | `-BinaryOperator 0x7fb38fd8c550 <line:904:40, line:565:35> '_Bool' '=='
|     |   |-ImplicitCastExpr 0x7fb38fd8c520 <line:904:40> 'int' <IntegralCast>
|     |   | `-ImplicitCastExpr 0x7fb38fd8c508 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     |   |   `-DeclRefExpr 0x7fb38fd8c060 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb38fd8b930 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     |   `-ImplicitCastExpr 0x7fb38fd8c538 <line:565:35> 'int' <IntegralCast>
|     |     `-DeclRefExpr 0x7fb38f11a5a0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb38f10fb90 'memory_order_acquire' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fb38fd8ca90 <line:904:40, line:566:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fb38fd8ca60 <line:904:40> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fb38fd8ca48 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb38fd8c5a0 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb38fd8b930 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fb38fd8ca78 <line:566:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fb38f11a688 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb38f10fc30 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fb38fd8cc58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:909:47> line:907:9 load '_Bool (std::__1::memory_order) const volatile noexcept'
| |-ParmVarDecl 0x7fb38fd8cb50 <col:14, col:33> col:27 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fb38fd8cd08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-DiagnoseIfAttr 0x7fb38fd8d7a8 <line:1070:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fb38fd8cc58 'load' '_Bool (std::__1::memory_order) const volatile noexcept'
|   `-BinaryOperator 0x7fb38fd8d780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:908:39, line:571:35> '_Bool' '||'
|     |-BinaryOperator 0x7fb38fd8d240 <line:908:39, line:570:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fb38fd8d210 <line:908:39> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fb38fd8d1f8 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fb38fd8cd50 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb38fd8cb50 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fb38fd8d228 <line:570:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fb38f11a870 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb38f10fbe0 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fb38fd8d758 <line:908:39, line:571:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fb38fd8d728 <line:908:39> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fb38fd8d710 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb38fd8d268 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb38fd8cb50 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fb38fd8d740 <line:571:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fb38f11a930 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb38f10fc30 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fb38fd8d928 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:913:47> line:911:9 load '_Bool (std::__1::memory_order) const noexcept'
| |-ParmVarDecl 0x7fb38fd8d818 <col:14, col:33> col:27 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fb38fd8d9d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-DiagnoseIfAttr 0x7fb38fd8e478 <line:1070:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fb38fd8d928 'load' '_Bool (std::__1::memory_order) const noexcept'
|   `-BinaryOperator 0x7fb38fd8e450 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:912:39, line:571:35> '_Bool' '||'
|     |-BinaryOperator 0x7fb38fd8df10 <line:912:39, line:570:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fb38fd8dee0 <line:912:39> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fb38fd8dec8 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fb38fd8da20 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb38fd8d818 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fb38fd8def8 <line:570:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fb38f11ab18 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb38f10fbe0 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fb38fd8e428 <line:912:39, line:571:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fb38fd8e3f8 <line:912:39> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fb38fd8e3e0 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb38fd8df38 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb38fd8d818 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fb38fd8e410 <line:571:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fb38f11abd8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb38f10fc30 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXConversionDecl 0x7fb38fd8e558 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:915:60> col:5 operator bool '_Bool (void) const volatile noexcept'
| `-AlwaysInlineAttr 0x7fb38fd8e600 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConversionDecl 0x7fb38fd8e6b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:917:60> col:5 operator bool '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38fd8e760 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd8e948 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:920:56> line:919:9 exchange '_Bool (_Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fb38fd8e7c8 <col:18, col:22> col:22 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb38fd8e828 <col:27, col:46> col:40 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fb38fd8ea00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd8ebd8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:923:56> line:922:9 exchange '_Bool (_Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fb38fd8ea58 <col:18, col:22> col:22 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb38fd8eab8 <col:27, col:46> col:40 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fb38fd8ec90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fd8ef98 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:928:80> line:925:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fb38fd8ed18 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7fb38fd8ed88 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb38fd8ede8 <line:926:32, col:45> col:45 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fb38fd8ee48 <col:50, col:63> col:63 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fb38fd8f060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-DiagnoseIfAttr 0x7fb38fd8fb00 <line:1070:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fb38fd8ef98 'compare_exchange_weak' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7fb38fd8fad8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:927:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fb38fd8f598 <line:927:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fb38fd8f568 <line:927:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fb38fd8f550 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fb38fd8f0a8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb38fd8ee48 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fb38fd8f580 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fb38f121fc0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb38f10fbe0 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fb38fd8fab0 <line:927:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fb38fd8fa80 <line:927:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fb38fd8fa68 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb38fd8f5c0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb38fd8ee48 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fb38fd8fa98 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fb38f122080 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb38f10fc30 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fb38fd8fdf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:933:80> line:930:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fb38fd8fb80 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7fb38fd8fbf0 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb38fd8fc50 <line:931:32, col:45> col:45 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fb38fd8fcb0 <col:50, col:63> col:63 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fb38fd8fec0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-DiagnoseIfAttr 0x7fb3904b5f88 <line:1070:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fb38fd8fdf8 'compare_exchange_weak' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7fb3904b5f60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:932:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fb38fd903f8 <line:932:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fb38fd903c8 <line:932:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fb38fd903b0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fb38fd8ff08 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb38fd8fcb0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fb38fd903e0 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fb38f122268 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb38f10fbe0 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fb3904b5f38 <line:932:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fb3904b5f08 <line:932:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fb3904b5ef0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb38fd90420 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb38fd8fcb0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fb3904b5f20 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fb38f122328 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb38f10fc30 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fb3904b61e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:938:82> line:935:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fb3904b6008 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7fb3904b6078 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb3904b60d8 <line:936:34, col:47> col:47 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fb3904b6138 <col:52, col:65> col:65 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fb3904b62a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-DiagnoseIfAttr 0x7fb3904b6d48 <line:1070:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fb3904b61e0 'compare_exchange_strong' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7fb3904b6d20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:937:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fb3904b67e0 <line:937:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fb3904b67b0 <line:937:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fb3904b6798 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fb3904b62f0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb3904b6138 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fb3904b67c8 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fb38f122510 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb38f10fbe0 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fb3904b6cf8 <line:937:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fb3904b6cc8 <line:937:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fb3904b6cb0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb3904b6808 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb3904b6138 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fb3904b6ce0 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fb38f1225d0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb38f10fc30 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fb3904b6fa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:943:82> line:940:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fb3904b6dc8 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7fb3904b6e38 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb3904b6e98 <line:941:34, col:47> col:47 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fb3904b6ef8 <col:52, col:65> col:65 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fb3904b7068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-DiagnoseIfAttr 0x7fb3904b7b08 <line:1070:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fb3904b6fa0 'compare_exchange_strong' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7fb3904b7ae0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:942:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fb3904b75a0 <line:942:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fb3904b7570 <line:942:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fb3904b7558 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fb3904b70b0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb3904b6ef8 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fb3904b7588 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fb38f1227b8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb38f10fbe0 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fb3904b7ab8 <line:942:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fb3904b7a88 <line:942:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fb3904b7a70 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb3904b75c8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb3904b6ef8 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fb3904b7aa0 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fb38f122878 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb38f10fc30 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fb3904b7d98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:947:80> line:945:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fb3904b7b88 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7fb3904b7bf8 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb3904b7c58 <line:946:31, col:50> col:44 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fb3904b7e58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3904b80b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:951:80> line:949:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fb3904b7eb0 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7fb3904b7f20 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb3904b7f80 <line:950:32, col:51> col:45 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fb3904b8178 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3904b8340 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:955:82> line:953:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fb3904b81d0 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7fb3904b8240 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb3904b82a0 <line:954:31, col:50> col:44 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fb3904b8400 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3904b85c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:959:82> line:957:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fb3904b8458 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7fb3904b84c8 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb3904b8528 <line:958:34, col:53> col:47 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fb3904b8688 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb3904b8710 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:963:39> col:5 __atomic_base 'void (void) noexcept' default trivial
| `-AlwaysInlineAttr 0x7fb3904b87c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb3904b8908 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:969:69> col:23 used constexpr __atomic_base 'void (_Bool) noexcept'
| |-ParmVarDecl 0x7fb3904b8820 <col:37, col:41> col:41 used __d '_Bool':'_Bool'
| |-CXXCtorInitializer Field 0x7fb38fd8a3e0 '__a_' '_Atomic(_Bool)'
| | `-ImplicitCastExpr 0x7fb3904ba428 <col:63> '_Atomic(_Bool)' <NonAtomicToAtomic>
| |   `-ImplicitCastExpr 0x7fb3904ba410 <col:63> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7fb3904ba3b8 <col:63> '_Bool':'_Bool' lvalue ParmVar 0x7fb3904b8820 '__d' '_Bool':'_Bool'
| |-CompoundStmt 0x7fb38f11bbd8 <col:68, col:69>
| `-AlwaysInlineAttr 0x7fb3904b89c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb3904b8b30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:971:5, col:48> col:5 __atomic_base 'void (const struct std::__1::__atomic_base<_Bool, false> &)' delete trivial
| `-ParmVarDecl 0x7fb3904b8a48 <col:19, col:38> col:39 'const struct std::__1::__atomic_base<_Bool, false> &'
|-CXXMethodDecl 0x7fb3904b8cf0 <line:972:5, col:59> col:20 operator= 'struct std::__1::__atomic_base<_Bool, false> &(const struct std::__1::__atomic_base<_Bool, false> &)' delete trivial
| `-ParmVarDecl 0x7fb3904b8c28 <col:30, col:49> col:50 'const struct std::__1::__atomic_base<_Bool, false> &'
|-CXXMethodDecl 0x7fb3904b8e70 <line:973:5, col:68> col:20 operator= 'struct std::__1::__atomic_base<_Bool, false> &(const struct std::__1::__atomic_base<_Bool, false> &) volatile' delete trivial
| `-ParmVarDecl 0x7fb3904b8db0 <col:30, col:49> col:50 'const struct std::__1::__atomic_base<_Bool, false> &'
`-CXXDestructorDecl 0x7fb3904ba238 <line:878:8> col:8 implicit ~__atomic_base 'void (void)' inline default trivial noexcept-unevaluated 0x7fb3904ba238

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__atomic_base" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__atomic_base" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb38f134aa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1070:1, line:1086:1> line:1071:8 struct atomic definition
|-public '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>'
|-TemplateArgument type '_Bool'
|-CXXRecordDecl 0x7fb3904b8fa8 prev 0x7fb38f134aa8 <col:1, col:8> col:8 implicit struct atomic
|-TypedefDecl 0x7fb3904b9348 <line:1074:5, col:32> col:32 __base '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>'
| `-TemplateSpecializationType 0x7fb3904b92d0 '__atomic_base<_Bool>' sugar __atomic_base
|   |-TemplateArgument type '_Bool':'_Bool'
|   `-RecordType 0x7fb38fd8a1d0 'struct std::__1::__atomic_base<_Bool, false>'
|     `-ClassTemplateSpecialization 0x7fb38fd8a0c8 '__atomic_base'
|-CXXConstructorDecl 0x7fb3904b93e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, line:798:33> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1076:5 atomic 'void (void)' default trivial noexcept-unevaluated 0x7fb3904b93e0
| `-AlwaysInlineAttr 0x7fb3904b94c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb3904b9608 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1078:64> col:23 used constexpr atomic 'void (_Bool) noexcept'
| |-ParmVarDecl 0x7fb3904b9520 <col:30, col:34> col:34 used __d '_Bool':'_Bool'
| |-CXXCtorInitializer 'std::__1::atomic<_Bool>::__base':'struct std::__1::__atomic_base<_Bool, false>'
| | `-CXXConstructExpr 0x7fb3904ba470 <col:51, col:61> '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>' 'void (_Bool) noexcept'
| |   `-ImplicitCastExpr 0x7fb3904ba3a0 <col:58> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7fb3904ba318 <col:58> '_Bool':'_Bool' lvalue ParmVar 0x7fb3904b9520 '__d' '_Bool':'_Bool'
| |-CompoundStmt 0x7fb38f127700 <col:63, col:64>
| `-AlwaysInlineAttr 0x7fb3904b96c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3904b9828 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1082:41> line:1081:9 operator= '_Bool (_Bool) volatile noexcept'
| |-ParmVarDecl 0x7fb3904b9720 <col:19, col:23> col:23 __d '_Bool':'_Bool'
| `-AlwaysInlineAttr 0x7fb3904b98d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3904b9a38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1085:41> line:1084:9 operator= '_Bool (_Bool) noexcept'
| |-ParmVarDecl 0x7fb3904b9930 <col:19, col:23> col:23 __d '_Bool':'_Bool'
| `-AlwaysInlineAttr 0x7fb3904b9ae8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb3904b9b58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1071:8> col:8 implicit atomic 'void (const struct std::__1::atomic<_Bool> &)' inline default_delete trivial noexcept-unevaluated 0x7fb3904b9b58
| `-ParmVarDecl 0x7fb3904b9c80 <col:8> col:8 'const struct std::__1::atomic<_Bool> &'
|-CXXConstructorDecl 0x7fb3904b9d18 <col:8> col:8 implicit atomic 'void (struct std::__1::atomic<_Bool> &&)' inline default_delete trivial noexcept-unevaluated 0x7fb3904b9d18
| `-ParmVarDecl 0x7fb3904b9e40 <col:8> col:8 'struct std::__1::atomic<_Bool> &&'
|-CXXMethodDecl 0x7fb3904b9ed8 <col:8, <invalid sloc>> col:8 implicit operator= 'struct std::__1::atomic<_Bool> &(const struct std::__1::atomic<_Bool> &)' inline default_delete trivial noexcept-unevaluated 0x7fb3904b9ed8
| `-ParmVarDecl 0x7fb3904b9ff0 <col:8> col:8 'const struct std::__1::atomic<_Bool> &'
`-CXXMethodDecl 0x7fb3904ba058 <col:8, <invalid sloc>> col:8 implicit operator= 'struct std::__1::atomic<_Bool> &(struct std::__1::atomic<_Bool> &&)' inline default_delete trivial noexcept-unevaluated 0x7fb3904ba058
  `-ParmVarDecl 0x7fb3904ba170 <col:8> col:8 'struct std::__1::atomic<_Bool> &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::atomic" = type { %"struct.std::__1::__atomic_base" }
  NonVirtualBaseLLVMType:%"struct.std::__1::atomic" = type { %"struct.std::__1::__atomic_base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb38fa5f780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:487:1, line:588:1> line:488:28 class duration definition
|-TemplateArgument type 'long long'
|-TemplateArgument type 'class std::__1::ratio<1, 1000>'
|-CXXRecordDecl 0x7fb38fb0ba58 prev 0x7fb38fa5f780 <col:1, col:28> col:28 implicit class duration
|-StaticAssertDecl 0x7fb38fb0bc10 <line:490:5, col:97> col:5
| |-UnaryOperator 0x7fb38fb0bbf0 <col:19, col:41> '_Bool' prefix '!'
| | `-ImplicitCastExpr 0x7fb38fb0bbd8 <col:20, col:41> '_Bool':'_Bool' <LValueToRValue>
| |   `-DeclRefExpr 0x7fb38fb0bba0 <col:20, col:41> 'const _Bool':'const _Bool' lvalue Var 0x7fb38f9f3548 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fb38fa56a28 <col:48> 'const char [48]' lvalue "A duration representation can not be a duration"
|-StaticAssertDecl 0x7fb38fb0c198 <line:491:5, col:107> col:5
| |-DeclRefExpr 0x7fb38fb0c148 <col:19, col:40> 'const _Bool':'const _Bool' lvalue Var 0x7fb38fa83310 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fb38fa56c98 <col:47> 'const char [59]' lvalue "Second template parameter of duration must be a std::ratio"
|-StaticAssertDecl 0x7fb38fb0f070 <line:492:5, col:71> col:5
| |-BinaryOperator 0x7fb38fb0f048 <col:19, col:34> '_Bool' '>'
| | |-ImplicitCastExpr 0x7fb38fb0f018 <col:19, col:28> 'intmax_t':'long' <LValueToRValue>
| | | `-DeclRefExpr 0x7fb38fb0efe0 <col:19, col:28> 'const intmax_t':'const long' lvalue Var 0x7fb38fb0ea50 'num' 'const intmax_t':'const long'
| | `-ImplicitCastExpr 0x7fb38fb0f030 <col:34> 'long' <IntegralCast>
| |   `-IntegerLiteral 0x7fb38fa56dc8 <col:34> 'int' 0
| `-StringLiteral 0x7fb38fa56ee0 <col:37> 'const char [33]' lvalue "duration period must be positive"
|-ClassTemplateDecl 0x7fb38fb0f240 <line:494:5, line:495:12> col:12 __no_overflow
| |-TemplateTypeParmDecl 0x7fb38fb0f0a8 <line:494:15, col:21> col:21 class depth 0 index 0 _R1
| |-TemplateTypeParmDecl 0x7fb38fb0f118 <col:26, col:32> col:32 class depth 0 index 1 _R2
| |-CXXRecordDecl 0x7fb38fb0f1a8 <line:495:5, col:12> col:12 struct __no_overflow
| `-ClassTemplateSpecializationDecl 0x7fb391100378 <line:494:5, line:495:12> col:12 struct __no_overflow definition
|   |-TemplateArgument type 'class std::__1::ratio<1, 1000>'
|   |-TemplateArgument type 'class std::__1::ratio<1, 1000>'
|   |-CXXRecordDecl 0x7fb3911005d8 prev 0x7fb391100378 <col:5, col:12> col:12 implicit struct __no_overflow
|   |-AccessSpecDecl 0x7fb391100670 <line:497:5, col:12> col:5 private
|   |-VarDecl 0x7fb391100698 <line:498:9, col:79> col:31 referenced __gcd_n1_n2 'const intmax_t':'const long' static cinit
|   | `-ImplicitCastExpr 0x7fb391100988 <col:45, col:79> 'intmax_t':'long' <LValueToRValue>
|   |   `-DeclRefExpr 0x7fb391100950 <col:45, col:79> 'const intmax_t':'const long' lvalue Var 0x7fb38fa98e30 'value' 'const intmax_t':'const long'
|   |-VarDecl 0x7fb3911009f8 <line:499:9, col:79> col:31 referenced __gcd_d1_d2 'const intmax_t':'const long' static cinit
|   | `-ImplicitCastExpr 0x7fb391100c58 <col:45, col:79> 'intmax_t':'long' <LValueToRValue>
|   |   `-DeclRefExpr 0x7fb391100c20 <col:45, col:79> 'const intmax_t':'const long' lvalue Var 0x7fb3910fcd90 'value' 'const intmax_t':'const long'
|   |-VarDecl 0x7fb391100cc8 <line:500:9, col:49> col:31 referenced __n1 'const intmax_t':'const long' static cinit
|   | `-BinaryOperator 0x7fb391100de8 <col:38, col:49> 'long' '/'
|   |   |-ImplicitCastExpr 0x7fb391100db8 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
|   |   | `-DeclRefExpr 0x7fb391100d58 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38fb0ea50 'num' 'const intmax_t':'const long'
|   |   `-ImplicitCastExpr 0x7fb391100dd0 <col:49> 'intmax_t':'long' <LValueToRValue>
|   |     `-DeclRefExpr 0x7fb391100d90 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb391100698 '__gcd_n1_n2' 'const intmax_t':'const long'
|   |-VarDecl 0x7fb391100e68 <line:501:9, col:49> col:31 referenced __d1 'const intmax_t':'const long' static cinit
|   | `-BinaryOperator 0x7fb391100f88 <col:38, col:49> 'long' '/'
|   |   |-ImplicitCastExpr 0x7fb391100f58 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
|   |   | `-DeclRefExpr 0x7fb391100ef8 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38fb0ec80 'den' 'const intmax_t':'const long'
|   |   `-ImplicitCastExpr 0x7fb391100f70 <col:49> 'intmax_t':'long' <LValueToRValue>
|   |     `-DeclRefExpr 0x7fb391100f30 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb3911009f8 '__gcd_d1_d2' 'const intmax_t':'const long'
|   |-VarDecl 0x7fb391101008 <line:502:9, col:49> col:31 referenced __n2 'const intmax_t':'const long' static cinit
|   | `-BinaryOperator 0x7fb391101128 <col:38, col:49> 'long' '/'
|   |   |-ImplicitCastExpr 0x7fb3911010f8 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
|   |   | `-DeclRefExpr 0x7fb391101098 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38fb0ea50 'num' 'const intmax_t':'const long'
|   |   `-ImplicitCastExpr 0x7fb391101110 <col:49> 'intmax_t':'long' <LValueToRValue>
|   |     `-DeclRefExpr 0x7fb3911010d0 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb391100698 '__gcd_n1_n2' 'const intmax_t':'const long'
|   |-VarDecl 0x7fb3911011a8 <line:503:9, col:49> col:31 referenced __d2 'const intmax_t':'const long' static cinit
|   | `-BinaryOperator 0x7fb3911012c8 <col:38, col:49> 'long' '/'
|   |   |-ImplicitCastExpr 0x7fb391101298 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
|   |   | `-DeclRefExpr 0x7fb391101238 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38fb0ec80 'den' 'const intmax_t':'const long'
|   |   `-ImplicitCastExpr 0x7fb3911012b0 <col:49> 'intmax_t':'long' <LValueToRValue>
|   |     `-DeclRefExpr 0x7fb391101270 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb3911009f8 '__gcd_d1_d2' 'const intmax_t':'const long'
|   |-VarDecl 0x7fb391101348 <line:504:9, col:93> col:31 referenced max 'const intmax_t':'const long' static cinit
|   | `-UnaryOperator 0x7fb391101540 <col:37, col:93> 'long' prefix '-'
|   |   `-ParenExpr 0x7fb391101520 <col:38, col:93> 'long'
|   |     `-BinaryOperator 0x7fb3911014f8 <col:39, col:92> 'long' '+'
|   |       |-ParenExpr 0x7fb3911014c0 <col:39, col:88> 'intmax_t':'long'
|   |       | `-BinaryOperator 0x7fb391101498 <col:40, col:87> 'intmax_t':'long' '<<'
|   |       |   |-CXXFunctionalCastExpr 0x7fb3911013d0 <col:40, col:50> 'intmax_t':'long' functional cast to intmax_t <NoOp>
|   |       |   | `-ImplicitCastExpr 0x7fb3911013b8 <col:49> 'intmax_t':'long' <IntegralCast>
|   |       |   |   `-IntegerLiteral 0x7fb38fa58018 <col:49> 'int' 1
|   |       |   `-ParenExpr 0x7fb391101478 <col:55, col:87> 'unsigned long'
|   |       |     `-BinaryOperator 0x7fb391101450 <col:56, col:86> 'unsigned long' '-'
|   |       |       |-BinaryOperator 0x7fb391101410 <col:56, <built-in>:66:22> 'unsigned long' '*'
|   |       |       | |-UnaryExprOrTypeTraitExpr 0x7fb38fa58088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:504:56, col:71> 'unsigned long' sizeof 'intmax_t':'long'
|   |       |       | `-ImplicitCastExpr 0x7fb3911013f8 <<built-in>:66:22> 'unsigned long' <IntegralCast>
|   |       |       |   `-IntegerLiteral 0x7fb38fa580a8 <col:22> 'int' 8
|   |       |       `-ImplicitCastExpr 0x7fb391101438 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:504:86> 'unsigned long' <IntegralCast>
|   |       |         `-IntegerLiteral 0x7fb38fa58108 <col:86> 'int' 1
|   |       `-ImplicitCastExpr 0x7fb3911014e0 <col:92> 'long' <IntegralCast>
|   |         `-IntegerLiteral 0x7fb38fa581d0 <col:92> 'int' 1
|   |-ClassTemplateDecl 0x7fb391101780 <line:506:9, line:507:16> col:16 __mul
|   | |-NonTypeTemplateParmDecl 0x7fb3911015b8 <line:506:19, col:28> col:28 'intmax_t':'long' depth 0 index 0 _Xp
|   | |-NonTypeTemplateParmDecl 0x7fb391101610 <col:33, col:42> col:42 'intmax_t':'long' depth 0 index 1 _Yp
|   | |-NonTypeTemplateParmDecl 0x7fb391101668 <col:47, col:52> col:52 '_Bool' depth 0 index 2 __overflow
|   | |-CXXRecordDecl 0x7fb3911016e8 <line:507:9, col:16> col:16 struct __mul
|   | `-ClassTemplateSpecializationDecl 0x7fb3911023e8 <line:506:9, line:507:16> col:16 struct __mul definition
|   |   |-TemplateArgument integral 1
|   |   |-TemplateArgument integral 1
|   |   |-TemplateArgument integral 0
|   |   |-CXXRecordDecl 0x7fb391104ac0 prev 0x7fb3911023e8 <col:9, col:16> col:16 implicit struct __mul
|   |   `-VarDecl 0x7fb391104b58 <line:509:13, col:49> col:35 referenced value 'const intmax_t':'const long' static cinit
|   |     `-BinaryOperator 0x7fb391104c58 <col:43, col:49> 'long' '*'
|   |       |-SubstNonTypeTemplateParmExpr 0x7fb391104be8 <col:43> 'long'
|   |       | `-IntegerLiteral 0x7fb391104bc8 <col:43> 'long' 1
|   |       `-SubstNonTypeTemplateParmExpr 0x7fb391104c30 <col:49> 'long'
|   |         `-IntegerLiteral 0x7fb391104c10 <col:49> 'long' 1
|   |-AccessSpecDecl 0x7fb391101f90 <line:518:5, col:11> col:5 public
|   |-VarDecl 0x7fb391101fb8 <line:519:9, col:78> col:27 referenced value 'const _Bool' static cinit
|   | `-BinaryOperator 0x7fb391102288 <col:35, col:78> '_Bool' '&&'
|   |   |-ParenExpr 0x7fb391102138 <col:35, col:54> '_Bool'
|   |   | `-BinaryOperator 0x7fb391102110 <col:36, col:50> '_Bool' '<='
|   |   |   |-ImplicitCastExpr 0x7fb3911020f8 <col:36> 'intmax_t':'long' <LValueToRValue>
|   |   |   | `-DeclRefExpr 0x7fb391102028 <col:36> 'const intmax_t':'const long' lvalue Var 0x7fb391100cc8 '__n1' 'const intmax_t':'const long'
|   |   |   `-BinaryOperator 0x7fb3911020d0 <col:44, col:50> 'long' '/'
|   |   |     |-ImplicitCastExpr 0x7fb3911020a0 <col:44> 'intmax_t':'long' <LValueToRValue>
|   |   |     | `-DeclRefExpr 0x7fb391102050 <col:44> 'const intmax_t':'const long' lvalue Var 0x7fb391101348 'max' 'const intmax_t':'const long'
|   |   |     `-ImplicitCastExpr 0x7fb3911020b8 <col:50> 'intmax_t':'long' <LValueToRValue>
|   |   |       `-DeclRefExpr 0x7fb391102078 <col:50> 'const intmax_t':'const long' lvalue Var 0x7fb3911011a8 '__d2' 'const intmax_t':'const long'
|   |   `-ParenExpr 0x7fb391102268 <col:59, col:78> '_Bool'
|   |     `-BinaryOperator 0x7fb391102240 <col:60, col:74> '_Bool' '<='
|   |       |-ImplicitCastExpr 0x7fb391102228 <col:60> 'intmax_t':'long' <LValueToRValue>
|   |       | `-DeclRefExpr 0x7fb391102158 <col:60> 'const intmax_t':'const long' lvalue Var 0x7fb391101008 '__n2' 'const intmax_t':'const long'
|   |       `-BinaryOperator 0x7fb391102200 <col:68, col:74> 'long' '/'
|   |         |-ImplicitCastExpr 0x7fb3911021d0 <col:68> 'intmax_t':'long' <LValueToRValue>
|   |         | `-DeclRefExpr 0x7fb391102180 <col:68> 'const intmax_t':'const long' lvalue Var 0x7fb391101348 'max' 'const intmax_t':'const long'
|   |         `-ImplicitCastExpr 0x7fb3911021e8 <col:74> 'intmax_t':'long' <LValueToRValue>
|   |           `-DeclRefExpr 0x7fb3911021a8 <col:74> 'const intmax_t':'const long' lvalue Var 0x7fb391100e68 '__d1' 'const intmax_t':'const long'
|   `-TypedefDecl 0x7fb391105028 <line:520:9, line:521:57> col:57 referenced type 'ratio<__mul<__n1, __d2, !value>::value, __mul<__n2, __d1, !value>::value>':'class std::__1::ratio<1, 1>'
|     `-TemplateSpecializationType 0x7fb391104f80 'ratio<__mul<__n1, __d2, !value>::value, __mul<__n2, __d1, !value>::value>' sugar ratio
|       |-TemplateArgument expr
|       | `-ImplicitCastExpr 0x7fb391104f48 <line:520:23, col:50> 'intmax_t':'long' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb391104cf8 <col:23, col:50> 'const intmax_t':'const long' lvalue Var 0x7fb391104b58 'value' 'const intmax_t':'const long'
|       |-TemplateArgument expr
|       | `-ImplicitCastExpr 0x7fb391104f60 <line:521:23, col:50> 'intmax_t':'long' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb391104f10 <col:23, col:50> 'const intmax_t':'const long' lvalue Var 0x7fb391104b58 'value' 'const intmax_t':'const long'
|       `-RecordType 0x7fb38fa45e60 'class std::__1::ratio<1, 1>'
|         `-ClassTemplateSpecialization 0x7fb38fa45d58 'ratio'
|-AccessSpecDecl 0x7fb38fb0f478 <line:524:1, col:7> col:1 public
|-TypedefDecl 0x7fb38fb0f4b0 <line:525:5, col:18> col:18 referenced rep 'long long':'long long'
| `-SubstTemplateTypeParmType 0x7fb38fa82930 'long long' sugar
|   |-TemplateTypeParmType 0x7fb38fa56560 '_Rep' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fb38fa56518 '_Rep'
|   `-BuiltinType 0x7fb38f032c00 'long long'
|-TypedefDecl 0x7fb38fb0f5a0 <line:526:5, col:36> col:36 period 'typename class ratio<1, 1000>::type':'class std::__1::ratio<1, 1000>'
| `-ElaboratedType 0x7fb38fb0f550 'typename class ratio<1, 1000>::type' sugar
|   `-TypedefType 0x7fb38fb0f530 'std::__1::ratio<1, 1000>::type' sugar
|     |-Typedef 0x7fb38fb0ef68 'type'
|     `-TemplateSpecializationType 0x7fb38fb0eec0 'ratio<num, den>' sugar ratio
|       |-TemplateArgument expr
|       | `-ImplicitCastExpr 0x7fb38fb0ee88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ratio:260:19> 'intmax_t':'long' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb38fb0ea28 <col:19> 'const intmax_t':'const long' lvalue Var 0x7fb38fb0e6e0 'num' 'const intmax_t':'const long'
|       |-TemplateArgument expr
|       | `-ImplicitCastExpr 0x7fb38fb0eea0 <col:24> 'intmax_t':'long' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb38fb0ec58 <col:24> 'const intmax_t':'const long' lvalue Var 0x7fb38fb0e8b8 'den' 'const intmax_t':'const long'
|       `-RecordType 0x7fb38fa2de80 'class std::__1::ratio<1, 1000>'
|         `-ClassTemplateSpecialization 0x7fb38fa2dd78 'ratio'
|-AccessSpecDecl 0x7fb38fb0f5f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:527:1, col:8> col:1 private
|-FieldDecl 0x7fb38fb0f650 <line:528:5, col:9> col:9 referenced __rep_ 'std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep':'long long'
|-AccessSpecDecl 0x7fb38fb0f698 <line:529:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fb38fb0f700 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:533:28> col:9 duration 'void (void)' default trivial noexcept-unevaluated 0x7fb38fb0f700
| `-AlwaysInlineAttr 0x7fb38fb0f7e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7fb38fb0ffa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:538:5, line:547:32> line:540:18 duration
| |-TemplateTypeParmDecl 0x7fb38fb0f830 <line:538:15, col:21> col:21 class depth 0 index 0 _Rep2
| |-CXXConstructorDecl 0x7fb38fb0ff00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:547:32> line:540:18 constexpr duration 'void (const _Rep2 &, typename enable_if<is_convertible<_Rep2, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<_Rep2>::value)>::type *)'
| | |-ParmVarDecl 0x7fb38fb0f8e8 <col:27, col:40> col:40 __r 'const _Rep2 &'
| | |-ParmVarDecl 0x7fb38fb0fe10 <line:541:13, line:546:24> col:22 'typename enable_if<is_convertible<_Rep2, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<_Rep2>::value)>::type *'
| | `-AlwaysInlineAttr 0x7fb38fb10008 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| |-CXXConstructorDecl 0x7fb3910ffd20 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:547:32> line:540:18 used constexpr duration 'void (const long long &, typename enable_if<is_convertible<long long, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<long long>::value)>::type *)'
| | |-TemplateArgument type 'long long'
| | |-ParmVarDecl 0x7fb3910ff7e8 <col:27, col:40> col:40 used __r 'const long long &'
| | |-ParmVarDecl 0x7fb3910ffc50 <line:541:13, line:546:24> col:22 'typename enable_if<is_convertible<long long, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<long long>::value)>::type *' cinit
| | | `-ImplicitCastExpr 0x7fb3910fff20 <col:24> 'typename enable_if<is_convertible<long long, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<long long>::value)>::type *' <NullToPointer>
| | |   `-IntegerLiteral 0x7fb38fa5d7e0 <col:24> 'int' 0
| | |-CXXCtorInitializer Field 0x7fb38fb0f650 '__rep_' 'std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep':'long long'
| | | `-ImplicitCastExpr 0x7fb3910fffb0 <line:547:26> 'long long':'long long' <LValueToRValue>
| | |   `-DeclRefExpr 0x7fb3910fff58 <col:26> 'const long long':'const long long' lvalue ParmVar 0x7fb3910ff7e8 '__r' 'const long long &'
| | |-CompoundStmt 0x7fb38fa5d8a8 <col:31, col:32>
| | `-AlwaysInlineAttr 0x7fb3910ffe30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-CXXConstructorDecl 0x7fb3904bbf80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:547:32> line:540:18 used constexpr duration 'void (const int &, typename enable_if<is_convertible<int, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<int>::value)>::type *)'
|   |-TemplateArgument type 'int'
|   |-ParmVarDecl 0x7fb3904bab38 <col:27, col:40> col:40 used __r 'const int &'
|   |-ParmVarDecl 0x7fb3904bbe70 <line:541:13, line:546:24> col:22 'typename enable_if<is_convertible<int, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<int>::value)>::type *' cinit
|   | `-ImplicitCastExpr 0x7fb3904bc180 <col:24> 'typename enable_if<is_convertible<int, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<int>::value)>::type *' <NullToPointer>
|   |   `-IntegerLiteral 0x7fb38fa5d7e0 <col:24> 'int' 0
|   |-CXXCtorInitializer Field 0x7fb38fb0f650 '__rep_' 'std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep':'long long'
|   | `-ImplicitCastExpr 0x7fb3904bc228 <line:547:26> 'std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep':'long long' <IntegralCast>
|   |   `-ImplicitCastExpr 0x7fb3904bc210 <col:26> 'int':'int' <LValueToRValue>
|   |     `-DeclRefExpr 0x7fb3904bc1b8 <col:26> 'const int':'const int' lvalue ParmVar 0x7fb3904bab38 '__r' 'const int &'
|   |-CompoundStmt 0x7fb38fa5d8a8 <col:31, col:32>
|   `-AlwaysInlineAttr 0x7fb3904bc090 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7fb3910fa928 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:550:5, line:560:80> line:552:9 duration
| |-TemplateTypeParmDecl 0x7fb38fb100d8 <line:550:15, col:21> col:21 class depth 0 index 0 _Rep2
| |-TemplateTypeParmDecl 0x7fb38fb10148 <col:28, col:34> col:34 class depth 0 index 1 _Period2
| |-CXXConstructorDecl 0x7fb3910fa880 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:560:80> line:552:9 constexpr duration 'void (const duration<_Rep2, _Period2> &, typename enable_if<__no_overflow<_Period2, period>::value && (treat_as_floating_point<rep>::value || (__no_overflow<_Period2, period>::type::den == 1 && !treat_as_floating_point<_Rep2>::value))>::type *)'
| | |-ParmVarDecl 0x7fb38fb102d8 <col:18, col:51> col:51 __d 'const duration<_Rep2, _Period2> &'
| | |-ParmVarDecl 0x7fb3910fa750 <line:553:13, line:559:24> col:22 'typename enable_if<__no_overflow<_Period2, period>::value && (treat_as_floating_point<rep>::value || (__no_overflow<_Period2, period>::type::den == 1 && !treat_as_floating_point<_Rep2>::value))>::type *'
| | `-AlwaysInlineAttr 0x7fb3910fa988 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-CXXConstructorDecl 0x7fb3911057c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:560:80> line:552:9 constexpr duration 'void (const duration<long long, class std::__1::ratio<1, 1000> > &, typename enable_if<__no_overflow<class ratio<1, 1000>, period>::value && (treat_as_floating_point<rep>::value || (__no_overflow<class ratio<1, 1000>, period>::type::den == 1 && !treat_as_floating_point<long long>::value))>::type *)'
|   |-TemplateArgument type 'long long'
|   |-TemplateArgument type 'class std::__1::ratio<1, 1000>'
|   |-ParmVarDecl 0x7fb391100308 <col:18, col:51> col:51 __d 'const duration<long long, class std::__1::ratio<1, 1000> > &'
|   |-ParmVarDecl 0x7fb3911056b0 <line:553:13, line:559:24> col:22 'typename enable_if<__no_overflow<class ratio<1, 1000>, period>::value && (treat_as_floating_point<rep>::value || (__no_overflow<class ratio<1, 1000>, period>::type::den == 1 && !treat_as_floating_point<long long>::value))>::type *'
|   `-AlwaysInlineAttr 0x7fb3911058e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3910faab0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:564:82> col:53 constexpr count 'std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep (void) const'
| `-AlwaysInlineAttr 0x7fb3910fab58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3910fdb30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:568:156> col:86 constexpr operator+ 'typename common_type<class duration<long long, class ratio<1, 1000> > >::type (void) const'
| `-AlwaysInlineAttr 0x7fb3910fdbd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3910fdd80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:569:158> col:86 constexpr operator- 'typename common_type<class duration<long long, class ratio<1, 1000> > >::type (void) const'
| `-AlwaysInlineAttr 0x7fb3910fde28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3910fdef0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:570:113> col:71 operator++ 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &(void)'
| `-AlwaysInlineAttr 0x7fb3910fdf98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3910fe0a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:571:116> col:71 operator++ 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > (int)'
| |-ParmVarDecl 0x7fb3910fdfe0 <col:82> col:85 'int'
| `-AlwaysInlineAttr 0x7fb3910fe150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3910fe1b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:572:113> col:71 operator-- 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &(void)'
| `-AlwaysInlineAttr 0x7fb3910fe260 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3910fe330 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:573:116> col:71 operator-- 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > (int)'
| |-ParmVarDecl 0x7fb3910fe2a8 <col:82> col:85 'int'
| `-AlwaysInlineAttr 0x7fb3910fe3e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3910fe530 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:575:140> col:71 operator+= 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &(const class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &)'
| |-ParmVarDecl 0x7fb3910fe468 <col:82, col:98> col:98 __d 'const class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &'
| `-AlwaysInlineAttr 0x7fb3910fe5e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3910fe6c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:576:140> col:71 operator-= 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &(const class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &)'
| |-ParmVarDecl 0x7fb3910fe638 <col:82, col:98> col:98 __d 'const class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &'
| `-AlwaysInlineAttr 0x7fb3910fe770 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3910fe900 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:578:127> col:71 operator*= 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &(const std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep &)'
| |-ParmVarDecl 0x7fb3910fe7f8 <col:82, col:93> col:93 rhs 'const std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep &'
| `-AlwaysInlineAttr 0x7fb3910fe9b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3910fea90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:579:127> col:71 operator/= 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &(const std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep &)'
| |-ParmVarDecl 0x7fb3910fea08 <col:82, col:93> col:93 rhs 'const std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep &'
| `-AlwaysInlineAttr 0x7fb3910feb40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3910fec20 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:580:127> col:71 operator%= 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &(const std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep &)'
| |-ParmVarDecl 0x7fb3910feb98 <col:82, col:93> col:93 rhs 'const std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep &'
| `-AlwaysInlineAttr 0x7fb3910fecd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3910fedb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:581:140> col:71 operator%= 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &(const class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &)'
| |-ParmVarDecl 0x7fb3910fed28 <col:82, col:98> col:98 rhs 'const class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &'
| `-AlwaysInlineAttr 0x7fb3910fee60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3910fef00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:585:119> col:65 constexpr zero 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > (void)' static
| `-AlwaysInlineAttr 0x7fb3910fefa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3910ff010 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:586:118> col:65 constexpr min 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > (void)' static
| `-AlwaysInlineAttr 0x7fb3910ff0b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb3910ff120 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:587:118> col:65 constexpr max 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > (void)' static
| `-AlwaysInlineAttr 0x7fb3910ff1c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb3910ff3e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:488:28> col:28 implicit constexpr duration 'void (const class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &)' inline default trivial noexcept-unevaluated 0x7fb3910ff3e8
| `-ParmVarDecl 0x7fb3910ff510 <col:28> col:28 'const class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &'
|-CXXConstructorDecl 0x7fb3910ff5a8 <col:28> col:28 implicit used constexpr duration 'void (class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7fb3910ff6d0 <col:28> col:28 used 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &&'
| |-CXXCtorInitializer Field 0x7fb38fb0f650 '__rep_' 'std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep':'long long'
| | `-ImplicitCastExpr 0x7fb391105a40 <col:28> 'std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep':'long long' <LValueToRValue>
| |   `-MemberExpr 0x7fb3911059f0 <col:28> 'std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >::rep':'long long' xvalue .__rep_ 0x7fb38fb0f650
| |     `-CXXStaticCastExpr 0x7fb3911059c0 <col:28> 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >' xvalue static_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &&> <NoOp>
| |       `-DeclRefExpr 0x7fb391105988 <col:28> 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> >' lvalue ParmVar 0x7fb3910ff6d0 '' 'class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000> > &&'
| `-CompoundStmt 0x7fb391105a88 <col:28>
`-CXXDestructorDecl 0x7fb391100038 <col:28> col:28 implicit referenced ~duration 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::chrono::duration" = type { i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::chrono::duration" = type { i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::thread
         0 |   std::__1::__libcpp_thread_t __t_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_t
         0 |   long __sig
         8 |   struct __darwin_pthread_handler_rec * __cleanup_stack
        16 |   char [8176] __opaque
           | [sizeof=8192, dsize=8192, align=8,
           |  nvsize=8192, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __darwin_pthread_handler_rec
         0 |   void (*)(void *) __routine
         8 |   void * __arg
        16 |   struct __darwin_pthread_handler_rec * __next
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fb38f81bf60 </usr/include/sys/_pthread/_pthread_types.h:57:1, line:61:1> line:57:8 struct __darwin_pthread_handler_rec definition
|-CXXRecordDecl 0x7fb38f81c088 <col:1, col:8> col:8 implicit struct __darwin_pthread_handler_rec
|-FieldDecl 0x7fb38f81c2d0 <line:58:2, col:26> col:9 __routine 'void (*)(void *)'
|-FieldDecl 0x7fb38f81c330 <line:59:2, col:8> col:8 __arg 'void *'
`-FieldDecl 0x7fb38f81c400 <line:60:2, col:39> col:39 __next 'struct __darwin_pthread_handler_rec *'

Layout: <CGRecordLayout
  LLVMType:%struct.__darwin_pthread_handler_rec = type { void (i8*)*, i8*, %struct.__darwin_pthread_handler_rec* }
  NonVirtualBaseLLVMType:%struct.__darwin_pthread_handler_rec = type { void (i8*)*, i8*, %struct.__darwin_pthread_handler_rec* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fb38f820860 </usr/include/sys/_pthread/_pthread_types.h:103:1, line:107:1> line:103:8 struct _opaque_pthread_t definition
|-CXXRecordDecl 0x7fb38f820988 <col:1, col:8> col:8 implicit struct _opaque_pthread_t
|-FieldDecl 0x7fb38f820a38 <line:104:2, col:7> col:7 __sig 'long'
|-FieldDecl 0x7fb38f820aa8 <line:105:2, col:40> col:40 __cleanup_stack 'struct __darwin_pthread_handler_rec *'
`-FieldDecl 0x7fb38f820b68 <line:106:2, col:32> col:7 __opaque 'char [8176]'

Layout: <CGRecordLayout
  LLVMType:%struct._opaque_pthread_t = type { i64, %struct.__darwin_pthread_handler_rec*, [8176 x i8] }
  NonVirtualBaseLLVMType:%struct._opaque_pthread_t = type { i64, %struct.__darwin_pthread_handler_rec*, [8176 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fb38fb289f8 prev 0x7fb38fb22708 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:282:1, line:330:1> line:282:24 referenced class thread definition
|-VisibilityAttr 0x7fb38fb28af8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7fb38fb28b40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:282:1, col:24> col:24 implicit referenced class thread
|-FieldDecl 0x7fb38fb28be8 <line:284:5, col:23> col:23 referenced __t_ 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
|-CXXConstructorDecl 0x7fb38fb28d80 <line:286:5, col:25> col:5 thread 'void (const class std::__1::thread &)'
| `-ParmVarDecl 0x7fb38fb28c68 <col:12, col:24> col:25 'const class std::__1::thread &'
|-CXXMethodDecl 0x7fb38fb28f30 <line:287:5, col:36> col:13 operator= 'class std::__1::thread &(const class std::__1::thread &)'
| `-ParmVarDecl 0x7fb38fb28e40 <col:23, col:35> col:36 'const class std::__1::thread &'
|-AccessSpecDecl 0x7fb38fb28fd0 <line:288:1, col:7> col:1 public
|-TypedefDecl 0x7fb38fb29008 <line:289:5, col:25> col:25 referenced id 'class std::__1::__thread_id'
| `-RecordType 0x7fb38fb1ef30 'class std::__1::__thread_id'
|   `-CXXRecord 0x7fb38fb1f3c8 '__thread_id'
|-TypedefDecl 0x7fb38fb29070 <line:290:5, col:31> col:31 referenced native_handle_type 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| `-TypedefType 0x7fb38f2aa1c0 'std::__1::__libcpp_thread_t' sugar
|   |-Typedef 0x7fb38f2a7a90 '__libcpp_thread_t'
|   `-TypedefType 0x7fb38f2427d0 'pthread_t' sugar
|     |-Typedef 0x7fb38f240de0 'pthread_t'
|     `-TypedefType 0x7fb38f240db0 '__darwin_pthread_t' sugar
|       |-Typedef 0x7fb38f822280 '__darwin_pthread_t'
|       `-PointerType 0x7fb38f822230 'struct _opaque_pthread_t *'
|         `-ElaboratedType 0x7fb38f8211c0 'struct _opaque_pthread_t' sugar
|           `-RecordType 0x7fb38f820900 'struct _opaque_pthread_t'
|             `-CXXRecord 0x7fb38f820860 '_opaque_pthread_t'
|-CXXConstructorDecl 0x7fb38fb29120 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:293:53> col:5 thread 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7fb38fb28be8 '__t_' 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| | `-ImplicitCastExpr 0x7fb38fb2d7a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__threading_support:69:29> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <NullToPointer>
| |   `-IntegerLiteral 0x7fb38fb2d758 <col:29> 'unsigned int' 0
| |-CompoundStmt 0x7fb38fb2d7f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:293:52, col:53>
| |-AlwaysInlineAttr 0x7fb38fb291c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fb38fb29210 <col:51, col:74> Hidden
|-FunctionTemplateDecl 0x7fb38fb29b38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:295:5, line:302:53> col:18 thread
| |-TemplateTypeParmDecl 0x7fb38fb29220 <line:295:15, col:21> col:21 referenced class depth 0 index 0 _Fp
| |-TemplateTypeParmDecl 0x7fb38fb29288 <col:26, col:35> col:35 referenced class depth 0 index 1 ... _Args
| |-TemplateTypeParmDecl 0x7fb38fb297a0 <line:296:15, line:299:18> line:296:15 class depth 0 index 2
| | `-TemplateArgument type 'typename enable_if<!is_same<typename decay<_Fp>::type, class thread>::value>::type'
| |-CXXConstructorDecl 0x7fb38fb29a90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:302:53> col:18 thread 'void (_Fp &&, _Args &&...)' inline
| | |-ParmVarDecl 0x7fb38fb29898 <col:25, col:31> col:31 __f '_Fp &&'
| | |-ParmVarDecl 0x7fb38fb29978 <col:36, col:47> col:47 __args '_Args &&...'
| | `-VisibilityAttr 0x7fb38fb29b98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:624:40, col:63> Hidden
| `-CXXConstructorDecl 0x7fb3904cb8d0 parent 0x7fb38fb289f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:356:1, line:370:1> line:356:9 used thread 'void (void (&&)(void))'
|   |-TemplateArgument type 'void (&)(void)'
|   |-TemplateArgument pack
|   |-TemplateArgument type 'void'
|   `-ParmVarDecl 0x7fb3904cb7c8 <col:16, col:19> col:22 __f 'void (&&)(void)'
|-CXXDestructorDecl 0x7fb38fb29c30 <line:308:5, col:13> col:5 used ~thread 'void (void) noexcept'
|-CXXConstructorDecl 0x7fb38fb29e48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:312:85> col:5 thread 'void (class std::__1::thread &&) noexcept'
| |-ParmVarDecl 0x7fb38fb29d38 <col:12, col:21> col:21 used __t 'class std::__1::thread &&'
| |-CXXCtorInitializer Field 0x7fb38fb28be8 '__t_' 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| | `-ImplicitCastExpr 0x7fb38fb2d898 <col:43, col:47> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <LValueToRValue>
| |   `-MemberExpr 0x7fb38fb2d830 <col:43, col:47> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue .__t_ 0x7fb38fb28be8
| |     `-DeclRefExpr 0x7fb38fb2d808 <col:43> 'class std::__1::thread' lvalue ParmVar 0x7fb38fb29d38 '__t' 'class std::__1::thread &&'
| |-CompoundStmt 0x7fb38fb2d9a0 <col:53, col:85>
| | `-BinaryOperator 0x7fb38fb2d978 <col:54, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__threading_support:69:29> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue '='
| |   |-MemberExpr 0x7fb38fb2d908 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:312:54, col:58> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue .__t_ 0x7fb38fb28be8
| |   | `-DeclRefExpr 0x7fb38fb2d8e0 <col:54> 'class std::__1::thread' lvalue ParmVar 0x7fb38fb29d38 '__t' 'class std::__1::thread &&'
| |   `-ImplicitCastExpr 0x7fb38fb2d960 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__threading_support:69:29> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <NullToPointer>
| |     `-IntegerLiteral 0x7fb38fb2d940 <col:29> 'unsigned int' 0
| |-AlwaysInlineAttr 0x7fb38fb29ef8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fb38fb29f40 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fb38fb2a098 <col:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:314:13 operator= 'class std::__1::thread &(class std::__1::thread &&) noexcept'
| |-ParmVarDecl 0x7fb38fb29f90 <col:23, col:32> col:32 __t 'class std::__1::thread &&'
| |-AlwaysInlineAttr 0x7fb38fb2a138 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fb38fb2a180 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fb38fb2a2d8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:318:67> col:10 used swap 'void (class std::__1::thread &) noexcept'
| |-ParmVarDecl 0x7fb38fb2a1d0 <col:15, col:23> col:23 used __t 'class std::__1::thread &'
| |-CompoundStmt 0x7fb38fb3aa48 <col:38, col:67>
| | `-CallExpr 0x7fb38fb3aa10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:318:65> 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type':'void'
| |   |-ImplicitCastExpr 0x7fb38fb3a9f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:318:46> 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type (*)(struct _opaque_pthread_t *&, struct _opaque_pthread_t *&) noexcept(is_nothrow_move_constructible<struct _opaque_pthread_t *>::value && is_nothrow_move_assignable<struct _opaque_pthread_t *>::value)' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7fb38fb3a958 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:318:46> 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type (struct _opaque_pthread_t *&, struct _opaque_pthread_t *&) noexcept(is_nothrow_move_constructible<struct _opaque_pthread_t *>::value && is_nothrow_move_assignable<struct _opaque_pthread_t *>::value)' lvalue Function 0x7fb38fb37190 'swap' 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type (struct _opaque_pthread_t *&, struct _opaque_pthread_t *&) noexcept(is_nothrow_move_constructible<struct _opaque_pthread_t *>::value && is_nothrow_move_assignable<struct _opaque_pthread_t *>::value)' (FunctionTemplate 0x7fb38f0fb8b8 'swap')
| |   |-MemberExpr 0x7fb38fb2dae0 <col:51> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue ->__t_ 0x7fb38fb28be8
| |   | `-CXXThisExpr 0x7fb38fb2dac8 <col:51> 'class std::__1::thread *' this
| |   `-MemberExpr 0x7fb38fb2db40 <col:57, col:61> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue .__t_ 0x7fb38fb28be8
| |     `-DeclRefExpr 0x7fb38fb2db18 <col:57> 'class std::__1::thread' lvalue ParmVar 0x7fb38fb2a1d0 '__t' 'class std::__1::thread &'
| |-AlwaysInlineAttr 0x7fb38fb2a378 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fb38fb2a3c0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fb38fb2d050 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:76> col:10 joinable '_Bool (void) const noexcept'
| |-CompoundStmt 0x7fb38fb3ac38 <col:37, col:76>
| | `-ReturnStmt 0x7fb38fb3ac20 <col:38, col:74>
| |   `-UnaryOperator 0x7fb38fb3ac00 <col:45, col:74> '_Bool' prefix '!'
| |     `-CallExpr 0x7fb38fb3abd0 <col:46, col:74> '_Bool'
| |       |-ImplicitCastExpr 0x7fb38fb3abb8 <col:46> '_Bool (*)(const std::__1::__libcpp_thread_t *)' <FunctionToPointerDecay>
| |       | `-DeclRefExpr 0x7fb38fb3ab30 <col:46> '_Bool (const std::__1::__libcpp_thread_t *)' lvalue Function 0x7fb39112c6e0 '__libcpp_thread_isnull' '_Bool (const std::__1::__libcpp_thread_t *)'
| |       `-UnaryOperator 0x7fb38fb3ab10 <col:69, col:70> 'const std::__1::__libcpp_thread_t *' prefix '&'
| |         `-MemberExpr 0x7fb38fb3aad8 <col:70> 'const std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *const' lvalue ->__t_ 0x7fb38fb28be8
| |           `-CXXThisExpr 0x7fb38fb3aac0 <col:70> 'const class std::__1::thread *' this
| |-AlwaysInlineAttr 0x7fb38fb2d0e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fb38fb2d130 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fb38fb2d160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:322:5, col:15> col:10 used join 'void (void)'
|-CXXMethodDecl 0x7fb38fb2d218 <line:323:5, col:17> col:10 detach 'void (void)'
|-CXXMethodDecl 0x7fb38fb2d388 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:325:71> col:8 get_id 'std::__1::thread::id (void) const noexcept'
| |-CompoundStmt 0x7fb38fb3aec0 <col:33, col:71>
| | `-ReturnStmt 0x7fb38fb3aea8 <col:34, col:69>
| |   `-ExprWithCleanups 0x7fb38fb3ae90 <col:34, col:69> 'std::__1::thread::id':'class std::__1::__thread_id'
| |     `-CXXConstructExpr 0x7fb38fb3ae58 <col:34, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' 'void (class std::__1::__thread_id &&) noexcept' elidable
| |       `-MaterializeTemporaryExpr 0x7fb38fb3ae40 <col:41, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' xvalue
| |         `-ImplicitCastExpr 0x7fb38fb3ae28 <col:41, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' <ConstructorConversion>
| |           `-CXXConstructExpr 0x7fb38fb3adf0 <col:41, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' 'void (std::__1::__libcpp_thread_id)'
| |             `-CallExpr 0x7fb38fb3adc0 <col:41, col:69> 'std::__1::__libcpp_thread_id':'struct _opaque_pthread_t *'
| |               |-ImplicitCastExpr 0x7fb38fb3ada8 <col:41> 'std::__1::__libcpp_thread_id (*)(const std::__1::__libcpp_thread_t *)' <FunctionToPointerDecay>
| |               | `-DeclRefExpr 0x7fb38fb3ad20 <col:41> 'std::__1::__libcpp_thread_id (const std::__1::__libcpp_thread_t *)' lvalue Function 0x7fb39112d198 '__libcpp_thread_get_id' 'std::__1::__libcpp_thread_id (const std::__1::__libcpp_thread_t *)'
| |               `-UnaryOperator 0x7fb38fb3ad00 <col:64, col:65> 'const std::__1::__libcpp_thread_t *' prefix '&'
| |                 `-MemberExpr 0x7fb38fb3acc8 <col:65> 'const std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *const' lvalue ->__t_ 0x7fb38fb28be8
| |                   `-CXXThisExpr 0x7fb38fb3acb0 <col:65> 'const class std::__1::thread *' this
| |-AlwaysInlineAttr 0x7fb38fb2d420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fb38fb2d468 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fb38fb2d528 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:327:63> col:24 native_handle 'std::__1::thread::native_handle_type (void) noexcept'
| |-CompoundStmt 0x7fb38fb3af60 <col:50, col:63>
| | `-ReturnStmt 0x7fb38fb3af48 <col:51, col:58>
| |   `-ImplicitCastExpr 0x7fb38fb3af30 <col:58> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <LValueToRValue>
| |     `-MemberExpr 0x7fb38fb3aef8 <col:58> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue ->__t_ 0x7fb38fb28be8
| |       `-CXXThisExpr 0x7fb38fb3aee0 <col:58> 'class std::__1::thread *' this
| |-AlwaysInlineAttr 0x7fb38fb2d5c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7fb38fb2d608 <col:51, col:74> Hidden
`-CXXMethodDecl 0x7fb38fb2d680 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:329:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:329:21 hardware_concurrency 'unsigned int (void) noexcept' static

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::thread" = type { %struct._opaque_pthread_t* }
  NonVirtualBaseLLVMType:%"class.std::__1::thread" = type { %struct._opaque_pthread_t* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1185:9)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1203:9)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1298:9)
         0 |   struct _opaque_pthread_t * __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::default_delete<class std::__1::__thread_struct> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__libcpp_compressed_pair_imp<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct>, 2>
         0 |   struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
         0 |   class std::__1::__thread_struct * __first_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> >
         0 |   class std::__1::__libcpp_compressed_pair_imp<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct>, 2> (base)
         0 |     struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
         0 |     class std::__1::__thread_struct * __first_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >
         0 |   class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |     class std::__1::__libcpp_compressed_pair_imp<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct>, 2> (base)
         0 |       struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
         0 |       class std::__1::__thread_struct * __first_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__tuple_leaf<0, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, false>
         0 |   class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> > value
         0 |     class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |       class std::__1::__libcpp_compressed_pair_imp<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct>, 2> (base)
         0 |         struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
         0 |         class std::__1::__thread_struct * __first_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__tuple_leaf<1, void (*)(void), false>
         0 |   void (*)(void) value
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__tuple_impl<struct std::__1::__tuple_indices<0, 1>, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)>
         0 |   class std::__1::__tuple_leaf<0, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, false> (base)
         0 |     class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> > value
         0 |       class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |         class std::__1::__libcpp_compressed_pair_imp<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct>, 2> (base)
         0 |           struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
         0 |           class std::__1::__thread_struct * __first_
         8 |   class std::__1::__tuple_leaf<1, void (*)(void), false> (base)
         8 |     void (*)(void) value
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)>
         0 |   struct std::__1::__tuple_impl<struct std::__1::__tuple_indices<0, 1>, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> base_
         0 |     class std::__1::__tuple_leaf<0, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, false> (base)
         0 |       class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> > value
         0 |         class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |           class std::__1::__libcpp_compressed_pair_imp<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct>, 2> (base)
         0 |             struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
         0 |             class std::__1::__thread_struct * __first_
         8 |     class std::__1::__tuple_leaf<1, void (*)(void), false> (base)
         8 |       void (*)(void) value
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::integral_constant<_Bool, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb38f837408 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:500:1, line:512:1> line:501:29 struct integral_constant definition
|-TemplateArgument type '_Bool'
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7fb38f83d5d8 prev 0x7fb38f837408 <col:1, col:29> col:29 implicit struct integral_constant
|-VarDecl 0x7fb38f83d680 <line:503:5, col:53> col:45 used value 'const _Bool':'const _Bool' static constexpr cinit
| `-SubstNonTypeTemplateParmExpr 0x7fb38f83d708 <col:53> '_Bool'
|   `-CXXBoolLiteralExpr 0x7fb38f83d6f0 <col:53> '_Bool' true
|-TypedefDecl 0x7fb38f83d798 <line:504:5, col:31> col:31 value_type '_Bool':'_Bool'
| `-SubstTemplateTypeParmType 0x7fb38f8373d0 '_Bool' sugar
|   |-TemplateTypeParmType 0x7fb38f836400 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fb38f8363c0 '_Tp'
|   `-BuiltinType 0x7fb38f032b40 '_Bool'
|-TypedefDecl 0x7fb38f83d800 <line:505:5, col:31> col:31 referenced type 'struct std::__1::integral_constant<_Bool, true>'
| `-RecordType 0x7fb38f837510 'struct std::__1::integral_constant<_Bool, true>'
|   `-ClassTemplateSpecialization 0x7fb38f837408 'integral_constant'
|-CXXConversionDecl 0x7fb38f83d8e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:507:79> col:27 constexpr operator bool 'std::__1::integral_constant<_Bool, true>::value_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38f83d9b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38f83da30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:510:75> col:31 constexpr operator() 'std::__1::integral_constant<_Bool, true>::value_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb38f83dad8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb3902307f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:501:29> col:29 implicit referenced constexpr integral_constant 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fb390230908 <col:29> col:29 implicit constexpr integral_constant 'void (const struct std::__1::integral_constant<_Bool, true> &)' inline default trivial noexcept-unevaluated 0x7fb390230908
| `-ParmVarDecl 0x7fb390230a30 <col:29> col:29 'const struct std::__1::integral_constant<_Bool, true> &'
|-CXXConstructorDecl 0x7fb390230ac8 <col:29> col:29 implicit used constexpr integral_constant 'void (struct std::__1::integral_constant<_Bool, true> &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7fb390230bf0 <col:29> col:29 'struct std::__1::integral_constant<_Bool, true> &&'
| `-CompoundStmt 0x7fb38fdc2b78 <col:29>
`-CXXDestructorDecl 0x7fb390230ce0 <col:29> col:29 implicit referenced ~integral_constant 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::integral_constant" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::integral_constant" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> (empty)
         0 |   struct std::__1::integral_constant<_Bool, true> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb39053e568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1405:1, line:1413:1> line:1406:8 struct __has_destroy definition
|-public 'integral_constant<_Bool, is_same<decltype(__has_destroy_test(declval<class allocator<int> >(), declval<int *>())), true_type>::value>':'struct std::__1::integral_constant<_Bool, true>'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-TemplateArgument type 'int *'
|-CXXRecordDecl 0x7fb390541428 prev 0x7fb39053e568 <col:1, col:8> col:8 implicit struct __has_destroy
|-CXXConstructorDecl 0x7fb390541500 <col:8> col:8 implicit referenced constexpr __has_destroy 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fb390541618 <col:8> col:8 implicit constexpr __has_destroy 'void (const struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &)' inline default trivial noexcept-unevaluated 0x7fb390541618
| `-ParmVarDecl 0x7fb390541740 <col:8> col:8 'const struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &'
|-CXXConstructorDecl 0x7fb3905417d8 <col:8> col:8 implicit constexpr __has_destroy 'void (struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &&)' inline default trivial noexcept-unevaluated 0x7fb3905417d8
| `-ParmVarDecl 0x7fb390541900 <col:8> col:8 'struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &&'
`-CXXDestructorDecl 0x7fb3905419a0 <col:8> col:8 implicit referenced ~__has_destroy 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__has_destroy" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__has_destroy" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb38faffc60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:487:1, line:588:1> line:488:28 class duration definition
|-TemplateArgument type 'long double'
|-TemplateArgument type 'class std::__1::ratio<1, 1>'
|-CXXRecordDecl 0x7fb38fb00098 prev 0x7fb38faffc60 <col:1, col:28> col:28 implicit class duration
|-StaticAssertDecl 0x7fb38fb00250 <line:490:5, col:97> col:5
| |-UnaryOperator 0x7fb38fb00230 <col:19, col:41> '_Bool' prefix '!'
| | `-ImplicitCastExpr 0x7fb38fb00218 <col:20, col:41> '_Bool':'_Bool' <LValueToRValue>
| |   `-DeclRefExpr 0x7fb38fb001e0 <col:20, col:41> 'const _Bool':'const _Bool' lvalue Var 0x7fb38f9f3548 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fb38fa56a28 <col:48> 'const char [48]' lvalue "A duration representation can not be a duration"
|-StaticAssertDecl 0x7fb38fb00390 <line:491:5, col:107> col:5
| |-DeclRefExpr 0x7fb38fb00340 <col:19, col:40> 'const _Bool':'const _Bool' lvalue Var 0x7fb38fa83310 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fb38fa56c98 <col:47> 'const char [59]' lvalue "Second template parameter of duration must be a std::ratio"
|-StaticAssertDecl 0x7fb38fb00528 <line:492:5, col:71> col:5
| |-BinaryOperator 0x7fb38fb00500 <col:19, col:34> '_Bool' '>'
| | |-ImplicitCastExpr 0x7fb38fb004d0 <col:19, col:28> 'intmax_t':'long' <LValueToRValue>
| | | `-DeclRefExpr 0x7fb38fb00498 <col:19, col:28> 'const intmax_t':'const long' lvalue Var 0x7fb38fac7ed0 'num' 'const intmax_t':'const long'
| | `-ImplicitCastExpr 0x7fb38fb004e8 <col:34> 'long' <IntegralCast>
| |   `-IntegerLiteral 0x7fb38fa56dc8 <col:34> 'int' 0
| `-StringLiteral 0x7fb38fa56ee0 <col:37> 'const char [33]' lvalue "duration period must be positive"
|-ClassTemplateDecl 0x7fb38fb006f0 <line:494:5, line:495:12> col:12 __no_overflow
| |-TemplateTypeParmDecl 0x7fb38fb00560 <line:494:15, col:21> col:21 class depth 0 index 0 _R1
| |-TemplateTypeParmDecl 0x7fb38fb005c8 <col:26, col:32> col:32 class depth 0 index 1 _R2
| |-CXXRecordDecl 0x7fb38fb00658 <line:495:5, col:12> col:12 struct __no_overflow
| |-ClassTemplateSpecializationDecl 0x7fb38fb06638 <line:494:5, line:495:12> col:12 struct __no_overflow definition
| | |-TemplateArgument type 'class std::__1::ratio<1, 1>'
| | |-TemplateArgument type 'class std::__1::ratio<1, 1>'
| | |-CXXRecordDecl 0x7fb38fb06898 prev 0x7fb38fb06638 <col:5, col:12> col:12 implicit struct __no_overflow
| | |-AccessSpecDecl 0x7fb38fb06930 <line:497:5, col:12> col:5 private
| | |-VarDecl 0x7fb38fb06958 <line:498:9, col:79> col:31 referenced __gcd_n1_n2 'const intmax_t':'const long' static cinit
| | | `-ImplicitCastExpr 0x7fb38fb06bb8 <col:45, col:79> 'intmax_t':'long' <LValueToRValue>
| | |   `-DeclRefExpr 0x7fb38fb06b80 <col:45, col:79> 'const intmax_t':'const long' lvalue Var 0x7fb38fa98e30 'value' 'const intmax_t':'const long'
| | |-VarDecl 0x7fb38fb06c28 <line:499:9, col:79> col:31 referenced __gcd_d1_d2 'const intmax_t':'const long' static cinit
| | | `-ImplicitCastExpr 0x7fb38fb08ca8 <col:45, col:79> 'intmax_t':'long' <LValueToRValue>
| | |   `-DeclRefExpr 0x7fb38fb08c70 <col:45, col:79> 'const intmax_t':'const long' lvalue Var 0x7fb38fa98e30 'value' 'const intmax_t':'const long'
| | |-VarDecl 0x7fb38fb08d18 <line:500:9, col:49> col:31 referenced __n1 'const intmax_t':'const long' static cinit
| | | `-BinaryOperator 0x7fb38fb08e38 <col:38, col:49> 'long' '/'
| | |   |-ImplicitCastExpr 0x7fb38fb08e08 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
| | |   | `-DeclRefExpr 0x7fb38fb08da8 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38fac7ed0 'num' 'const intmax_t':'const long'
| | |   `-ImplicitCastExpr 0x7fb38fb08e20 <col:49> 'intmax_t':'long' <LValueToRValue>
| | |     `-DeclRefExpr 0x7fb38fb08de0 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb38fb06958 '__gcd_n1_n2' 'const intmax_t':'const long'
| | |-VarDecl 0x7fb38fb08eb8 <line:501:9, col:49> col:31 referenced __d1 'const intmax_t':'const long' static cinit
| | | `-BinaryOperator 0x7fb38fb08fd8 <col:38, col:49> 'long' '/'
| | |   |-ImplicitCastExpr 0x7fb38fb08fa8 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
| | |   | `-DeclRefExpr 0x7fb38fb08f48 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38fac8100 'den' 'const intmax_t':'const long'
| | |   `-ImplicitCastExpr 0x7fb38fb08fc0 <col:49> 'intmax_t':'long' <LValueToRValue>
| | |     `-DeclRefExpr 0x7fb38fb08f80 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb38fb06c28 '__gcd_d1_d2' 'const intmax_t':'const long'
| | |-VarDecl 0x7fb38fb09058 <line:502:9, col:49> col:31 referenced __n2 'const intmax_t':'const long' static cinit
| | | `-BinaryOperator 0x7fb38fb09178 <col:38, col:49> 'long' '/'
| | |   |-ImplicitCastExpr 0x7fb38fb09148 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
| | |   | `-DeclRefExpr 0x7fb38fb090e8 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38fac7ed0 'num' 'const intmax_t':'const long'
| | |   `-ImplicitCastExpr 0x7fb38fb09160 <col:49> 'intmax_t':'long' <LValueToRValue>
| | |     `-DeclRefExpr 0x7fb38fb09120 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb38fb06958 '__gcd_n1_n2' 'const intmax_t':'const long'
| | |-VarDecl 0x7fb38fb091f8 <line:503:9, col:49> col:31 referenced __d2 'const intmax_t':'const long' static cinit
| | | `-BinaryOperator 0x7fb38fb09318 <col:38, col:49> 'long' '/'
| | |   |-ImplicitCastExpr 0x7fb38fb092e8 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
| | |   | `-DeclRefExpr 0x7fb38fb09288 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38fac8100 'den' 'const intmax_t':'const long'
| | |   `-ImplicitCastExpr 0x7fb38fb09300 <col:49> 'intmax_t':'long' <LValueToRValue>
| | |     `-DeclRefExpr 0x7fb38fb092c0 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb38fb06c28 '__gcd_d1_d2' 'const intmax_t':'const long'
| | |-VarDecl 0x7fb38fb09398 <line:504:9, col:93> col:31 referenced max 'const intmax_t':'const long' static cinit
| | | `-UnaryOperator 0x7fb38fb09590 <col:37, col:93> 'long' prefix '-'
| | |   `-ParenExpr 0x7fb38fb09570 <col:38, col:93> 'long'
| | |     `-BinaryOperator 0x7fb38fb09548 <col:39, col:92> 'long' '+'
| | |       |-ParenExpr 0x7fb38fb09510 <col:39, col:88> 'intmax_t':'long'
| | |       | `-BinaryOperator 0x7fb38fb094e8 <col:40, col:87> 'intmax_t':'long' '<<'
| | |       |   |-CXXFunctionalCastExpr 0x7fb38fb09420 <col:40, col:50> 'intmax_t':'long' functional cast to intmax_t <NoOp>
| | |       |   | `-ImplicitCastExpr 0x7fb38fb09408 <col:49> 'intmax_t':'long' <IntegralCast>
| | |       |   |   `-IntegerLiteral 0x7fb38fa58018 <col:49> 'int' 1
| | |       |   `-ParenExpr 0x7fb38fb094c8 <col:55, col:87> 'unsigned long'
| | |       |     `-BinaryOperator 0x7fb38fb094a0 <col:56, col:86> 'unsigned long' '-'
| | |       |       |-BinaryOperator 0x7fb38fb09460 <col:56, <built-in>:66:22> 'unsigned long' '*'
| | |       |       | |-UnaryExprOrTypeTraitExpr 0x7fb38fa58088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:504:56, col:71> 'unsigned long' sizeof 'intmax_t':'long'
| | |       |       | `-ImplicitCastExpr 0x7fb38fb09448 <<built-in>:66:22> 'unsigned long' <IntegralCast>
| | |       |       |   `-IntegerLiteral 0x7fb38fa580a8 <col:22> 'int' 8
| | |       |       `-ImplicitCastExpr 0x7fb38fb09488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:504:86> 'unsigned long' <IntegralCast>
| | |       |         `-IntegerLiteral 0x7fb38fa58108 <col:86> 'int' 1
| | |       `-ImplicitCastExpr 0x7fb38fb09530 <col:92> 'long' <IntegralCast>
| | |         `-IntegerLiteral 0x7fb38fa581d0 <col:92> 'int' 1
| | |-ClassTemplateDecl 0x7fb38fb097d0 <line:506:9, line:507:16> col:16 __mul
| | | |-NonTypeTemplateParmDecl 0x7fb38fb09608 <line:506:19, col:28> col:28 'intmax_t':'long' depth 0 index 0 _Xp
| | | |-NonTypeTemplateParmDecl 0x7fb38fb09660 <col:33, col:42> col:42 'intmax_t':'long' depth 0 index 1 _Yp
| | | |-NonTypeTemplateParmDecl 0x7fb38fb096b8 <col:47, col:52> col:52 '_Bool' depth 0 index 2 __overflow
| | | |-CXXRecordDecl 0x7fb38fb09738 <line:507:9, col:16> col:16 struct __mul
| | | `-ClassTemplateSpecializationDecl 0x7fb38fb0a438 <line:506:9, line:507:16> col:16 struct __mul definition
| | |   |-TemplateArgument integral 1
| | |   |-TemplateArgument integral 1
| | |   |-TemplateArgument integral 0
| | |   |-CXXRecordDecl 0x7fb38fb0a708 prev 0x7fb38fb0a438 <col:9, col:16> col:16 implicit struct __mul
| | |   `-VarDecl 0x7fb38fb0a7a0 <line:509:13, col:49> col:35 referenced value 'const intmax_t':'const long' static cinit
| | |     `-BinaryOperator 0x7fb38fb0a8a0 <col:43, col:49> 'long' '*'
| | |       |-SubstNonTypeTemplateParmExpr 0x7fb38fb0a830 <col:43> 'long'
| | |       | `-IntegerLiteral 0x7fb38fb0a810 <col:43> 'long' 1
| | |       `-SubstNonTypeTemplateParmExpr 0x7fb38fb0a878 <col:49> 'long'
| | |         `-IntegerLiteral 0x7fb38fb0a858 <col:49> 'long' 1
| | |-AccessSpecDecl 0x7fb38fb09fe0 <line:518:5, col:11> col:5 public
| | |-VarDecl 0x7fb38fb0a008 <line:519:9, col:78> col:27 referenced value 'const _Bool' static cinit
| | | `-BinaryOperator 0x7fb38fb0a2d8 <col:35, col:78> '_Bool' '&&'
| | |   |-ParenExpr 0x7fb38fb0a188 <col:35, col:54> '_Bool'
| | |   | `-BinaryOperator 0x7fb38fb0a160 <col:36, col:50> '_Bool' '<='
| | |   |   |-ImplicitCastExpr 0x7fb38fb0a148 <col:36> 'intmax_t':'long' <LValueToRValue>
| | |   |   | `-DeclRefExpr 0x7fb38fb0a078 <col:36> 'const intmax_t':'const long' lvalue Var 0x7fb38fb08d18 '__n1' 'const intmax_t':'const long'
| | |   |   `-BinaryOperator 0x7fb38fb0a120 <col:44, col:50> 'long' '/'
| | |   |     |-ImplicitCastExpr 0x7fb38fb0a0f0 <col:44> 'intmax_t':'long' <LValueToRValue>
| | |   |     | `-DeclRefExpr 0x7fb38fb0a0a0 <col:44> 'const intmax_t':'const long' lvalue Var 0x7fb38fb09398 'max' 'const intmax_t':'const long'
| | |   |     `-ImplicitCastExpr 0x7fb38fb0a108 <col:50> 'intmax_t':'long' <LValueToRValue>
| | |   |       `-DeclRefExpr 0x7fb38fb0a0c8 <col:50> 'const intmax_t':'const long' lvalue Var 0x7fb38fb091f8 '__d2' 'const intmax_t':'const long'
| | |   `-ParenExpr 0x7fb38fb0a2b8 <col:59, col:78> '_Bool'
| | |     `-BinaryOperator 0x7fb38fb0a290 <col:60, col:74> '_Bool' '<='
| | |       |-ImplicitCastExpr 0x7fb38fb0a278 <col:60> 'intmax_t':'long' <LValueToRValue>
| | |       | `-DeclRefExpr 0x7fb38fb0a1a8 <col:60> 'const intmax_t':'const long' lvalue Var 0x7fb38fb09058 '__n2' 'const intmax_t':'const long'
| | |       `-BinaryOperator 0x7fb38fb0a250 <col:68, col:74> 'long' '/'
| | |         |-ImplicitCastExpr 0x7fb38fb0a220 <col:68> 'intmax_t':'long' <LValueToRValue>
| | |         | `-DeclRefExpr 0x7fb38fb0a1d0 <col:68> 'const intmax_t':'const long' lvalue Var 0x7fb38fb09398 'max' 'const intmax_t':'const long'
| | |         `-ImplicitCastExpr 0x7fb38fb0a238 <col:74> 'intmax_t':'long' <LValueToRValue>
| | |           `-DeclRefExpr 0x7fb38fb0a1f8 <col:74> 'const intmax_t':'const long' lvalue Var 0x7fb38fb08eb8 '__d1' 'const intmax_t':'const long'
| | `-TypedefDecl 0x7fb38fb0ac78 <line:520:9, line:521:57> col:57 referenced type 'ratio<__mul<__n1, __d2, !value>::value, __mul<__n2, __d1, !value>::value>':'class std::__1::ratio<1, 1>'
| |   `-TemplateSpecializationType 0x7fb38fb0abd0 'ratio<__mul<__n1, __d2, !value>::value, __mul<__n2, __d1, !value>::value>' sugar ratio
| |     |-TemplateArgument expr
| |     | `-ImplicitCastExpr 0x7fb38fb0ab98 <line:520:23, col:50> 'intmax_t':'long' <LValueToRValue>
| |     |   `-DeclRefExpr 0x7fb38fb0a940 <col:23, col:50> 'const intmax_t':'const long' lvalue Var 0x7fb38fb0a7a0 'value' 'const intmax_t':'const long'
| |     |-TemplateArgument expr
| |     | `-ImplicitCastExpr 0x7fb38fb0abb0 <line:521:23, col:50> 'intmax_t':'long' <LValueToRValue>
| |     |   `-DeclRefExpr 0x7fb38fb0ab60 <col:23, col:50> 'const intmax_t':'const long' lvalue Var 0x7fb38fb0a7a0 'value' 'const intmax_t':'const long'
| |     `-RecordType 0x7fb38fa45e60 'class std::__1::ratio<1, 1>'
| |       `-ClassTemplateSpecialization 0x7fb38fa45d58 'ratio'
| `-ClassTemplateSpecializationDecl 0x7fb38fb5d448 <line:494:5, line:495:12> col:12 struct __no_overflow definition
|   |-TemplateArgument type 'class std::__1::ratio<1, 1000000000>'
|   |-TemplateArgument type 'class std::__1::ratio<1, 1>'
|   |-CXXRecordDecl 0x7fb38fb5d6a8 prev 0x7fb38fb5d448 <col:5, col:12> col:12 implicit struct __no_overflow
|   |-AccessSpecDecl 0x7fb38fb5d740 <line:497:5, col:12> col:5 private
|   |-VarDecl 0x7fb38fb5d768 <line:498:9, col:79> col:31 referenced __gcd_n1_n2 'const intmax_t':'const long' static cinit
|   | `-ImplicitCastExpr 0x7fb38fb5d9c8 <col:45, col:79> 'intmax_t':'long' <LValueToRValue>
|   |   `-DeclRefExpr 0x7fb38fb5d990 <col:45, col:79> 'const intmax_t':'const long' lvalue Var 0x7fb38fa98e30 'value' 'const intmax_t':'const long'
|   |-VarDecl 0x7fb38fb5da38 <line:499:9, col:79> col:31 referenced __gcd_d1_d2 'const intmax_t':'const long' static cinit
|   | `-ImplicitCastExpr 0x7fb38fb5dc98 <col:45, col:79> 'intmax_t':'long' <LValueToRValue>
|   |   `-DeclRefExpr 0x7fb38fb5dc60 <col:45, col:79> 'const intmax_t':'const long' lvalue Var 0x7fb38faa03f0 'value' 'const intmax_t':'const long'
|   |-VarDecl 0x7fb38fb5dd08 <line:500:9, col:49> col:31 referenced __n1 'const intmax_t':'const long' static cinit
|   | `-BinaryOperator 0x7fb38fb5de28 <col:38, col:49> 'long' '/'
|   |   |-ImplicitCastExpr 0x7fb38fb5ddf8 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
|   |   | `-DeclRefExpr 0x7fb38fb5dd98 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38faa0c00 'num' 'const intmax_t':'const long'
|   |   `-ImplicitCastExpr 0x7fb38fb5de10 <col:49> 'intmax_t':'long' <LValueToRValue>
|   |     `-DeclRefExpr 0x7fb38fb5ddd0 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb38fb5d768 '__gcd_n1_n2' 'const intmax_t':'const long'
|   |-VarDecl 0x7fb38fb5dea8 <line:501:9, col:49> col:31 referenced __d1 'const intmax_t':'const long' static cinit
|   | `-BinaryOperator 0x7fb38fb5dfc8 <col:38, col:49> 'long' '/'
|   |   |-ImplicitCastExpr 0x7fb38fb5df98 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
|   |   | `-DeclRefExpr 0x7fb38fb5df38 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38faa0e30 'den' 'const intmax_t':'const long'
|   |   `-ImplicitCastExpr 0x7fb38fb5dfb0 <col:49> 'intmax_t':'long' <LValueToRValue>
|   |     `-DeclRefExpr 0x7fb38fb5df70 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb38fb5da38 '__gcd_d1_d2' 'const intmax_t':'const long'
|   |-VarDecl 0x7fb38fb5e048 <line:502:9, col:49> col:31 referenced __n2 'const intmax_t':'const long' static cinit
|   | `-BinaryOperator 0x7fb38fb5e168 <col:38, col:49> 'long' '/'
|   |   |-ImplicitCastExpr 0x7fb38fb5e138 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
|   |   | `-DeclRefExpr 0x7fb38fb5e0d8 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38fac7ed0 'num' 'const intmax_t':'const long'
|   |   `-ImplicitCastExpr 0x7fb38fb5e150 <col:49> 'intmax_t':'long' <LValueToRValue>
|   |     `-DeclRefExpr 0x7fb38fb5e110 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb38fb5d768 '__gcd_n1_n2' 'const intmax_t':'const long'
|   |-VarDecl 0x7fb38fb5e1e8 <line:503:9, col:49> col:31 referenced __d2 'const intmax_t':'const long' static cinit
|   | `-BinaryOperator 0x7fb38fb5e308 <col:38, col:49> 'long' '/'
|   |   |-ImplicitCastExpr 0x7fb38fb5e2d8 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
|   |   | `-DeclRefExpr 0x7fb38fb5e278 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38fac8100 'den' 'const intmax_t':'const long'
|   |   `-ImplicitCastExpr 0x7fb38fb5e2f0 <col:49> 'intmax_t':'long' <LValueToRValue>
|   |     `-DeclRefExpr 0x7fb38fb5e2b0 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb38fb5da38 '__gcd_d1_d2' 'const intmax_t':'const long'
|   |-VarDecl 0x7fb38fb5e388 <line:504:9, col:93> col:31 referenced max 'const intmax_t':'const long' static cinit
|   | `-UnaryOperator 0x7fb38fb5e580 <col:37, col:93> 'long' prefix '-'
|   |   `-ParenExpr 0x7fb38fb5e560 <col:38, col:93> 'long'
|   |     `-BinaryOperator 0x7fb38fb5e538 <col:39, col:92> 'long' '+'
|   |       |-ParenExpr 0x7fb38fb5e500 <col:39, col:88> 'intmax_t':'long'
|   |       | `-BinaryOperator 0x7fb38fb5e4d8 <col:40, col:87> 'intmax_t':'long' '<<'
|   |       |   |-CXXFunctionalCastExpr 0x7fb38fb5e410 <col:40, col:50> 'intmax_t':'long' functional cast to intmax_t <NoOp>
|   |       |   | `-ImplicitCastExpr 0x7fb38fb5e3f8 <col:49> 'intmax_t':'long' <IntegralCast>
|   |       |   |   `-IntegerLiteral 0x7fb38fa58018 <col:49> 'int' 1
|   |       |   `-ParenExpr 0x7fb38fb5e4b8 <col:55, col:87> 'unsigned long'
|   |       |     `-BinaryOperator 0x7fb38fb5e490 <col:56, col:86> 'unsigned long' '-'
|   |       |       |-BinaryOperator 0x7fb38fb5e450 <col:56, <built-in>:66:22> 'unsigned long' '*'
|   |       |       | |-UnaryExprOrTypeTraitExpr 0x7fb38fa58088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:504:56, col:71> 'unsigned long' sizeof 'intmax_t':'long'
|   |       |       | `-ImplicitCastExpr 0x7fb38fb5e438 <<built-in>:66:22> 'unsigned long' <IntegralCast>
|   |       |       |   `-IntegerLiteral 0x7fb38fa580a8 <col:22> 'int' 8
|   |       |       `-ImplicitCastExpr 0x7fb38fb5e478 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:504:86> 'unsigned long' <IntegralCast>
|   |       |         `-IntegerLiteral 0x7fb38fa58108 <col:86> 'int' 1
|   |       `-ImplicitCastExpr 0x7fb38fb5e520 <col:92> 'long' <IntegralCast>
|   |         `-IntegerLiteral 0x7fb38fa581d0 <col:92> 'int' 1
|   |-ClassTemplateDecl 0x7fb38fb5e7c0 <line:506:9, line:507:16> col:16 __mul
|   | |-NonTypeTemplateParmDecl 0x7fb38fb5e5f8 <line:506:19, col:28> col:28 'intmax_t':'long' depth 0 index 0 _Xp
|   | |-NonTypeTemplateParmDecl 0x7fb38fb5e650 <col:33, col:42> col:42 'intmax_t':'long' depth 0 index 1 _Yp
|   | |-NonTypeTemplateParmDecl 0x7fb38fb5e6a8 <col:47, col:52> col:52 '_Bool' depth 0 index 2 __overflow
|   | |-CXXRecordDecl 0x7fb38fb5e728 <line:507:9, col:16> col:16 struct __mul
|   | |-ClassTemplateSpecializationDecl 0x7fb38fb5f428 <line:506:9, line:507:16> col:16 struct __mul definition
|   | | |-TemplateArgument integral 1
|   | | |-TemplateArgument integral 1
|   | | |-TemplateArgument integral 0
|   | | |-CXXRecordDecl 0x7fb38fb5f6f8 prev 0x7fb38fb5f428 <col:9, col:16> col:16 implicit struct __mul
|   | | `-VarDecl 0x7fb38fb5f790 <line:509:13, col:49> col:35 referenced value 'const intmax_t':'const long' static cinit
|   | |   `-BinaryOperator 0x7fb38fb5f890 <col:43, col:49> 'long' '*'
|   | |     |-SubstNonTypeTemplateParmExpr 0x7fb38fb5f820 <col:43> 'long'
|   | |     | `-IntegerLiteral 0x7fb38fb5f800 <col:43> 'long' 1
|   | |     `-SubstNonTypeTemplateParmExpr 0x7fb38fb5f868 <col:49> 'long'
|   | |       `-IntegerLiteral 0x7fb38fb5f848 <col:49> 'long' 1
|   | `-ClassTemplateSpecializationDecl 0x7fb38fb5fa48 <line:506:9, line:507:16> col:16 struct __mul definition
|   |   |-TemplateArgument integral 1
|   |   |-TemplateArgument integral 1000000000
|   |   |-TemplateArgument integral 0
|   |   |-CXXRecordDecl 0x7fb38fb5fd18 prev 0x7fb38fb5fa48 <col:9, col:16> col:16 implicit struct __mul
|   |   `-VarDecl 0x7fb38fb5fdb0 <line:509:13, col:49> col:35 referenced value 'const intmax_t':'const long' static cinit
|   |     `-BinaryOperator 0x7fb38fb5feb0 <col:43, col:49> 'long' '*'
|   |       |-SubstNonTypeTemplateParmExpr 0x7fb38fb5fe40 <col:43> 'long'
|   |       | `-IntegerLiteral 0x7fb38fb5fe20 <col:43> 'long' 1
|   |       `-SubstNonTypeTemplateParmExpr 0x7fb38fb5fe88 <col:49> 'long'
|   |         `-IntegerLiteral 0x7fb38fb5fe68 <col:49> 'long' 1000000000
|   |-AccessSpecDecl 0x7fb38fb5efd0 <line:518:5, col:11> col:5 public
|   |-VarDecl 0x7fb38fb5eff8 <line:519:9, col:78> col:27 referenced value 'const _Bool' static cinit
|   | `-BinaryOperator 0x7fb38fb5f2c8 <col:35, col:78> '_Bool' '&&'
|   |   |-ParenExpr 0x7fb38fb5f178 <col:35, col:54> '_Bool'
|   |   | `-BinaryOperator 0x7fb38fb5f150 <col:36, col:50> '_Bool' '<='
|   |   |   |-ImplicitCastExpr 0x7fb38fb5f138 <col:36> 'intmax_t':'long' <LValueToRValue>
|   |   |   | `-DeclRefExpr 0x7fb38fb5f068 <col:36> 'const intmax_t':'const long' lvalue Var 0x7fb38fb5dd08 '__n1' 'const intmax_t':'const long'
|   |   |   `-BinaryOperator 0x7fb38fb5f110 <col:44, col:50> 'long' '/'
|   |   |     |-ImplicitCastExpr 0x7fb38fb5f0e0 <col:44> 'intmax_t':'long' <LValueToRValue>
|   |   |     | `-DeclRefExpr 0x7fb38fb5f090 <col:44> 'const intmax_t':'const long' lvalue Var 0x7fb38fb5e388 'max' 'const intmax_t':'const long'
|   |   |     `-ImplicitCastExpr 0x7fb38fb5f0f8 <col:50> 'intmax_t':'long' <LValueToRValue>
|   |   |       `-DeclRefExpr 0x7fb38fb5f0b8 <col:50> 'const intmax_t':'const long' lvalue Var 0x7fb38fb5e1e8 '__d2' 'const intmax_t':'const long'
|   |   `-ParenExpr 0x7fb38fb5f2a8 <col:59, col:78> '_Bool'
|   |     `-BinaryOperator 0x7fb38fb5f280 <col:60, col:74> '_Bool' '<='
|   |       |-ImplicitCastExpr 0x7fb38fb5f268 <col:60> 'intmax_t':'long' <LValueToRValue>
|   |       | `-DeclRefExpr 0x7fb38fb5f198 <col:60> 'const intmax_t':'const long' lvalue Var 0x7fb38fb5e048 '__n2' 'const intmax_t':'const long'
|   |       `-BinaryOperator 0x7fb38fb5f240 <col:68, col:74> 'long' '/'
|   |         |-ImplicitCastExpr 0x7fb38fb5f210 <col:68> 'intmax_t':'long' <LValueToRValue>
|   |         | `-DeclRefExpr 0x7fb38fb5f1c0 <col:68> 'const intmax_t':'const long' lvalue Var 0x7fb38fb5e388 'max' 'const intmax_t':'const long'
|   |         `-ImplicitCastExpr 0x7fb38fb5f228 <col:74> 'intmax_t':'long' <LValueToRValue>
|   |           `-DeclRefExpr 0x7fb38fb5f1e8 <col:74> 'const intmax_t':'const long' lvalue Var 0x7fb38fb5dea8 '__d1' 'const intmax_t':'const long'
|   `-TypedefDecl 0x7fb38fb60068 <line:520:9, line:521:57> col:57 referenced type 'ratio<__mul<__n1, __d2, !value>::value, __mul<__n2, __d1, !value>::value>':'class std::__1::ratio<1, 1000000000>'
|     `-TemplateSpecializationType 0x7fb38fb5ffc0 'ratio<__mul<__n1, __d2, !value>::value, __mul<__n2, __d1, !value>::value>' sugar ratio
|       |-TemplateArgument expr
|       | `-ImplicitCastExpr 0x7fb38fb5ff88 <line:520:23, col:50> 'intmax_t':'long' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb38fb5f930 <col:23, col:50> 'const intmax_t':'const long' lvalue Var 0x7fb38fb5f790 'value' 'const intmax_t':'const long'
|       |-TemplateArgument expr
|       | `-ImplicitCastExpr 0x7fb38fb5ffa0 <line:521:23, col:50> 'intmax_t':'long' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb38fb5ff50 <col:23, col:50> 'const intmax_t':'const long' lvalue Var 0x7fb38fb5fdb0 'value' 'const intmax_t':'const long'
|       `-RecordType 0x7fb38fa2d8c0 'class std::__1::ratio<1, 1000000000>'
|         `-ClassTemplateSpecialization 0x7fb38fa2d7b8 'ratio'
|-AccessSpecDecl 0x7fb38fb00928 <line:524:1, col:7> col:1 public
|-TypedefDecl 0x7fb38fb00960 <line:525:5, col:18> col:18 referenced rep 'long double':'long double'
| `-SubstTemplateTypeParmType 0x7fb38fac9360 'long double' sugar
|   |-TemplateTypeParmType 0x7fb38fa56560 '_Rep' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fb38fa56518 '_Rep'
|   `-BuiltinType 0x7fb38f032d00 'long double'
|-TypedefDecl 0x7fb38fb009f8 <line:526:5, col:36> col:36 referenced period 'typename class ratio<1, 1>::type':'class std::__1::ratio<1, 1>'
| `-ElaboratedType 0x7fb38faf4220 'typename class ratio<1, 1>::type' sugar
|   `-TypedefType 0x7fb38faf4200 'std::__1::ratio<1, 1>::type' sugar
|     |-Typedef 0x7fb38fac83e8 'type'
|     `-TemplateSpecializationType 0x7fb38fac8340 'ratio<num, den>' sugar ratio
|       |-TemplateArgument expr
|       | `-ImplicitCastExpr 0x7fb38fac8308 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ratio:260:19> 'intmax_t':'long' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb38fac7ea8 <col:19> 'const intmax_t':'const long' lvalue Var 0x7fb38fac7b60 'num' 'const intmax_t':'const long'
|       |-TemplateArgument expr
|       | `-ImplicitCastExpr 0x7fb38fac8320 <col:24> 'intmax_t':'long' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb38fac80d8 <col:24> 'const intmax_t':'const long' lvalue Var 0x7fb38fac7d38 'den' 'const intmax_t':'const long'
|       `-RecordType 0x7fb38fa45e60 'class std::__1::ratio<1, 1>'
|         `-ClassTemplateSpecialization 0x7fb38fa45d58 'ratio'
|-AccessSpecDecl 0x7fb38fb00a50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:527:1, col:8> col:1 private
|-FieldDecl 0x7fb38fb00ab0 <line:528:5, col:9> col:9 referenced __rep_ 'std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep':'long double'
|-AccessSpecDecl 0x7fb38fb00af8 <line:529:1, col:7> col:1 public
|-CXXConstructorDecl 0x7fb38fb00b60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:533:28> col:9 duration 'void (void)' default trivial noexcept-unevaluated 0x7fb38fb00b60
| `-AlwaysInlineAttr 0x7fb38fb00c48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7fb38fb01408 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:538:5, line:547:32> line:540:18 duration
| |-TemplateTypeParmDecl 0x7fb38fb00c90 <line:538:15, col:21> col:21 class depth 0 index 0 _Rep2
| |-CXXConstructorDecl 0x7fb38fb01360 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:547:32> line:540:18 constexpr duration 'void (const _Rep2 &, typename enable_if<is_convertible<_Rep2, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<_Rep2>::value)>::type *)'
| | |-ParmVarDecl 0x7fb38fb00d48 <col:27, col:40> col:40 __r 'const _Rep2 &'
| | |-ParmVarDecl 0x7fb38fb01270 <line:541:13, line:546:24> col:22 'typename enable_if<is_convertible<_Rep2, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<_Rep2>::value)>::type *'
| | `-AlwaysInlineAttr 0x7fb38fb01468 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-CXXConstructorDecl 0x7fb38fb05fe0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:547:32> line:540:18 used constexpr duration 'void (const long double &, typename enable_if<is_convertible<long double, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<long double>::value)>::type *)'
|   |-TemplateArgument type 'long double'
|   |-ParmVarDecl 0x7fb38fb05aa8 <col:27, col:40> col:40 used __r 'const long double &'
|   |-ParmVarDecl 0x7fb38fb05f10 <line:541:13, line:546:24> col:22 'typename enable_if<is_convertible<long double, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<long double>::value)>::type *' cinit
|   | `-ImplicitCastExpr 0x7fb38fb061e0 <col:24> 'typename enable_if<is_convertible<long double, rep>::value && (treat_as_floating_point<rep>::value || !treat_as_floating_point<long double>::value)>::type *' <NullToPointer>
|   |   `-IntegerLiteral 0x7fb38fa5d7e0 <col:24> 'int' 0
|   |-CXXCtorInitializer Field 0x7fb38fb00ab0 '__rep_' 'std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep':'long double'
|   | `-ImplicitCastExpr 0x7fb38fb06270 <line:547:26> 'long double':'long double' <LValueToRValue>
|   |   `-DeclRefExpr 0x7fb38fb06218 <col:26> 'const long double':'const long double' lvalue ParmVar 0x7fb38fb05aa8 '__r' 'const long double &'
|   |-CompoundStmt 0x7fb38fa5d8a8 <col:31, col:32>
|   `-AlwaysInlineAttr 0x7fb38fb060f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7fb38fb02378 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:550:5, line:560:80> line:552:9 duration
| |-TemplateTypeParmDecl 0x7fb38fb01538 <line:550:15, col:21> col:21 class depth 0 index 0 _Rep2
| |-TemplateTypeParmDecl 0x7fb38fb015a8 <col:28, col:34> col:34 class depth 0 index 1 _Period2
| |-CXXConstructorDecl 0x7fb38fb022d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:560:80> line:552:9 constexpr duration 'void (const duration<_Rep2, _Period2> &, typename enable_if<__no_overflow<_Period2, period>::value && (treat_as_floating_point<rep>::value || (__no_overflow<_Period2, period>::type::den == 1 && !treat_as_floating_point<_Rep2>::value))>::type *)'
| | |-ParmVarDecl 0x7fb38fb01738 <col:18, col:51> col:51 __d 'const duration<_Rep2, _Period2> &'
| | |-ParmVarDecl 0x7fb38fb021a0 <line:553:13, line:559:24> col:22 'typename enable_if<__no_overflow<_Period2, period>::value && (treat_as_floating_point<rep>::value || (__no_overflow<_Period2, period>::type::den == 1 && !treat_as_floating_point<_Rep2>::value))>::type *'
| | `-AlwaysInlineAttr 0x7fb38fb023d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| |-CXXConstructorDecl 0x7fb38fb0b410 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:560:80> line:552:9 constexpr duration 'void (const duration<long double, class std::__1::ratio<1, 1> > &, typename enable_if<__no_overflow<class ratio<1, 1>, period>::value && (treat_as_floating_point<rep>::value || (__no_overflow<class ratio<1, 1>, period>::type::den == 1 && !treat_as_floating_point<long double>::value))>::type *)'
| | |-TemplateArgument type 'long double'
| | |-TemplateArgument type 'class std::__1::ratio<1, 1>'
| | |-ParmVarDecl 0x7fb38fb065c8 <col:18, col:51> col:51 __d 'const duration<long double, class std::__1::ratio<1, 1> > &'
| | |-ParmVarDecl 0x7fb38fb0b300 <line:553:13, line:559:24> col:22 'typename enable_if<__no_overflow<class ratio<1, 1>, period>::value && (treat_as_floating_point<rep>::value || (__no_overflow<class ratio<1, 1>, period>::type::den == 1 && !treat_as_floating_point<long double>::value))>::type *'
| | `-AlwaysInlineAttr 0x7fb38fb0b538 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-CXXConstructorDecl 0x7fb38fb607c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:560:80> line:552:9 used constexpr duration 'void (const duration<long long, class std::__1::ratio<1, 1000000000> > &, typename enable_if<__no_overflow<class ratio<1, 1000000000>, period>::value && (treat_as_floating_point<rep>::value || (__no_overflow<class ratio<1, 1000000000>, period>::type::den == 1 && !treat_as_floating_point<long long>::value))>::type *)'
|   |-TemplateArgument type 'long long'
|   |-TemplateArgument type 'class std::__1::ratio<1, 1000000000>'
|   |-ParmVarDecl 0x7fb38fb5d3d8 <col:18, col:51> col:51 used __d 'const duration<long long, class std::__1::ratio<1, 1000000000> > &'
|   |-ParmVarDecl 0x7fb38fb606f0 <line:553:13, line:559:24> col:22 'typename enable_if<__no_overflow<class ratio<1, 1000000000>, period>::value && (treat_as_floating_point<rep>::value || (__no_overflow<class ratio<1, 1000000000>, period>::type::den == 1 && !treat_as_floating_point<long long>::value))>::type *' cinit
|   | `-ImplicitCastExpr 0x7fb38fb60960 <col:24> 'typename enable_if<__no_overflow<class ratio<1, 1000000000>, period>::value && (treat_as_floating_point<rep>::value || (__no_overflow<class ratio<1, 1000000000>, period>::type::den == 1 && !treat_as_floating_point<long long>::value))>::type *' <NullToPointer>
|   |   `-IntegerLiteral 0x7fb38fa5d800 <col:24> 'int' 0
|   |-CXXCtorInitializer Field 0x7fb38fb00ab0 '__rep_' 'std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep':'long double'
|   | `-ExprWithCleanups 0x7fb38f2b9008 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:560:76> 'std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep':'long double'
|   |   `-CXXMemberCallExpr 0x7fb38f2b8f98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:560:76> 'std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep':'long double'
|   |     `-MemberExpr 0x7fb38f2b8e98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:560:70> '<bound member function type>' .count 0x7fb38fb02500
|   |       `-ImplicitCastExpr 0x7fb38f2b8fc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:560:68> 'const class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >' xvalue <NoOp>
|   |         `-MaterializeTemporaryExpr 0x7fb38f2b8e80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:560:68> 'typename enable_if<__is_duration<class duration<long double, class ratio<1, 1> > >::value, class duration<long double, class ratio<1, 1> > >::type':'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >' xvalue
|   |           `-CallExpr 0x7fb38f2b8e50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:560:68> 'typename enable_if<__is_duration<class duration<long double, class ratio<1, 1> > >::value, class duration<long double, class ratio<1, 1> > >::type':'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >'
|   |             |-ImplicitCastExpr 0x7fb38f2b8e38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:560:63> 'typename enable_if<__is_duration<class duration<long double, class ratio<1, 1> > >::value, class duration<long double, class ratio<1, 1> > >::type (*)(const duration<long long, class std::__1::ratio<1, 1000000000> > &)' <FunctionToPointerDecay>
|   |             | `-DeclRefExpr 0x7fb38fb61c70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:560:63> 'typename enable_if<__is_duration<class duration<long double, class ratio<1, 1> > >::value, class duration<long double, class ratio<1, 1> > >::type (const duration<long long, class std::__1::ratio<1, 1000000000> > &)' lvalue Function 0x7fb38fb61b00 'duration_cast' 'typename enable_if<__is_duration<class duration<long double, class ratio<1, 1> > >::value, class duration<long double, class ratio<1, 1> > >::type (const duration<long long, class std::__1::ratio<1, 1000000000> > &)' (FunctionTemplate 0x7fb38fa54378 'duration_cast')
|   |             `-DeclRefExpr 0x7fb38fb60a40 <col:65> 'const duration<long long, class std::__1::ratio<1, 1000000000> >':'const class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >' lvalue ParmVar 0x7fb38fb5d3d8 '__d' 'const duration<long long, class std::__1::ratio<1, 1000000000> > &'
|   |-CompoundStmt 0x7fb38fa5db40 <col:79, col:80>
|   `-AlwaysInlineAttr 0x7fb38fb608e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fb02500 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:564:82> col:53 used constexpr count 'std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep (void) const'
| |-CompoundStmt 0x7fb38f2b8f78 <col:67, col:82>
| | `-ReturnStmt 0x7fb38f2b8f60 <col:68, col:75>
| |   `-ImplicitCastExpr 0x7fb38f2b8f48 <col:75> 'std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep':'long double' <LValueToRValue>
| |     `-MemberExpr 0x7fb38f2b8f10 <col:75> 'const std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep':'const long double' lvalue ->__rep_ 0x7fb38fb00ab0
| |       `-CXXThisExpr 0x7fb38f2b8ef8 <col:75> 'const class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > *' this
| `-AlwaysInlineAttr 0x7fb38fb025a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fb03e20 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:568:156> col:86 constexpr operator+ 'typename common_type<class duration<long double, class ratio<1, 1> > >::type (void) const'
| `-AlwaysInlineAttr 0x7fb38fb03ec8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fb04070 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:569:158> col:86 constexpr operator- 'typename common_type<class duration<long double, class ratio<1, 1> > >::type (void) const'
| `-AlwaysInlineAttr 0x7fb38fb04118 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fb041e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:570:113> col:71 operator++ 'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &(void)'
| `-AlwaysInlineAttr 0x7fb38fb04288 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fb04390 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:571:116> col:71 operator++ 'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > (int)'
| |-ParmVarDecl 0x7fb38fb042d0 <col:82> col:85 'int'
| `-AlwaysInlineAttr 0x7fb38fb04440 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fb044a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:572:113> col:71 operator-- 'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &(void)'
| `-AlwaysInlineAttr 0x7fb38fb04550 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fb04620 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:573:116> col:71 operator-- 'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > (int)'
| |-ParmVarDecl 0x7fb38fb04598 <col:82> col:85 'int'
| `-AlwaysInlineAttr 0x7fb38fb046d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fb04820 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:575:140> col:71 operator+= 'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &(const class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &)'
| |-ParmVarDecl 0x7fb38fb04758 <col:82, col:98> col:98 __d 'const class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &'
| `-AlwaysInlineAttr 0x7fb38fb048d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fb049b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:576:140> col:71 operator-= 'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &(const class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &)'
| |-ParmVarDecl 0x7fb38fb04928 <col:82, col:98> col:98 __d 'const class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &'
| `-AlwaysInlineAttr 0x7fb38fb04a60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fb04bf0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:578:127> col:71 operator*= 'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &(const std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep &)'
| |-ParmVarDecl 0x7fb38fb04ae8 <col:82, col:93> col:93 rhs 'const std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep &'
| `-AlwaysInlineAttr 0x7fb38fb04ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fb04d80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:579:127> col:71 operator/= 'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &(const std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep &)'
| |-ParmVarDecl 0x7fb38fb04cf8 <col:82, col:93> col:93 rhs 'const std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep &'
| `-AlwaysInlineAttr 0x7fb38fb04e30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fb04f10 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:580:127> col:71 operator%= 'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &(const std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep &)'
| |-ParmVarDecl 0x7fb38fb04e88 <col:82, col:93> col:93 rhs 'const std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep &'
| `-AlwaysInlineAttr 0x7fb38fb04fc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fb050a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:581:140> col:71 operator%= 'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &(const class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &)'
| |-ParmVarDecl 0x7fb38fb05018 <col:82, col:98> col:98 rhs 'const class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &'
| `-AlwaysInlineAttr 0x7fb38fb05150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fb051f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:585:119> col:65 constexpr zero 'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > (void)' static
| `-AlwaysInlineAttr 0x7fb38fb05298 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fb05300 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:586:118> col:65 constexpr min 'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > (void)' static
| `-AlwaysInlineAttr 0x7fb38fb053a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7fb38fb05410 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:587:118> col:65 constexpr max 'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > (void)' static
| `-AlwaysInlineAttr 0x7fb38fb054b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7fb38fb056a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:488:28> col:28 implicit constexpr duration 'void (const class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &)' inline default trivial noexcept-unevaluated 0x7fb38fb056a0
| `-ParmVarDecl 0x7fb38fb057d0 <col:28> col:28 'const class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &'
|-CXXConstructorDecl 0x7fb38fb05868 <col:28> col:28 implicit used constexpr duration 'void (class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7fb38fb05990 <col:28> col:28 used 'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &&'
| |-CXXCtorInitializer Field 0x7fb38fb00ab0 '__rep_' 'std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep':'long double'
| | `-ImplicitCastExpr 0x7fb38fb0b690 <col:28> 'std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep':'long double' <LValueToRValue>
| |   `-MemberExpr 0x7fb38fb0b640 <col:28> 'std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep':'long double' xvalue .__rep_ 0x7fb38fb00ab0
| |     `-CXXStaticCastExpr 0x7fb38fb0b610 <col:28> 'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >' xvalue static_cast<class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &&> <NoOp>
| |       `-DeclRefExpr 0x7fb38fb0b5d8 <col:28> 'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >' lvalue ParmVar 0x7fb38fb05990 '' 'class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> > &&'
| `-CompoundStmt 0x7fb38fb0b6d8 <col:28>
`-CXXDestructorDecl 0x7fb38fb062f8 <col:28> col:28 implicit referenced ~duration 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::chrono::duration.0" = type { x86_fp80 }
  NonVirtualBaseLLVMType:%"class.std::__1::chrono::duration.0" = type { x86_fp80 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb38fa5f220 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:487:1, line:588:1> line:488:28 class duration definition
|-TemplateArgument type 'long long'
|-TemplateArgument type 'class std::__1::ratio<1, 1000000000>'
|-CXXRecordDecl 0x7fb38fa9cdf0 prev 0x7fb38fa5f220 <col:1, col:28> col:28 implicit class duration
|-StaticAssertDecl 0x7fb38fa9cfb0 <line:490:5, col:97> col:5
| |-UnaryOperator 0x7fb38fa9cf90 <col:19, col:41> '_Bool' prefix '!'
| | `-ImplicitCastExpr 0x7fb38fa9cf78 <col:20, col:41> '_Bool':'_Bool' <LValueToRValue>
| |   `-DeclRefExpr 0x7fb38fa9cf40 <col:20, col:41> 'const _Bool':'const _Bool' lvalue Var 0x7fb38f9f3548 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fb38fa56a28 <col:48> 'const char [48]' lvalue "A duration representation can not be a duration"
|-StaticAssertDecl 0x7fb38fa9d538 <line:491:5, col:107> col:5
| |-DeclRefExpr 0x7fb38fa9d4e8 <col:19, col:40> 'const _Bool':'const _Bool' lvalue Var 0x7fb38fa83310 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fb38fa56c98 <col:47> 'const char [59]' lvalue "Second template parameter of duration must be a std::ratio"
|-StaticAssertDecl 0x7fb38faa1220 <line:492:5, col:71> col:5
| |-BinaryOperator 0x7fb38faa11f8 <col:19, col:34> '_Bool' '>'
| | |-ImplicitCastExpr 0x7fb38faa11c8 <col:19, col:28> 'intmax_t':'long' <LValueToRValue>
| | | `-DeclRefExpr 0x7fb38faa1190 <col:19, col:28> 'const intmax_t':'const long' lvalue Var 0x7fb38faa0c00 'num' 'const intmax_t':'const long'
| | `-ImplicitCastExpr 0x7fb38faa11e0 <col:34> 'long' <IntegralCast>
| |   `-IntegerLiteral 0x7fb38fa56dc8 <col:34> 'int' 0
| `-StringLiteral 0x7fb38fa56ee0 <col:37> 'const char [33]' lvalue "duration period must be positive"
|-ClassTemplateDecl 0x7fb38faa13f0 <line:494:5, line:495:12> col:12 __no_overflow
| |-TemplateTypeParmDecl 0x7fb38faa1258 <line:494:15, col:21> col:21 class depth 0 index 0 _R1
| |-TemplateTypeParmDecl 0x7fb38faa12c8 <col:26, col:32> col:32 class depth 0 index 1 _R2
| |-CXXRecordDecl 0x7fb38faa1358 <line:495:5, col:12> col:12 struct __no_overflow
| |-ClassTemplateSpecializationDecl 0x7fb3902a7998 <line:494:5, line:495:12> col:12 struct __no_overflow definition
| | |-TemplateArgument type 'class std::__1::ratio<1, 1000000000>'
| | |-TemplateArgument type 'class std::__1::ratio<1, 1000000000>'
| | |-CXXRecordDecl 0x7fb3902a7bf8 prev 0x7fb3902a7998 <col:5, col:12> col:12 implicit struct __no_overflow
| | |-AccessSpecDecl 0x7fb3902a7c90 <line:497:5, col:12> col:5 private
| | |-VarDecl 0x7fb3902a7cb8 <line:498:9, col:79> col:31 referenced __gcd_n1_n2 'const intmax_t':'const long' static cinit
| | | `-ImplicitCastExpr 0x7fb3902a7fa8 <col:45, col:79> 'intmax_t':'long' <LValueToRValue>
| | |   `-DeclRefExpr 0x7fb3902a7f70 <col:45, col:79> 'const intmax_t':'const long' lvalue Var 0x7fb38fa98e30 'value' 'const intmax_t':'const long'
| | |-VarDecl 0x7fb3902a8018 <line:499:9, col:79> col:31 referenced __gcd_d1_d2 'const intmax_t':'const long' static cinit
| | | `-ImplicitCastExpr 0x7fb3902a8278 <col:45, col:79> 'intmax_t':'long' <LValueToRValue>
| | |   `-DeclRefExpr 0x7fb3902a8240 <col:45, col:79> 'const intmax_t':'const long' lvalue Var 0x7fb38faa5530 'value' 'const intmax_t':'const long'
| | |-VarDecl 0x7fb3902a82e8 <line:500:9, col:49> col:31 referenced __n1 'const intmax_t':'const long' static cinit
| | | `-BinaryOperator 0x7fb3902a8408 <col:38, col:49> 'long' '/'
| | |   |-ImplicitCastExpr 0x7fb3902a83d8 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
| | |   | `-DeclRefExpr 0x7fb3902a8378 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38faa0c00 'num' 'const intmax_t':'const long'
| | |   `-ImplicitCastExpr 0x7fb3902a83f0 <col:49> 'intmax_t':'long' <LValueToRValue>
| | |     `-DeclRefExpr 0x7fb3902a83b0 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb3902a7cb8 '__gcd_n1_n2' 'const intmax_t':'const long'
| | |-VarDecl 0x7fb3902a8488 <line:501:9, col:49> col:31 referenced __d1 'const intmax_t':'const long' static cinit
| | | `-BinaryOperator 0x7fb3902a85a8 <col:38, col:49> 'long' '/'
| | |   |-ImplicitCastExpr 0x7fb3902a8578 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
| | |   | `-DeclRefExpr 0x7fb3902a8518 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38faa0e30 'den' 'const intmax_t':'const long'
| | |   `-ImplicitCastExpr 0x7fb3902a8590 <col:49> 'intmax_t':'long' <LValueToRValue>
| | |     `-DeclRefExpr 0x7fb3902a8550 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb3902a8018 '__gcd_d1_d2' 'const intmax_t':'const long'
| | |-VarDecl 0x7fb3902a8628 <line:502:9, col:49> col:31 referenced __n2 'const intmax_t':'const long' static cinit
| | | `-BinaryOperator 0x7fb3902a8748 <col:38, col:49> 'long' '/'
| | |   |-ImplicitCastExpr 0x7fb3902a8718 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
| | |   | `-DeclRefExpr 0x7fb3902a86b8 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38faa0c00 'num' 'const intmax_t':'const long'
| | |   `-ImplicitCastExpr 0x7fb3902a8730 <col:49> 'intmax_t':'long' <LValueToRValue>
| | |     `-DeclRefExpr 0x7fb3902a86f0 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb3902a7cb8 '__gcd_n1_n2' 'const intmax_t':'const long'
| | |-VarDecl 0x7fb3902a87c8 <line:503:9, col:49> col:31 referenced __d2 'const intmax_t':'const long' static cinit
| | | `-BinaryOperator 0x7fb3902a88e8 <col:38, col:49> 'long' '/'
| | |   |-ImplicitCastExpr 0x7fb3902a88b8 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
| | |   | `-DeclRefExpr 0x7fb3902a8858 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38faa0e30 'den' 'const intmax_t':'const long'
| | |   `-ImplicitCastExpr 0x7fb3902a88d0 <col:49> 'intmax_t':'long' <LValueToRValue>
| | |     `-DeclRefExpr 0x7fb3902a8890 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb3902a8018 '__gcd_d1_d2' 'const intmax_t':'const long'
| | |-VarDecl 0x7fb3902a8968 <line:504:9, col:93> col:31 referenced max 'const intmax_t':'const long' static cinit
| | | `-UnaryOperator 0x7fb3902a8b60 <col:37, col:93> 'long' prefix '-'
| | |   `-ParenExpr 0x7fb3902a8b40 <col:38, col:93> 'long'
| | |     `-BinaryOperator 0x7fb3902a8b18 <col:39, col:92> 'long' '+'
| | |       |-ParenExpr 0x7fb3902a8ae0 <col:39, col:88> 'intmax_t':'long'
| | |       | `-BinaryOperator 0x7fb3902a8ab8 <col:40, col:87> 'intmax_t':'long' '<<'
| | |       |   |-CXXFunctionalCastExpr 0x7fb3902a89f0 <col:40, col:50> 'intmax_t':'long' functional cast to intmax_t <NoOp>
| | |       |   | `-ImplicitCastExpr 0x7fb3902a89d8 <col:49> 'intmax_t':'long' <IntegralCast>
| | |       |   |   `-IntegerLiteral 0x7fb38fa58018 <col:49> 'int' 1
| | |       |   `-ParenExpr 0x7fb3902a8a98 <col:55, col:87> 'unsigned long'
| | |       |     `-BinaryOperator 0x7fb3902a8a70 <col:56, col:86> 'unsigned long' '-'
| | |       |       |-BinaryOperator 0x7fb3902a8a30 <col:56, <built-in>:66:22> 'unsigned long' '*'
| | |       |       | |-UnaryExprOrTypeTraitExpr 0x7fb38fa58088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:504:56, col:71> 'unsigned long' sizeof 'intmax_t':'long'
| | |       |       | `-ImplicitCastExpr 0x7fb3902a8a18 <<built-in>:66:22> 'unsigned long' <IntegralCast>
| | |       |       |   `-IntegerLiteral 0x7fb38fa580a8 <col:22> 'int' 8
| | |       |       `-ImplicitCastExpr 0x7fb3902a8a58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:504:86> 'unsigned long' <IntegralCast>
| | |       |         `-IntegerLiteral 0x7fb38fa58108 <col:86> 'int' 1
| | |       `-ImplicitCastExpr 0x7fb3902a8b00 <col:92> 'long' <IntegralCast>
| | |         `-IntegerLiteral 0x7fb38fa581d0 <col:92> 'int' 1
| | |-ClassTemplateDecl 0x7fb3902a8da0 <line:506:9, line:507:16> col:16 __mul
| | | |-NonTypeTemplateParmDecl 0x7fb3902a8bd8 <line:506:19, col:28> col:28 'intmax_t':'long' depth 0 index 0 _Xp
| | | |-NonTypeTemplateParmDecl 0x7fb3902a8c30 <col:33, col:42> col:42 'intmax_t':'long' depth 0 index 1 _Yp
| | | |-NonTypeTemplateParmDecl 0x7fb3902a8c88 <col:47, col:52> col:52 '_Bool' depth 0 index 2 __overflow
| | | |-CXXRecordDecl 0x7fb3902a8d08 <line:507:9, col:16> col:16 struct __mul
| | | `-ClassTemplateSpecializationDecl 0x7fb3902a9a08 <line:506:9, line:507:16> col:16 struct __mul definition
| | |   |-TemplateArgument integral 1
| | |   |-TemplateArgument integral 1
| | |   |-TemplateArgument integral 0
| | |   |-CXXRecordDecl 0x7fb3902a9cd8 prev 0x7fb3902a9a08 <col:9, col:16> col:16 implicit struct __mul
| | |   `-VarDecl 0x7fb3902a9d70 <line:509:13, col:49> col:35 referenced value 'const intmax_t':'const long' static cinit
| | |     `-BinaryOperator 0x7fb3902a9e70 <col:43, col:49> 'long' '*'
| | |       |-SubstNonTypeTemplateParmExpr 0x7fb3902a9e00 <col:43> 'long'
| | |       | `-IntegerLiteral 0x7fb3902a9de0 <col:43> 'long' 1
| | |       `-SubstNonTypeTemplateParmExpr 0x7fb3902a9e48 <col:49> 'long'
| | |         `-IntegerLiteral 0x7fb3902a9e28 <col:49> 'long' 1
| | |-AccessSpecDecl 0x7fb3902a95b0 <line:518:5, col:11> col:5 public
| | |-VarDecl 0x7fb3902a95d8 <line:519:9, col:78> col:27 referenced value 'const _Bool' static cinit
| | | `-BinaryOperator 0x7fb3902a98a8 <col:35, col:78> '_Bool' '&&'
| | |   |-ParenExpr 0x7fb3902a9758 <col:35, col:54> '_Bool'
| | |   | `-BinaryOperator 0x7fb3902a9730 <col:36, col:50> '_Bool' '<='
| | |   |   |-ImplicitCastExpr 0x7fb3902a9718 <col:36> 'intmax_t':'long' <LValueToRValue>
| | |   |   | `-DeclRefExpr 0x7fb3902a9648 <col:36> 'const intmax_t':'const long' lvalue Var 0x7fb3902a82e8 '__n1' 'const intmax_t':'const long'
| | |   |   `-BinaryOperator 0x7fb3902a96f0 <col:44, col:50> 'long' '/'
| | |   |     |-ImplicitCastExpr 0x7fb3902a96c0 <col:44> 'intmax_t':'long' <LValueToRValue>
| | |   |     | `-DeclRefExpr 0x7fb3902a9670 <col:44> 'const intmax_t':'const long' lvalue Var 0x7fb3902a8968 'max' 'const intmax_t':'const long'
| | |   |     `-ImplicitCastExpr 0x7fb3902a96d8 <col:50> 'intmax_t':'long' <LValueToRValue>
| | |   |       `-DeclRefExpr 0x7fb3902a9698 <col:50> 'const intmax_t':'const long' lvalue Var 0x7fb3902a87c8 '__d2' 'const intmax_t':'const long'
| | |   `-ParenExpr 0x7fb3902a9888 <col:59, col:78> '_Bool'
| | |     `-BinaryOperator 0x7fb3902a9860 <col:60, col:74> '_Bool' '<='
| | |       |-ImplicitCastExpr 0x7fb3902a9848 <col:60> 'intmax_t':'long' <LValueToRValue>
| | |       | `-DeclRefExpr 0x7fb3902a9778 <col:60> 'const intmax_t':'const long' lvalue Var 0x7fb3902a8628 '__n2' 'const intmax_t':'const long'
| | |       `-BinaryOperator 0x7fb3902a9820 <col:68, col:74> 'long' '/'
| | |         |-ImplicitCastExpr 0x7fb3902a97f0 <col:68> 'intmax_t':'long' <LValueToRValue>
| | |         | `-DeclRefExpr 0x7fb3902a97a0 <col:68> 'const intmax_t':'const long' lvalue Var 0x7fb3902a8968 'max' 'const intmax_t':'const long'
| | |         `-ImplicitCastExpr 0x7fb3902a9808 <col:74> 'intmax_t':'long' <LValueToRValue>
| | |           `-DeclRefExpr 0x7fb3902a97c8 <col:74> 'const intmax_t':'const long' lvalue Var 0x7fb3902a8488 '__d1' 'const intmax_t':'const long'
| | `-TypedefDecl 0x7fb3902aa248 <line:520:9, line:521:57> col:57 referenced type 'ratio<__mul<__n1, __d2, !value>::value, __mul<__n2, __d1, !value>::value>':'class std::__1::ratio<1, 1>'
| |   `-TemplateSpecializationType 0x7fb3902aa1a0 'ratio<__mul<__n1, __d2, !value>::value, __mul<__n2, __d1, !value>::value>' sugar ratio
| |     |-TemplateArgument expr
| |     | `-ImplicitCastExpr 0x7fb3902aa168 <line:520:23, col:50> 'intmax_t':'long' <LValueToRValue>
| |     |   `-DeclRefExpr 0x7fb3902a9f10 <col:23, col:50> 'const intmax_t':'const long' lvalue Var 0x7fb3902a9d70 'value' 'const intmax_t':'const long'
| |     |-TemplateArgument expr
| |     | `-ImplicitCastExpr 0x7fb3902aa180 <line:521:23, col:50> 'intmax_t':'long' <LValueToRValue>
| |     |   `-DeclRefExpr 0x7fb3902aa130 <col:23, col:50> 'const intmax_t':'const long' lvalue Var 0x7fb3902a9d70 'value' 'const intmax_t':'const long'
| |     `-RecordType 0x7fb38fa45e60 'class std::__1::ratio<1, 1>'
| |       `-ClassTemplateSpecialization 0x7fb38fa45d58 'ratio'
| |-ClassTemplateSpecializationDecl 0x7fb3911520a8 <line:494:5, line:495:12> col:12 struct __no_overflow definition
| | |-TemplateArgument type 'class std::__1::ratio<1, 1>'
| | |-TemplateArgument type 'class std::__1::ratio<1, 1000000000>'
| | |-CXXRecordDecl 0x7fb391152308 prev 0x7fb3911520a8 <col:5, col:12> col:12 implicit struct __no_overflow
| | |-AccessSpecDecl 0x7fb3911523a0 <line:497:5, col:12> col:5 private
| | |-VarDecl 0x7fb3911523c8 <line:498:9, col:79> col:31 referenced __gcd_n1_n2 'const intmax_t':'const long' static cinit
| | | `-ImplicitCastExpr 0x7fb391152628 <col:45, col:79> 'intmax_t':'long' <LValueToRValue>
| | |   `-DeclRefExpr 0x7fb3911525f0 <col:45, col:79> 'const intmax_t':'const long' lvalue Var 0x7fb38fa98e30 'value' 'const intmax_t':'const long'
| | |-VarDecl 0x7fb391152698 <line:499:9, col:79> col:31 referenced __gcd_d1_d2 'const intmax_t':'const long' static cinit
| | | `-ImplicitCastExpr 0x7fb3911528f8 <col:45, col:79> 'intmax_t':'long' <LValueToRValue>
| | |   `-DeclRefExpr 0x7fb3911528c0 <col:45, col:79> 'const intmax_t':'const long' lvalue Var 0x7fb38fa9ff60 'value' 'const intmax_t':'const long'
| | |-VarDecl 0x7fb391152968 <line:500:9, col:49> col:31 referenced __n1 'const intmax_t':'const long' static cinit
| | | `-BinaryOperator 0x7fb391152a88 <col:38, col:49> 'long' '/'
| | |   |-ImplicitCastExpr 0x7fb391152a58 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
| | |   | `-DeclRefExpr 0x7fb3911529f8 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38fac7ed0 'num' 'const intmax_t':'const long'
| | |   `-ImplicitCastExpr 0x7fb391152a70 <col:49> 'intmax_t':'long' <LValueToRValue>
| | |     `-DeclRefExpr 0x7fb391152a30 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb3911523c8 '__gcd_n1_n2' 'const intmax_t':'const long'
| | |-VarDecl 0x7fb391152b08 <line:501:9, col:49> col:31 referenced __d1 'const intmax_t':'const long' static cinit
| | | `-BinaryOperator 0x7fb391152c28 <col:38, col:49> 'long' '/'
| | |   |-ImplicitCastExpr 0x7fb391152bf8 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
| | |   | `-DeclRefExpr 0x7fb391152b98 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38fac8100 'den' 'const intmax_t':'const long'
| | |   `-ImplicitCastExpr 0x7fb391152c10 <col:49> 'intmax_t':'long' <LValueToRValue>
| | |     `-DeclRefExpr 0x7fb391152bd0 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb391152698 '__gcd_d1_d2' 'const intmax_t':'const long'
| | |-VarDecl 0x7fb391152ca8 <line:502:9, col:49> col:31 referenced __n2 'const intmax_t':'const long' static cinit
| | | `-BinaryOperator 0x7fb391152dc8 <col:38, col:49> 'long' '/'
| | |   |-ImplicitCastExpr 0x7fb391152d98 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
| | |   | `-DeclRefExpr 0x7fb391152d38 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38faa0c00 'num' 'const intmax_t':'const long'
| | |   `-ImplicitCastExpr 0x7fb391152db0 <col:49> 'intmax_t':'long' <LValueToRValue>
| | |     `-DeclRefExpr 0x7fb391152d70 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb3911523c8 '__gcd_n1_n2' 'const intmax_t':'const long'
| | |-VarDecl 0x7fb391152e48 <line:503:9, col:49> col:31 referenced __d2 'const intmax_t':'const long' static cinit
| | | `-BinaryOperator 0x7fb391152f68 <col:38, col:49> 'long' '/'
| | |   |-ImplicitCastExpr 0x7fb391152f38 <col:38, col:43> 'intmax_t':'long' <LValueToRValue>
| | |   | `-DeclRefExpr 0x7fb391152ed8 <col:38, col:43> 'const intmax_t':'const long' lvalue Var 0x7fb38faa0e30 'den' 'const intmax_t':'const long'
| | |   `-ImplicitCastExpr 0x7fb391152f50 <col:49> 'intmax_t':'long' <LValueToRValue>
| | |     `-DeclRefExpr 0x7fb391152f10 <col:49> 'const intmax_t':'const long' lvalue Var 0x7fb391152698 '__gcd_d1_d2' 'const intmax_t':'const long'
| | |-VarDecl 0x7fb391152fe8 <line:504:9, col:93> col:31 referenced max 'const intmax_t':'const long' static cinit
| | | `-UnaryOperator 0x7fb3911531e0 <col:37, col:93> 'long' prefix '-'
| | |   `-ParenExpr 0x7fb3911531c0 <col:38, col:93> 'long'
| | |     `-BinaryOperator 0x7fb391153198 <col:39, col:92> 'long' '+'
| | |       |-ParenExpr 0x7fb391153160 <col:39, col:88> 'intmax_t':'long'
| | |       | `-BinaryOperator 0x7fb391153138 <col:40, col:87> 'intmax_t':'long' '<<'
| | |       |   |-CXXFunctionalCastExpr 0x7fb391153070 <col:40, col:50> 'intmax_t':'long' functional cast to intmax_t <NoOp>
| | |       |   | `-ImplicitCastExpr 0x7fb391153058 <col:49> 'intmax_t':'long' <IntegralCast>
| | |       |   |   `-IntegerLiteral 0x7fb38fa58018 <col:49> 'int' 1
| | |       |   `-ParenExpr 0x7fb391153118 <col:55, col:87> 'unsigned long'
| | |       |     `-BinaryOperator 0x7fb3911530f0 <col:56, col:86> 'unsigned long' '-'
| | |       |       |-BinaryOperator 0x7fb3911530b0 <col:56, <built-in>:66:22> 'unsigned long' '*'
| | |       |       | |-UnaryExprOrTypeTraitExpr 0x7fb38fa58088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:504:56, col:71> 'unsigned long' sizeof 'intmax_t':'long'
| | |       |       | `-ImplicitCastExpr 0x7fb391153098 <<built-in>:66:22> 'unsigned long' <IntegralCast>
| | |       |       |   `-IntegerLiteral 0x7fb38fa580a8 <col:22> 'int' 8
| | |       |       `-ImplicitCastExpr 0x7fb3911530d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/chrono:504:86> 'unsigned long' <IntegralCast>
| | |       |         `-IntegerLiteral 0x7fb38fa58108 <col:86> 'int' 1
| | |       `-ImplicitCastExpr 0x7fb391153180 <col:92> 'long' <IntegralCast>
| | |         `-IntegerLiteral 0x7fb38fa581d0 <col:92> 'int' 1
| | |-ClassTemplateDecl 0x7fb391153420 <line:506:9, line:507:16> col:16 __mul
| | | |-NonTypeTemplateParmDecl 0x7fb391153258 <line:506:19, col:28> col:28 'intmax_t':'long' depth 0 index 0 _Xp
| | | |-NonTypeTemplateParmDecl 0x7fb3911532b0 <col:33, col:42> col:42 'intmax_t':'long' depth 0 index 1 _Yp
| | | |-NonTypeTemplateParmDecl 0x7fb391153308 <col:47, col:52> col:52 '_Bool' depth 0 index 2 __overflow
| | | |-CXXRecordDecl 0x7fb391153388 <line:507:9, col:16> col:16 struct __mul
| | | |-ClassTemplateSpecializationDecl 0x7fb391154088 <line:506:9, line:507:16> col:16 struct __mul definition
| | | | |-TemplateArgument integral 1
| | | | |-TemplateArgument integral 1000000000
| | | | |-TemplateArgument integral 0
| | | | |-CXXRecordDecl 0x7fb391154358 prev 0x7fb391154088 <col:9, col:16> col:16 implicit struct __mul
| | | | `-VarDecl 0x7fb3911543f0 <line:509:13, col:49> col:35 referenced value 'const intmax_t':'const long' static cinit
| | | |   `-BinaryOperator 0x7fb3911544f0 <col:43, col:49> 'long' '*'
| | | |     |-SubstNonTypeTemplateParmExpr 0x7fb391154480 <col:43> 'long'
| | | |     | `-IntegerLiteral 0x7fb391154460 <col:43> 'long' 1
| | | |     `-SubstNonTypeTemplateParmExpr 0x7fb3911544c8 <col:49> 'long'
| | | |       `-IntegerLiteral 0x7fb3911544a8 <col:49> 'long' 1000000000
| | | `-ClassTemplateSpecializationDecl 0x7fb3911546a8 <line:506:9, line:507:16> col:16 struct __mul definition
| | |   |-TemplateArgument integral 1
| | |   |-TemplateArgument integral 1
| | |   |-TemplateArgument integral 0
| | |   |-CXXRecordDecl 0x7fb391154978 prev 0x7fb3911546a8 <col:9, col:16> col:16 implicit struct __mul
| | |   `-VarDecl 0x7fb391154a10 <line:509:13, col:49> col:35 referenced value 'const intmax_t':'const long' static cinit
| | |     `-BinaryOperator 0x7fb391154b10 <col:43, col:49> 'long' '*'
| | |       |-SubstNonTypeTemplateParmExpr 0x7fb391154aa0 <col:43> 'long'
| | |       | `-IntegerLiteral 0x7fb391154a80 <col:43> 'long' 1
| | |       `-SubstNonTypeTemplateParmExpr 0x7fb391154ae8 <col:49> 'long'
| | |         `-IntegerLiteral 0x7fb391154ac8 <col:49> 'long' 1
| | |-AccessSpecDecl 0x7fb391153c30 <line:518:5, col:11> col:5 public
| | |-VarDecl 0x7fb391153c58 <line:519:9, col:78> col:27 referenced value 'const _Bool' static cinit
