
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__scalar_hash<struct std::__1::_PairT, 2> (empty)
         0 |   struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1509:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1000000000, 1>, false, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_mutex_t
         0 |   long __sig
         8 |   char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_cond_t
         0 |   long __sig
         8 |   char [40] __opaque
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1, 1>, true, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct _opaque_pthread_t *, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::hash<struct _opaque_pthread_t *> (empty)
         0 |   struct std::__1::unary_function<struct _opaque_pthread_t *, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__thread_struct
         0 |   class std::__1::__thread_struct_imp * __p_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<unsigned long, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__vector_base_common<true> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<int *, 0, false>
         0 |   int * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<int> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (empty)
         0 |   class std::__1::allocator<int> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<int *, class std::__1::allocator<int> >
         0 |   struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
         0 |     int * __value_
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<int> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__vector_base<int, class std::__1::allocator<int> >
         0 |   class std::__1::__vector_base_common<true> (base) (empty)
         0 |   std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __begin_
         8 |   std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __end_
        16 |   class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > __end_cap_
        16 |     struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
        16 |       int * __value_
        16 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (base) (empty)
        16 |       class std::__1::allocator<int> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::vector<int, class std::__1::allocator<int> >
         0 |   class std::__1::__vector_base<int, class std::__1::allocator<int> > (base)
         0 |     class std::__1::__vector_base_common<true> (base) (empty)
         0 |     std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __begin_
         8 |     std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __end_
        16 |     class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > __end_cap_
        16 |       struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
        16 |         int * __value_
        16 |       struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (base) (empty)
        16 |         class std::__1::allocator<int> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fec7db1b300 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:317:89> col:64 class __vector_base_common definition
|-TemplateArgument integral 1
|-VisibilityAttr 0x7fec7db1b498 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fec7db1b548 prev 0x7fec7db1b300 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:291:1, col:7> col:7 implicit class __vector_base_common
|-AccessSpecDecl 0x7fec7db1b5e0 <line:293:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fec7db1b648 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:294:51> col:27 __vector_base_common 'void (void)'
| `-AlwaysInlineAttr 0x7fec7db1b728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fec7db1b770 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:295:22, col:50> col:27 __throw_length_error 'void (void) const'
| `-CXX11NoReturnAttr 0x7fec7db1b818 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
|-CXXMethodDecl 0x7fec7db1b860 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:296:22, col:50> col:27 __throw_out_of_range 'void (void) const'
| `-CXX11NoReturnAttr 0x7fec7db1b908 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
`-CXXDestructorDecl 0x7fec7d786728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:317:64> col:64 implicit ~__vector_base_common 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__vector_base_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__vector_base_common.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fec7d768600 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2034:1, line:2067:1> line:2037:8 struct __compressed_pair_elem definition
|-TemplateArgument type 'int *'
|-TemplateArgument integral 0
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7fec7d768880 prev 0x7fec7d768600 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7fec7d768928 <line:2038:3, col:15> col:15 _ParamT 'int *':'int *'
| `-SubstTemplateTypeParmType 0x7fec7d767c80 'int *' sugar
|   |-TemplateTypeParmType 0x7fec7e885d80 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fec7e885d38 '_Tp'
|   `-PointerType 0x7fec7d8191d0 'int *'
|     `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7d7689e8 <line:2039:3, col:16> col:16 referenced reference 'int *&'
| `-LValueReferenceType 0x7fec7d7689b0 'int *&'
|   `-SubstTemplateTypeParmType 0x7fec7d767c80 'int *' sugar
|     |-TemplateTypeParmType 0x7fec7e885d80 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fec7e885d38 '_Tp'
|     `-PointerType 0x7fec7d8191d0 'int *'
|       `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7d768aa8 <line:2040:3, col:22> col:22 referenced const_reference 'int *const &'
| `-LValueReferenceType 0x7fec7d768a70 'int *const &'
|   `-QualType 0x7fec7d767c81 'int *const' const
|     `-SubstTemplateTypeParmType 0x7fec7d767c80 'int *' sugar
|       |-TemplateTypeParmType 0x7fec7e885d80 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fec7e885d38 '_Tp'
|       `-PointerType 0x7fec7d8191d0 'int *'
|         `-BuiltinType 0x7fec7d033bc0 'int'
|-CXXConstructorDecl 0x7fec7d768b40 <line:2043:3, col:52> col:13 constexpr __compressed_pair_elem 'void (void)'
|-FunctionTemplateDecl 0x7fec7d769328 <line:2045:3, line:2050:44> line:2049:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fec7d768bf8 <line:2045:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fec7d768c68 <col:24, line:2047:6> line:2045:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<int *, 0, false>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7fec7d769280 <line:2048:3, line:2050:44> line:2049:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7fec7d769198 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7fec7d769958 <line:2052:3, line:2056:75> line:2054:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fec7d769408 <line:2052:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7fec7d769478 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7fec7d7698b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2056:75> line:2054:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7fec7d7694f0 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fec7d769658 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7fec7d7697a8 <line:2055:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7fec7d7699e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d769b68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2062:3, col:50> col:13 __get 'std::__1::__compressed_pair_elem<int *, 0, false>::reference (void) noexcept'
|-CXXMethodDecl 0x7fec7d769cb8 <line:2063:3, col:62> col:19 __get 'std::__1::__compressed_pair_elem<int *, 0, false>::const_reference (void) const noexcept'
|-AccessSpecDecl 0x7fec7d769d60 <line:2065:1, col:8> col:1 private
|-FieldDecl 0x7fec7d769d98 <line:2066:3, col:7> col:7 __value_ 'int *':'int *'
`-CXXDestructorDecl 0x7fec7d7868e8 <line:2037:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem" = type { i32* }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem" = type { i32* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fec7d752200 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:101:1, col:52> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28 class allocator definition
|-TemplateArgument type 'int'
|-CXXRecordDecl 0x7fec7d753208 prev 0x7fec7d752200 <col:1, col:28> col:28 implicit class allocator
|-AccessSpecDecl 0x7fec7d7532a0 <line:1722:1, col:7> col:1 public
|-TypedefDecl 0x7fec7d7532c8 <line:1723:5, col:31> col:31 referenced size_type 'size_t':'unsigned long'
| `-TypedefType 0x7fec7d105a10 'size_t' sugar
|   |-Typedef 0x7fec7d0691b0 'size_t'
|   `-BuiltinType 0x7fec7d033c80 'unsigned long'
|-TypedefDecl 0x7fec7d753320 <line:1724:5, col:31> col:31 referenced difference_type 'ptrdiff_t':'long'
| `-TypedefType 0x7fec7e037750 'ptrdiff_t' sugar
|   |-Typedef 0x7fec7d069140 'ptrdiff_t'
|   `-BuiltinType 0x7fec7d033be0 'long'
|-TypedefDecl 0x7fec7d7533e8 <line:1725:5, col:31> col:31 referenced pointer 'int *'
| `-PointerType 0x7fec7d7533b0 'int *'
|   `-SubstTemplateTypeParmType 0x7fec7d753380 'int' sugar
|     |-TemplateTypeParmType 0x7fec7e874e60 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fec7e874e18 '_Tp'
|     `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7d753478 <line:1726:5, col:31> col:31 referenced const_pointer 'const int *'
| `-PointerType 0x7fec7d753440 'const int *'
|   `-QualType 0x7fec7d753381 'const int' const
|     `-SubstTemplateTypeParmType 0x7fec7d753380 'int' sugar
|       |-TemplateTypeParmType 0x7fec7e874e60 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fec7e874e18 '_Tp'
|       `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7d753508 <line:1727:5, col:31> col:31 reference 'int &'
| `-LValueReferenceType 0x7fec7d7534d0 'int &'
|   `-SubstTemplateTypeParmType 0x7fec7d753380 'int' sugar
|     |-TemplateTypeParmType 0x7fec7e874e60 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fec7e874e18 '_Tp'
|     `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7d753598 <line:1728:5, col:31> col:31 const_reference 'const int &'
| `-LValueReferenceType 0x7fec7d753560 'const int &'
|   `-QualType 0x7fec7d753381 'const int' const
|     `-SubstTemplateTypeParmType 0x7fec7d753380 'int' sugar
|       |-TemplateTypeParmType 0x7fec7e874e60 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fec7e874e18 '_Tp'
|       `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7d753600 <line:1729:5, col:31> col:31 referenced value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7fec7d753380 'int' sugar
|   |-TemplateTypeParmType 0x7fec7e874e60 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fec7e874e18 '_Tp'
|   `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7d753658 <line:1731:5, col:23> col:23 referenced propagate_on_container_move_assignment 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fec7d0a9140 'std::__1::true_type' sugar
|   |-Typedef 0x7fec7d0e6a48 'true_type'
|   `-TemplateSpecializationType 0x7fec7d0e6530 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fec7d0e6398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fec7d0e6380 <line:528:31> '_Bool' true
|     `-RecordType 0x7fec7d0e6510 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fec7d0e6408 'integral_constant'
|-TypedefDecl 0x7fec7d7536b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1732:5, col:23> col:23 referenced is_always_equal 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fec7d0a9140 'std::__1::true_type' sugar
|   |-Typedef 0x7fec7d0e6a48 'true_type'
|   `-TemplateSpecializationType 0x7fec7d0e6530 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fec7d0e6398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fec7d0e6380 <line:528:31> '_Bool' true
|     `-RecordType 0x7fec7d0e6510 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fec7d0e6408 'integral_constant'
|-ClassTemplateDecl 0x7fec7d753828 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1734:5, col:33> col:33 rebind
| |-TemplateTypeParmDecl 0x7fec7d753708 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXRecordDecl 0x7fec7d753790 <col:26, col:33> col:33 struct rebind
|-CXXConstructorDecl 0x7fec7d753a78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1736:54> col:31 referenced allocator 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fec7d753b58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fec7d753e70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:5, col:96> col:52 allocator
| |-TemplateTypeParmDecl 0x7fec7d753ba0 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXConstructorDecl 0x7fec7d753dc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:96> col:52 allocator 'void (const allocator<_Up> &) noexcept'
|   |-ParmVarDecl 0x7fec7d753ce0 <col:62, col:82> col:83 'const allocator<_Up> &'
|   `-AlwaysInlineAttr 0x7fec7d753ec8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d7540f8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1739:39> line:1738:39 address 'std::__1::allocator<int>::pointer (std::__1::allocator<int>::reference) const noexcept'
| |-ParmVarDecl 0x7fec7d753ff0 <col:47, col:57> col:57 __x 'std::__1::allocator<int>::reference':'int &'
| `-AlwaysInlineAttr 0x7fec7d7541a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d754348 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1741:39> line:1740:45 address 'std::__1::allocator<int>::const_pointer (std::__1::allocator<int>::const_reference) const noexcept'
| |-ParmVarDecl 0x7fec7d754240 <col:53, col:69> col:69 __x 'std::__1::allocator<int>::const_reference':'const int &'
| `-AlwaysInlineAttr 0x7fec7d7543f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d7545b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1748:9> line:1742:39 allocate 'std::__1::allocator<int>::pointer (std::__1::allocator::size_type, allocator<void>::const_pointer)'
| |-ParmVarDecl 0x7fec7d754440 <col:48, col:58> col:58 __n 'std::__1::allocator::size_type':'unsigned long'
| |-ParmVarDecl 0x7fec7d7544a0 <col:63, col:96> col:94 'allocator<void>::const_pointer':'const void *'
| `-AlwaysInlineAttr 0x7fec7d754668 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d754838 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1750:49> line:1749:36 deallocate 'void (std::__1::allocator<int>::pointer, std::__1::allocator::size_type) noexcept'
| |-ParmVarDecl 0x7fec7d7546c0 <col:47, col:55> col:55 __p 'std::__1::allocator<int>::pointer':'int *'
| |-ParmVarDecl 0x7fec7d754720 <col:60> col:69 'std::__1::allocator::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fec7d7548f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d754938 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1752:45> line:1751:41 max_size 'std::__1::allocator::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d7549e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fec7d754dc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1754:5, line:1760:9> line:1757:9 construct
| |-TemplateTypeParmDecl 0x7fec7d754a28 <line:1754:15, col:21> col:21 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fec7d754a98 <col:26, col:35> col:35 class depth 0 index 1 ... _Args
| `-CXXMethodDecl 0x7fec7d754d30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1760:9> line:1757:9 construct 'void (_Up *, _Args &&...)'
|   |-ParmVarDecl 0x7fec7d754b68 <col:19, col:24> col:24 __p '_Up *'
|   |-ParmVarDecl 0x7fec7d754c58 <col:29, col:40> col:40 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7fec7d754e28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d755010 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1814:70> col:36 destroy 'void (std::__1::allocator<int>::pointer)'
| |-ParmVarDecl 0x7fec7d754f08 <col:44, col:52> col:52 __p 'std::__1::allocator<int>::pointer':'int *'
| `-AlwaysInlineAttr 0x7fec7d7550c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fec7d76c0b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28> col:28 implicit referenced ~allocator 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fec7d785598 <col:28> col:28 implicit constexpr allocator 'void (const class std::__1::allocator<int> &)' inline default trivial noexcept-unevaluated 0x7fec7d785598
| `-ParmVarDecl 0x7fec7d785680 <col:28> col:28 'const class std::__1::allocator<int> &'
`-CXXConstructorDecl 0x7fec7d785718 <col:28> col:28 implicit constexpr allocator 'void (class std::__1::allocator<int> &&)' inline default trivial noexcept-unevaluated 0x7fec7d785718
  `-ParmVarDecl 0x7fec7d785840 <col:28> col:28 'class std::__1::allocator<int> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fec7d76a7e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2069:1, line:2099:1> line:2070:8 struct __compressed_pair_elem definition
|-private 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-TemplateArgument integral 1
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7fec7d76ab78 prev 0x7fec7d76a7e0 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7fec7d76ac20 <line:2071:3, col:15> col:15 _ParamT 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7fec7d76aa40 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7fec7e8881b0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fec7e888170 '_Tp'
|   `-RecordType 0x7fec7d7522f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fec7d752200 'allocator'
|-TypedefDecl 0x7fec7d76acb8 <line:2072:3, col:16> col:16 referenced reference 'class std::__1::allocator<int> &'
| `-LValueReferenceType 0x7fec7d76ac80 'class std::__1::allocator<int> &'
|   `-SubstTemplateTypeParmType 0x7fec7d76aa40 'class std::__1::allocator<int>' sugar
|     |-TemplateTypeParmType 0x7fec7e8881b0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fec7e888170 '_Tp'
|     `-RecordType 0x7fec7d7522f0 'class std::__1::allocator<int>'
|       `-ClassTemplateSpecialization 0x7fec7d752200 'allocator'
|-TypedefDecl 0x7fec7d76ad48 <line:2073:3, col:22> col:22 referenced const_reference 'const class std::__1::allocator<int> &'
| `-LValueReferenceType 0x7fec7d76ad10 'const class std::__1::allocator<int> &'
|   `-QualType 0x7fec7d76aa41 'const class std::__1::allocator<int>' const
|     `-SubstTemplateTypeParmType 0x7fec7d76aa40 'class std::__1::allocator<int>' sugar
|       |-TemplateTypeParmType 0x7fec7e8881b0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fec7e888170 '_Tp'
|       `-RecordType 0x7fec7d7522f0 'class std::__1::allocator<int>'
|         `-ClassTemplateSpecialization 0x7fec7d752200 'allocator'
|-TypedefDecl 0x7fec7d76adb0 <line:2074:3, col:15> col:15 __value_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7fec7d76aa40 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7fec7e8881b0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fec7e888170 '_Tp'
|   `-RecordType 0x7fec7d7522f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fec7d752200 'allocator'
|-CXXConstructorDecl 0x7fec7d76ae48 <line:2077:3, col:46> col:13 __compressed_pair_elem 'void (void)' default noexcept-unevaluated 0x7fec7d76ae48
|-FunctionTemplateDecl 0x7fec7d76b628 <line:2079:3, line:2084:48> line:2083:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fec7d76af00 <line:2079:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fec7d76af68 <col:24, line:2081:6> line:2079:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<class allocator<int>, 1, true>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7fec7d76b580 <line:2082:3, line:2084:48> line:2083:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7fec7d76b498 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7fec7d76bc58 <line:2086:3, line:2090:79> line:2088:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fec7d76b708 <line:2086:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7fec7d76b778 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7fec7d76bbb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2090:79> line:2088:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7fec7d76b7f0 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fec7d76b958 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7fec7d76baa8 <line:2089:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7fec7d76bce8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d76be68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2097:3, col:47> col:13 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>::reference (void) noexcept'
|-CXXMethodDecl 0x7fec7d76bfb8 <line:2098:3, col:59> col:19 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>::const_reference (void) const noexcept'
`-CXXDestructorDecl 0x7fec7d7869c8 <line:2070:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem.0" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem.0" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fec7d767a08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2104:1, line:2201:1> line:2105:7 class __compressed_pair definition
|-private '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|-private '__compressed_pair_elem<class std::__1::allocator<int>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>'
|-TemplateArgument type 'int *'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x7fec7d76c1e0 prev 0x7fec7d767a08 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7fec7d76c588 <line:2107:3, col:42> col:42 _Base1 '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
| `-TemplateSpecializationType 0x7fec7d76c4e0 '__compressed_pair_elem<int *, 0>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'int *':'int *'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fec7e88c200 <col:39> 'int' 0
|   `-RecordType 0x7fec7d768720 'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|     `-ClassTemplateSpecialization 0x7fec7d768600 '__compressed_pair_elem'
|-TypedefDecl 0x7fec7d76c8e8 <line:2108:3, col:42> col:42 _Base2 '__compressed_pair_elem<class std::__1::allocator<int>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>'
| `-TemplateSpecializationType 0x7fec7d76c840 '__compressed_pair_elem<class std::__1::allocator<int>, 1>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fec7e88c5a8 <col:39> 'int' 1
|   `-RecordType 0x7fec7d76a900 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>'
|     `-ClassTemplateSpecialization 0x7fec7d76a7e0 '__compressed_pair_elem'
|-StaticAssertDecl 0x7fec7d76cd68 <line:2114:3, line:2117:44> line:2114:3
| |-ParenExpr 0x7fec7d76cd48 <col:17, col:43> '_Bool'
| | `-UnaryOperator 0x7fec7d76cd28 <col:18, col:38> '_Bool' prefix '!'
| |   `-ImplicitCastExpr 0x7fec7d76cd10 <col:19, col:38> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7fec7d76ccd8 <col:19, col:38> 'const _Bool':'const _Bool' lvalue Var 0x7fec7d407078 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fec7e88cad8 <line:2115:5, line:2117:5> 'const char [179]' lvalue "__compressed_pair cannot be instantated when T1 and T2 are the same type; The current implementation is NOT ABI-compatible with the previous implementation for this configuration"
|-AccessSpecDecl 0x7fec7d76cda0 <line:2119:1, col:7> col:1 public
|-FunctionTemplateDecl 0x7fec7d76d7e8 <line:2121:3, line:2128:34> col:13 __compressed_pair
| |-NonTypeTemplateParmDecl 0x7fec7d76cdc8 <line:2121:13, col:27> col:18 referenced '_Bool' depth 0 index 0 _Dummy
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fec7e88cc20 <col:27> '_Bool' true
| |-TemplateTypeParmDecl 0x7fec7d76ce20 <line:2122:7, line:2125:10> line:2122:7 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<__dependent_type<is_default_constructible<int *>, _Dummy>::value && __dependent_type<is_default_constructible<class allocator<int> >, _Dummy>::value>::type'
| `-CXXConstructorDecl 0x7fec7d76d740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2128:34> col:13 constexpr __compressed_pair 'void (void)'
|   `-AlwaysInlineAttr 0x7fec7d76d868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fec7d76e088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2130:3, line:2135:51> line:2134:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fec7d76d938 <line:2130:13, col:19> col:19 class depth 0 index 0 _Tp
| |-NonTypeTemplateParmDecl 0x7fec7d76de40 <col:24, line:2132:57> col:55 'typename enable_if<!is_same<typename decay<_Tp>::type, class __compressed_pair<int *, class allocator<int> > >::value, _Bool>::type' depth 0 index 1
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fec7e88db40 <col:57> '_Bool' true
| `-CXXConstructorDecl 0x7fec7d76dfe0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2135:51> line:2134:3 constexpr __compressed_pair 'void (_Tp &&)'
|   |-ParmVarDecl 0x7fec7d76def8 <col:21, col:27> col:27 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fec7d76e0e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fec7d76e468 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2137:3, line:2140:51> line:2139:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fec7d76e1b0 <line:2137:13, col:19> col:19 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7fec7d76e3c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2140:51> line:2139:3 constexpr __compressed_pair 'void (struct std::__1::__second_tag, _Tp &&)'
|   |-ParmVarDecl 0x7fec7d76e230 <col:21> col:33 'struct std::__1::__second_tag'
|   |-ParmVarDecl 0x7fec7d76e2c8 <col:35, col:41> col:41 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fec7d76e4c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fec7d76e918 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2142:3, line:2145:75> line:2144:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fec7d76e598 <line:2142:13, col:19> col:19 class depth 0 index 0 _U1
| |-TemplateTypeParmDecl 0x7fec7d76e608 <col:24, col:30> col:30 class depth 0 index 1 _U2
| `-CXXConstructorDecl 0x7fec7d76e870 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 constexpr __compressed_pair 'void (_U1 &&, _U2 &&)'
|   |-ParmVarDecl 0x7fec7d76e6d8 <col:21, col:27> col:27 __t1 '_U1 &&'
|   |-ParmVarDecl 0x7fec7d76e778 <col:33, col:39> col:39 __t2 '_U2 &&'
|   `-AlwaysInlineAttr 0x7fec7d76e978 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fec7d76efd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2147:3, line:2154:75> line:2149:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fec7d76ea48 <line:2147:13, col:22> col:22 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7fec7d76eab8 <col:30, col:39> col:39 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7fec7d76ef30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2154:75> line:2149:3 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7fec7d76eb48 <col:21, col:43> col:43 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fec7d76ecb8 <col:49, col:66> col:66 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7fec7d76ee28 <line:2150:21, col:38> col:38 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7fec7d76f040 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d76f208 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2175:3> line:2173:30 first 'typename _Base1::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7fec7d76f2b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d76f3b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2180:3> line:2178:36 first 'typename _Base1::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d76f460 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d76f5a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2185:3> line:2183:30 second 'typename _Base2::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7fec7d76f650 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d76f758 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2190:3> line:2188:36 second 'typename _Base2::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d76f800 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d76f9a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2200:3> line:2193:8 swap 'void (class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > &)' noexcept-uninstantiated 0x7fec7e88fc48
| |-ParmVarDecl 0x7fec7d76f888 <col:13, col:32> col:32 __x 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7fec7d76fa98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
`-CXXDestructorDecl 0x7fec7d786808 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2105:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fec7d752728 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:322:1, line:411:1> line:323:7 class __vector_base definition
|-protected '__vector_base_common<true>':'class std::__1::__vector_base_common<true>'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x7fec7d752990 prev 0x7fec7d752728 <col:1, col:7> col:7 implicit class __vector_base
|-AccessSpecDecl 0x7fec7d752a28 <line:326:1, col:10> col:1 protected
|-TypedefDecl 0x7fec7d752a88 <line:327:5, col:54> col:54 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7fec7d752a50 'int' sugar
|   |-TemplateTypeParmType 0x7fec7db1b9b0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fec7db1b970 '_Tp'
|   `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7d752b18 <line:328:5, col:54> col:54 allocator_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7fec7d752ae0 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7fec7db1ba20 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fec7db1b9d8 '_Allocator'
|   `-RecordType 0x7fec7d7522f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fec7d752200 'allocator'
|-TypedefDecl 0x7fec7d752d28 <line:329:5, col:54> col:54 referenced __alloc_traits 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x7fec7d752cb0 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type':'class std::__1::allocator<int>'
|   `-RecordType 0x7fec7d752c90 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x7fec7d752ba0 'allocator_traits'
|-TypedefDecl 0x7fec7d752e08 <line:330:5, col:54> col:54 referenced reference 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-LValueReferenceType 0x7fec7d752dd0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|   `-TypedefType 0x7fec7d752d80 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|     |-Typedef 0x7fec7d752a88 'value_type'
|     `-SubstTemplateTypeParmType 0x7fec7d752a50 'int' sugar
|       |-TemplateTypeParmType 0x7fec7db1b9b0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fec7db1b970 '_Tp'
|       `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7d752ec8 <line:331:5, col:54> col:54 referenced const_reference 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-LValueReferenceType 0x7fec7d752e90 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|   `-QualType 0x7fec7d752d81 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' const
|     `-TypedefType 0x7fec7d752d80 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|       |-Typedef 0x7fec7d752a88 'value_type'
|       `-SubstTemplateTypeParmType 0x7fec7d752a50 'int' sugar
|         |-TemplateTypeParmType 0x7fec7db1b9b0 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7fec7db1b970 '_Tp'
|         `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7d767530 <line:332:5, col:54> col:54 referenced size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7fec7d7674e0 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7fec7d75fc20 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x7fec7d75c5b0 'size_type'
|     `-ElaboratedType 0x7fec7d75c560 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7fec7d75c540 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|         |-Typedef 0x7fec7d75c4c0 'type'
|         `-ElaboratedType 0x7fec7d75c470 'typename class allocator<int>::size_type' sugar
|           `-TypedefType 0x7fec7d75bd50 'std::__1::allocator<int>::size_type' sugar
|             |-Typedef 0x7fec7d7532c8 'size_type'
|             `-TypedefType 0x7fec7d105a10 'size_t' sugar
|               |-Typedef 0x7fec7d0691b0 'size_t'
|               `-BuiltinType 0x7fec7d033c80 'unsigned long'
|-TypedefDecl 0x7fec7d767600 <line:333:5, col:54> col:54 referenced difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7fec7d7675b0 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7fec7d75ba70 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x7fec7d75ba00 'difference_type'
|     `-ElaboratedType 0x7fec7d75b9b0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7fec7d75b990 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|         |-Typedef 0x7fec7d75b910 'type'
|         `-ElaboratedType 0x7fec7d75b8c0 'typename class allocator<int>::difference_type' sugar
|           `-TypedefType 0x7fec7d75b170 'std::__1::allocator<int>::difference_type' sugar
|             |-Typedef 0x7fec7d753320 'difference_type'
|             `-TypedefType 0x7fec7e037750 'ptrdiff_t' sugar
|               |-Typedef 0x7fec7d069140 'ptrdiff_t'
|               `-BuiltinType 0x7fec7d033be0 'long'
|-TypedefDecl 0x7fec7d7676d0 <line:334:5, col:54> col:54 referenced pointer 'typename __alloc_traits::pointer':'int *'
| `-ElaboratedType 0x7fec7d767680 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7fec7d756840 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x7fec7d7567d0 'pointer'
|     `-ElaboratedType 0x7fec7d756780 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7fec7d756760 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|         |-Typedef 0x7fec7d7566e0 'type'
|         `-ElaboratedType 0x7fec7d756690 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|           `-TypedefType 0x7fec7d756670 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x7fec7d7565f0 'type'
|             `-ElaboratedType 0x7fec7d7565a0 'typename class allocator<int>::pointer' sugar
|               `-TypedefType 0x7fec7d753fa0 'std::__1::allocator<int>::pointer' sugar
|                 |-Typedef 0x7fec7d7533e8 'pointer'
|                 `-PointerType 0x7fec7d7533b0 'int *'
|                   `-SubstTemplateTypeParmType 0x7fec7d753380 'int' sugar
|                     |-TemplateTypeParmType 0x7fec7e874e60 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fec7e874e18 '_Tp'
|                     `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7d7677c0 <line:335:5, col:54> col:54 referenced const_pointer 'typename __alloc_traits::const_pointer':'const int *'
| `-ElaboratedType 0x7fec7d767770 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7fec7d767750 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x7fec7d7575d0 'const_pointer'
|     `-ElaboratedType 0x7fec7d757580 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7fec7d757560 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|         |-Typedef 0x7fec7d7574e0 'type'
|         `-ElaboratedType 0x7fec7d757490 'typename class allocator<int>::const_pointer' sugar
|           `-TypedefType 0x7fec7d7541f0 'std::__1::allocator<int>::const_pointer' sugar
|             |-Typedef 0x7fec7d753478 'const_pointer'
|             `-PointerType 0x7fec7d753440 'const int *'
|               `-QualType 0x7fec7d753381 'const int' const
|                 `-SubstTemplateTypeParmType 0x7fec7d753380 'int' sugar
|                   |-TemplateTypeParmType 0x7fec7e874e60 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7fec7e874e18 '_Tp'
|                   `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7d767850 <line:336:5, col:54> col:54 iterator 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
| `-TypedefType 0x7fec7d767820 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer' sugar
|   |-Typedef 0x7fec7d7676d0 'pointer'
|   `-ElaboratedType 0x7fec7d767680 'typename __alloc_traits::pointer' sugar
|     `-TypedefType 0x7fec7d756840 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|       |-Typedef 0x7fec7d7567d0 'pointer'
|       `-ElaboratedType 0x7fec7d756780 'typename __pointer_type<value_type, allocator_type>::type' sugar
|         `-TypedefType 0x7fec7d756760 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|           |-Typedef 0x7fec7d7566e0 'type'
|           `-ElaboratedType 0x7fec7d756690 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|             `-TypedefType 0x7fec7d756670 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|               |-Typedef 0x7fec7d7565f0 'type'
|               `-ElaboratedType 0x7fec7d7565a0 'typename class allocator<int>::pointer' sugar
|                 `-TypedefType 0x7fec7d753fa0 'std::__1::allocator<int>::pointer' sugar
|                   |-Typedef 0x7fec7d7533e8 'pointer'
|                   `-PointerType 0x7fec7d7533b0 'int *'
|                     `-SubstTemplateTypeParmType 0x7fec7d753380 'int' sugar
|                       |-TemplateTypeParmType 0x7fec7e874e60 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7fec7e874e18 '_Tp'
|                       `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7d7678e0 <line:337:5, col:54> col:54 const_iterator 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer':'const int *'
| `-TypedefType 0x7fec7d7678b0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer' sugar
|   |-Typedef 0x7fec7d7677c0 'const_pointer'
|   `-ElaboratedType 0x7fec7d767770 'typename __alloc_traits::const_pointer' sugar
|     `-TypedefType 0x7fec7d767750 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|       |-Typedef 0x7fec7d7575d0 'const_pointer'
|       `-ElaboratedType 0x7fec7d757580 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|         `-TypedefType 0x7fec7d757560 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|           |-Typedef 0x7fec7d7574e0 'type'
|           `-ElaboratedType 0x7fec7d757490 'typename class allocator<int>::const_pointer' sugar
|             `-TypedefType 0x7fec7d7541f0 'std::__1::allocator<int>::const_pointer' sugar
|               |-Typedef 0x7fec7d753478 'const_pointer'
|               `-PointerType 0x7fec7d753440 'const int *'
|                 `-QualType 0x7fec7d753381 'const int' const
|                   `-SubstTemplateTypeParmType 0x7fec7d753380 'int' sugar
|                     |-TemplateTypeParmType 0x7fec7e874e60 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fec7e874e18 '_Tp'
|                     `-BuiltinType 0x7fec7d033bc0 'int'
|-FieldDecl 0x7fec7d767948 <line:339:5, col:53> col:53 __begin_ 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
|-FieldDecl 0x7fec7d7679a0 <line:340:5, col:53> col:53 __end_ 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
|-FieldDecl 0x7fec7d76fb00 <line:341:5, col:48> col:48 __end_cap_ '__compressed_pair<std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer, std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> >'
|-CXXMethodDecl 0x7fec7d76fbd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:345:37> line:344:21 __alloc 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &(void) noexcept'
| `-AlwaysInlineAttr 0x7fec7d76fca8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d76fd78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:348:37> line:347:27 __alloc 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &(void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d76fe20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d76fef8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:351:36> line:350:14 __end_cap 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer &(void) noexcept'
| `-AlwaysInlineAttr 0x7fec7d76ffa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d770078 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:354:36> line:353:20 __end_cap 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer &(void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d770120 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fec7d7701d0 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:357:5 __vector_base 'void (void)' noexcept-uninstantiated 0x7fec7db1d2f0
| `-AlwaysInlineAttr 0x7fec7d7702d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fec7d770450 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:359:70> col:31 __vector_base 'void (const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fec7d770328 <col:45, col:67> col:67 __a 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fec7d770510 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fec7d770588 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:360:5, col:20> col:5 used ~__vector_base 'void (void) noexcept'
|-CXXMethodDecl 0x7fec7d770638 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:363:57> col:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fec7d7706e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d7707a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:366:64> line:365:15 capacity 'std::__1::__vector_base<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d770850 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d770978 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:369:10 __destruct_at_end 'void (std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x7fec7d7708a8 <col:28, col:36> col:36 __new_last 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7fec7d770a28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d770b70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:374:89> line:372:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &)'
| |-ParmVarDecl 0x7fec7d770aa8 <col:30, col:51> col:51 __c 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7fec7d770c20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d770dc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:382:89> line:377:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &)' noexcept-uninstantiated 0x7fec7db29600
| |-ParmVarDecl 0x7fec7d770ca8 <col:30, col:45> col:45 __c 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7fec7d770eb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7fec7d770f00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:383:1, col:8> col:1 private
|-CXXMethodDecl 0x7fec7d7710b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:394:9> line:385:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::true_type)'
| |-ParmVarDecl 0x7fec7d770f38 <col:30, col:51> col:51 __c 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7fec7d770f98 <col:56> col:65 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fec7d771168 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d771330 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:398:10> line:397:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::false_type)'
| |-ParmVarDecl 0x7fec7d7711c0 <col:30, col:49> col:50 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7fec7d771220 <col:52> col:62 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7fec7d7713e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d7715c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:405:9> line:401:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::true_type)' noexcept-uninstantiated 0x7fec7db29e68
| |-ParmVarDecl 0x7fec7d771440 <col:30, col:45> col:45 __c 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7fec7d7714a0 <col:50> col:59 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fec7d7716d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
`-CXXMethodDecl 0x7fec7d7718a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:410:10> line:408:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::false_type) noexcept'
  |-ParmVarDecl 0x7fec7d771728 <col:30, col:43> col:44 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
  |-ParmVarDecl 0x7fec7d771788 <col:46> col:56 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
  `-AlwaysInlineAttr 0x7fec7d771960 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__vector_base" = type { i32*, i32*, %"class.std::__1::__compressed_pair" }
  NonVirtualBaseLLVMType:%"class.std::__1::__vector_base" = type { i32*, i32*, %"class.std::__1::__compressed_pair" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fec7d752388 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:453:1, line:887:1> line:454:28 class vector definition
|-private '__vector_base<int, class std::__1::allocator<int> >':'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x7fec7d771a18 prev 0x7fec7d752388 <col:1, col:28> col:28 implicit class vector
|-AccessSpecDecl 0x7fec7d771ab0 <line:457:1, col:8> col:1 private
|-TypedefDecl 0x7fec7d771ba8 <line:458:5, col:54> col:54 __base '__vector_base<int, class std::__1::allocator<int> >':'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x7fec7d771b00 '__vector_base<int, class std::__1::allocator<int> >' sugar __vector_base
|   |-TemplateArgument type 'int':'int'
|   |-TemplateArgument type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|   `-RecordType 0x7fec7d752830 'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x7fec7d752728 '__vector_base'
|-TypedefDecl 0x7fec7d771c88 <line:459:5, col:54> col:54 __default_allocator_type 'allocator<int>':'class std::__1::allocator<int>'
| `-TemplateSpecializationType 0x7fec7d771c10 'allocator<int>' sugar allocator
|   |-TemplateArgument type 'int':'int'
|   `-RecordType 0x7fec7d7522f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fec7d752200 'allocator'
|-AccessSpecDecl 0x7fec7d771ce0 <line:460:1, col:7> col:1 public
|-TypedefDecl 0x7fec7d771d18 <line:461:5, col:54> col:54 __self 'class std::__1::vector<int, class std::__1::allocator<int> >'
| `-RecordType 0x7fec7d752490 'class std::__1::vector<int, class std::__1::allocator<int> >'
|   `-ClassTemplateSpecialization 0x7fec7d752388 'vector'
|-TypedefDecl 0x7fec7d771d80 <line:462:5, col:54> col:54 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7fec7d7526b0 'int' sugar
|   |-TemplateTypeParmType 0x7fec7db2e5e0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fec7db2e5a0 '_Tp'
|   `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7d771de8 <line:463:5, col:54> col:54 allocator_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7fec7d7526f0 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7fec7db2e650 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fec7db2e608 '_Allocator'
|   `-RecordType 0x7fec7d7522f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fec7d752200 'allocator'
|-TypedefDecl 0x7fec7d771ef0 <line:464:5, col:54> col:54 __alloc_traits 'typename __base::__alloc_traits':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-ElaboratedType 0x7fec7d771ea0 'typename __base::__alloc_traits' sugar
|   `-TypedefType 0x7fec7d752f20 'std::__1::__vector_base<int, class std::__1::allocator<int> >::__alloc_traits' sugar
|     |-Typedef 0x7fec7d752d28 '__alloc_traits'
|     `-TemplateSpecializationType 0x7fec7d752cb0 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>' sugar allocator_traits
|       |-TemplateArgument type 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type':'class std::__1::allocator<int>'
|       `-RecordType 0x7fec7d752c90 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|         `-ClassTemplateSpecialization 0x7fec7d752ba0 'allocator_traits'
|-TypedefDecl 0x7fec7d771fe0 <line:465:5, col:54> col:54 reference 'typename __base::reference':'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ElaboratedType 0x7fec7d771f90 'typename __base::reference' sugar
|   `-TypedefType 0x7fec7d771f70 'std::__1::__vector_base<int, class std::__1::allocator<int> >::reference' sugar
|     |-Typedef 0x7fec7d752e08 'reference'
|     `-LValueReferenceType 0x7fec7d752dd0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|       `-TypedefType 0x7fec7d752d80 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|         |-Typedef 0x7fec7d752a88 'value_type'
|         `-SubstTemplateTypeParmType 0x7fec7d752a50 'int' sugar
|           |-TemplateTypeParmType 0x7fec7db1b9b0 '_Tp' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x7fec7db1b970 '_Tp'
|           `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7d7720d0 <line:466:5, col:54> col:54 const_reference 'typename __base::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ElaboratedType 0x7fec7d772080 'typename __base::const_reference' sugar
|   `-TypedefType 0x7fec7d772060 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_reference' sugar
|     |-Typedef 0x7fec7d752ec8 'const_reference'
|     `-LValueReferenceType 0x7fec7d752e90 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|       `-QualType 0x7fec7d752d81 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' const
|         `-TypedefType 0x7fec7d752d80 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|           |-Typedef 0x7fec7d752a88 'value_type'
|           `-SubstTemplateTypeParmType 0x7fec7d752a50 'int' sugar
|             |-TemplateTypeParmType 0x7fec7db1b9b0 '_Tp' dependent depth 0 index 0
|             | `-TemplateTypeParm 0x7fec7db1b970 '_Tp'
|             `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7d7721a0 <line:467:5, col:54> col:54 size_type 'typename __base::size_type':'unsigned long'
| `-ElaboratedType 0x7fec7d772150 'typename __base::size_type' sugar
|   `-TypedefType 0x7fec7d770730 'std::__1::__vector_base<int, class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x7fec7d767530 'size_type'
|     `-ElaboratedType 0x7fec7d7674e0 'typename __alloc_traits::size_type' sugar
|       `-TypedefType 0x7fec7d75fc20 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|         |-Typedef 0x7fec7d75c5b0 'size_type'
|         `-ElaboratedType 0x7fec7d75c560 'typename __size_type<allocator_type, difference_type>::type' sugar
|           `-TypedefType 0x7fec7d75c540 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|             |-Typedef 0x7fec7d75c4c0 'type'
|             `-ElaboratedType 0x7fec7d75c470 'typename class allocator<int>::size_type' sugar
|               `-TypedefType 0x7fec7d75bd50 'std::__1::allocator<int>::size_type' sugar
|                 |-Typedef 0x7fec7d7532c8 'size_type'
|                 `-TypedefType 0x7fec7d105a10 'size_t' sugar
|                   |-Typedef 0x7fec7d0691b0 'size_t'
|                   `-BuiltinType 0x7fec7d033c80 'unsigned long'
|-TypedefDecl 0x7fec7d772290 <line:468:5, col:54> col:54 difference_type 'typename __base::difference_type':'long'
| `-ElaboratedType 0x7fec7d772240 'typename __base::difference_type' sugar
|   `-TypedefType 0x7fec7d772220 'std::__1::__vector_base<int, class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x7fec7d767600 'difference_type'
|     `-ElaboratedType 0x7fec7d7675b0 'typename __alloc_traits::difference_type' sugar
|       `-TypedefType 0x7fec7d75ba70 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|         |-Typedef 0x7fec7d75ba00 'difference_type'
|         `-ElaboratedType 0x7fec7d75b9b0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|           `-TypedefType 0x7fec7d75b990 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|             |-Typedef 0x7fec7d75b910 'type'
|             `-ElaboratedType 0x7fec7d75b8c0 'typename class allocator<int>::difference_type' sugar
|               `-TypedefType 0x7fec7d75b170 'std::__1::allocator<int>::difference_type' sugar
|                 |-Typedef 0x7fec7d753320 'difference_type'
|                 `-TypedefType 0x7fec7e037750 'ptrdiff_t' sugar
|                   |-Typedef 0x7fec7d069140 'ptrdiff_t'
|                   `-BuiltinType 0x7fec7d033be0 'long'
|-TypedefDecl 0x7fec7d772360 <line:469:5, col:54> col:54 pointer 'typename __base::pointer':'int *'
| `-ElaboratedType 0x7fec7d772310 'typename __base::pointer' sugar
|   `-TypedefType 0x7fec7d767820 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x7fec7d7676d0 'pointer'
|     `-ElaboratedType 0x7fec7d767680 'typename __alloc_traits::pointer' sugar
|       `-TypedefType 0x7fec7d756840 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|         |-Typedef 0x7fec7d7567d0 'pointer'
|         `-ElaboratedType 0x7fec7d756780 'typename __pointer_type<value_type, allocator_type>::type' sugar
|           `-TypedefType 0x7fec7d756760 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|             |-Typedef 0x7fec7d7566e0 'type'
|             `-ElaboratedType 0x7fec7d756690 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|               `-TypedefType 0x7fec7d756670 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|                 |-Typedef 0x7fec7d7565f0 'type'
|                 `-ElaboratedType 0x7fec7d7565a0 'typename class allocator<int>::pointer' sugar
|                   `-TypedefType 0x7fec7d753fa0 'std::__1::allocator<int>::pointer' sugar
|                     |-Typedef 0x7fec7d7533e8 'pointer'
|                     `-PointerType 0x7fec7d7533b0 'int *'
|                       `-SubstTemplateTypeParmType 0x7fec7d753380 'int' sugar
|                         |-TemplateTypeParmType 0x7fec7e874e60 '_Tp' dependent depth 0 index 0
|                         | `-TemplateTypeParm 0x7fec7e874e18 '_Tp'
|                         `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7d772430 <line:470:5, col:54> col:54 const_pointer 'typename __base::const_pointer':'const int *'
| `-ElaboratedType 0x7fec7d7723e0 'typename __base::const_pointer' sugar
|   `-TypedefType 0x7fec7d7678b0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x7fec7d7677c0 'const_pointer'
|     `-ElaboratedType 0x7fec7d767770 'typename __alloc_traits::const_pointer' sugar
|       `-TypedefType 0x7fec7d767750 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|         |-Typedef 0x7fec7d7575d0 'const_pointer'
|         `-ElaboratedType 0x7fec7d757580 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|           `-TypedefType 0x7fec7d757560 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x7fec7d7574e0 'type'
|             `-ElaboratedType 0x7fec7d757490 'typename class allocator<int>::const_pointer' sugar
|               `-TypedefType 0x7fec7d7541f0 'std::__1::allocator<int>::const_pointer' sugar
|                 |-Typedef 0x7fec7d753478 'const_pointer'
|                 `-PointerType 0x7fec7d753440 'const int *'
|                   `-QualType 0x7fec7d753381 'const int' const
|                     `-SubstTemplateTypeParmType 0x7fec7d753380 'int' sugar
|                       |-TemplateTypeParmType 0x7fec7e874e60 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7fec7e874e18 '_Tp'
|                       `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7d772648 <line:471:5, col:54> col:54 iterator '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::pointer>':'class std::__1::__wrap_iter<int *>'
| `-TemplateSpecializationType 0x7fec7d7725d0 '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|   `-RecordType 0x7fec7d7725b0 'class std::__1::__wrap_iter<int *>'
|     `-ClassTemplateSpecialization 0x7fec7d7724c0 '__wrap_iter'
|-TypedefDecl 0x7fec7d772858 <line:472:5, col:54> col:54 const_iterator '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::const_pointer>':'class std::__1::__wrap_iter<const int *>'
| `-TemplateSpecializationType 0x7fec7d7727e0 '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::const_pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::const_pointer':'const int *'
|   `-RecordType 0x7fec7d7727c0 'class std::__1::__wrap_iter<const int *>'
|     `-ClassTemplateSpecialization 0x7fec7d7726d0 '__wrap_iter'
|-TypedefDecl 0x7fec7d773ec0 <line:473:5, col:55> col:55 reverse_iterator 'std::__1::reverse_iterator<iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<int *> >'
| `-ElaboratedType 0x7fec7d773e50 'std::__1::reverse_iterator<iterator>' sugar
|   `-TemplateSpecializationType 0x7fec7d773e00 'reverse_iterator<std::__1::vector<int, class std::__1::allocator<int> >::iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::iterator':'class std::__1::__wrap_iter<int *>'
|     `-RecordType 0x7fec7d7729d0 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<int *> >'
|       `-ClassTemplateSpecialization 0x7fec7d7728e0 'reverse_iterator'
|-TypedefDecl 0x7fec7d774120 <line:474:5, col:55> col:55 const_reverse_iterator 'std::__1::reverse_iterator<const_iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const int *> >'
| `-ElaboratedType 0x7fec7d7740b0 'std::__1::reverse_iterator<const_iterator>' sugar
|   `-TemplateSpecializationType 0x7fec7d774060 'reverse_iterator<std::__1::vector<int, class std::__1::allocator<int> >::const_iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|     `-RecordType 0x7fec7d774040 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const int *> >'
|       `-ClassTemplateSpecialization 0x7fec7d773f50 'reverse_iterator'
|-StaticAssertDecl 0x7fec7d7746a8 <line:476:5, line:477:74> line:476:5
| |-ParenExpr 0x7fec7d774670 <col:19, col:83> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7fec7d774638 <col:20, col:78> 'const _Bool':'const _Bool' lvalue Var 0x7fec7d49ae20 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fec7db2fff0 <line:477:19> 'const char [54]' lvalue "Allocator::value_type must be same type as value_type"
|-CXXConstructorDecl 0x7fec7d774748 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:485:9> line:480:5 used vector 'void (void) noexcept(is_nothrow_default_constructible<allocator_type>::value)'
| `-AlwaysInlineAttr 0x7fec7d774868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fec7d7749e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:497:5> line:486:40 vector 'void (const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)' noexcept-uninstantiated 0x7fec7db30368
| |-ParmVarDecl 0x7fec7d7748e8 <col:47, col:69> col:69 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fec7d774ae8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fec7d774c40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:498:5, col:34> col:14 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fec7d774b60 <col:21, col:31> col:31 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXConstructorDecl 0x7fec7d774eb0 <line:500:5, col:61> col:14 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fec7d774d10 <col:21, col:31> col:31 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fec7d774d80 <col:36, col:58> col:58 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-CXXConstructorDecl 0x7fec7d775150 <line:502:5, col:46> col:5 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fec7d774f88 <col:12, col:22> col:22 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fec7d775020 <col:27, col:43> col:43 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXConstructorDecl 0x7fec7d775460 <line:503:5, col:73> col:5 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fec7d775228 <col:12, col:22> col:22 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fec7d775298 <col:27, col:43> col:43 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ParmVarDecl 0x7fec7d775308 <col:48, col:70> col:70 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-FunctionTemplateDecl 0x7fec7d775ef8 <line:504:5, line:511:62> line:505:9 vector
| |-TemplateTypeParmDecl 0x7fec7d775530 <line:504:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7fec7d775e50 <line:505:9, line:511:62> line:505:9 vector 'void (_InputIterator, typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, _InputIterator>::type)'
|   |-ParmVarDecl 0x7fec7d7755c0 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x7fec7d775d20 <line:506:16, line:511:56> col:56 __last 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, _InputIterator>::type'
|-FunctionTemplateDecl 0x7fec7d776a68 <line:512:5, line:518:108> line:513:9 vector
| |-TemplateTypeParmDecl 0x7fec7d775fe0 <line:512:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7fec7d7769c0 <line:513:9, line:518:108> line:513:9 vector 'void (_InputIterator, _InputIterator, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &, typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value>::type *)'
|   |-ParmVarDecl 0x7fec7d776070 <col:16, col:31> col:31 __first '_InputIterator'
|   |-ParmVarDecl 0x7fec7d7760e0 <col:40, col:55> col:55 __last '_InputIterator'
|   |-ParmVarDecl 0x7fec7d776150 <col:63, col:85> col:85 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|   `-ParmVarDecl 0x7fec7d776860 <line:514:16, line:518:107> col:105 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value>::type *'
|-FunctionTemplateDecl 0x7fec7d777378 <line:519:5, line:525:64> line:520:9 vector
| |-TemplateTypeParmDecl 0x7fec7d776b60 <line:519:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXConstructorDecl 0x7fec7d7772d0 <line:520:9, line:525:64> line:520:9 vector 'void (_ForwardIterator, typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, _ForwardIterator>::type)'
|   |-ParmVarDecl 0x7fec7d776bf0 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fec7d7771a0 <line:521:16, line:525:58> col:58 __last 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, _ForwardIterator>::type'
|-FunctionTemplateDecl 0x7fec7d777da8 <line:526:5, line:531:110> line:527:9 vector
| |-TemplateTypeParmDecl 0x7fec7d777460 <line:526:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXConstructorDecl 0x7fec7d777d00 <line:527:9, line:531:110> line:527:9 vector 'void (_ForwardIterator, _ForwardIterator, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &, typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value>::type *)'
|   |-ParmVarDecl 0x7fec7d7774f0 <col:16, col:33> col:33 __first '_ForwardIterator'
|   |-ParmVarDecl 0x7fec7d777560 <col:42, col:59> col:59 __last '_ForwardIterator'
|   |-ParmVarDecl 0x7fec7d7775d0 <col:67, col:89> col:89 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|   `-ParmVarDecl 0x7fec7d777ba0 <line:528:16, line:531:109> col:107 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value>::type *'
|-CXXConstructorDecl 0x7fec7d777fc0 <line:541:5, col:29> col:5 vector 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &)'
| `-ParmVarDecl 0x7fec7d777ed8 <col:12, col:26> col:26 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
|-CXXConstructorDecl 0x7fec7d778230 <line:542:5, col:56> col:5 vector 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fec7d778090 <col:12, col:26> col:26 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x7fec7d778100 <col:31, col:53> col:53 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-CXXMethodDecl 0x7fec7d778400 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:544:40> col:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(const class std::__1::vector<int, class std::__1::allocator<int> > &)'
| |-ParmVarDecl 0x7fec7d778338 <col:23, col:37> col:37 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7fec7d7784b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fec7d7787b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:548:45> col:5 vector 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7fec7d778688 <col:12, col:41> col:41 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7fec7d778870 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fec7d778af0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:551:72> col:5 vector 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fec7d778948 <col:12, col:41> col:41 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| |-ParmVarDecl 0x7fec7d7789b8 <col:47, col:69> col:69 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fec7d778bb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fec7d778d70 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:554:5 vector 'void (class std::__1::vector<int, class std::__1::allocator<int> > &&)' noexcept-uninstantiated 0x7fec7db344b8
| |-ParmVarDecl 0x7fec7d778c38 <col:12, col:21> col:21 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| `-AlwaysInlineAttr 0x7fec7d778e78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fec7d779070 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:562:51> col:5 vector 'void (class std::__1::vector<int, class std::__1::allocator<int> > &&, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fec7d778ed0 <col:12, col:21> col:21 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| |-ParmVarDecl 0x7fec7d778f40 <col:26, col:48> col:48 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fec7d779138 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d7792a0 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:564:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(class std::__1::vector<int, class std::__1::allocator<int> > &&)' noexcept-uninstantiated 0x7fec7db349d8
| |-ParmVarDecl 0x7fec7d779190 <col:23, col:32> col:32 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| `-AlwaysInlineAttr 0x7fec7d779398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d779570 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:569:57> line:568:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7fec7d779468 <col:23, col:52> col:52 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7fec7d779620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fec7d779ed8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:573:5, line:583:61> col:9 assign
| |-TemplateTypeParmDecl 0x7fec7d779668 <line:573:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fec7d779e40 <line:574:9, line:583:61> col:9 assign 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, void>::type (_InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x7fec7d779cb0 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x7fec7d779d20 <col:40, col:55> col:55 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fec7d77a6e8 <line:584:5, line:593:65> col:9 assign
| |-TemplateTypeParmDecl 0x7fec7d779fc0 <line:584:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fec7d77a650 <line:585:9, line:593:65> col:9 assign 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, void>::type (_ForwardIterator, _ForwardIterator)'
|   |-ParmVarDecl 0x7fec7d77a4c0 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fec7d77a530 <col:42, col:59> col:59 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fec7d77a8e0 <line:595:5, col:51> col:10 assign 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fec7d77a7e0 <col:17, col:27> col:27 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fec7d77a850 <col:32, col:48> col:48 __u 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7fec7d77aaf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:600:43> line:599:10 assign 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7fec7d77aa28 <col:17, col:46> col:46 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7fec7d77aba0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77ac78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:605:33> line:604:20 get_allocator 'std::__1::vector<int, class std::__1::allocator<int> >::allocator_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d77ad20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77adf8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:607:54 begin 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fec7d77aea0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77af78 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:608:54 begin 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d77b020 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77b090 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:609:54 end 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fec7d77b138 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77b1a8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:610:54 end 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d77b250 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77b348 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:614:47> line:613:28 rbegin 'std::__1::vector<int, class std::__1::allocator<int> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fec7d77b3f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77b4e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:617:47> line:616:28 rbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d77b590 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77b600 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:620:49> line:619:28 rend 'std::__1::vector<int, class std::__1::allocator<int> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fec7d77b6a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77b718 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:623:49> line:622:28 rend 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d77b7c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77b830 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:627:25> line:626:28 cbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d77b8d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77b948 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:630:23> line:629:28 cend 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d77b9f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77ba60 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:633:26> line:632:28 crbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d77bb08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77bb78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:636:24> line:635:28 crend 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d77bc20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77bcc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:640:71> line:639:15 size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d77bd70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77bde0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:643:36> line:642:15 capacity 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d77be88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77bed0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:646:48> line:645:10 empty '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d77bf78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77bfe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:647:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:647:15 max_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
|-CXXMethodDecl 0x7fec7d77c128 <line:648:5, col:31> col:10 reserve 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fec7d77c0a0 <col:18, col:28> col:28 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fec7d77c1d8 <line:649:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:649:10 shrink_to_fit 'void (void) noexcept'
|-CXXMethodDecl 0x7fec7d77c3b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:651:71> col:47 operator[] 'std::__1::vector<int, class std::__1::allocator<int> >::reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| |-ParmVarDecl 0x7fec7d77c2b0 <col:58, col:68> col:68 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fec7d77c460 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77c5c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:652:73> col:47 operator[] 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fec7d77c4b8 <col:58, col:68> col:68 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fec7d77c670 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77c750 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:653:5, col:37> col:21 at 'std::__1::vector<int, class std::__1::allocator<int> >::reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fec7d77c6c8 <col:24, col:34> col:34 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fec7d77c898 <line:654:5, col:39> col:21 at 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| `-ParmVarDecl 0x7fec7d77c810 <col:24, col:34> col:34 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fec7d77c9d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:660:5> line:656:47 front 'std::__1::vector<int, class std::__1::allocator<int> >::reference (void)'
| `-AlwaysInlineAttr 0x7fec7d77ca78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77cb40 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:665:5> line:661:47 front 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7fec7d77cbe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77cc50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:670:5> line:666:47 back 'std::__1::vector<int, class std::__1::allocator<int> >::reference (void)'
| `-AlwaysInlineAttr 0x7fec7d77ccf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77cd60 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:675:5> line:671:47 back 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7fec7d77ce08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77ced8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:679:57> line:678:23 data 'std::__1::vector<int, class std::__1::allocator<int> >::value_type *(void) noexcept'
| `-AlwaysInlineAttr 0x7fec7d77cf80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77d088 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:682:57> line:681:23 data 'const std::__1::vector<int, class std::__1::allocator<int> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d77d130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77d290 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:684:65> col:36 push_back 'void (std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fec7d77d188 <col:46, col:62> col:62 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-AlwaysInlineAttr 0x7fec7d77d340 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77d500 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:687:62> col:36 push_back 'void (std::__1::vector<int, class std::__1::allocator<int> >::value_type &&)'
| |-ParmVarDecl 0x7fec7d77d3f8 <col:46, col:59> col:59 __x 'std::__1::vector<int, class std::__1::allocator<int> >::value_type &&'
| `-AlwaysInlineAttr 0x7fec7d77d5b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fec7d77d868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:689:5, line:694:49> col:19 emplace_back
| |-TemplateTypeParmDecl 0x7fec7d77d5f8 <line:689:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x7fec7d77d7d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:694:49> col:19 emplace_back 'void (_Args &&...)'
|   |-ParmVarDecl 0x7fec7d77d708 <col:32, col:43> col:43 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7fec7d77d8c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fec7d77d990 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:699:19> col:10 pop_back 'void (void)'
| `-AlwaysInlineAttr 0x7fec7d77da38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fec7d77dc10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:701:5, col:67> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fec7d77da90 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x7fec7d77db00 <col:48, col:64> col:64 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7fec7d77de60 <line:704:5, col:64> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::value_type &&)'
| |-ParmVarDecl 0x7fec7d77dcd8 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x7fec7d77dd48 <col:48, col:61> col:61 __x 'std::__1::vector<int, class std::__1::allocator<int> >::value_type &&'
|-FunctionTemplateDecl 0x7fec7d77e248 <line:705:5, line:706:70> col:18 emplace
| |-TemplateTypeParmDecl 0x7fec7d77df18 <line:705:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x7fec7d77e1b0 <line:706:9, col:70> col:18 emplace 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _Args &&...)'
|   |-ParmVarDecl 0x7fec7d77dfb0 <col:26, col:41> col:41 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   `-ParmVarDecl 0x7fec7d77e098 <col:53, col:64> col:64 __args '_Args &&...'
|-CXXMethodDecl 0x7fec7d77e550 <line:709:5, col:82> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fec7d77e340 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| |-ParmVarDecl 0x7fec7d77e3b0 <col:48, col:58> col:58 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fec7d77e420 <col:63, col:79> col:79 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-FunctionTemplateDecl 0x7fec7d77efc8 <line:710:5, line:720:88> col:9 insert
| |-TemplateTypeParmDecl 0x7fec7d77e610 <line:710:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fec7d77ef30 <line:711:9, line:720:88> col:9 insert 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, iterator>::type (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x7fec7d77ed10 <col:16, col:31> col:31 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   |-ParmVarDecl 0x7fec7d77ed80 <col:43, col:58> col:58 __first '_InputIterator'
|   `-ParmVarDecl 0x7fec7d77edf0 <col:67, col:82> col:82 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fec7d77f938 <line:721:5, line:730:92> col:9 insert
| |-TemplateTypeParmDecl 0x7fec7d77f0b8 <line:721:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fec7d77f8a0 <line:722:9, line:730:92> col:9 insert 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, iterator>::type (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _ForwardIterator, _ForwardIterator)'
|   |-ParmVarDecl 0x7fec7d77f680 <col:16, col:31> col:31 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   |-ParmVarDecl 0x7fec7d77f6f0 <col:43, col:60> col:60 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fec7d77f760 <col:69, col:86> col:86 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fec7d77fc40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:735:62> line:734:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7fec7d77fa38 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| |-ParmVarDecl 0x7fec7d77fb28 <col:48, col:77> col:77 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7fec7d77fcf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d77fe50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:738:71> col:40 erase 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator)'
| |-ParmVarDecl 0x7fec7d77fd50 <col:46, col:61> col:61 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-AlwaysInlineAttr 0x7fec7d77ff00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d7800e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:739:5, col:65> col:14 erase 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::const_iterator)'
| |-ParmVarDecl 0x7fec7d77ff58 <col:20, col:35> col:35 __first 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x7fec7d77ffc8 <col:44, col:59> col:59 __last 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|-CXXMethodDecl 0x7fec7d780198 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:748:5> line:742:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fec7d780240 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d780320 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:750:5, col:31> col:10 resize 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fec7d780298 <col:17, col:27> col:27 __sz 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fec7d7804e0 <line:751:5, col:52> col:10 resize 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fec7d7803e0 <col:17, col:27> col:27 __sz 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fec7d780450 <col:33, col:49> col:49 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7fec7d7806b8 <line:753:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:753:10 swap 'void (class std::__1::vector<int, class std::__1::allocator<int> > &) noexcept'
| `-ParmVarDecl 0x7fec7d7805a8 <col:15, col:21> col:22 'class std::__1::vector<int, class std::__1::allocator<int> > &'
|-CXXMethodDecl 0x7fec7d780768 <line:761:5, col:25> col:10 __invariants '_Bool (void) const'
|-AccessSpecDecl 0x7fec7d780810 <line:772:1, col:8> col:1 private
|-CXXMethodDecl 0x7fec7d780838 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:773:63> col:36 __invalidate_all_iterators 'void (void)'
| `-AlwaysInlineAttr 0x7fec7d7808e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d780a00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:774:82> col:36 __invalidate_iterators_past 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x7fec7d780938 <col:64, col:72> col:72 __new_last 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7fec7d780ab0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d780b90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:775:5, col:32> col:10 allocate 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fec7d780b08 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fec7d780c40 <line:776:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:776:10 deallocate 'void (void) noexcept'
|-CXXMethodDecl 0x7fec7d780dc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:777:75> col:41 __recommend 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fec7d780cf8 <col:53, col:63> col:63 __new_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fec7d780e70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d780f50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:778:5, col:42> col:10 __construct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fec7d780ec8 <col:29, col:39> col:39 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fec7d781110 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:780:63> col:10 __construct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fec7d781010 <col:29, col:39> col:39 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fec7d781080 <col:44, col:60> col:60 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-AlwaysInlineAttr 0x7fec7d7811c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-FunctionTemplateDecl 0x7fec7d781748 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:781:5, line:787:92> col:9 __construct_at_end
| |-TemplateTypeParmDecl 0x7fec7d781210 <line:781:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fec7d7816b0 <line:782:9, line:787:92> col:9 __construct_at_end 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value, void>::type (_ForwardIterator, _ForwardIterator, std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
|   |-ParmVarDecl 0x7fec7d781490 <col:28, col:45> col:45 __first '_ForwardIterator'
|   |-ParmVarDecl 0x7fec7d781500 <col:54, col:71> col:71 __last '_ForwardIterator'
|   `-ParmVarDecl 0x7fec7d781570 <col:79, col:89> col:89 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fec7d7818d0 <line:788:5, col:32> col:10 __append 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fec7d781848 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fec7d781a90 <line:789:5, col:53> col:10 __append 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fec7d781990 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fec7d781a00 <col:34, col:50> col:50 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7fec7d781c68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:791:20 __make_iter 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x7fec7d781b58 <col:32, col:40> col:40 __p 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7fec7d781d18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d781e78 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:793:20 __make_iter 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_pointer) const noexcept'
| |-ParmVarDecl 0x7fec7d781d70 <col:32, col:46> col:46 __p 'std::__1::vector<int, class std::__1::allocator<int> >::const_pointer':'const int *'
| `-AlwaysInlineAttr 0x7fec7d781f28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d7822f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:794:5, col:85> col:10 __swap_out_circular_buffer 'void (__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &)'
| `-ParmVarDecl 0x7fec7d7821e8 <col:37, col:82> col:82 __v '__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &'
|-CXXMethodDecl 0x7fec7d782620 <line:795:5, col:101> col:13 __swap_out_circular_buffer 'std::__1::vector<int, class std::__1::allocator<int> >::pointer (__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &, std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x7fec7d782498 <col:40, col:85> col:85 __v '__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &'
| `-ParmVarDecl 0x7fec7d782508 <col:90, col:98> col:98 __p 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|-CXXMethodDecl 0x7fec7d782900 <line:796:5, col:71> col:10 __move_range 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer, std::__1::vector<int, class std::__1::allocator<int> >::pointer, std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x7fec7d7826e8 <col:23, col:31> col:31 __from_s 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| |-ParmVarDecl 0x7fec7d782758 <col:41, col:49> col:49 __from_e 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-ParmVarDecl 0x7fec7d7827c8 <col:59, col:67> col:67 __to 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|-CXXMethodDecl 0x7fec7d782b50 <line:797:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:797:10 __move_assign 'void (class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::true_type)' noexcept-uninstantiated 0x7fec7db3e898
| |-ParmVarDecl 0x7fec7d7829d0 <col:24, col:32> col:32 __c 'class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x7fec7d782a30 <col:37> col:46 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
|-CXXMethodDecl 0x7fec7d782df0 <line:799:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:799:10 __move_assign 'void (class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::false_type)' noexcept-uninstantiated 0x7fec7db3ead8
| |-ParmVarDecl 0x7fec7d782c70 <col:24, col:32> col:32 __c 'class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x7fec7d782cd0 <col:37> col:47 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
|-CXXMethodDecl 0x7fec7d782fd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:808:5> line:802:10 __destruct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x7fec7d782f10 <col:28, col:36> col:36 __new_last 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7fec7d783088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fec7d7832e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:811:5, col:62> col:31 __push_back_slow_path
| |-TemplateTypeParmDecl 0x7fec7d7830d0 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXMethodDecl 0x7fec7d783250 <col:26, col:62> col:31 __push_back_slow_path 'void (_Up &&)'
|   `-ParmVarDecl 0x7fec7d783188 <col:53, col:59> col:59 __x '_Up &&'
|-FunctionTemplateDecl 0x7fec7d783638 <line:813:5, line:814:52> col:10 __emplace_back_slow_path
| |-TemplateTypeParmDecl 0x7fec7d7833c8 <line:813:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x7fec7d7835a0 <line:814:5, col:52> col:10 __emplace_back_slow_path 'void (_Args &&...)'
|   `-ParmVarDecl 0x7fec7d7834d8 <col:35, col:46> col:46 __args '_Args &&...'
|-CXXMethodDecl 0x7fec7d7838d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:835:62> line:834:10 __annotate_contiguous_container 'void (const void *, const void *, const void *, const void *) const'
| |-ParmVarDecl 0x7fec7d783718 <col:42, col:52> col:53 'const void *'
| |-ParmVarDecl 0x7fec7d783778 <col:55, col:65> col:66 'const void *'
| |-ParmVarDecl 0x7fec7d7837d8 <col:68, col:78> col:79 'const void *'
| |-ParmVarDecl 0x7fec7d783838 <line:835:42, col:52> col:53 'const void *'
| `-AlwaysInlineAttr 0x7fec7d7839a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d783b00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:841:5> line:838:10 __annotate_new 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fec7d7839f8 <col:25, col:35> col:35 __current_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fec7d783bb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d783bf8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:847:5> line:844:10 __annotate_delete 'void (void) const'
| `-AlwaysInlineAttr 0x7fec7d783ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d784a00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:854:5> line:850:10 __annotate_increase 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fec7d783cf8 <col:30, col:40> col:40 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fec7d784ab0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d784b90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:861:5> line:857:10 __annotate_shrink 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fec7d784b08 <col:28, col:38> col:38 __old_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fec7d784c40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXRecordDecl 0x7fec7d784c88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:880:5, col:12> col:12 struct __RAII_IncreaseAnnotator
`-CXXDestructorDecl 0x7fec7d784d70 <line:454:28> col:28 implicit used ~vector 'void (void) noexcept' inline default
  `-CompoundStmt 0x7fec7d786aa8 <col:28>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::vector" = type { %"class.std::__1::__vector_base" }
  NonVirtualBaseLLVMType:%"class.std::__1::vector" = type { %"class.std::__1::__vector_base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__atomic_base<_Bool, false>
         0 |   _Atomic(_Bool) __a_
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::atomic<_Bool>
         0 |   struct std::__1::__atomic_base<_Bool, false> (base)
         0 |     _Atomic(_Bool) __a_
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fec7d7887b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:890:1, line:993:1> line:891:8 struct __atomic_base definition
|-TemplateArgument type '_Bool'
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7fec7d7889f0 prev 0x7fec7d7887b8 <col:1, col:8> col:8 implicit struct __atomic_base
|-FieldDecl 0x7fec7d788ad0 <line:893:5, col:26> col:26 __a_ '_Atomic(_Bool)' mutable
|-CXXMethodDecl 0x7fec7d788b18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:907:5> line:900:10 is_lock_free '_Bool (void) const volatile noexcept'
| `-AlwaysInlineAttr 0x7fec7d788be8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d788c30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:910:82> line:909:10 is_lock_free '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d788cd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d788ea8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:914:46> line:912:10 store 'void (_Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fec7d788d30 <col:16, col:20> col:20 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fec7d788d90 <col:25, col:44> col:38 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fec7d788f60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fec7d789f40 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fec7d788ea8 'store' 'void (_Bool, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7fec7d789f18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:913:40, line:566:35> '_Bool' '||'
|     |-BinaryOperator 0x7fec7d7899d8 <line:913:40, line:565:35> '_Bool' '||'
|     | |-BinaryOperator 0x7fec7d789498 <line:913:40, line:564:35> '_Bool' '=='
|     | | |-ImplicitCastExpr 0x7fec7d789468 <line:913:40> 'int' <IntegralCast>
|     | | | `-ImplicitCastExpr 0x7fec7d789450 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | | |   `-DeclRefExpr 0x7fec7d788fa8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fec7d788d90 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | | `-ImplicitCastExpr 0x7fec7d789480 <line:564:35> 'int' <IntegralCast>
|     | |   `-DeclRefExpr 0x7fec7e028ad8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fec7e01e538 'memory_order_consume' 'enum std::__1::memory_order'
|     | `-BinaryOperator 0x7fec7d7899b0 <line:913:40, line:565:35> '_Bool' '=='
|     |   |-ImplicitCastExpr 0x7fec7d789980 <line:913:40> 'int' <IntegralCast>
|     |   | `-ImplicitCastExpr 0x7fec7d789968 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     |   |   `-DeclRefExpr 0x7fec7d7894c0 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fec7d788d90 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     |   `-ImplicitCastExpr 0x7fec7d789998 <line:565:35> 'int' <IntegralCast>
|     |     `-DeclRefExpr 0x7fec7e028b98 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fec7e01e580 'memory_order_acquire' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fec7d789ef0 <line:913:40, line:566:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fec7d789ec0 <line:913:40> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fec7d789ea8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fec7d789a00 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fec7d788d90 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fec7d789ed8 <line:566:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fec7e028c80 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fec7e01e610 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fec7d78a138 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:918:46> line:916:10 store 'void (_Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fec7d789fc0 <col:16, col:20> col:20 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fec7d78a020 <col:25, col:44> col:38 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fec7d78a1f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fec7d78b1d0 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fec7d78a138 'store' 'void (_Bool, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7fec7d78b1a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:917:40, line:566:35> '_Bool' '||'
|     |-BinaryOperator 0x7fec7d78ac68 <line:917:40, line:565:35> '_Bool' '||'
|     | |-BinaryOperator 0x7fec7d78a728 <line:917:40, line:564:35> '_Bool' '=='
|     | | |-ImplicitCastExpr 0x7fec7d78a6f8 <line:917:40> 'int' <IntegralCast>
|     | | | `-ImplicitCastExpr 0x7fec7d78a6e0 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | | |   `-DeclRefExpr 0x7fec7d78a238 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fec7d78a020 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | | `-ImplicitCastExpr 0x7fec7d78a710 <line:564:35> 'int' <IntegralCast>
|     | |   `-DeclRefExpr 0x7fec7e028ee0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fec7e01e538 'memory_order_consume' 'enum std::__1::memory_order'
|     | `-BinaryOperator 0x7fec7d78ac40 <line:917:40, line:565:35> '_Bool' '=='
|     |   |-ImplicitCastExpr 0x7fec7d78ac10 <line:917:40> 'int' <IntegralCast>
|     |   | `-ImplicitCastExpr 0x7fec7d78abf8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     |   |   `-DeclRefExpr 0x7fec7d78a750 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fec7d78a020 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     |   `-ImplicitCastExpr 0x7fec7d78ac28 <line:565:35> 'int' <IntegralCast>
|     |     `-DeclRefExpr 0x7fec7e028fa0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fec7e01e580 'memory_order_acquire' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fec7d78b180 <line:917:40, line:566:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fec7d78b150 <line:917:40> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fec7d78b138 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fec7d78ac90 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fec7d78a020 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fec7d78b168 <line:566:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fec7e029088 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fec7e01e610 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fec7d78b348 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:922:47> line:920:9 load '_Bool (std::__1::memory_order) const volatile noexcept'
| |-ParmVarDecl 0x7fec7d78b240 <col:14, col:33> col:27 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fec7d78b3f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fec7d78be98 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fec7d78b348 'load' '_Bool (std::__1::memory_order) const volatile noexcept'
|   `-BinaryOperator 0x7fec7d78be70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:921:39, line:571:35> '_Bool' '||'
|     |-BinaryOperator 0x7fec7d78b930 <line:921:39, line:570:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fec7d78b900 <line:921:39> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fec7d78b8e8 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fec7d78b440 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fec7d78b240 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fec7d78b918 <line:570:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fec7e029270 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fec7e01e5c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fec7d78be48 <line:921:39, line:571:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fec7d78be18 <line:921:39> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fec7d78be00 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fec7d78b958 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fec7d78b240 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fec7d78be30 <line:571:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fec7e029330 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fec7e01e610 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fec7d78c018 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:926:47> line:924:9 load '_Bool (std::__1::memory_order) const noexcept'
| |-ParmVarDecl 0x7fec7d78bf08 <col:14, col:33> col:27 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fec7d78c0c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fec7d78cb68 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fec7d78c018 'load' '_Bool (std::__1::memory_order) const noexcept'
|   `-BinaryOperator 0x7fec7d78cb40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:925:39, line:571:35> '_Bool' '||'
|     |-BinaryOperator 0x7fec7d78c600 <line:925:39, line:570:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fec7d78c5d0 <line:925:39> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fec7d78c5b8 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fec7d78c110 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fec7d78bf08 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fec7d78c5e8 <line:570:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fec7e029518 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fec7e01e5c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fec7d78cb18 <line:925:39, line:571:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fec7d78cae8 <line:925:39> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fec7d78cad0 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fec7d78c628 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fec7d78bf08 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fec7d78cb00 <line:571:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fec7e0295d8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fec7e01e610 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXConversionDecl 0x7fec7d78cc48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:928:60> col:5 operator bool '_Bool (void) const volatile noexcept'
| `-AlwaysInlineAttr 0x7fec7d78ccf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConversionDecl 0x7fec7d78cda8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:930:60> col:5 operator bool '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d78ce50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d78d038 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:933:56> line:932:9 exchange '_Bool (_Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fec7d78ceb8 <col:18, col:22> col:22 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fec7d78cf18 <col:27, col:46> col:40 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fec7d78d0f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d78d2c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:936:56> line:935:9 exchange '_Bool (_Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fec7d78d148 <col:18, col:22> col:22 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fec7d78d1a8 <col:27, col:46> col:40 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fec7d78d380 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d78d688 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:941:80> line:938:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fec7d78d408 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7fec7d78d478 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fec7d78d4d8 <line:939:32, col:45> col:45 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fec7d78d538 <col:50, col:63> col:63 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fec7d78d750 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fec7d78e1f0 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fec7d78d688 'compare_exchange_weak' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7fec7d78e1c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:940:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fec7d78dc88 <line:940:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fec7d78dc58 <line:940:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fec7d78dc40 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fec7d78d798 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fec7d78d538 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fec7d78dc70 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fec7e0307c0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fec7e01e5c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fec7d78e1a0 <line:940:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fec7d78e170 <line:940:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fec7d78e158 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fec7d78dcb0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fec7d78d538 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fec7d78e188 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fec7e030880 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fec7e01e610 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fec7d78e4e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:946:80> line:943:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fec7d78e270 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7fec7d78e2e0 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fec7d78e340 <line:944:32, col:45> col:45 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fec7d78e3a0 <col:50, col:63> col:63 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fec7d78e5b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fec7d78f050 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fec7d78e4e8 'compare_exchange_weak' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7fec7d78f028 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:945:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fec7d78eae8 <line:945:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fec7d78eab8 <line:945:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fec7d78eaa0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fec7d78e5f8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fec7d78e3a0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fec7d78ead0 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fec7e030a68 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fec7e01e5c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fec7d78f000 <line:945:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fec7d78efd0 <line:945:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fec7d78efb8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fec7d78eb10 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fec7d78e3a0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fec7d78efe8 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fec7e030b28 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fec7e01e610 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fec7d78f2a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:951:82> line:948:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fec7d78f0d0 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7fec7d78f140 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fec7d78f1a0 <line:949:34, col:47> col:47 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fec7d78f200 <col:52, col:65> col:65 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fec7d78f370 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fec7d78fe10 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fec7d78f2a8 'compare_exchange_strong' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7fec7d78fde8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:950:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fec7d78f8a8 <line:950:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fec7d78f878 <line:950:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fec7d78f860 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fec7d78f3b8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fec7d78f200 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fec7d78f890 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fec7e030d10 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fec7e01e5c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fec7d78fdc0 <line:950:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fec7d78fd90 <line:950:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fec7d78fd78 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fec7d78f8d0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fec7d78f200 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fec7d78fda8 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fec7e030dd0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fec7e01e610 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fec7d790068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:956:82> line:953:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fec7d78fe90 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7fec7d78ff00 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fec7d78ff60 <line:954:34, col:47> col:47 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fec7d78ffc0 <col:52, col:65> col:65 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fec7d790130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fec7d790bd0 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fec7d790068 'compare_exchange_strong' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7fec7d790ba8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:955:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fec7d790668 <line:955:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fec7d790638 <line:955:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fec7d790620 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fec7d790178 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fec7d78ffc0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fec7d790650 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fec7e030fb8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fec7e01e5c8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fec7d790b80 <line:955:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fec7d790b50 <line:955:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fec7d790b38 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fec7d790690 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fec7d78ffc0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fec7d790b68 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fec7e031078 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fec7e01e610 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fec7d790e58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:960:80> line:958:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fec7d790c50 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7fec7d790cc0 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fec7d790d20 <line:959:31, col:50> col:44 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fec7d790f18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d791178 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:964:80> line:962:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fec7d790f70 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7fec7d790fe0 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fec7d791040 <line:963:32, col:51> col:45 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fec7d791238 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d791400 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:968:82> line:966:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fec7d791290 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7fec7d791300 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fec7d791360 <line:967:31, col:50> col:44 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fec7d7914c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d791688 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:972:82> line:970:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fec7d791518 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7fec7d791588 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fec7d7915e8 <line:971:34, col:53> col:47 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fec7d791748 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fec7d7917d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:976:39> col:5 __atomic_base 'void (void) noexcept' default trivial
| `-AlwaysInlineAttr 0x7fec7d791888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fec7d7919c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:982:69> col:23 used constexpr __atomic_base 'void (_Bool) noexcept'
| |-ParmVarDecl 0x7fec7d7918e0 <col:37, col:41> col:41 used __d '_Bool':'_Bool'
| |-CXXCtorInitializer Field 0x7fec7d788ad0 '__a_' '_Atomic(_Bool)'
| | `-ImplicitCastExpr 0x7fec7d7934e8 <col:63> '_Atomic(_Bool)' <NonAtomicToAtomic>
| |   `-ImplicitCastExpr 0x7fec7d7934d0 <col:63> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7fec7d793478 <col:63> '_Bool':'_Bool' lvalue ParmVar 0x7fec7d7918e0 '__d' '_Bool':'_Bool'
| |-CompoundStmt 0x7fec7e02a5d8 <col:68, col:69>
| `-AlwaysInlineAttr 0x7fec7d791a88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fec7d791bf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:984:5, col:48> col:5 __atomic_base 'void (const struct std::__1::__atomic_base<_Bool, false> &)' delete trivial
| `-ParmVarDecl 0x7fec7d791b08 <col:19, col:38> col:39 'const struct std::__1::__atomic_base<_Bool, false> &'
|-CXXMethodDecl 0x7fec7d791db0 <line:985:5, col:59> col:20 operator= 'struct std::__1::__atomic_base<_Bool, false> &(const struct std::__1::__atomic_base<_Bool, false> &)' delete trivial
| `-ParmVarDecl 0x7fec7d791ce8 <col:30, col:49> col:50 'const struct std::__1::__atomic_base<_Bool, false> &'
|-CXXMethodDecl 0x7fec7d791f30 <line:986:5, col:68> col:20 operator= 'struct std::__1::__atomic_base<_Bool, false> &(const struct std::__1::__atomic_base<_Bool, false> &) volatile' delete trivial
| `-ParmVarDecl 0x7fec7d791e70 <col:30, col:49> col:50 'const struct std::__1::__atomic_base<_Bool, false> &'
`-CXXDestructorDecl 0x7fec7d7932f8 <line:891:8> col:8 implicit ~__atomic_base 'void (void)' inline default trivial noexcept-unevaluated 0x7fec7d7932f8

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__atomic_base" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__atomic_base" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fec7d828ca8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1083:1, line:1099:1> line:1084:8 struct atomic definition
|-public '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>'
|-TemplateArgument type '_Bool'
|-CXXRecordDecl 0x7fec7d792068 prev 0x7fec7d828ca8 <col:1, col:8> col:8 implicit struct atomic
|-TypedefDecl 0x7fec7d792408 <line:1087:5, col:32> col:32 __base '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>'
| `-TemplateSpecializationType 0x7fec7d792390 '__atomic_base<_Bool>' sugar __atomic_base
|   |-TemplateArgument type '_Bool':'_Bool'
|   `-RecordType 0x7fec7d7888c0 'struct std::__1::__atomic_base<_Bool, false>'
|     `-ClassTemplateSpecialization 0x7fec7d7887b8 '__atomic_base'
|-CXXConstructorDecl 0x7fec7d7924a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:818:33> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1089:5 atomic 'void (void)' default trivial noexcept-unevaluated 0x7fec7d7924a0
| `-AlwaysInlineAttr 0x7fec7d792588 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fec7d7926c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1091:64> col:23 used constexpr atomic 'void (_Bool) noexcept'
| |-ParmVarDecl 0x7fec7d7925e0 <col:30, col:34> col:34 used __d '_Bool':'_Bool'
| |-CXXCtorInitializer 'std::__1::atomic<_Bool>::__base':'struct std::__1::__atomic_base<_Bool, false>'
| | `-CXXConstructExpr 0x7fec7d793530 <col:51, col:61> '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>' 'void (_Bool) noexcept'
| |   `-ImplicitCastExpr 0x7fec7d793460 <col:58> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7fec7d7933d8 <col:58> '_Bool':'_Bool' lvalue ParmVar 0x7fec7d7925e0 '__d' '_Bool':'_Bool'
| |-CompoundStmt 0x7fec7e035f00 <col:63, col:64>
| `-AlwaysInlineAttr 0x7fec7d792788 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d7928e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1095:41> line:1094:9 operator= '_Bool (_Bool) volatile noexcept'
| |-ParmVarDecl 0x7fec7d7927e0 <col:19, col:23> col:23 __d '_Bool':'_Bool'
| `-AlwaysInlineAttr 0x7fec7d792998 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d792af8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1098:41> line:1097:9 operator= '_Bool (_Bool) noexcept'
| |-ParmVarDecl 0x7fec7d7929f0 <col:19, col:23> col:23 __d '_Bool':'_Bool'
| `-AlwaysInlineAttr 0x7fec7d792ba8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fec7d792c18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1084:8> col:8 implicit atomic 'void (const struct std::__1::atomic<_Bool> &)' inline default_delete trivial noexcept-unevaluated 0x7fec7d792c18
| `-ParmVarDecl 0x7fec7d792d40 <col:8> col:8 'const struct std::__1::atomic<_Bool> &'
|-CXXConstructorDecl 0x7fec7d792dd8 <col:8> col:8 implicit atomic 'void (struct std::__1::atomic<_Bool> &&)' inline default_delete trivial noexcept-unevaluated 0x7fec7d792dd8
| `-ParmVarDecl 0x7fec7d792f00 <col:8> col:8 'struct std::__1::atomic<_Bool> &&'
|-CXXMethodDecl 0x7fec7d792f98 <col:8, <invalid sloc>> col:8 implicit operator= 'struct std::__1::atomic<_Bool> &(const struct std::__1::atomic<_Bool> &)' inline default_delete trivial noexcept-unevaluated 0x7fec7d792f98
| `-ParmVarDecl 0x7fec7d7930b0 <col:8> col:8 'const struct std::__1::atomic<_Bool> &'
`-CXXMethodDecl 0x7fec7d793118 <col:8, <invalid sloc>> col:8 implicit operator= 'struct std::__1::atomic<_Bool> &(struct std::__1::atomic<_Bool> &&)' inline default_delete trivial noexcept-unevaluated 0x7fec7d793118
  `-ParmVarDecl 0x7fec7d793230 <col:8> col:8 'struct std::__1::atomic<_Bool> &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::atomic" = type { %"struct.std::__1::__atomic_base" }
  NonVirtualBaseLLVMType:%"struct.std::__1::atomic" = type { %"struct.std::__1::__atomic_base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::thread
         0 |   std::__1::__libcpp_thread_t __t_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_t
         0 |   long __sig
         8 |   struct __darwin_pthread_handler_rec * __cleanup_stack
        16 |   char [8176] __opaque
           | [sizeof=8192, dsize=8192, align=8,
           |  nvsize=8192, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __darwin_pthread_handler_rec
         0 |   void (*)(void *) __routine
         8 |   void * __arg
        16 |   struct __darwin_pthread_handler_rec * __next
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fec7d0c7360 </usr/include/sys/_pthread/_pthread_types.h:57:1, line:61:1> line:57:8 struct __darwin_pthread_handler_rec definition
|-CXXRecordDecl 0x7fec7d0c7488 <col:1, col:8> col:8 implicit struct __darwin_pthread_handler_rec
|-FieldDecl 0x7fec7d0c76d0 <line:58:2, col:26> col:9 __routine 'void (*)(void *)'
|-FieldDecl 0x7fec7d0c7730 <line:59:2, col:8> col:8 __arg 'void *'
`-FieldDecl 0x7fec7d0c7800 <line:60:2, col:39> col:39 __next 'struct __darwin_pthread_handler_rec *'

Layout: <CGRecordLayout
  LLVMType:%struct.__darwin_pthread_handler_rec = type { void (i8*)*, i8*, %struct.__darwin_pthread_handler_rec* }
  NonVirtualBaseLLVMType:%struct.__darwin_pthread_handler_rec = type { void (i8*)*, i8*, %struct.__darwin_pthread_handler_rec* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fec7d0cc860 </usr/include/sys/_pthread/_pthread_types.h:103:1, line:107:1> line:103:8 struct _opaque_pthread_t definition
|-CXXRecordDecl 0x7fec7d0cc988 <col:1, col:8> col:8 implicit struct _opaque_pthread_t
|-FieldDecl 0x7fec7d0cca38 <line:104:2, col:7> col:7 __sig 'long'
|-FieldDecl 0x7fec7d0ccaa8 <line:105:2, col:40> col:40 __cleanup_stack 'struct __darwin_pthread_handler_rec *'
`-FieldDecl 0x7fec7d0ccb68 <line:106:2, col:32> col:7 __opaque 'char [8176]'

Layout: <CGRecordLayout
  LLVMType:%struct._opaque_pthread_t = type { i64, %struct.__darwin_pthread_handler_rec*, [8176 x i8] }
  NonVirtualBaseLLVMType:%struct._opaque_pthread_t = type { i64, %struct.__darwin_pthread_handler_rec*, [8176 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fec7e242778 prev 0x7fec7e23ad10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:285:1, line:333:1> line:285:24 referenced class thread definition
|-VisibilityAttr 0x7fec7e242878 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fec7e2428c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:285:1, col:24> col:24 implicit referenced class thread
|-FieldDecl 0x7fec7e242968 <line:287:5, col:23> col:23 referenced __t_ 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
|-CXXConstructorDecl 0x7fec7e242b00 <line:289:5, col:25> col:5 thread 'void (const class std::__1::thread &)'
| `-ParmVarDecl 0x7fec7e2429e8 <col:12, col:24> col:25 'const class std::__1::thread &'
|-CXXMethodDecl 0x7fec7e242cb0 <line:290:5, col:36> col:13 operator= 'class std::__1::thread &(const class std::__1::thread &)'
| `-ParmVarDecl 0x7fec7e242bc0 <col:23, col:35> col:36 'const class std::__1::thread &'
|-AccessSpecDecl 0x7fec7e242d50 <line:291:1, col:7> col:1 public
|-TypedefDecl 0x7fec7e242d88 <line:292:5, col:25> col:25 referenced id 'class std::__1::__thread_id'
| `-RecordType 0x7fec7e238950 'class std::__1::__thread_id'
|   `-CXXRecord 0x7fec7e238de8 '__thread_id'
|-TypedefDecl 0x7fec7e242df0 <line:293:5, col:31> col:31 referenced native_handle_type 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| `-TypedefType 0x7fec7da45f10 'std::__1::__libcpp_thread_t' sugar
|   |-Typedef 0x7fec7da437e0 '__libcpp_thread_t'
|   `-TypedefType 0x7fec7e1dfa90 'pthread_t' sugar
|     |-Typedef 0x7fec7e1de0d0 'pthread_t'
|     `-TypedefType 0x7fec7e1de0a0 '__darwin_pthread_t' sugar
|       |-Typedef 0x7fec7d0ce280 '__darwin_pthread_t'
|       `-PointerType 0x7fec7d0ce230 'struct _opaque_pthread_t *'
|         `-ElaboratedType 0x7fec7d0cd1c0 'struct _opaque_pthread_t' sugar
|           `-RecordType 0x7fec7d0cc900 'struct _opaque_pthread_t'
|             `-CXXRecord 0x7fec7d0cc860 '_opaque_pthread_t'
|-CXXConstructorDecl 0x7fec7e242ea0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:296:53> col:5 thread 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7fec7e242968 '__t_' 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| | `-ImplicitCastExpr 0x7fec7e244928 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__threading_support:73:29> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <NullToPointer>
| |   `-IntegerLiteral 0x7fec7e2448d8 <col:29> 'unsigned int' 0
| |-CompoundStmt 0x7fec7e244970 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:296:52, col:53>
| |-AlwaysInlineAttr 0x7fec7e242f48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fec7e242f90 <col:51, col:74> Hidden
|-FunctionTemplateDecl 0x7fec7e2438b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:298:5, line:305:53> col:18 thread
| |-TemplateTypeParmDecl 0x7fec7e242fa0 <line:298:15, col:21> col:21 referenced class depth 0 index 0 _Fp
| |-TemplateTypeParmDecl 0x7fec7e243008 <col:26, col:35> col:35 referenced class depth 0 index 1 ... _Args
| |-TemplateTypeParmDecl 0x7fec7e243520 <line:299:15, line:302:18> line:299:15 class depth 0 index 2
| | `-TemplateArgument type 'typename enable_if<!is_same<typename decay<_Fp>::type, class thread>::value>::type'
| |-CXXConstructorDecl 0x7fec7e243810 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:305:53> col:18 thread 'void (_Fp &&, _Args &&...)' inline
| | |-ParmVarDecl 0x7fec7e243618 <col:25, col:31> col:31 __f '_Fp &&'
| | |-ParmVarDecl 0x7fec7e2436f8 <col:36, col:47> col:47 __args '_Args &&...'
| | `-VisibilityAttr 0x7fec7e243918 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:644:40, col:63> Hidden
| `-CXXConstructorDecl 0x7fec7d7a1e20 parent 0x7fec7e242778 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:359:1, line:373:1> line:359:9 used thread 'void (void (&&)(void))'
|   |-TemplateArgument type 'void (&)(void)'
|   |-TemplateArgument pack
|   |-TemplateArgument type 'void'
|   `-ParmVarDecl 0x7fec7d7a1d18 <col:16, col:19> col:22 __f 'void (&&)(void)'
|-CXXDestructorDecl 0x7fec7e2439b0 <line:311:5, col:13> col:5 used ~thread 'void (void) noexcept'
|-CXXConstructorDecl 0x7fec7e243bc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:315:85> col:5 thread 'void (class std::__1::thread &&) noexcept'
| |-ParmVarDecl 0x7fec7e243ab8 <col:12, col:21> col:21 used __t 'class std::__1::thread &&'
| |-CXXCtorInitializer Field 0x7fec7e242968 '__t_' 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| | `-ImplicitCastExpr 0x7fec7e244a18 <col:43, col:47> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <LValueToRValue>
| |   `-MemberExpr 0x7fec7e2449b0 <col:43, col:47> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue .__t_ 0x7fec7e242968
| |     `-DeclRefExpr 0x7fec7e244988 <col:43> 'class std::__1::thread' lvalue ParmVar 0x7fec7e243ab8 '__t' 'class std::__1::thread &&'
| |-CompoundStmt 0x7fec7e244b20 <col:53, col:85>
| | `-BinaryOperator 0x7fec7e244af8 <col:54, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__threading_support:73:29> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue '='
| |   |-MemberExpr 0x7fec7e244a88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:315:54, col:58> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue .__t_ 0x7fec7e242968
| |   | `-DeclRefExpr 0x7fec7e244a60 <col:54> 'class std::__1::thread' lvalue ParmVar 0x7fec7e243ab8 '__t' 'class std::__1::thread &&'
| |   `-ImplicitCastExpr 0x7fec7e244ae0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__threading_support:73:29> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <NullToPointer>
| |     `-IntegerLiteral 0x7fec7e244ac0 <col:29> 'unsigned int' 0
| |-AlwaysInlineAttr 0x7fec7e243c78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fec7e243cc0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fec7e243e18 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:317:13 operator= 'class std::__1::thread &(class std::__1::thread &&) noexcept'
| |-ParmVarDecl 0x7fec7e243d10 <col:23, col:32> col:32 __t 'class std::__1::thread &&'
| |-AlwaysInlineAttr 0x7fec7e243eb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fec7e243f00 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fec7e244058 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:67> col:10 used swap 'void (class std::__1::thread &) noexcept'
| |-ParmVarDecl 0x7fec7e243f50 <col:15, col:23> col:23 used __t 'class std::__1::thread &'
| |-CompoundStmt 0x7fec7e252be8 <col:38, col:67>
| | `-CallExpr 0x7fec7e252bb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:65> 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type':'void'
| |   |-ImplicitCastExpr 0x7fec7e252b98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:46> 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type (*)(struct _opaque_pthread_t *&, struct _opaque_pthread_t *&) noexcept(is_nothrow_move_constructible<struct _opaque_pthread_t *>::value && is_nothrow_move_assignable<struct _opaque_pthread_t *>::value)' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7fec7e252af8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:46> 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type (struct _opaque_pthread_t *&, struct _opaque_pthread_t *&) noexcept(is_nothrow_move_constructible<struct _opaque_pthread_t *>::value && is_nothrow_move_assignable<struct _opaque_pthread_t *>::value)' lvalue Function 0x7fec7e24f330 'swap' 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type (struct _opaque_pthread_t *&, struct _opaque_pthread_t *&) noexcept(is_nothrow_move_constructible<struct _opaque_pthread_t *>::value && is_nothrow_move_assignable<struct _opaque_pthread_t *>::value)' (FunctionTemplate 0x7fec7e00a2b8 'swap')
| |   |-MemberExpr 0x7fec7e244c60 <col:51> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue ->__t_ 0x7fec7e242968
| |   | `-CXXThisExpr 0x7fec7e244c48 <col:51> 'class std::__1::thread *' this
| |   `-MemberExpr 0x7fec7e244cc0 <col:57, col:61> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue .__t_ 0x7fec7e242968
| |     `-DeclRefExpr 0x7fec7e244c98 <col:57> 'class std::__1::thread' lvalue ParmVar 0x7fec7e243f50 '__t' 'class std::__1::thread &'
| |-AlwaysInlineAttr 0x7fec7e2440f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fec7e244140 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fec7e2441d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:324:76> col:10 joinable '_Bool (void) const noexcept'
| |-CompoundStmt 0x7fec7e252dd8 <col:37, col:76>
| | `-ReturnStmt 0x7fec7e252dc0 <col:38, col:74>
| |   `-UnaryOperator 0x7fec7e252da0 <col:45, col:74> '_Bool' prefix '!'
| |     `-CallExpr 0x7fec7e252d70 <col:46, col:74> '_Bool'
| |       |-ImplicitCastExpr 0x7fec7e252d58 <col:46> '_Bool (*)(const std::__1::__libcpp_thread_t *)' <FunctionToPointerDecay>
| |       | `-DeclRefExpr 0x7fec7e252cd0 <col:46> '_Bool (const std::__1::__libcpp_thread_t *)' lvalue Function 0x7fec7e1e4620 '__libcpp_thread_isnull' '_Bool (const std::__1::__libcpp_thread_t *)'
| |       `-UnaryOperator 0x7fec7e252cb0 <col:69, col:70> 'const std::__1::__libcpp_thread_t *' prefix '&'
| |         `-MemberExpr 0x7fec7e252c78 <col:70> 'const std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *const' lvalue ->__t_ 0x7fec7e242968
| |           `-CXXThisExpr 0x7fec7e252c60 <col:70> 'const class std::__1::thread *' this
| |-AlwaysInlineAttr 0x7fec7e244268 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fec7e2442b0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fec7e2442e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:325:5, col:15> col:10 used join 'void (void)'
|-CXXMethodDecl 0x7fec7e244398 <line:326:5, col:17> col:10 detach 'void (void)'
|-CXXMethodDecl 0x7fec7e244508 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:328:71> col:8 get_id 'std::__1::thread::id (void) const noexcept'
| |-CompoundStmt 0x7fec7e253060 <col:33, col:71>
| | `-ReturnStmt 0x7fec7e253048 <col:34, col:69>
| |   `-ExprWithCleanups 0x7fec7e253030 <col:34, col:69> 'std::__1::thread::id':'class std::__1::__thread_id'
| |     `-CXXConstructExpr 0x7fec7e252ff8 <col:34, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' 'void (class std::__1::__thread_id &&) noexcept' elidable
| |       `-MaterializeTemporaryExpr 0x7fec7e252fe0 <col:41, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' xvalue
| |         `-ImplicitCastExpr 0x7fec7e252fc8 <col:41, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' <ConstructorConversion>
| |           `-CXXConstructExpr 0x7fec7e252f90 <col:41, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' 'void (std::__1::__libcpp_thread_id)'
| |             `-CallExpr 0x7fec7e252f60 <col:41, col:69> 'std::__1::__libcpp_thread_id':'struct _opaque_pthread_t *'
| |               |-ImplicitCastExpr 0x7fec7e252f48 <col:41> 'std::__1::__libcpp_thread_id (*)(const std::__1::__libcpp_thread_t *)' <FunctionToPointerDecay>
| |               | `-DeclRefExpr 0x7fec7e252ec0 <col:41> 'std::__1::__libcpp_thread_id (const std::__1::__libcpp_thread_t *)' lvalue Function 0x7fec7e1e50d8 '__libcpp_thread_get_id' 'std::__1::__libcpp_thread_id (const std::__1::__libcpp_thread_t *)'
| |               `-UnaryOperator 0x7fec7e252ea0 <col:64, col:65> 'const std::__1::__libcpp_thread_t *' prefix '&'
| |                 `-MemberExpr 0x7fec7e252e68 <col:65> 'const std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *const' lvalue ->__t_ 0x7fec7e242968
| |                   `-CXXThisExpr 0x7fec7e252e50 <col:65> 'const class std::__1::thread *' this
| |-AlwaysInlineAttr 0x7fec7e2445a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fec7e2445e8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fec7e2446a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:330:63> col:24 native_handle 'std::__1::thread::native_handle_type (void) noexcept'
| |-CompoundStmt 0x7fec7e253100 <col:50, col:63>
| | `-ReturnStmt 0x7fec7e2530e8 <col:51, col:58>
| |   `-ImplicitCastExpr 0x7fec7e2530d0 <col:58> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <LValueToRValue>
| |     `-MemberExpr 0x7fec7e253098 <col:58> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue ->__t_ 0x7fec7e242968
| |       `-CXXThisExpr 0x7fec7e253080 <col:58> 'class std::__1::thread *' this
| |-AlwaysInlineAttr 0x7fec7e244740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fec7e244788 <col:51, col:74> Hidden
`-CXXMethodDecl 0x7fec7e244800 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:332:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:332:21 hardware_concurrency 'unsigned int (void) noexcept' static

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::thread" = type { %struct._opaque_pthread_t* }
  NonVirtualBaseLLVMType:%"class.std::__1::thread" = type { %struct._opaque_pthread_t* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1225:9)
         0 |   struct std::__1::_PairT __t
         0 |     size_t first
         8 |     size_t second
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__murmur2_or_cityhash<unsigned long, 64> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1190:9)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1208:9)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1303:9)
         0 |   struct _opaque_pthread_t * __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |       union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __l
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __s
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw __r
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__rep
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __l
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |     struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __s
         0 |       union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw __r
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__split_buffer_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>
         0 |   class std::__1::allocator<int> & __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>
         0 |   struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
         0 |     int * __value_
         8 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> (base)
         8 |     class std::__1::allocator<int> & __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__split_buffer<int, class std::__1::allocator<int> &>
         0 |   class std::__1::__split_buffer_common<true> (base) (empty)
         0 |   std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer __first_
         8 |   std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer __begin_
        16 |   std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer __end_
        24 |   class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> __end_cap_
        24 |     struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
        24 |       int * __value_
        32 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> (base)
        32 |       class std::__1::allocator<int> & __value_
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false>
         0 |   class std::__1::__thread_struct * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::default_delete<class std::__1::__thread_struct> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (empty)
         0 |   struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> >
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |     class std::__1::__thread_struct * __value_
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |     struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >
         0 |   class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |       class std::__1::__thread_struct * __value_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |       struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__tuple_leaf<0, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, false>
         0 |   class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> > __value_
         0 |     class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |       struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |         class std::__1::__thread_struct * __value_
         0 |       struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |         struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__tuple_leaf<1, void (*)(void), false>
         0 |   void (*)(void) __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__tuple_impl<struct std::__1::__tuple_indices<0, 1>, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)>
         0 |   class std::__1::__tuple_leaf<0, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, false> (base)
         0 |     class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> > __value_
         0 |       class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |         struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |           class std::__1::__thread_struct * __value_
         0 |         struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |           struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
         8 |   class std::__1::__tuple_leaf<1, void (*)(void), false> (base)
         8 |     void (*)(void) __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)>
         0 |   struct std::__1::__tuple_impl<struct std::__1::__tuple_indices<0, 1>, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> __base_
         0 |     class std::__1::__tuple_leaf<0, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, false> (base)
         0 |       class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> > __value_
         0 |         class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |           struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |             class std::__1::__thread_struct * __value_
         0 |           struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |             struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
         8 |     class std::__1::__tuple_leaf<1, void (*)(void), false> (base)
         8 |       void (*)(void) __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> >, 1, true> (empty)
         0 |   struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> *, 0, false>
         0 |   class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> *, struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > >
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> *, 0, false> (base)
         0 |     class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> * __value_
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> >, 1, true> (base) (empty)
         0 |     struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::integral_constant<_Bool, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fec7d0e6408 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:503:1, line:515:1> line:504:29 struct integral_constant definition
|-TemplateArgument type '_Bool'
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7fec7d0a91d8 prev 0x7fec7d0e6408 <col:1, col:29> col:29 implicit struct integral_constant
|-VarDecl 0x7fec7d0a9280 <line:506:5, col:53> col:45 used value 'const _Bool':'const _Bool' static constexpr cinit
| `-SubstNonTypeTemplateParmExpr 0x7fec7d0a9308 <col:53> '_Bool'
|   `-CXXBoolLiteralExpr 0x7fec7d0a92f0 <col:53> '_Bool' true
|-TypedefDecl 0x7fec7d0a9398 <line:507:5, col:31> col:31 value_type '_Bool':'_Bool'
| `-SubstTemplateTypeParmType 0x7fec7d0e63d0 '_Bool' sugar
|   |-TemplateTypeParmType 0x7fec7d0e5400 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fec7d0e53c0 '_Tp'
|   `-BuiltinType 0x7fec7d033b40 '_Bool'
|-TypedefDecl 0x7fec7d0a9400 <line:508:5, col:31> col:31 referenced type 'struct std::__1::integral_constant<_Bool, true>'
| `-RecordType 0x7fec7d0e6510 'struct std::__1::integral_constant<_Bool, true>'
|   `-ClassTemplateSpecialization 0x7fec7d0e6408 'integral_constant'
|-CXXConversionDecl 0x7fec7d0a94e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:510:79> col:27 constexpr operator bool 'std::__1::integral_constant<_Bool, true>::value_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d0a95b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7d0a9630 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:513:75> col:31 constexpr operator() 'std::__1::integral_constant<_Bool, true>::value_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7d0a96d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fec7e858490 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:504:29> col:29 implicit referenced constexpr integral_constant 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fec7e8585a8 <col:29> col:29 implicit constexpr integral_constant 'void (const struct std::__1::integral_constant<_Bool, true> &)' inline default trivial noexcept-unevaluated 0x7fec7e8585a8
| `-ParmVarDecl 0x7fec7e8586d0 <col:29> col:29 'const struct std::__1::integral_constant<_Bool, true> &'
|-CXXConstructorDecl 0x7fec7e858768 <col:29> col:29 implicit used constexpr integral_constant 'void (struct std::__1::integral_constant<_Bool, true> &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7fec7e858890 <col:29> col:29 'struct std::__1::integral_constant<_Bool, true> &&'
| `-CompoundStmt 0x7fec8003f158 <col:29>
`-CXXDestructorDecl 0x7fec7e858980 <col:29> col:29 implicit referenced ~integral_constant 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::integral_constant" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::integral_constant" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> (empty)
         0 |   struct std::__1::integral_constant<_Bool, true> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fec7e3fbb88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1366:1, line:1374:1> line:1367:8 struct __has_destroy definition
|-public 'integral_constant<_Bool, is_same<decltype(__has_destroy_test(declval<class allocator<int> >(), declval<int *>())), true_type>::value>':'struct std::__1::integral_constant<_Bool, true>'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-TemplateArgument type 'int *'
|-CXXRecordDecl 0x7fec7e3fea78 prev 0x7fec7e3fbb88 <col:1, col:8> col:8 implicit struct __has_destroy
|-CXXConstructorDecl 0x7fec7e3feb50 <col:8> col:8 implicit referenced constexpr __has_destroy 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fec7e3fec68 <col:8> col:8 implicit constexpr __has_destroy 'void (const struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &)' inline default trivial noexcept-unevaluated 0x7fec7e3fec68
| `-ParmVarDecl 0x7fec7e3fed90 <col:8> col:8 'const struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &'
|-CXXConstructorDecl 0x7fec7e3fee28 <col:8> col:8 implicit constexpr __has_destroy 'void (struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &&)' inline default trivial noexcept-unevaluated 0x7fec7e3fee28
| `-ParmVarDecl 0x7fec7e3fef50 <col:8> col:8 'struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &&'
`-CXXDestructorDecl 0x7fec7e3feff0 <col:8> col:8 implicit referenced ~__has_destroy 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__has_destroy" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__has_destroy" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fec7d784c88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:880:5, line:884:5> line:880:12 struct __RAII_IncreaseAnnotator definition
|-CXXRecordDecl 0x7fec7e400ef0 prev 0x7fec7d784c88 <col:5, col:12> col:12 implicit struct __RAII_IncreaseAnnotator
|-CXXConstructorDecl 0x7fec7e401160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:882:64> col:7 used __RAII_IncreaseAnnotator 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| |-ParmVarDecl 0x7fec7e400f98 <col:32, col:45> col:46 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7fec7e401008 <col:48, col:60> col:58 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7fec7e401740 <col:60> 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7fec7db40eb8 <col:60> 'int' 1
| |-CompoundStmt 0x7fec7db45728 <col:63, col:64>
| `-AlwaysInlineAttr 0x7fec7e401258 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e4012a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:883:48> col:38 used __done 'void (void)'
| |-CompoundStmt 0x7fec7db45740 <col:47, col:48>
| `-AlwaysInlineAttr 0x7fec7e401348 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fec7e4013d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:880:12> col:12 implicit constexpr __RAII_IncreaseAnnotator 'void (const struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &)' inline default trivial noexcept-unevaluated 0x7fec7e4013d8
| `-ParmVarDecl 0x7fec7e401500 <col:12> col:12 'const struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &'
`-CXXConstructorDecl 0x7fec7e401598 <col:12> col:12 implicit constexpr __RAII_IncreaseAnnotator 'void (struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &&)' inline default trivial noexcept-unevaluated 0x7fec7e401598
  `-ParmVarDecl 0x7fec7e4016c0 <col:12> col:12 'struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::vector<int, std::__1::allocator<int> >::__RAII_IncreaseAnnotator" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::vector<int, std::__1::allocator<int> >::__RAII_IncreaseAnnotator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> (empty)
         0 |   struct std::__1::integral_constant<_Bool, true> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fec7e403a00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1345:1, line:1354:1> line:1346:8 struct __has_construct definition
|-public 'integral_constant<_Bool, is_same<decltype(__has_construct_test(declval<class allocator<int> >(), declval<int *>(), declval<int>())), true_type>::value>':'struct std::__1::integral_constant<_Bool, true>'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-TemplateArgument type 'int *'
|-TemplateArgument pack
| `-TemplateArgument type 'int'
|-CXXRecordDecl 0x7fec7e407a88 prev 0x7fec7e403a00 <col:1, col:8> col:8 implicit struct __has_construct
|-CXXConstructorDecl 0x7fec7e407b60 <col:8> col:8 implicit referenced constexpr __has_construct 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fec7e407c78 <col:8> col:8 implicit constexpr __has_construct 'void (const struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &)' inline default trivial noexcept-unevaluated 0x7fec7e407c78
| `-ParmVarDecl 0x7fec7e407da0 <col:8> col:8 'const struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &'
|-CXXConstructorDecl 0x7fec7e407e38 <col:8> col:8 implicit constexpr __has_construct 'void (struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &&)' inline default trivial noexcept-unevaluated 0x7fec7e407e38
| `-ParmVarDecl 0x7fec7e407f60 <col:8> col:8 'struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &&'
`-CXXDestructorDecl 0x7fec7e408000 <col:8> col:8 implicit referenced ~__has_construct 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__has_construct" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__has_construct" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fec7daede68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:19:1, line:25:1> line:20:7 class __split_buffer_common definition
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7fec7daee050 prev 0x7fec7daede68 <col:1, col:7> col:7 implicit class __split_buffer_common
|-AccessSpecDecl 0x7fec7daee0e8 <line:22:1, col:10> col:1 protected
|-CXXMethodDecl 0x7fec7daee110 <line:23:5, col:33> col:10 __throw_length_error 'void (void) const'
|-CXXMethodDecl 0x7fec7daee1b8 <line:24:5, col:33> col:10 __throw_out_of_range 'void (void) const'
|-CXXDestructorDecl 0x7fec7e41a1a0 <line:20:7> col:7 implicit ~__split_buffer_common 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fec7e437d58 <col:7> col:7 implicit used constexpr __split_buffer_common 'void (void) noexcept' inline default trivial
| `-CompoundStmt 0x7fec7e4381b8 <col:7>
|-CXXConstructorDecl 0x7fec7e437e68 <col:7> col:7 implicit constexpr __split_buffer_common 'void (const class std::__1::__split_buffer_common<true> &)' inline default trivial noexcept-unevaluated 0x7fec7e437e68
| `-ParmVarDecl 0x7fec7e437f90 <col:7> col:7 'const class std::__1::__split_buffer_common<true> &'
`-CXXConstructorDecl 0x7fec7e438028 <col:7> col:7 implicit constexpr __split_buffer_common 'void (class std::__1::__split_buffer_common<true> &&)' inline default trivial noexcept-unevaluated 0x7fec7e438028
  `-ParmVarDecl 0x7fec7e438150 <col:7> col:7 'class std::__1::__split_buffer_common<true> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__split_buffer_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__split_buffer_common" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fec7e40d620 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2034:1, line:2067:1> line:2037:8 struct __compressed_pair_elem definition
|-TemplateArgument type 'class std::__1::allocator<int> &'
|-TemplateArgument integral 1
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7fec7e40d8a0 prev 0x7fec7e40d620 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7fec7e40d948 <line:2038:3, col:15> col:15 _ParamT 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
| `-SubstTemplateTypeParmType 0x7fec7e40cca0 'class std::__1::allocator<int> &' sugar
|   |-TemplateTypeParmType 0x7fec7e885d80 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fec7e885d38 '_Tp'
|   `-LValueReferenceType 0x7fec7d75fb50 'class std::__1::allocator<int> &'
|     `-RecordType 0x7fec7d7522f0 'class std::__1::allocator<int>'
|       `-ClassTemplateSpecialization 0x7fec7d752200 'allocator'
|-TypedefDecl 0x7fec7e40d9d8 <line:2039:3, col:16> col:16 referenced reference 'class std::__1::allocator<int> &&'
| `-LValueReferenceType 0x7fec7e40d9a0 'class std::__1::allocator<int> &&'
|   `-RecordType 0x7fec7d7522f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fec7d752200 'allocator'
|-TypedefDecl 0x7fec7e40da40 <line:2040:3, col:22> col:22 referenced const_reference 'class std::__1::allocator<int> &&'
| `-LValueReferenceType 0x7fec7e40d9a0 'class std::__1::allocator<int> &&'
|   `-RecordType 0x7fec7d7522f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fec7d752200 'allocator'
|-CXXConstructorDecl 0x7fec7e40dad8 <line:2043:3, col:52> col:13 constexpr __compressed_pair_elem 'void (void)'
|-FunctionTemplateDecl 0x7fec7e40e2b8 <line:2045:3, line:2050:44> line:2049:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fec7e40db90 <line:2045:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fec7e40dbf8 <col:24, line:2047:6> line:2045:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<class allocator<int> &, 1, false>, typename decay<_Up>::type>::value>::type'
| |-CXXConstructorDecl 0x7fec7e40e210 <line:2048:3, line:2050:44> line:2049:3 constexpr __compressed_pair_elem 'void (_Up &&)'
| | `-ParmVarDecl 0x7fec7e40e128 <col:26, col:32> col:32 __u '_Up &&'
| `-CXXConstructorDecl 0x7fec7e437520 <line:2048:3, line:2050:44> line:2049:3 used constexpr __compressed_pair_elem 'void (class std::__1::allocator<int> &&)'
|   |-TemplateArgument type 'class std::__1::allocator<int> &'
|   |-TemplateArgument type 'void'
|   |-ParmVarDecl 0x7fec7e437458 <col:26, col:32> col:32 used __u 'class std::__1::allocator<int> &&'
|   |-CXXCtorInitializer Field 0x7fec7e40ecf8 '__value_' 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
|   | `-CallExpr 0x7fec7e437bb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2050:41> 'class std::__1::allocator<int>' lvalue
|   |   |-ImplicitCastExpr 0x7fec7e437ba0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2050:36> 'class std::__1::allocator<int> &&(*)(typename remove_reference<class allocator<int> &>::type &) noexcept' <FunctionToPointerDecay>
|   |   | `-DeclRefExpr 0x7fec7e437b20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2050:36> 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' lvalue Function 0x7fec7e4308e8 'forward' 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' (FunctionTemplate 0x7fec7d873ee0 'forward')
|   |   `-DeclRefExpr 0x7fec7e437718 <col:38> 'class std::__1::allocator<int>' lvalue ParmVar 0x7fec7e437458 '__u' 'class std::__1::allocator<int> &&'
|   `-CompoundStmt 0x7fec7e887bc0 <col:43, col:44>
|-FunctionTemplateDecl 0x7fec7e40e8e8 <line:2052:3, line:2056:75> line:2054:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fec7e40e398 <line:2052:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7fec7e40e408 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7fec7e40e840 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2056:75> line:2054:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7fec7e40e480 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fec7e40e5e8 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7fec7e40e738 <line:2055:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7fec7e40e978 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e40eac8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2062:3, col:50> col:13 used __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>::reference (void) noexcept'
| `-CompoundStmt 0x7fec7e449300 <col:31, col:50>
|   `-ReturnStmt 0x7fec7e4492e8 <col:33, col:40>
|     `-MemberExpr 0x7fec7e4492b0 <col:40> 'class std::__1::allocator<int>' lvalue ->__value_ 0x7fec7e40ecf8
|       `-CXXThisExpr 0x7fec7e449298 <col:40> 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> *' this
|-CXXMethodDecl 0x7fec7e40ec18 <line:2063:3, col:62> col:19 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>::const_reference (void) const noexcept'
|-AccessSpecDecl 0x7fec7e40ecc0 <line:2065:1, col:8> col:1 private
|-FieldDecl 0x7fec7e40ecf8 <line:2066:3, col:7> col:7 referenced __value_ 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
|-CXXMethodDecl 0x7fec7e4128a8 <line:2037:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &(const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &)' inline default_delete trivial noexcept-unevaluated 0x7fec7e4128a8
| `-ParmVarDecl 0x7fec7e4129c0 <col:8> col:8 'const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &'
|-CXXMethodDecl 0x7fec7e412a58 <col:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &(struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&)' inline default_delete trivial noexcept-unevaluated 0x7fec7e412a58
| `-ParmVarDecl 0x7fec7e412b70 <col:8> col:8 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&'
|-CXXDestructorDecl 0x7fec7e41a358 <col:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fec7e421a88 <col:8> col:8 implicit constexpr __compressed_pair_elem 'void (const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &)' inline default trivial noexcept-unevaluated 0x7fec7e421a88
| `-ParmVarDecl 0x7fec7e421bb0 <col:8> col:8 'const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &'
`-CXXConstructorDecl 0x7fec7e421c18 <col:8> col:8 implicit constexpr __compressed_pair_elem 'void (struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&)' inline default trivial noexcept-unevaluated 0x7fec7e421c18
  `-ParmVarDecl 0x7fec7e421d40 <col:8> col:8 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem.2" = type { %"class.std::__1::allocator"* }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem.2" = type { %"class.std::__1::allocator"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fec7e40c710 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2104:1, line:2201:1> line:2105:7 class __compressed_pair definition
|-private '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|-private '__compressed_pair_elem<class std::__1::allocator<int> &, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
|-TemplateArgument type 'int *'
|-TemplateArgument type 'class std::__1::allocator<int> &'
|-CXXRecordDecl 0x7fec7e40eda8 prev 0x7fec7e40c710 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7fec7e40f148 <line:2107:3, col:42> col:42 _Base1 '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
| `-TemplateSpecializationType 0x7fec7e40f0a0 '__compressed_pair_elem<int *, 0>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'int *':'int *'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fec7e88c200 <col:39> 'int' 0
|   `-RecordType 0x7fec7d768720 'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|     `-ClassTemplateSpecialization 0x7fec7d768600 '__compressed_pair_elem'
|-TypedefDecl 0x7fec7e40f4a8 <line:2108:3, col:42> col:42 _Base2 '__compressed_pair_elem<class std::__1::allocator<int> &, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
| `-TemplateSpecializationType 0x7fec7e40f400 '__compressed_pair_elem<class std::__1::allocator<int> &, 1>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fec7e88c5a8 <col:39> 'int' 1
|   `-RecordType 0x7fec7e40d740 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
|     `-ClassTemplateSpecialization 0x7fec7e40d620 '__compressed_pair_elem'
|-StaticAssertDecl 0x7fec7e40f928 <line:2114:3, line:2117:44> line:2114:3
| |-ParenExpr 0x7fec7e40f908 <col:17, col:43> '_Bool'
| | `-UnaryOperator 0x7fec7e40f8e8 <col:18, col:38> '_Bool' prefix '!'
| |   `-ImplicitCastExpr 0x7fec7e40f8d0 <col:19, col:38> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7fec7e40f898 <col:19, col:38> 'const _Bool':'const _Bool' lvalue Var 0x7fec7d407078 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fec7e88cad8 <line:2115:5, line:2117:5> 'const char [179]' lvalue "__compressed_pair cannot be instantated when T1 and T2 are the same type; The current implementation is NOT ABI-compatible with the previous implementation for this configuration"
|-AccessSpecDecl 0x7fec7e40f960 <line:2119:1, col:7> col:1 public
|-FunctionTemplateDecl 0x7fec7e410228 <line:2121:3, line:2128:34> col:13 __compressed_pair
| |-NonTypeTemplateParmDecl 0x7fec7e40f988 <line:2121:13, col:27> col:18 referenced '_Bool' depth 0 index 0 _Dummy
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fec7e88cc20 <col:27> '_Bool' true
| |-TemplateTypeParmDecl 0x7fec7e40f9e0 <line:2122:7, line:2125:10> line:2122:7 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<__dependent_type<is_default_constructible<int *>, _Dummy>::value && __dependent_type<is_default_constructible<class allocator<int> &>, _Dummy>::value>::type'
| `-CXXConstructorDecl 0x7fec7e410180 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2128:34> col:13 constexpr __compressed_pair 'void (void)'
|   `-AlwaysInlineAttr 0x7fec7e4102a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fec7e410ac8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2130:3, line:2135:51> line:2134:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fec7e410378 <line:2130:13, col:19> col:19 class depth 0 index 0 _Tp
| |-NonTypeTemplateParmDecl 0x7fec7e410880 <col:24, line:2132:57> col:55 'typename enable_if<!is_same<typename decay<_Tp>::type, class __compressed_pair<int *, class allocator<int> &> >::value, _Bool>::type' depth 0 index 1
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fec7e88db40 <col:57> '_Bool' true
| `-CXXConstructorDecl 0x7fec7e410a20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2135:51> line:2134:3 constexpr __compressed_pair 'void (_Tp &&)'
|   |-ParmVarDecl 0x7fec7e410938 <col:21, col:27> col:27 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fec7e410b20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fec7e410ea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2137:3, line:2140:51> line:2139:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fec7e410bf0 <line:2137:13, col:19> col:19 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7fec7e410e00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2140:51> line:2139:3 constexpr __compressed_pair 'void (struct std::__1::__second_tag, _Tp &&)'
|   |-ParmVarDecl 0x7fec7e410c70 <col:21> col:33 'struct std::__1::__second_tag'
|   |-ParmVarDecl 0x7fec7e410d08 <col:35, col:41> col:41 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fec7e410f08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fec7e411358 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2142:3, line:2145:75> line:2144:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fec7e410fd8 <line:2142:13, col:19> col:19 class depth 0 index 0 _U1
| |-TemplateTypeParmDecl 0x7fec7e411048 <col:24, col:30> col:30 class depth 0 index 1 _U2
| |-CXXConstructorDecl 0x7fec7e4112b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 constexpr __compressed_pair 'void (_U1 &&, _U2 &&)'
| | |-ParmVarDecl 0x7fec7e411118 <col:21, col:27> col:27 __t1 '_U1 &&'
| | |-ParmVarDecl 0x7fec7e4111b8 <col:33, col:39> col:39 __t2 '_U2 &&'
| | `-AlwaysInlineAttr 0x7fec7e4113b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-CXXConstructorDecl 0x7fec7e42f760 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 used constexpr __compressed_pair 'void (nullptr_t &&, class std::__1::allocator<int> &&)'
|   |-TemplateArgument type 'nullptr_t'
|   |-TemplateArgument type 'class std::__1::allocator<int> &'
|   |-ParmVarDecl 0x7fec7e42f578 <col:21, col:27> col:27 used __t1 'nullptr_t &&'
|   |-ParmVarDecl 0x7fec7e42f648 <col:33, col:39> col:39 used __t2 'class std::__1::allocator<int> &&'
|   |-CXXCtorInitializer 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|   | `-CXXConstructExpr 0x7fec7e4302e0 <line:2145:9, col:39> '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>' 'void (nullptr_t &&)'
|   |   `-CallExpr 0x7fec7e42fee8 <col:16, col:38> 'nullptr_t':'nullptr_t' xvalue
|   |     |-ImplicitCastExpr 0x7fec7e42fed0 <col:16, col:32> 'nullptr_t &&(*)(typename remove_reference<nullptr_t>::type &) noexcept' <FunctionToPointerDecay>
|   |     | `-DeclRefExpr 0x7fec7e42fe50 <col:16, col:32> 'nullptr_t &&(typename remove_reference<nullptr_t>::type &) noexcept' lvalue Function 0x7fec7e3f8568 'forward' 'nullptr_t &&(typename remove_reference<nullptr_t>::type &) noexcept' (FunctionTemplate 0x7fec7d873ee0 'forward')
|   |     `-DeclRefExpr 0x7fec7e42fa48 <col:34> 'nullptr_t':'nullptr_t' lvalue ParmVar 0x7fec7e42f578 '__t1' 'nullptr_t &&'
|   |-CXXCtorInitializer 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
|   | `-CXXConstructExpr 0x7fec7e437c48 <col:42, col:72> '__compressed_pair_elem<class std::__1::allocator<int> &, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>' 'void (class std::__1::allocator<int> &&)'
|   |   `-CallExpr 0x7fec7e430df0 <col:49, col:71> 'class std::__1::allocator<int>' lvalue
|   |     |-ImplicitCastExpr 0x7fec7e430dd8 <col:49, col:65> 'class std::__1::allocator<int> &&(*)(typename remove_reference<class allocator<int> &>::type &) noexcept' <FunctionToPointerDecay>
|   |     | `-DeclRefExpr 0x7fec7e430c60 <col:49, col:65> 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' lvalue Function 0x7fec7e4308e8 'forward' 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' (FunctionTemplate 0x7fec7d873ee0 'forward')
|   |     `-DeclRefExpr 0x7fec7e430418 <col:67> 'class std::__1::allocator<int>' lvalue ParmVar 0x7fec7e42f648 '__t2' 'class std::__1::allocator<int> &&'
|   |-CompoundStmt 0x7fec7e8907f8 <col:74, col:75>
|   `-AlwaysInlineAttr 0x7fec7e42f888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fec7e411a18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2147:3, line:2154:75> line:2149:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fec7e411488 <line:2147:13, col:22> col:22 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7fec7e4114f8 <col:30, col:39> col:39 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7fec7e411970 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2154:75> line:2149:3 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7fec7e411588 <col:21, col:43> col:43 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fec7e4116f8 <col:49, col:66> col:66 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7fec7e411868 <line:2150:21, col:38> col:38 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7fec7e411a80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e411c48 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2175:3> line:2173:30 used first 'typename _Base1::reference (void) noexcept'
| |-CompoundStmt 0x7fec7e449ae8 <col:48, line:2175:3>
| | `-ReturnStmt 0x7fec7e449ad0 <line:2174:5, col:46>
| |   `-CXXMemberCallExpr 0x7fec7e449aa8 <col:12, col:46> 'int *':'int *' lvalue
| |     `-MemberExpr 0x7fec7e449a70 <col:12, col:40> '<bound member function type>' .__get 0x7fec7d769b68
| |       `-CXXStaticCastExpr 0x7fec7e4499d0 <col:12, col:38> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue static_cast<std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1 &> <NoOp>
| |         `-ImplicitCastExpr 0x7fec7e4499b0 <col:33, col:34> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue <DerivedToBase (__compressed_pair_elem)>
| |           `-UnaryOperator 0x7fec7e449990 <col:33, col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue prefix '*'
| |             `-CXXThisExpr 0x7fec7e449978 <col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fec7e411cf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e411df8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2180:3> line:2178:36 used first 'typename _Base1::const_reference (void) const noexcept'
| |-CompoundStmt 0x7fec7e44b2d8 <col:60, line:2180:3>
| | `-ReturnStmt 0x7fec7e44b2c0 <line:2179:5, col:52>
| |   `-CXXMemberCallExpr 0x7fec7e44b298 <col:12, col:52> 'int *const':'int *const' lvalue
| |     `-MemberExpr 0x7fec7e44b260 <col:12, col:46> '<bound member function type>' .__get 0x7fec7d769cb8
| |       `-CXXStaticCastExpr 0x7fec7e44b1c0 <col:12, col:44> 'const std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'const struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue static_cast<const std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1 &> <NoOp>
| |         `-ImplicitCastExpr 0x7fec7e44b1a0 <col:39, col:40> 'const std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'const struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue <DerivedToBase (__compressed_pair_elem)>
| |           `-UnaryOperator 0x7fec7e44b180 <col:39, col:40> 'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue prefix '*'
| |             `-CXXThisExpr 0x7fec7e44b168 <col:40> 'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fec7e411ea0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e411fe8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2185:3> line:2183:30 used second 'typename _Base2::reference (void) noexcept'
| |-CompoundStmt 0x7fec7e449278 <col:49, line:2185:3>
| | `-ReturnStmt 0x7fec7e449260 <line:2184:5, col:46>
| |   `-CXXMemberCallExpr 0x7fec7e449238 <col:12, col:46> 'class std::__1::allocator<int>' lvalue
| |     `-MemberExpr 0x7fec7e449200 <col:12, col:40> '<bound member function type>' .__get 0x7fec7e40eac8
| |       `-CXXStaticCastExpr 0x7fec7e438f30 <col:12, col:38> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>' lvalue static_cast<std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2 &> <NoOp>
| |         `-ImplicitCastExpr 0x7fec7e438f10 <col:33, col:34> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>' lvalue <DerivedToBase (__compressed_pair_elem)>
| |           `-UnaryOperator 0x7fec7e438ef0 <col:33, col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue prefix '*'
| |             `-CXXThisExpr 0x7fec7e438ed8 <col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fec7e412090 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e412198 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2190:3> line:2188:36 second 'typename _Base2::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7e412240 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e4123e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2200:3> line:2193:8 swap 'void (class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &)' noexcept-uninstantiated 0x7fec7e88fc48
| |-ParmVarDecl 0x7fec7e4122c8 <col:13, col:32> col:32 __x 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &'
| `-AlwaysInlineAttr 0x7fec7e4124d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e412bd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2105:7, <invalid sloc>> col:7 implicit constexpr operator= 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &(class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&)' inline default_delete trivial noexcept-unevaluated 0x7fec7e412bd8
| `-ParmVarDecl 0x7fec7e412cf0 <col:7> col:7 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&'
|-CXXDestructorDecl 0x7fec7e41a278 <col:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fec7e429080 <col:7> col:7 implicit constexpr __compressed_pair 'void (const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &)' inline default trivial noexcept-unevaluated 0x7fec7e429080
| `-ParmVarDecl 0x7fec7e4291b0 <col:7> col:7 'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &'
`-CXXConstructorDecl 0x7fec7e42f308 <col:7> col:7 implicit constexpr __compressed_pair 'void (class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&)' inline default trivial noexcept-unevaluated 0x7fec7e42f308
  `-ParmVarDecl 0x7fec7e42f430 <col:7> col:7 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair.1" = type { %"struct.std::__1::__compressed_pair_elem", %"struct.std::__1::__compressed_pair_elem.2" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair.1" = type { %"struct.std::__1::__compressed_pair_elem", %"struct.std::__1::__compressed_pair_elem.2" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fec7d781fb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:27:1, line:164:1> line:28:8 struct __split_buffer definition
|-private '__split_buffer_common<true>':'class std::__1::__split_buffer_common<true>'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int> &'
|-CXXRecordDecl 0x7fec7e40b458 prev 0x7fec7d781fb8 <col:1, col:8> col:8 implicit struct __split_buffer
|-AccessSpecDecl 0x7fec7e40b4f0 <line:31:1, col:8> col:1 private
|-CXXConstructorDecl 0x7fec7e40b660 <line:32:5, col:41> col:5 __split_buffer 'void (const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &)'
| `-ParmVarDecl 0x7fec7e40b558 <col:20, col:40> col:41 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &'
|-CXXMethodDecl 0x7fec7e40b7f0 <line:33:5, col:52> col:21 operator= 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &(const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &)'
| `-ParmVarDecl 0x7fec7e40b730 <col:31, col:51> col:52 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &'
|-AccessSpecDecl 0x7fec7e40b8a0 <line:34:1, col:7> col:1 public
|-TypedefDecl 0x7fec7e40b908 <line:35:5, col:61> col:61 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7fec7e40b8d0 'int' sugar
|   |-TemplateTypeParmType 0x7fec7dae9d40 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fec7dae9cf8 '_Tp'
|   `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7e40b998 <line:36:5, col:61> col:61 allocator_type 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
| `-SubstTemplateTypeParmType 0x7fec7e40b960 'class std::__1::allocator<int> &' sugar
|   |-TemplateTypeParmType 0x7fec7dae9e70 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fec7dae9e28 '_Allocator'
|   `-LValueReferenceType 0x7fec7d75fb50 'class std::__1::allocator<int> &'
|     `-RecordType 0x7fec7d7522f0 'class std::__1::allocator<int>'
|       `-ClassTemplateSpecialization 0x7fec7d752200 'allocator'
|-TypedefDecl 0x7fec7e40beb0 <line:37:5, col:61> col:61 __alloc_rr 'typename remove_reference<allocator_type>::type':'class std::__1::allocator<int>'
| `-ElaboratedType 0x7fec7e40be60 'typename remove_reference<allocator_type>::type' sugar
|   `-TypedefType 0x7fec7e40be40 'std::__1::remove_reference<class std::__1::allocator<int> &>::type' sugar
|     |-Typedef 0x7fec7e40bdc8 'type'
|     `-SubstTemplateTypeParmType 0x7fec7e40bc10 'class std::__1::allocator<int>' sugar
|       |-TemplateTypeParmType 0x7fec7d11ee20 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fec7d11edd8 '_Tp'
|       `-RecordType 0x7fec7d7522f0 'class std::__1::allocator<int>'
|         `-ClassTemplateSpecialization 0x7fec7d752200 'allocator'
|-TypedefDecl 0x7fec7e40bfb8 <line:38:5, col:61> col:61 __alloc_traits 'allocator_traits<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr>':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x7fec7e40bf40 'allocator_traits<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>'
|   `-RecordType 0x7fec7d752c90 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x7fec7d752ba0 'allocator_traits'
|-TypedefDecl 0x7fec7e40c068 <line:39:5, col:61> col:61 reference 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
| `-LValueReferenceType 0x7fec7e40c030 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
|   `-TypedefType 0x7fec7e40c010 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type' sugar
|     |-Typedef 0x7fec7e40b908 'value_type'
|     `-SubstTemplateTypeParmType 0x7fec7e40b8d0 'int' sugar
|       |-TemplateTypeParmType 0x7fec7dae9d40 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fec7dae9cf8 '_Tp'
|       `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7e40c0f8 <line:40:5, col:61> col:61 const_reference 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
| `-LValueReferenceType 0x7fec7e40c0c0 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
|   `-QualType 0x7fec7e40c011 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type' const
|     `-TypedefType 0x7fec7e40c010 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type' sugar
|       |-Typedef 0x7fec7e40b908 'value_type'
|       `-SubstTemplateTypeParmType 0x7fec7e40b8d0 'int' sugar
|         |-TemplateTypeParmType 0x7fec7dae9d40 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7fec7dae9cf8 '_Tp'
|         `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7e40c200 <line:41:5, col:61> col:61 size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7fec7e40c1b0 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7fec7d75fc20 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x7fec7d75c5b0 'size_type'
|     `-ElaboratedType 0x7fec7d75c560 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7fec7d75c540 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|         |-Typedef 0x7fec7d75c4c0 'type'
|         `-ElaboratedType 0x7fec7d75c470 'typename class allocator<int>::size_type' sugar
|           `-TypedefType 0x7fec7d75bd50 'std::__1::allocator<int>::size_type' sugar
|             |-Typedef 0x7fec7d7532c8 'size_type'
|             `-TypedefType 0x7fec7d105a10 'size_t' sugar
|               |-Typedef 0x7fec7d0691b0 'size_t'
|               `-BuiltinType 0x7fec7d033c80 'unsigned long'
|-TypedefDecl 0x7fec7e40c2d0 <line:42:5, col:61> col:61 difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7fec7e40c280 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7fec7d75ba70 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x7fec7d75ba00 'difference_type'
|     `-ElaboratedType 0x7fec7d75b9b0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7fec7d75b990 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|         |-Typedef 0x7fec7d75b910 'type'
|         `-ElaboratedType 0x7fec7d75b8c0 'typename class allocator<int>::difference_type' sugar
|           `-TypedefType 0x7fec7d75b170 'std::__1::allocator<int>::difference_type' sugar
|             |-Typedef 0x7fec7d753320 'difference_type'
|             `-TypedefType 0x7fec7e037750 'ptrdiff_t' sugar
|               |-Typedef 0x7fec7d069140 'ptrdiff_t'
|               `-BuiltinType 0x7fec7d033be0 'long'
|-TypedefDecl 0x7fec7e40c3a0 <line:43:5, col:61> col:61 pointer 'typename __alloc_traits::pointer':'int *'
| `-ElaboratedType 0x7fec7e40c350 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7fec7d756840 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x7fec7d7567d0 'pointer'
|     `-ElaboratedType 0x7fec7d756780 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7fec7d756760 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|         |-Typedef 0x7fec7d7566e0 'type'
|         `-ElaboratedType 0x7fec7d756690 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|           `-TypedefType 0x7fec7d756670 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x7fec7d7565f0 'type'
|             `-ElaboratedType 0x7fec7d7565a0 'typename class allocator<int>::pointer' sugar
|               `-TypedefType 0x7fec7d753fa0 'std::__1::allocator<int>::pointer' sugar
|                 |-Typedef 0x7fec7d7533e8 'pointer'
|                 `-PointerType 0x7fec7d7533b0 'int *'
|                   `-SubstTemplateTypeParmType 0x7fec7d753380 'int' sugar
|                     |-TemplateTypeParmType 0x7fec7e874e60 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fec7e874e18 '_Tp'
|                     `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7e40c470 <line:44:5, col:61> col:61 const_pointer 'typename __alloc_traits::const_pointer':'const int *'
| `-ElaboratedType 0x7fec7e40c420 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7fec7d767750 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x7fec7d7575d0 'const_pointer'
|     `-ElaboratedType 0x7fec7d757580 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7fec7d757560 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|         |-Typedef 0x7fec7d7574e0 'type'
|         `-ElaboratedType 0x7fec7d757490 'typename class allocator<int>::const_pointer' sugar
|           `-TypedefType 0x7fec7d7541f0 'std::__1::allocator<int>::const_pointer' sugar
|             |-Typedef 0x7fec7d753478 'const_pointer'
|             `-PointerType 0x7fec7d753440 'const int *'
|               `-QualType 0x7fec7d753381 'const int' const
|                 `-SubstTemplateTypeParmType 0x7fec7d753380 'int' sugar
|                   |-TemplateTypeParmType 0x7fec7e874e60 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7fec7e874e18 '_Tp'
|                   `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7e40c500 <line:45:5, col:61> col:61 iterator 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
| `-TypedefType 0x7fec7e40c4d0 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer' sugar
|   |-Typedef 0x7fec7e40c3a0 'pointer'
|   `-ElaboratedType 0x7fec7e40c350 'typename __alloc_traits::pointer' sugar
|     `-TypedefType 0x7fec7d756840 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|       |-Typedef 0x7fec7d7567d0 'pointer'
|       `-ElaboratedType 0x7fec7d756780 'typename __pointer_type<value_type, allocator_type>::type' sugar
|         `-TypedefType 0x7fec7d756760 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|           |-Typedef 0x7fec7d7566e0 'type'
|           `-ElaboratedType 0x7fec7d756690 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|             `-TypedefType 0x7fec7d756670 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|               |-Typedef 0x7fec7d7565f0 'type'
|               `-ElaboratedType 0x7fec7d7565a0 'typename class allocator<int>::pointer' sugar
|                 `-TypedefType 0x7fec7d753fa0 'std::__1::allocator<int>::pointer' sugar
|                   |-Typedef 0x7fec7d7533e8 'pointer'
|                   `-PointerType 0x7fec7d7533b0 'int *'
|                     `-SubstTemplateTypeParmType 0x7fec7d753380 'int' sugar
|                       |-TemplateTypeParmType 0x7fec7e874e60 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7fec7e874e18 '_Tp'
|                       `-BuiltinType 0x7fec7d033bc0 'int'
|-TypedefDecl 0x7fec7e40c590 <line:46:5, col:61> col:61 const_iterator 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_pointer':'const int *'
| `-TypedefType 0x7fec7e40c560 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_pointer' sugar
|   |-Typedef 0x7fec7e40c470 'const_pointer'
|   `-ElaboratedType 0x7fec7e40c420 'typename __alloc_traits::const_pointer' sugar
|     `-TypedefType 0x7fec7d767750 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|       |-Typedef 0x7fec7d7575d0 'const_pointer'
|       `-ElaboratedType 0x7fec7d757580 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|         `-TypedefType 0x7fec7d757560 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|           |-Typedef 0x7fec7d7574e0 'type'
|           `-ElaboratedType 0x7fec7d757490 'typename class allocator<int>::const_pointer' sugar
|             `-TypedefType 0x7fec7d7541f0 'std::__1::allocator<int>::const_pointer' sugar
|               |-Typedef 0x7fec7d753478 'const_pointer'
|               `-PointerType 0x7fec7d753440 'const int *'
|                 `-QualType 0x7fec7d753381 'const int' const
|                   `-SubstTemplateTypeParmType 0x7fec7d753380 'int' sugar
|                     |-TemplateTypeParmType 0x7fec7e874e60 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fec7e874e18 '_Tp'
|                     `-BuiltinType 0x7fec7d033bc0 'int'
|-FieldDecl 0x7fec7e40c5f8 <line:48:5, col:53> col:53 referenced __first_ 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
|-FieldDecl 0x7fec7e40c650 <line:49:5, col:53> col:53 referenced __begin_ 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
|-FieldDecl 0x7fec7e40c6a8 <line:50:5, col:53> col:53 referenced __end_ 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
|-FieldDecl 0x7fec7e412d78 <line:51:5, col:48> col:48 referenced __end_cap_ '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>'
|-TypedefDecl 0x7fec7e414500 <line:53:5, col:65> col:65 __alloc_ref 'typename add_lvalue_reference<allocator_type>::type':'class std::__1::allocator<int> &&'
| `-ElaboratedType 0x7fec7e4144b0 'typename add_lvalue_reference<allocator_type>::type' sugar
|   `-TypedefType 0x7fec7e414490 'std::__1::add_lvalue_reference<class std::__1::allocator<int> &>::type' sugar
|     |-Typedef 0x7fec7e414410 'type'
|     `-ElaboratedType 0x7fec7e4143c0 'typename __add_lvalue_reference_impl<class allocator<int> &>::type' sugar
|       `-TypedefType 0x7fec7e4143a0 'std::__1::__add_lvalue_reference_impl<class std::__1::allocator<int> &, true>::type' sugar
|         |-Typedef 0x7fec7e414328 'type'
|         `-LValueReferenceType 0x7fec7e4142f0 'class std::__1::allocator<int> &&'
|           `-RecordType 0x7fec7d7522f0 'class std::__1::allocator<int>'
|             `-ClassTemplateSpecialization 0x7fec7d752200 'allocator'
|-TypedefDecl 0x7fec7e414660 <line:54:5, col:65> col:65 __alloc_const_ref 'typename add_lvalue_reference<allocator_type>::type':'class std::__1::allocator<int> &&'
| `-ElaboratedType 0x7fec7e414610 'typename add_lvalue_reference<allocator_type>::type' sugar
|   `-TypedefType 0x7fec7e414490 'std::__1::add_lvalue_reference<class std::__1::allocator<int> &>::type' sugar
|     |-Typedef 0x7fec7e414410 'type'
|     `-ElaboratedType 0x7fec7e4143c0 'typename __add_lvalue_reference_impl<class allocator<int> &>::type' sugar
|       `-TypedefType 0x7fec7e4143a0 'std::__1::__add_lvalue_reference_impl<class std::__1::allocator<int> &, true>::type' sugar
|         |-Typedef 0x7fec7e414328 'type'
|         `-LValueReferenceType 0x7fec7e4142f0 'class std::__1::allocator<int> &&'
|           `-RecordType 0x7fec7d7522f0 'class std::__1::allocator<int>'
|             `-ClassTemplateSpecialization 0x7fec7d752200 'allocator'
|-CXXMethodDecl 0x7fec7e414748 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:56:109> col:53 used __alloc 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &(void) noexcept'
| |-CompoundStmt 0x7fec7e438e80 <col:81, col:109>
| | `-ReturnStmt 0x7fec7e438e68 <col:82, col:107>
| |   `-CXXMemberCallExpr 0x7fec7e438e40 <col:89, col:107> 'class std::__1::allocator<int>' lvalue
| |     `-MemberExpr 0x7fec7e438e08 <col:89, col:100> '<bound member function type>' .second 0x7fec7e411fe8
| |       `-MemberExpr 0x7fec7e438d60 <col:89> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue ->__end_cap_ 0x7fec7e412d78
| |         `-CXXThisExpr 0x7fec7e438d48 <col:89> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fec7e414818 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e4148e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:57:109> col:53 __alloc 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &(void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7e414990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e414a68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:58:108> col:53 used __end_cap 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer &(void) noexcept'
| |-CompoundStmt 0x7fec7e449920 <col:81, col:108>
| | `-ReturnStmt 0x7fec7e449908 <col:82, col:106>
| |   `-CXXMemberCallExpr 0x7fec7e4498e0 <col:89, col:106> 'int *':'int *' lvalue
| |     `-MemberExpr 0x7fec7e4498a8 <col:89, col:100> '<bound member function type>' .first 0x7fec7e411c48
| |       `-MemberExpr 0x7fec7e449800 <col:89> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue ->__end_cap_ 0x7fec7e412d78
| |         `-CXXThisExpr 0x7fec7e4497e8 <col:89> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fec7e414b10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e414be8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:59:108> col:53 used __end_cap 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer &(void) const noexcept'
| |-CompoundStmt 0x7fec7e44b110 <col:81, col:108>
| | `-ReturnStmt 0x7fec7e44b0f8 <col:82, col:106>
| |   `-CXXMemberCallExpr 0x7fec7e44b0a8 <col:89, col:106> 'int *const':'int *const' lvalue
| |     `-MemberExpr 0x7fec7e44b070 <col:89, col:100> '<bound member function type>' .first 0x7fec7e411df8
| |       `-MemberExpr 0x7fec7e44afc8 <col:89> 'const __compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue ->__end_cap_ 0x7fec7e412d78
| |         `-CXXThisExpr 0x7fec7e44afb0 <col:89> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fec7e414c90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fec7e414d20 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:62:5 __split_buffer 'void (void)' noexcept-uninstantiated 0x7fec7daf00b0
| `-AlwaysInlineAttr 0x7fec7e414e20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fec7e414fa0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:65:44> col:14 __split_buffer 'void (std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7fec7e414e78 <col:29, col:41> col:41 __a 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| `-AlwaysInlineAttr 0x7fec7e415060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fec7e4151a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:67:50> col:14 __split_buffer 'void (const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7fec7e4150b8 <col:29, col:47> col:47 __a 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| `-AlwaysInlineAttr 0x7fec7e415260 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fec7e415510 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:308:1, line:314:1> line:68:5 used __split_buffer 'void (std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7fec7e4152e0 <col:20, col:30> col:30 used __cap 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
| |-ParmVarDecl 0x7fec7e415350 <col:37, col:47> col:47 used __start 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
| |-ParmVarDecl 0x7fec7e4153c0 <col:56, col:68> col:68 used __a 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| |-CXXCtorInitializer '__split_buffer_common<true>':'class std::__1::__split_buffer_common<true>'
| | `-CXXConstructExpr 0x7fec7e4381d0 <col:5> '__split_buffer_common<true>':'class std::__1::__split_buffer_common<true>' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7fec7e412d78 '__end_cap_' '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>'
| | `-ExprWithCleanups 0x7fec7e437cf8 <line:309:7, col:30> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>'
| |   `-CXXConstructExpr 0x7fec7e437cb8 <col:7, col:30> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' 'void (nullptr_t &&, class std::__1::allocator<int> &&)'
| |     |-MaterializeTemporaryExpr 0x7fec7e42f8d0 <col:18> 'nullptr_t':'nullptr_t' xvalue
| |     | `-CXXNullPtrLiteralExpr 0x7fec7db01648 <col:18> 'nullptr_t'
| |     `-DeclRefExpr 0x7fec7e4219f8 <col:27> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>' lvalue ParmVar 0x7fec7e4153c0 '__a' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| `-CompoundStmt 0x7fec7e438d18 <line:310:1, line:314:1>
|   |-BinaryOperator 0x7fec7e438788 <line:311:5, col:74> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|   | |-MemberExpr 0x7fec7e438280 <col:5> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7fec7e40c5f8
|   | | `-CXXThisExpr 0x7fec7e438268 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   | `-ConditionalOperator 0x7fec7e438758 <col:16, col:74> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer':'int *'
|   |   |-BinaryOperator 0x7fec7e438438 <col:16, col:25> '_Bool' '!='
|   |   | |-ImplicitCastExpr 0x7fec7e438408 <col:16> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|   |   | | `-DeclRefExpr 0x7fec7e4383e0 <col:16> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7fec7e4152e0 '__cap' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|   |   | `-ImplicitCastExpr 0x7fec7e438420 <col:25> 'unsigned long' <IntegralCast>
|   |   |   `-IntegerLiteral 0x7fec7db01768 <col:25> 'int' 0
|   |   |-CallExpr 0x7fec7e4386f0 <col:29, col:70> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer':'int *'
|   |   | |-ImplicitCastExpr 0x7fec7e4386d8 <col:29, col:45> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer (*)(std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type)' <FunctionToPointerDecay>
|   |   | | `-DeclRefExpr 0x7fec7e438640 <col:29, col:45> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type)' lvalue CXXMethod 0x7fec7d75fd60 'allocate' 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type)'
|   |   | |-CXXMemberCallExpr 0x7fec7e4385f0 <col:54, col:62> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>' lvalue
|   |   | | `-MemberExpr 0x7fec7e4385b8 <col:54> '<bound member function type>' ->__alloc 0x7fec7e414748
|   |   | |   `-CXXThisExpr 0x7fec7e4385a0 <col:54> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   |   | `-ImplicitCastExpr 0x7fec7e438728 <col:65> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|   |   |   `-DeclRefExpr 0x7fec7e438618 <col:65> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7fec7e4152e0 '__cap' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|   |   `-ImplicitCastExpr 0x7fec7e438740 <col:74> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer':'int *' <NullToPointer>
|   |     `-CXXNullPtrLiteralExpr 0x7fec7db01a98 <col:74> 'nullptr_t'
|   |-BinaryOperator 0x7fec7e438a28 <line:312:5, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|   | |-MemberExpr 0x7fec7e4387c8 <col:5> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__begin_ 0x7fec7e40c650
|   | | `-CXXThisExpr 0x7fec7e4387b0 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   | `-ImplicitCastExpr 0x7fec7e438a10 <col:16, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|   |   `-BinaryOperator 0x7fec7e4389e8 <col:16, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|   |     |-MemberExpr 0x7fec7e438818 <col:16> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__end_ 0x7fec7e40c6a8
|   |     | `-CXXThisExpr 0x7fec7e438800 <col:16> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   |     `-BinaryOperator 0x7fec7e4389c0 <col:25, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' '+'
|   |       |-ImplicitCastExpr 0x7fec7e438990 <col:25> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|   |       | `-MemberExpr 0x7fec7e438930 <col:25> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7fec7e40c5f8
|   |       |   `-CXXThisExpr 0x7fec7e438918 <col:25> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   |       `-ImplicitCastExpr 0x7fec7e4389a8 <col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|   |         `-DeclRefExpr 0x7fec7e438968 <col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7fec7e415350 '__start' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|   `-BinaryOperator 0x7fec7e438cf0 <line:313:5, col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|     |-CXXMemberCallExpr 0x7fec7e438b30 <col:5, col:15> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue
|     | `-MemberExpr 0x7fec7e438af8 <col:5> '<bound member function type>' ->__end_cap 0x7fec7e414a68
|     |   `-CXXThisExpr 0x7fec7e438ae0 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     `-BinaryOperator 0x7fec7e438cc8 <col:19, col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' '+'
|       |-ImplicitCastExpr 0x7fec7e438c98 <col:19> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|       | `-MemberExpr 0x7fec7e438c38 <col:19> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7fec7e40c5f8
|       |   `-CXXThisExpr 0x7fec7e438c20 <col:19> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|       `-ImplicitCastExpr 0x7fec7e438cb0 <col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|         `-DeclRefExpr 0x7fec7e438c70 <col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7fec7e4152e0 '__cap' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|-CXXDestructorDecl 0x7fec7e415610 <line:339:1, line:344:1> line:69:5 used ~__split_buffer 'void (void) noexcept'
| `-CompoundStmt 0x7fec7e44a0b8 <line:340:1, line:344:1>
|   |-CXXMemberCallExpr 0x7fec7e449cd8 <line:341:5, col:11> 'void'
|   | `-MemberExpr 0x7fec7e449ca0 <col:5> '<bound member function type>' ->clear 0x7fec7e4162e8
|   |   `-CXXThisExpr 0x7fec7e449c88 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   `-IfStmt 0x7fec7e44a080 <line:342:5, line:343:67>
|     |-<<<NULL>>>
|     |-<<<NULL>>>
|     |-ImplicitCastExpr 0x7fec7e449d68 <line:342:9> '_Bool' <PointerToBoolean>
|     | `-ImplicitCastExpr 0x7fec7e449d50 <col:9> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|     |   `-MemberExpr 0x7fec7e449d18 <col:9> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7fec7e40c5f8
|     |     `-CXXThisExpr 0x7fec7e449d00 <col:9> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     |-CallExpr 0x7fec7e44a028 <line:343:9, col:67> 'void'
|     | |-ImplicitCastExpr 0x7fec7e44a010 <col:9, col:25> 'void (*)(std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::pointer, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type) noexcept' <FunctionToPointerDecay>
|     | | `-DeclRefExpr 0x7fec7e449dc0 <col:9, col:25> 'void (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::pointer, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type) noexcept' lvalue CXXMethod 0x7fec7d7603d8 'deallocate' 'void (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::pointer, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type) noexcept'
|     | |-CXXMemberCallExpr 0x7fec7e449ed8 <col:36, col:44> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>' lvalue
|     | | `-MemberExpr 0x7fec7e449ea0 <col:36> '<bound member function type>' ->__alloc 0x7fec7e414748
|     | |   `-CXXThisExpr 0x7fec7e449e88 <col:36> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     | |-ImplicitCastExpr 0x7fec7e44a068 <col:47> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|     | | `-MemberExpr 0x7fec7e449f18 <col:47> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7fec7e40c5f8
|     | |   `-CXXThisExpr 0x7fec7e449f00 <col:47> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     | `-CXXMemberCallExpr 0x7fec7e449fa0 <col:57, col:66> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|     |   `-MemberExpr 0x7fec7e449f68 <col:57> '<bound member function type>' ->capacity 0x7fec7e416630
|     |     `-ImplicitCastExpr 0x7fec7e449ff8 <col:57> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' <NoOp>
|     |       `-CXXThisExpr 0x7fec7e449f50 <col:57> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     `-<<<NULL>>>
|-CXXConstructorDecl 0x7fec7e415830 <line:72:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:72:5 __split_buffer 'void (struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&)' noexcept-uninstantiated 0x7fec7daf0b88
| `-ParmVarDecl 0x7fec7e4156f8 <col:20, col:37> col:37 __c 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&'
|-CXXConstructorDecl 0x7fec7e415af0 <line:74:5, col:63> col:5 __split_buffer 'void (struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&, const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7fec7e415948 <col:20, col:37> col:37 __c 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&'
| `-ParmVarDecl 0x7fec7e4159b8 <col:42, col:60> col:60 __a 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
|-CXXMethodDecl 0x7fec7e415ce0 <line:75:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:75:21 operator= 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &(struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&)' noexcept-uninstantiated 0x7fec7daf0fa8
| `-ParmVarDecl 0x7fec7e415bc8 <col:31, col:48> col:48 __c 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&'
|-CXXMethodDecl 0x7fec7e415e58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:81:87> col:46 begin 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fec7e415f00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e415fc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:82:87> col:46 begin 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7e416070 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e4160e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:83:85> col:46 end 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fec7e416188 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e4161f8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:84:85> col:46 end 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fec7e4162a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e4162e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:88:38> line:87:10 used clear 'void (void) noexcept'
| |-CompoundStmt 0x7fec7e44a260 <line:88:9, col:38>
| | `-CXXMemberCallExpr 0x7fec7e44a218 <col:10, col:36> 'void'
| |   |-MemberExpr 0x7fec7e44a1e0 <col:10> '<bound member function type>' ->__destruct_at_end 0x7fec7e419358
| |   | `-CXXThisExpr 0x7fec7e44a1c8 <col:10> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| |   `-ImplicitCastExpr 0x7fec7e44a248 <col:28> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
| |     `-MemberExpr 0x7fec7e44a190 <col:28> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__begin_ 0x7fec7e40c650
| |       `-CXXThisExpr 0x7fec7e44a178 <col:28> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fec7e416390 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e416430 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:89:104> col:41 size 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| `-AlwaysInlineAttr 0x7fec7e4164d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e416520 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:90:81> col:36 empty '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fec7e4165c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e416630 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:91:113> col:41 used capacity 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| |-CompoundStmt 0x7fec7e44af90 <col:58, col:113>
| | `-ReturnStmt 0x7fec7e44af78 <col:59, col:111>
| |   `-CXXStaticCastExpr 0x7fec7e44af48 <col:66, col:111> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' static_cast<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type> <NoOp>
| |     `-ImplicitCastExpr 0x7fec7e44af30 <col:89, col:103> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <IntegralCast>
| |       `-BinaryOperator 0x7fec7e44af08 <col:89, col:103> 'long' '-'
| |         |-ImplicitCastExpr 0x7fec7e44aed8 <col:89, col:99> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
| |         | `-CXXMemberCallExpr 0x7fec7e44ae60 <col:89, col:99> 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *const' lvalue
| |         |   `-MemberExpr 0x7fec7e44ae28 <col:89> '<bound member function type>' ->__end_cap 0x7fec7e414be8
| |         |     `-CXXThisExpr 0x7fec7e44ae10 <col:89> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| |         `-ImplicitCastExpr 0x7fec7e44aef0 <col:103> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
| |           `-MemberExpr 0x7fec7e44aea0 <col:103> 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *const' lvalue ->__first_ 0x7fec7e40c5f8
| |             `-CXXThisExpr 0x7fec7e44ae88 <col:103> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fec7e4166d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e416740 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:92:115> col:41 __front_spare 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| `-AlwaysInlineAttr 0x7fec7e4167e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e416850 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:93:115> col:41 __back_spare 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| `-AlwaysInlineAttr 0x7fec7e4168f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fec7e4169b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:95:79> col:47 front 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::reference (void)'
| `-AlwaysInlineAttr 0x7fec7e416a58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
