
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__scalar_hash<struct std::__1::_PairT, 2> (empty)
         0 |   struct std::__1::unary_function<struct std::__1::_PairT, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1509:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1512:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<3600, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<60, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1000000000, 1>, false, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_mutex_t
         0 |   long __sig
         8 |   char [56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_cond_t
         0 |   long __sig
         8 |   char [40] __opaque
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >, class std::__1::ratio<1, 1>, true, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::time_point<class std::__1::chrono::system_clock, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > >
         0 |   class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> > __d_
         0 |     std::__1::chrono::duration<long double, class std::__1::ratio<1, 1000000000> >::rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::unary_function<struct _opaque_pthread_t *, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::hash<struct _opaque_pthread_t *> (empty)
         0 |   struct std::__1::unary_function<struct _opaque_pthread_t *, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__thread_struct
         0 |   class std::__1::__thread_struct_imp * __p_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::chrono::__duration_cast<class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1000000000> >, class std::__1::chrono::duration<long double, class std::__1::ratio<1, 1> >, class std::__1::ratio<1, 1000000000>, true, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__less<unsigned long, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__vector_base_common<true> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<int *, 0, false>
         0 |   int * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<int> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (empty)
         0 |   class std::__1::allocator<int> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<int *, class std::__1::allocator<int> >
         0 |   struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
         0 |     int * __value_
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (base) (empty)
         0 |     class std::__1::allocator<int> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__vector_base<int, class std::__1::allocator<int> >
         0 |   class std::__1::__vector_base_common<true> (base) (empty)
         0 |   std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __begin_
         8 |   std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __end_
        16 |   class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > __end_cap_
        16 |     struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
        16 |       int * __value_
        16 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (base) (empty)
        16 |       class std::__1::allocator<int> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::vector<int, class std::__1::allocator<int> >
         0 |   class std::__1::__vector_base<int, class std::__1::allocator<int> > (base)
         0 |     class std::__1::__vector_base_common<true> (base) (empty)
         0 |     std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __begin_
         8 |     std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer __end_
        16 |     class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > __end_cap_
        16 |       struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
        16 |         int * __value_
        16 |       struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true> (base) (empty)
        16 |         class std::__1::allocator<int> (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb401323500 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:876:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:317:89> col:64 class __vector_base_common definition
|-TemplateArgument integral 1
|-VisibilityAttr 0x7fb401323698 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:62, col:86> Default
|-CXXRecordDecl 0x7fb401323748 prev 0x7fb401323500 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:291:1, col:7> col:7 implicit class __vector_base_common
|-AccessSpecDecl 0x7fb4013237e0 <line:293:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7fb401323848 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:294:51> col:27 __vector_base_common 'void (void)'
| `-AlwaysInlineAttr 0x7fb401323928 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:737:74> always_inline
|-CXXMethodDecl 0x7fb401323970 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:295:22, col:50> col:27 __throw_length_error 'void (void) const'
| `-CXX11NoReturnAttr 0x7fb401323a18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
|-CXXMethodDecl 0x7fb401323a60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:296:22, col:50> col:27 __throw_out_of_range 'void (void) const'
| `-CXX11NoReturnAttr 0x7fb401323b08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:341:30> Inherited
`-CXXDestructorDecl 0x7fb404202928 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:317:64> col:64 implicit ~__vector_base_common 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__vector_base_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__vector_base_common.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb4041e4800 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2034:1, line:2067:1> line:2037:8 struct __compressed_pair_elem definition
|-TemplateArgument type 'int *'
|-TemplateArgument integral 0
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7fb4041e4a80 prev 0x7fb4041e4800 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7fb4041e4b28 <line:2038:3, col:15> col:15 _ParamT 'int *':'int *'
| `-SubstTemplateTypeParmType 0x7fb4041e3e80 'int *' sugar
|   |-TemplateTypeParmType 0x7fb400b75b80 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fb400b75b38 '_Tp'
|   `-PointerType 0x7fb4010a01d0 'int *'
|     `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb4041e4be8 <line:2039:3, col:16> col:16 referenced reference 'int *&'
| `-LValueReferenceType 0x7fb4041e4bb0 'int *&'
|   `-SubstTemplateTypeParmType 0x7fb4041e3e80 'int *' sugar
|     |-TemplateTypeParmType 0x7fb400b75b80 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fb400b75b38 '_Tp'
|     `-PointerType 0x7fb4010a01d0 'int *'
|       `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb4041e4ca8 <line:2040:3, col:22> col:22 referenced const_reference 'int *const &'
| `-LValueReferenceType 0x7fb4041e4c70 'int *const &'
|   `-QualType 0x7fb4041e3e81 'int *const' const
|     `-SubstTemplateTypeParmType 0x7fb4041e3e80 'int *' sugar
|       |-TemplateTypeParmType 0x7fb400b75b80 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fb400b75b38 '_Tp'
|       `-PointerType 0x7fb4010a01d0 'int *'
|         `-BuiltinType 0x7fb400833bc0 'int'
|-CXXConstructorDecl 0x7fb4041e4d40 <line:2043:3, col:52> col:13 constexpr __compressed_pair_elem 'void (void)'
|-FunctionTemplateDecl 0x7fb4041e5528 <line:2045:3, line:2050:44> line:2049:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fb4041e4df8 <line:2045:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fb4041e4e68 <col:24, line:2047:6> line:2045:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<int *, 0, false>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7fb4041e5480 <line:2048:3, line:2050:44> line:2049:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7fb4041e5398 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7fb4041e5b58 <line:2052:3, line:2056:75> line:2054:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fb4041e5608 <line:2052:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7fb4041e5678 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7fb4041e5ab0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2056:75> line:2054:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7fb4041e56f0 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fb4041e5858 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7fb4041e59a8 <line:2055:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7fb4041e5be8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041e5d68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2062:3, col:50> col:13 __get 'std::__1::__compressed_pair_elem<int *, 0, false>::reference (void) noexcept'
|-CXXMethodDecl 0x7fb4041e5eb8 <line:2063:3, col:62> col:19 __get 'std::__1::__compressed_pair_elem<int *, 0, false>::const_reference (void) const noexcept'
|-AccessSpecDecl 0x7fb4041e5f60 <line:2065:1, col:8> col:1 private
|-FieldDecl 0x7fb4041e5f98 <line:2066:3, col:7> col:7 __value_ 'int *':'int *'
`-CXXDestructorDecl 0x7fb404202ae8 <line:2037:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem" = type { i32* }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem" = type { i32* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb4041ce400 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:101:1, col:52> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28 class allocator definition
|-TemplateArgument type 'int'
|-CXXRecordDecl 0x7fb4041cf408 prev 0x7fb4041ce400 <col:1, col:28> col:28 implicit class allocator
|-AccessSpecDecl 0x7fb4041cf4a0 <line:1722:1, col:7> col:1 public
|-TypedefDecl 0x7fb4041cf4c8 <line:1723:5, col:31> col:31 referenced size_type 'size_t':'unsigned long'
| `-TypedefType 0x7fb401060810 'size_t' sugar
|   |-Typedef 0x7fb4008691b0 'size_t'
|   `-BuiltinType 0x7fb400833c80 'unsigned long'
|-TypedefDecl 0x7fb4041cf520 <line:1724:5, col:31> col:31 referenced difference_type 'ptrdiff_t':'long'
| `-TypedefType 0x7fb401809950 'ptrdiff_t' sugar
|   |-Typedef 0x7fb400869140 'ptrdiff_t'
|   `-BuiltinType 0x7fb400833be0 'long'
|-TypedefDecl 0x7fb4041cf5e8 <line:1725:5, col:31> col:31 referenced pointer 'int *'
| `-PointerType 0x7fb4041cf5b0 'int *'
|   `-SubstTemplateTypeParmType 0x7fb4041cf580 'int' sugar
|     |-TemplateTypeParmType 0x7fb400b64c60 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fb400b64c18 '_Tp'
|     `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb4041cf678 <line:1726:5, col:31> col:31 referenced const_pointer 'const int *'
| `-PointerType 0x7fb4041cf640 'const int *'
|   `-QualType 0x7fb4041cf581 'const int' const
|     `-SubstTemplateTypeParmType 0x7fb4041cf580 'int' sugar
|       |-TemplateTypeParmType 0x7fb400b64c60 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fb400b64c18 '_Tp'
|       `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb4041cf708 <line:1727:5, col:31> col:31 reference 'int &'
| `-LValueReferenceType 0x7fb4041cf6d0 'int &'
|   `-SubstTemplateTypeParmType 0x7fb4041cf580 'int' sugar
|     |-TemplateTypeParmType 0x7fb400b64c60 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fb400b64c18 '_Tp'
|     `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb4041cf798 <line:1728:5, col:31> col:31 const_reference 'const int &'
| `-LValueReferenceType 0x7fb4041cf760 'const int &'
|   `-QualType 0x7fb4041cf581 'const int' const
|     `-SubstTemplateTypeParmType 0x7fb4041cf580 'int' sugar
|       |-TemplateTypeParmType 0x7fb400b64c60 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fb400b64c18 '_Tp'
|       `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb4041cf800 <line:1729:5, col:31> col:31 referenced value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7fb4041cf580 'int' sugar
|   |-TemplateTypeParmType 0x7fb400b64c60 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fb400b64c18 '_Tp'
|   `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb4041cf858 <line:1731:5, col:23> col:23 referenced propagate_on_container_move_assignment 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fb401043f40 'std::__1::true_type' sugar
|   |-Typedef 0x7fb401041848 'true_type'
|   `-TemplateSpecializationType 0x7fb401041330 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fb401041198 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fb401041180 <line:528:31> '_Bool' true
|     `-RecordType 0x7fb401041310 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fb401041208 'integral_constant'
|-TypedefDecl 0x7fb4041cf8b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1732:5, col:23> col:23 referenced is_always_equal 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7fb401043f40 'std::__1::true_type' sugar
|   |-Typedef 0x7fb401041848 'true_type'
|   `-TemplateSpecializationType 0x7fb401041330 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7fb401041198 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:525:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7fb401041180 <line:528:31> '_Bool' true
|     `-RecordType 0x7fb401041310 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7fb401041208 'integral_constant'
|-ClassTemplateDecl 0x7fb4041cfa28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1734:5, col:33> col:33 rebind
| |-TemplateTypeParmDecl 0x7fb4041cf908 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXRecordDecl 0x7fb4041cf990 <col:26, col:33> col:33 struct rebind
|-CXXConstructorDecl 0x7fb4041cfc78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1736:54> col:31 referenced allocator 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fb4041cfd58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fb4041d0070 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:5, col:96> col:52 allocator
| |-TemplateTypeParmDecl 0x7fb4041cfda0 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXConstructorDecl 0x7fb4041cffc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1737:96> col:52 allocator 'void (const allocator<_Up> &) noexcept'
|   |-ParmVarDecl 0x7fb4041cfee0 <col:62, col:82> col:83 'const allocator<_Up> &'
|   `-AlwaysInlineAttr 0x7fb4041d00c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041d02f8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1739:39> line:1738:39 address 'std::__1::allocator<int>::pointer (std::__1::allocator<int>::reference) const noexcept'
| |-ParmVarDecl 0x7fb4041d01f0 <col:47, col:57> col:57 __x 'std::__1::allocator<int>::reference':'int &'
| `-AlwaysInlineAttr 0x7fb4041d03a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041d0548 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1741:39> line:1740:45 address 'std::__1::allocator<int>::const_pointer (std::__1::allocator<int>::const_reference) const noexcept'
| |-ParmVarDecl 0x7fb4041d0440 <col:53, col:69> col:69 __x 'std::__1::allocator<int>::const_reference':'const int &'
| `-AlwaysInlineAttr 0x7fb4041d05f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041d07b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1748:9> line:1742:39 allocate 'std::__1::allocator<int>::pointer (std::__1::allocator::size_type, allocator<void>::const_pointer)'
| |-ParmVarDecl 0x7fb4041d0640 <col:48, col:58> col:58 __n 'std::__1::allocator::size_type':'unsigned long'
| |-ParmVarDecl 0x7fb4041d06a0 <col:63, col:96> col:94 'allocator<void>::const_pointer':'const void *'
| `-AlwaysInlineAttr 0x7fb4041d0868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041d0a38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1750:49> line:1749:36 deallocate 'void (std::__1::allocator<int>::pointer, std::__1::allocator::size_type) noexcept'
| |-ParmVarDecl 0x7fb4041d08c0 <col:47, col:55> col:55 __p 'std::__1::allocator<int>::pointer':'int *'
| |-ParmVarDecl 0x7fb4041d0920 <col:60> col:69 'std::__1::allocator::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fb4041d0af0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041d0b38 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1752:45> line:1751:41 max_size 'std::__1::allocator::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041d0be0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fb4041d0fc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1754:5, line:1760:9> line:1757:9 construct
| |-TemplateTypeParmDecl 0x7fb4041d0c28 <line:1754:15, col:21> col:21 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fb4041d0c98 <col:26, col:35> col:35 class depth 0 index 1 ... _Args
| `-CXXMethodDecl 0x7fb4041d0f30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1760:9> line:1757:9 construct 'void (_Up *, _Args &&...)'
|   |-ParmVarDecl 0x7fb4041d0d68 <col:19, col:24> col:24 __p '_Up *'
|   |-ParmVarDecl 0x7fb4041d0e58 <col:29, col:40> col:40 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7fb4041d1028 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041d1210 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1814:70> col:36 destroy 'void (std::__1::allocator<int>::pointer)'
| |-ParmVarDecl 0x7fb4041d1108 <col:44, col:52> col:52 __p 'std::__1::allocator<int>::pointer':'int *'
| `-AlwaysInlineAttr 0x7fb4041d12c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fb4041e82b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1720:28> col:28 implicit referenced ~allocator 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fb404201798 <col:28> col:28 implicit constexpr allocator 'void (const class std::__1::allocator<int> &)' inline default trivial noexcept-unevaluated 0x7fb404201798
| `-ParmVarDecl 0x7fb404201880 <col:28> col:28 'const class std::__1::allocator<int> &'
`-CXXConstructorDecl 0x7fb404201918 <col:28> col:28 implicit constexpr allocator 'void (class std::__1::allocator<int> &&)' inline default trivial noexcept-unevaluated 0x7fb404201918
  `-ParmVarDecl 0x7fb404201a40 <col:28> col:28 'class std::__1::allocator<int> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb4041e69e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2069:1, line:2099:1> line:2070:8 struct __compressed_pair_elem definition
|-private 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-TemplateArgument integral 1
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7fb4041e6d78 prev 0x7fb4041e69e0 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7fb4041e6e20 <line:2071:3, col:15> col:15 _ParamT 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7fb4041e6c40 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7fb400b77fb0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fb400b77f70 '_Tp'
|   `-RecordType 0x7fb4041ce4f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fb4041ce400 'allocator'
|-TypedefDecl 0x7fb4041e6eb8 <line:2072:3, col:16> col:16 referenced reference 'class std::__1::allocator<int> &'
| `-LValueReferenceType 0x7fb4041e6e80 'class std::__1::allocator<int> &'
|   `-SubstTemplateTypeParmType 0x7fb4041e6c40 'class std::__1::allocator<int>' sugar
|     |-TemplateTypeParmType 0x7fb400b77fb0 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7fb400b77f70 '_Tp'
|     `-RecordType 0x7fb4041ce4f0 'class std::__1::allocator<int>'
|       `-ClassTemplateSpecialization 0x7fb4041ce400 'allocator'
|-TypedefDecl 0x7fb4041e6f48 <line:2073:3, col:22> col:22 referenced const_reference 'const class std::__1::allocator<int> &'
| `-LValueReferenceType 0x7fb4041e6f10 'const class std::__1::allocator<int> &'
|   `-QualType 0x7fb4041e6c41 'const class std::__1::allocator<int>' const
|     `-SubstTemplateTypeParmType 0x7fb4041e6c40 'class std::__1::allocator<int>' sugar
|       |-TemplateTypeParmType 0x7fb400b77fb0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fb400b77f70 '_Tp'
|       `-RecordType 0x7fb4041ce4f0 'class std::__1::allocator<int>'
|         `-ClassTemplateSpecialization 0x7fb4041ce400 'allocator'
|-TypedefDecl 0x7fb4041e6fb0 <line:2074:3, col:15> col:15 __value_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7fb4041e6c40 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7fb400b77fb0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fb400b77f70 '_Tp'
|   `-RecordType 0x7fb4041ce4f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fb4041ce400 'allocator'
|-CXXConstructorDecl 0x7fb4041e7048 <line:2077:3, col:46> col:13 __compressed_pair_elem 'void (void)' default noexcept-unevaluated 0x7fb4041e7048
|-FunctionTemplateDecl 0x7fb4041e7828 <line:2079:3, line:2084:48> line:2083:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fb4041e7100 <line:2079:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fb4041e7168 <col:24, line:2081:6> line:2079:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<class allocator<int>, 1, true>, typename decay<_Up>::type>::value>::type'
| `-CXXConstructorDecl 0x7fb4041e7780 <line:2082:3, line:2084:48> line:2083:3 constexpr __compressed_pair_elem 'void (_Up &&)'
|   `-ParmVarDecl 0x7fb4041e7698 <col:26, col:32> col:32 __u '_Up &&'
|-FunctionTemplateDecl 0x7fb4041e7e58 <line:2086:3, line:2090:79> line:2088:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fb4041e7908 <line:2086:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7fb4041e7978 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7fb4041e7db0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2090:79> line:2088:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7fb4041e79f0 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fb4041e7b58 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7fb4041e7ca8 <line:2089:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7fb4041e7ee8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041e8068 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2097:3, col:47> col:13 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>::reference (void) noexcept'
|-CXXMethodDecl 0x7fb4041e81b8 <line:2098:3, col:59> col:19 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>::const_reference (void) const noexcept'
`-CXXDestructorDecl 0x7fb404202bc8 <line:2070:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem.0" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem.0" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb4041e3c08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2104:1, line:2201:1> line:2105:7 class __compressed_pair definition
|-private '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|-private '__compressed_pair_elem<class std::__1::allocator<int>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>'
|-TemplateArgument type 'int *'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x7fb4041e83e0 prev 0x7fb4041e3c08 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7fb4041e8788 <line:2107:3, col:42> col:42 _Base1 '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
| `-TemplateSpecializationType 0x7fb4041e86e0 '__compressed_pair_elem<int *, 0>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'int *':'int *'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fb400b7b400 <col:39> 'int' 0
|   `-RecordType 0x7fb4041e4920 'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|     `-ClassTemplateSpecialization 0x7fb4041e4800 '__compressed_pair_elem'
|-TypedefDecl 0x7fb4041e8ae8 <line:2108:3, col:42> col:42 _Base2 '__compressed_pair_elem<class std::__1::allocator<int>, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>'
| `-TemplateSpecializationType 0x7fb4041e8a40 '__compressed_pair_elem<class std::__1::allocator<int>, 1>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fb400b7b7a8 <col:39> 'int' 1
|   `-RecordType 0x7fb4041e6b00 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int>, 1, true>'
|     `-ClassTemplateSpecialization 0x7fb4041e69e0 '__compressed_pair_elem'
|-StaticAssertDecl 0x7fb4041e8f68 <line:2114:3, line:2117:44> line:2114:3
| |-ParenExpr 0x7fb4041e8f48 <col:17, col:43> '_Bool'
| | `-UnaryOperator 0x7fb4041e8f28 <col:18, col:38> '_Bool' prefix '!'
| |   `-ImplicitCastExpr 0x7fb4041e8f10 <col:19, col:38> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7fb4041e8ed8 <col:19, col:38> 'const _Bool':'const _Bool' lvalue Var 0x7fb400c46078 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fb400b7bcd8 <line:2115:5, line:2117:5> 'const char [179]' lvalue "__compressed_pair cannot be instantated when T1 and T2 are the same type; The current implementation is NOT ABI-compatible with the previous implementation for this configuration"
|-AccessSpecDecl 0x7fb4041e8fa0 <line:2119:1, col:7> col:1 public
|-FunctionTemplateDecl 0x7fb4041e99e8 <line:2121:3, line:2128:34> col:13 __compressed_pair
| |-NonTypeTemplateParmDecl 0x7fb4041e8fc8 <line:2121:13, col:27> col:18 referenced '_Bool' depth 0 index 0 _Dummy
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fb400b7be20 <col:27> '_Bool' true
| |-TemplateTypeParmDecl 0x7fb4041e9020 <line:2122:7, line:2125:10> line:2122:7 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<__dependent_type<is_default_constructible<int *>, _Dummy>::value && __dependent_type<is_default_constructible<class allocator<int> >, _Dummy>::value>::type'
| `-CXXConstructorDecl 0x7fb4041e9940 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2128:34> col:13 constexpr __compressed_pair 'void (void)'
|   `-AlwaysInlineAttr 0x7fb4041e9a68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fb4041ea288 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2130:3, line:2135:51> line:2134:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fb4041e9b38 <line:2130:13, col:19> col:19 class depth 0 index 0 _Tp
| |-NonTypeTemplateParmDecl 0x7fb4041ea040 <col:24, line:2132:57> col:55 'typename enable_if<!is_same<typename decay<_Tp>::type, class __compressed_pair<int *, class allocator<int> > >::value, _Bool>::type' depth 0 index 1
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fb400b7cd40 <col:57> '_Bool' true
| `-CXXConstructorDecl 0x7fb4041ea1e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2135:51> line:2134:3 constexpr __compressed_pair 'void (_Tp &&)'
|   |-ParmVarDecl 0x7fb4041ea0f8 <col:21, col:27> col:27 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fb4041ea2e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fb4041ea668 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2137:3, line:2140:51> line:2139:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fb4041ea3b0 <line:2137:13, col:19> col:19 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7fb4041ea5c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2140:51> line:2139:3 constexpr __compressed_pair 'void (struct std::__1::__second_tag, _Tp &&)'
|   |-ParmVarDecl 0x7fb4041ea430 <col:21> col:33 'struct std::__1::__second_tag'
|   |-ParmVarDecl 0x7fb4041ea4c8 <col:35, col:41> col:41 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fb4041ea6c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fb4041eab18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2142:3, line:2145:75> line:2144:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fb4041ea798 <line:2142:13, col:19> col:19 class depth 0 index 0 _U1
| |-TemplateTypeParmDecl 0x7fb4041ea808 <col:24, col:30> col:30 class depth 0 index 1 _U2
| `-CXXConstructorDecl 0x7fb4041eaa70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 constexpr __compressed_pair 'void (_U1 &&, _U2 &&)'
|   |-ParmVarDecl 0x7fb4041ea8d8 <col:21, col:27> col:27 __t1 '_U1 &&'
|   |-ParmVarDecl 0x7fb4041ea978 <col:33, col:39> col:39 __t2 '_U2 &&'
|   `-AlwaysInlineAttr 0x7fb4041eab78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fb4041eb1d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2147:3, line:2154:75> line:2149:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fb4041eac48 <line:2147:13, col:22> col:22 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7fb4041eacb8 <col:30, col:39> col:39 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7fb4041eb130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2154:75> line:2149:3 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7fb4041ead48 <col:21, col:43> col:43 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fb4041eaeb8 <col:49, col:66> col:66 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7fb4041eb028 <line:2150:21, col:38> col:38 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7fb4041eb240 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041eb408 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2175:3> line:2173:30 first 'typename _Base1::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7fb4041eb4b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041eb5b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2180:3> line:2178:36 first 'typename _Base1::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041eb660 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041eb7a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2185:3> line:2183:30 second 'typename _Base2::reference (void) noexcept'
| `-AlwaysInlineAttr 0x7fb4041eb850 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041eb958 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2190:3> line:2188:36 second 'typename _Base2::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041eba00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041ebba0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2200:3> line:2193:8 swap 'void (class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > &)' noexcept-uninstantiated 0x7fb400b7ee48
| |-ParmVarDecl 0x7fb4041eba88 <col:13, col:32> col:32 __x 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7fb4041ebc98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
`-CXXDestructorDecl 0x7fb404202a08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2105:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair" = type { %"struct.std::__1::__compressed_pair_elem" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb4041ce928 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:322:1, line:411:1> line:323:7 class __vector_base definition
|-protected '__vector_base_common<true>':'class std::__1::__vector_base_common<true>'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x7fb4041ceb90 prev 0x7fb4041ce928 <col:1, col:7> col:7 implicit class __vector_base
|-AccessSpecDecl 0x7fb4041cec28 <line:326:1, col:10> col:1 protected
|-TypedefDecl 0x7fb4041cec88 <line:327:5, col:54> col:54 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7fb4041cec50 'int' sugar
|   |-TemplateTypeParmType 0x7fb401323bb0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fb401323b70 '_Tp'
|   `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb4041ced18 <line:328:5, col:54> col:54 allocator_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7fb4041cece0 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7fb401323c20 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fb401323bd8 '_Allocator'
|   `-RecordType 0x7fb4041ce4f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fb4041ce400 'allocator'
|-TypedefDecl 0x7fb4041cef28 <line:329:5, col:54> col:54 referenced __alloc_traits 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x7fb4041ceeb0 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type':'class std::__1::allocator<int>'
|   `-RecordType 0x7fb4041cee90 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x7fb4041ceda0 'allocator_traits'
|-TypedefDecl 0x7fb4041cf008 <line:330:5, col:54> col:54 referenced reference 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-LValueReferenceType 0x7fb4041cefd0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|   `-TypedefType 0x7fb4041cef80 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|     |-Typedef 0x7fb4041cec88 'value_type'
|     `-SubstTemplateTypeParmType 0x7fb4041cec50 'int' sugar
|       |-TemplateTypeParmType 0x7fb401323bb0 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fb401323b70 '_Tp'
|       `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb4041cf0c8 <line:331:5, col:54> col:54 referenced const_reference 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-LValueReferenceType 0x7fb4041cf090 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|   `-QualType 0x7fb4041cef81 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' const
|     `-TypedefType 0x7fb4041cef80 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|       |-Typedef 0x7fb4041cec88 'value_type'
|       `-SubstTemplateTypeParmType 0x7fb4041cec50 'int' sugar
|         |-TemplateTypeParmType 0x7fb401323bb0 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7fb401323b70 '_Tp'
|         `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb4041e3730 <line:332:5, col:54> col:54 referenced size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7fb4041e36e0 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7fb4041dbe20 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x7fb4041d87b0 'size_type'
|     `-ElaboratedType 0x7fb4041d8760 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7fb4041d8740 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|         |-Typedef 0x7fb4041d86c0 'type'
|         `-ElaboratedType 0x7fb4041d8670 'typename class allocator<int>::size_type' sugar
|           `-TypedefType 0x7fb4041d7f50 'std::__1::allocator<int>::size_type' sugar
|             |-Typedef 0x7fb4041cf4c8 'size_type'
|             `-TypedefType 0x7fb401060810 'size_t' sugar
|               |-Typedef 0x7fb4008691b0 'size_t'
|               `-BuiltinType 0x7fb400833c80 'unsigned long'
|-TypedefDecl 0x7fb4041e3800 <line:333:5, col:54> col:54 referenced difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7fb4041e37b0 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7fb4041d7c70 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x7fb4041d7c00 'difference_type'
|     `-ElaboratedType 0x7fb4041d7bb0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7fb4041d7b90 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|         |-Typedef 0x7fb4041d7b10 'type'
|         `-ElaboratedType 0x7fb4041d7ac0 'typename class allocator<int>::difference_type' sugar
|           `-TypedefType 0x7fb4041d7370 'std::__1::allocator<int>::difference_type' sugar
|             |-Typedef 0x7fb4041cf520 'difference_type'
|             `-TypedefType 0x7fb401809950 'ptrdiff_t' sugar
|               |-Typedef 0x7fb400869140 'ptrdiff_t'
|               `-BuiltinType 0x7fb400833be0 'long'
|-TypedefDecl 0x7fb4041e38d0 <line:334:5, col:54> col:54 referenced pointer 'typename __alloc_traits::pointer':'int *'
| `-ElaboratedType 0x7fb4041e3880 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7fb4041d2a40 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x7fb4041d29d0 'pointer'
|     `-ElaboratedType 0x7fb4041d2980 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7fb4041d2960 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|         |-Typedef 0x7fb4041d28e0 'type'
|         `-ElaboratedType 0x7fb4041d2890 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|           `-TypedefType 0x7fb4041d2870 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x7fb4041d27f0 'type'
|             `-ElaboratedType 0x7fb4041d27a0 'typename class allocator<int>::pointer' sugar
|               `-TypedefType 0x7fb4041d01a0 'std::__1::allocator<int>::pointer' sugar
|                 |-Typedef 0x7fb4041cf5e8 'pointer'
|                 `-PointerType 0x7fb4041cf5b0 'int *'
|                   `-SubstTemplateTypeParmType 0x7fb4041cf580 'int' sugar
|                     |-TemplateTypeParmType 0x7fb400b64c60 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fb400b64c18 '_Tp'
|                     `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb4041e39c0 <line:335:5, col:54> col:54 referenced const_pointer 'typename __alloc_traits::const_pointer':'const int *'
| `-ElaboratedType 0x7fb4041e3970 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7fb4041e3950 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x7fb4041d37d0 'const_pointer'
|     `-ElaboratedType 0x7fb4041d3780 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7fb4041d3760 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|         |-Typedef 0x7fb4041d36e0 'type'
|         `-ElaboratedType 0x7fb4041d3690 'typename class allocator<int>::const_pointer' sugar
|           `-TypedefType 0x7fb4041d03f0 'std::__1::allocator<int>::const_pointer' sugar
|             |-Typedef 0x7fb4041cf678 'const_pointer'
|             `-PointerType 0x7fb4041cf640 'const int *'
|               `-QualType 0x7fb4041cf581 'const int' const
|                 `-SubstTemplateTypeParmType 0x7fb4041cf580 'int' sugar
|                   |-TemplateTypeParmType 0x7fb400b64c60 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7fb400b64c18 '_Tp'
|                   `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb4041e3a50 <line:336:5, col:54> col:54 iterator 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
| `-TypedefType 0x7fb4041e3a20 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer' sugar
|   |-Typedef 0x7fb4041e38d0 'pointer'
|   `-ElaboratedType 0x7fb4041e3880 'typename __alloc_traits::pointer' sugar
|     `-TypedefType 0x7fb4041d2a40 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|       |-Typedef 0x7fb4041d29d0 'pointer'
|       `-ElaboratedType 0x7fb4041d2980 'typename __pointer_type<value_type, allocator_type>::type' sugar
|         `-TypedefType 0x7fb4041d2960 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|           |-Typedef 0x7fb4041d28e0 'type'
|           `-ElaboratedType 0x7fb4041d2890 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|             `-TypedefType 0x7fb4041d2870 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|               |-Typedef 0x7fb4041d27f0 'type'
|               `-ElaboratedType 0x7fb4041d27a0 'typename class allocator<int>::pointer' sugar
|                 `-TypedefType 0x7fb4041d01a0 'std::__1::allocator<int>::pointer' sugar
|                   |-Typedef 0x7fb4041cf5e8 'pointer'
|                   `-PointerType 0x7fb4041cf5b0 'int *'
|                     `-SubstTemplateTypeParmType 0x7fb4041cf580 'int' sugar
|                       |-TemplateTypeParmType 0x7fb400b64c60 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7fb400b64c18 '_Tp'
|                       `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb4041e3ae0 <line:337:5, col:54> col:54 const_iterator 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer':'const int *'
| `-TypedefType 0x7fb4041e3ab0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer' sugar
|   |-Typedef 0x7fb4041e39c0 'const_pointer'
|   `-ElaboratedType 0x7fb4041e3970 'typename __alloc_traits::const_pointer' sugar
|     `-TypedefType 0x7fb4041e3950 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|       |-Typedef 0x7fb4041d37d0 'const_pointer'
|       `-ElaboratedType 0x7fb4041d3780 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|         `-TypedefType 0x7fb4041d3760 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|           |-Typedef 0x7fb4041d36e0 'type'
|           `-ElaboratedType 0x7fb4041d3690 'typename class allocator<int>::const_pointer' sugar
|             `-TypedefType 0x7fb4041d03f0 'std::__1::allocator<int>::const_pointer' sugar
|               |-Typedef 0x7fb4041cf678 'const_pointer'
|               `-PointerType 0x7fb4041cf640 'const int *'
|                 `-QualType 0x7fb4041cf581 'const int' const
|                   `-SubstTemplateTypeParmType 0x7fb4041cf580 'int' sugar
|                     |-TemplateTypeParmType 0x7fb400b64c60 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fb400b64c18 '_Tp'
|                     `-BuiltinType 0x7fb400833bc0 'int'
|-FieldDecl 0x7fb4041e3b48 <line:339:5, col:53> col:53 __begin_ 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
|-FieldDecl 0x7fb4041e3ba0 <line:340:5, col:53> col:53 __end_ 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
|-FieldDecl 0x7fb4041ebd00 <line:341:5, col:48> col:48 __end_cap_ '__compressed_pair<std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer, std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> >'
|-CXXMethodDecl 0x7fb4041ebdd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:345:37> line:344:21 __alloc 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &(void) noexcept'
| `-AlwaysInlineAttr 0x7fb4041ebea8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041ebf78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:348:37> line:347:27 __alloc 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &(void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041ec020 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041ec0f8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:351:36> line:350:14 __end_cap 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer &(void) noexcept'
| `-AlwaysInlineAttr 0x7fb4041ec1a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041ec278 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:354:36> line:353:20 __end_cap 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer &(void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041ec320 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fb4041ec3d0 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:357:5 __vector_base 'void (void)' noexcept-uninstantiated 0x7fb4013254f0
| `-AlwaysInlineAttr 0x7fb4041ec4d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fb4041ec650 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:359:70> col:31 __vector_base 'void (const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fb4041ec528 <col:45, col:67> col:67 __a 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fb4041ec710 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXDestructorDecl 0x7fb4041ec788 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:360:5, col:20> col:5 used ~__vector_base 'void (void) noexcept'
|-CXXMethodDecl 0x7fb4041ec838 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:363:57> col:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fb4041ec8e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041ec9a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:366:64> line:365:15 capacity 'std::__1::__vector_base<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041eca50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041ecb78 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:369:10 __destruct_at_end 'void (std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x7fb4041ecaa8 <col:28, col:36> col:36 __new_last 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7fb4041ecc28 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041ecd70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:374:89> line:372:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &)'
| |-ParmVarDecl 0x7fb4041ecca8 <col:30, col:51> col:51 __c 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7fb4041ece20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041ecfc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:382:89> line:377:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &)' noexcept-uninstantiated 0x7fb401329800
| |-ParmVarDecl 0x7fb4041ecea8 <col:30, col:45> col:45 __c 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7fb4041ed0b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-AccessSpecDecl 0x7fb4041ed100 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:383:1, col:8> col:1 private
|-CXXMethodDecl 0x7fb4041ed2b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:394:9> line:385:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::true_type)'
| |-ParmVarDecl 0x7fb4041ed138 <col:30, col:51> col:51 __c 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7fb4041ed198 <col:56> col:65 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fb4041ed368 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041ed530 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:398:10> line:397:10 __copy_assign_alloc 'void (const class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::false_type)'
| |-ParmVarDecl 0x7fb4041ed3c0 <col:30, col:49> col:50 'const class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7fb4041ed420 <col:52> col:62 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
| `-AlwaysInlineAttr 0x7fb4041ed5e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041ed7c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:405:9> line:401:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::true_type)' noexcept-uninstantiated 0x7fb40132a068
| |-ParmVarDecl 0x7fb4041ed640 <col:30, col:45> col:45 __c 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7fb4041ed6a0 <col:50> col:59 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-AlwaysInlineAttr 0x7fb4041ed8d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
`-CXXMethodDecl 0x7fb4041edaa8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:410:10> line:408:10 __move_assign_alloc 'void (class std::__1::__vector_base<int, class std::__1::allocator<int> > &, std::__1::false_type) noexcept'
  |-ParmVarDecl 0x7fb4041ed928 <col:30, col:43> col:44 'class std::__1::__vector_base<int, class std::__1::allocator<int> > &'
  |-ParmVarDecl 0x7fb4041ed988 <col:46> col:56 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
  `-AlwaysInlineAttr 0x7fb4041edb60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__vector_base" = type { i32*, i32*, %"class.std::__1::__compressed_pair" }
  NonVirtualBaseLLVMType:%"class.std::__1::__vector_base" = type { i32*, i32*, %"class.std::__1::__compressed_pair" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb4041ce588 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:453:1, line:887:1> line:454:28 class vector definition
|-private '__vector_base<int, class std::__1::allocator<int> >':'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-CXXRecordDecl 0x7fb4041edc18 prev 0x7fb4041ce588 <col:1, col:28> col:28 implicit class vector
|-AccessSpecDecl 0x7fb4041edcb0 <line:457:1, col:8> col:1 private
|-TypedefDecl 0x7fb4041edda8 <line:458:5, col:54> col:54 __base '__vector_base<int, class std::__1::allocator<int> >':'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x7fb4041edd00 '__vector_base<int, class std::__1::allocator<int> >' sugar __vector_base
|   |-TemplateArgument type 'int':'int'
|   |-TemplateArgument type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
|   `-RecordType 0x7fb4041cea30 'class std::__1::__vector_base<int, class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x7fb4041ce928 '__vector_base'
|-TypedefDecl 0x7fb4041ede88 <line:459:5, col:54> col:54 __default_allocator_type 'allocator<int>':'class std::__1::allocator<int>'
| `-TemplateSpecializationType 0x7fb4041ede10 'allocator<int>' sugar allocator
|   |-TemplateArgument type 'int':'int'
|   `-RecordType 0x7fb4041ce4f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fb4041ce400 'allocator'
|-AccessSpecDecl 0x7fb4041edee0 <line:460:1, col:7> col:1 public
|-TypedefDecl 0x7fb4041edf18 <line:461:5, col:54> col:54 __self 'class std::__1::vector<int, class std::__1::allocator<int> >'
| `-RecordType 0x7fb4041ce690 'class std::__1::vector<int, class std::__1::allocator<int> >'
|   `-ClassTemplateSpecialization 0x7fb4041ce588 'vector'
|-TypedefDecl 0x7fb4041edf80 <line:462:5, col:54> col:54 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7fb4041ce8b0 'int' sugar
|   |-TemplateTypeParmType 0x7fb40132e7e0 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fb40132e7a0 '_Tp'
|   `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb4041edfe8 <line:463:5, col:54> col:54 allocator_type 'class std::__1::allocator<int>':'class std::__1::allocator<int>'
| `-SubstTemplateTypeParmType 0x7fb4041ce8f0 'class std::__1::allocator<int>' sugar
|   |-TemplateTypeParmType 0x7fb40132e850 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fb40132e808 '_Allocator'
|   `-RecordType 0x7fb4041ce4f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fb4041ce400 'allocator'
|-TypedefDecl 0x7fb4041ee0f0 <line:464:5, col:54> col:54 __alloc_traits 'typename __base::__alloc_traits':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-ElaboratedType 0x7fb4041ee0a0 'typename __base::__alloc_traits' sugar
|   `-TypedefType 0x7fb4041cf120 'std::__1::__vector_base<int, class std::__1::allocator<int> >::__alloc_traits' sugar
|     |-Typedef 0x7fb4041cef28 '__alloc_traits'
|     `-TemplateSpecializationType 0x7fb4041ceeb0 'allocator_traits<std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type>' sugar allocator_traits
|       |-TemplateArgument type 'std::__1::__vector_base<int, class std::__1::allocator<int> >::allocator_type':'class std::__1::allocator<int>'
|       `-RecordType 0x7fb4041cee90 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|         `-ClassTemplateSpecialization 0x7fb4041ceda0 'allocator_traits'
|-TypedefDecl 0x7fb4041ee1e0 <line:465:5, col:54> col:54 reference 'typename __base::reference':'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ElaboratedType 0x7fb4041ee190 'typename __base::reference' sugar
|   `-TypedefType 0x7fb4041ee170 'std::__1::__vector_base<int, class std::__1::allocator<int> >::reference' sugar
|     |-Typedef 0x7fb4041cf008 'reference'
|     `-LValueReferenceType 0x7fb4041cefd0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|       `-TypedefType 0x7fb4041cef80 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|         |-Typedef 0x7fb4041cec88 'value_type'
|         `-SubstTemplateTypeParmType 0x7fb4041cec50 'int' sugar
|           |-TemplateTypeParmType 0x7fb401323bb0 '_Tp' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x7fb401323b70 '_Tp'
|           `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb4041ee2d0 <line:466:5, col:54> col:54 const_reference 'typename __base::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ElaboratedType 0x7fb4041ee280 'typename __base::const_reference' sugar
|   `-TypedefType 0x7fb4041ee260 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_reference' sugar
|     |-Typedef 0x7fb4041cf0c8 'const_reference'
|     `-LValueReferenceType 0x7fb4041cf090 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|       `-QualType 0x7fb4041cef81 'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' const
|         `-TypedefType 0x7fb4041cef80 'std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type' sugar
|           |-Typedef 0x7fb4041cec88 'value_type'
|           `-SubstTemplateTypeParmType 0x7fb4041cec50 'int' sugar
|             |-TemplateTypeParmType 0x7fb401323bb0 '_Tp' dependent depth 0 index 0
|             | `-TemplateTypeParm 0x7fb401323b70 '_Tp'
|             `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb4041ee3a0 <line:467:5, col:54> col:54 size_type 'typename __base::size_type':'unsigned long'
| `-ElaboratedType 0x7fb4041ee350 'typename __base::size_type' sugar
|   `-TypedefType 0x7fb4041ec930 'std::__1::__vector_base<int, class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x7fb4041e3730 'size_type'
|     `-ElaboratedType 0x7fb4041e36e0 'typename __alloc_traits::size_type' sugar
|       `-TypedefType 0x7fb4041dbe20 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|         |-Typedef 0x7fb4041d87b0 'size_type'
|         `-ElaboratedType 0x7fb4041d8760 'typename __size_type<allocator_type, difference_type>::type' sugar
|           `-TypedefType 0x7fb4041d8740 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|             |-Typedef 0x7fb4041d86c0 'type'
|             `-ElaboratedType 0x7fb4041d8670 'typename class allocator<int>::size_type' sugar
|               `-TypedefType 0x7fb4041d7f50 'std::__1::allocator<int>::size_type' sugar
|                 |-Typedef 0x7fb4041cf4c8 'size_type'
|                 `-TypedefType 0x7fb401060810 'size_t' sugar
|                   |-Typedef 0x7fb4008691b0 'size_t'
|                   `-BuiltinType 0x7fb400833c80 'unsigned long'
|-TypedefDecl 0x7fb4041ee490 <line:468:5, col:54> col:54 difference_type 'typename __base::difference_type':'long'
| `-ElaboratedType 0x7fb4041ee440 'typename __base::difference_type' sugar
|   `-TypedefType 0x7fb4041ee420 'std::__1::__vector_base<int, class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x7fb4041e3800 'difference_type'
|     `-ElaboratedType 0x7fb4041e37b0 'typename __alloc_traits::difference_type' sugar
|       `-TypedefType 0x7fb4041d7c70 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|         |-Typedef 0x7fb4041d7c00 'difference_type'
|         `-ElaboratedType 0x7fb4041d7bb0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|           `-TypedefType 0x7fb4041d7b90 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|             |-Typedef 0x7fb4041d7b10 'type'
|             `-ElaboratedType 0x7fb4041d7ac0 'typename class allocator<int>::difference_type' sugar
|               `-TypedefType 0x7fb4041d7370 'std::__1::allocator<int>::difference_type' sugar
|                 |-Typedef 0x7fb4041cf520 'difference_type'
|                 `-TypedefType 0x7fb401809950 'ptrdiff_t' sugar
|                   |-Typedef 0x7fb400869140 'ptrdiff_t'
|                   `-BuiltinType 0x7fb400833be0 'long'
|-TypedefDecl 0x7fb4041ee560 <line:469:5, col:54> col:54 pointer 'typename __base::pointer':'int *'
| `-ElaboratedType 0x7fb4041ee510 'typename __base::pointer' sugar
|   `-TypedefType 0x7fb4041e3a20 'std::__1::__vector_base<int, class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x7fb4041e38d0 'pointer'
|     `-ElaboratedType 0x7fb4041e3880 'typename __alloc_traits::pointer' sugar
|       `-TypedefType 0x7fb4041d2a40 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|         |-Typedef 0x7fb4041d29d0 'pointer'
|         `-ElaboratedType 0x7fb4041d2980 'typename __pointer_type<value_type, allocator_type>::type' sugar
|           `-TypedefType 0x7fb4041d2960 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|             |-Typedef 0x7fb4041d28e0 'type'
|             `-ElaboratedType 0x7fb4041d2890 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|               `-TypedefType 0x7fb4041d2870 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|                 |-Typedef 0x7fb4041d27f0 'type'
|                 `-ElaboratedType 0x7fb4041d27a0 'typename class allocator<int>::pointer' sugar
|                   `-TypedefType 0x7fb4041d01a0 'std::__1::allocator<int>::pointer' sugar
|                     |-Typedef 0x7fb4041cf5e8 'pointer'
|                     `-PointerType 0x7fb4041cf5b0 'int *'
|                       `-SubstTemplateTypeParmType 0x7fb4041cf580 'int' sugar
|                         |-TemplateTypeParmType 0x7fb400b64c60 '_Tp' dependent depth 0 index 0
|                         | `-TemplateTypeParm 0x7fb400b64c18 '_Tp'
|                         `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb4041ee630 <line:470:5, col:54> col:54 const_pointer 'typename __base::const_pointer':'const int *'
| `-ElaboratedType 0x7fb4041ee5e0 'typename __base::const_pointer' sugar
|   `-TypedefType 0x7fb4041e3ab0 'std::__1::__vector_base<int, class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x7fb4041e39c0 'const_pointer'
|     `-ElaboratedType 0x7fb4041e3970 'typename __alloc_traits::const_pointer' sugar
|       `-TypedefType 0x7fb4041e3950 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|         |-Typedef 0x7fb4041d37d0 'const_pointer'
|         `-ElaboratedType 0x7fb4041d3780 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|           `-TypedefType 0x7fb4041d3760 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x7fb4041d36e0 'type'
|             `-ElaboratedType 0x7fb4041d3690 'typename class allocator<int>::const_pointer' sugar
|               `-TypedefType 0x7fb4041d03f0 'std::__1::allocator<int>::const_pointer' sugar
|                 |-Typedef 0x7fb4041cf678 'const_pointer'
|                 `-PointerType 0x7fb4041cf640 'const int *'
|                   `-QualType 0x7fb4041cf581 'const int' const
|                     `-SubstTemplateTypeParmType 0x7fb4041cf580 'int' sugar
|                       |-TemplateTypeParmType 0x7fb400b64c60 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7fb400b64c18 '_Tp'
|                       `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb4041ee848 <line:471:5, col:54> col:54 iterator '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::pointer>':'class std::__1::__wrap_iter<int *>'
| `-TemplateSpecializationType 0x7fb4041ee7d0 '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|   `-RecordType 0x7fb4041ee7b0 'class std::__1::__wrap_iter<int *>'
|     `-ClassTemplateSpecialization 0x7fb4041ee6c0 '__wrap_iter'
|-TypedefDecl 0x7fb4041eea58 <line:472:5, col:54> col:54 const_iterator '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::const_pointer>':'class std::__1::__wrap_iter<const int *>'
| `-TemplateSpecializationType 0x7fb4041ee9e0 '__wrap_iter<std::__1::vector<int, class std::__1::allocator<int> >::const_pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::const_pointer':'const int *'
|   `-RecordType 0x7fb4041ee9c0 'class std::__1::__wrap_iter<const int *>'
|     `-ClassTemplateSpecialization 0x7fb4041ee8d0 '__wrap_iter'
|-TypedefDecl 0x7fb4041f00c0 <line:473:5, col:55> col:55 reverse_iterator 'std::__1::reverse_iterator<iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<int *> >'
| `-ElaboratedType 0x7fb4041f0050 'std::__1::reverse_iterator<iterator>' sugar
|   `-TemplateSpecializationType 0x7fb4041f0000 'reverse_iterator<std::__1::vector<int, class std::__1::allocator<int> >::iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::iterator':'class std::__1::__wrap_iter<int *>'
|     `-RecordType 0x7fb4041eebd0 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<int *> >'
|       `-ClassTemplateSpecialization 0x7fb4041eeae0 'reverse_iterator'
|-TypedefDecl 0x7fb4041f0320 <line:474:5, col:55> col:55 const_reverse_iterator 'std::__1::reverse_iterator<const_iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const int *> >'
| `-ElaboratedType 0x7fb4041f02b0 'std::__1::reverse_iterator<const_iterator>' sugar
|   `-TemplateSpecializationType 0x7fb4041f0260 'reverse_iterator<std::__1::vector<int, class std::__1::allocator<int> >::const_iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|     `-RecordType 0x7fb4041f0240 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const int *> >'
|       `-ClassTemplateSpecialization 0x7fb4041f0150 'reverse_iterator'
|-StaticAssertDecl 0x7fb4041f08a8 <line:476:5, line:477:74> line:476:5
| |-ParenExpr 0x7fb4041f0870 <col:19, col:83> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7fb4041f0838 <col:20, col:78> 'const _Bool':'const _Bool' lvalue Var 0x7fb400cd7620 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fb4013301f0 <line:477:19> 'const char [54]' lvalue "Allocator::value_type must be same type as value_type"
|-CXXConstructorDecl 0x7fb4041f0948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:485:9> line:480:5 used vector 'void (void) noexcept(is_nothrow_default_constructible<allocator_type>::value)'
| `-AlwaysInlineAttr 0x7fb4041f0a68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fb4041f0be0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:497:5> line:486:40 vector 'void (const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)' noexcept-uninstantiated 0x7fb401330568
| |-ParmVarDecl 0x7fb4041f0ae8 <col:47, col:69> col:69 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fb4041f0ce8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fb4041f0e40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:498:5, col:34> col:14 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fb4041f0d60 <col:21, col:31> col:31 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXConstructorDecl 0x7fb4041f10b0 <line:500:5, col:61> col:14 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fb4041f0f10 <col:21, col:31> col:31 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fb4041f0f80 <col:36, col:58> col:58 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-CXXConstructorDecl 0x7fb4041f1350 <line:502:5, col:46> col:5 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fb4041f1188 <col:12, col:22> col:22 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fb4041f1220 <col:27, col:43> col:43 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXConstructorDecl 0x7fb4041f1660 <line:503:5, col:73> col:5 vector 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fb4041f1428 <col:12, col:22> col:22 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fb4041f1498 <col:27, col:43> col:43 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-ParmVarDecl 0x7fb4041f1508 <col:48, col:70> col:70 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-FunctionTemplateDecl 0x7fb4041f20f8 <line:504:5, line:511:62> line:505:9 vector
| |-TemplateTypeParmDecl 0x7fb4041f1730 <line:504:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7fb4041f2050 <line:505:9, line:511:62> line:505:9 vector 'void (_InputIterator, typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, _InputIterator>::type)'
|   |-ParmVarDecl 0x7fb4041f17c0 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x7fb4041f1f20 <line:506:16, line:511:56> col:56 __last 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, _InputIterator>::type'
|-FunctionTemplateDecl 0x7fb4041f2c68 <line:512:5, line:518:108> line:513:9 vector
| |-TemplateTypeParmDecl 0x7fb4041f21e0 <line:512:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXConstructorDecl 0x7fb4041f2bc0 <line:513:9, line:518:108> line:513:9 vector 'void (_InputIterator, _InputIterator, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &, typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value>::type *)'
|   |-ParmVarDecl 0x7fb4041f2270 <col:16, col:31> col:31 __first '_InputIterator'
|   |-ParmVarDecl 0x7fb4041f22e0 <col:40, col:55> col:55 __last '_InputIterator'
|   |-ParmVarDecl 0x7fb4041f2350 <col:63, col:85> col:85 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|   `-ParmVarDecl 0x7fb4041f2a60 <line:514:16, line:518:107> col:105 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value>::type *'
|-FunctionTemplateDecl 0x7fb4041f3578 <line:519:5, line:525:64> line:520:9 vector
| |-TemplateTypeParmDecl 0x7fb4041f2d60 <line:519:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXConstructorDecl 0x7fb4041f34d0 <line:520:9, line:525:64> line:520:9 vector 'void (_ForwardIterator, typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, _ForwardIterator>::type)'
|   |-ParmVarDecl 0x7fb4041f2df0 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fb4041f33a0 <line:521:16, line:525:58> col:58 __last 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, _ForwardIterator>::type'
|-FunctionTemplateDecl 0x7fb4041f3fa8 <line:526:5, line:531:110> line:527:9 vector
| |-TemplateTypeParmDecl 0x7fb4041f3660 <line:526:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXConstructorDecl 0x7fb4041f3f00 <line:527:9, line:531:110> line:527:9 vector 'void (_ForwardIterator, _ForwardIterator, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &, typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value>::type *)'
|   |-ParmVarDecl 0x7fb4041f36f0 <col:16, col:33> col:33 __first '_ForwardIterator'
|   |-ParmVarDecl 0x7fb4041f3760 <col:42, col:59> col:59 __last '_ForwardIterator'
|   |-ParmVarDecl 0x7fb4041f37d0 <col:67, col:89> col:89 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|   `-ParmVarDecl 0x7fb4041f3da0 <line:528:16, line:531:109> col:107 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value>::type *'
|-CXXConstructorDecl 0x7fb4041f41c0 <line:541:5, col:29> col:5 vector 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &)'
| `-ParmVarDecl 0x7fb4041f40d8 <col:12, col:26> col:26 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
|-CXXConstructorDecl 0x7fb4041f4430 <line:542:5, col:56> col:5 vector 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fb4041f4290 <col:12, col:26> col:26 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x7fb4041f4300 <col:31, col:53> col:53 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
|-CXXMethodDecl 0x7fb4041f4600 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:544:40> col:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(const class std::__1::vector<int, class std::__1::allocator<int> > &)'
| |-ParmVarDecl 0x7fb4041f4538 <col:23, col:37> col:37 __x 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-AlwaysInlineAttr 0x7fb4041f46b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fb4041f49b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:548:45> col:5 vector 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7fb4041f4888 <col:12, col:41> col:41 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7fb4041f4a70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fb4041f4cf0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:551:72> col:5 vector 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fb4041f4b48 <col:12, col:41> col:41 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| |-ParmVarDecl 0x7fb4041f4bb8 <col:47, col:69> col:69 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fb4041f4db8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fb4041f4f70 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:554:5 vector 'void (class std::__1::vector<int, class std::__1::allocator<int> > &&)' noexcept-uninstantiated 0x7fb4013346b8
| |-ParmVarDecl 0x7fb4041f4e38 <col:12, col:21> col:21 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| `-AlwaysInlineAttr 0x7fb4041f5078 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fb4041f5270 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:562:51> col:5 vector 'void (class std::__1::vector<int, class std::__1::allocator<int> > &&, const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &)'
| |-ParmVarDecl 0x7fb4041f50d0 <col:12, col:21> col:21 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| |-ParmVarDecl 0x7fb4041f5140 <col:26, col:48> col:48 __a 'const std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &'
| `-AlwaysInlineAttr 0x7fb4041f5338 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f54a0 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:564:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(class std::__1::vector<int, class std::__1::allocator<int> > &&)' noexcept-uninstantiated 0x7fb401334bd8
| |-ParmVarDecl 0x7fb4041f5390 <col:23, col:32> col:32 __x 'class std::__1::vector<int, class std::__1::allocator<int> > &&'
| `-AlwaysInlineAttr 0x7fb4041f5598 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f5770 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:569:57> line:568:13 operator= 'class std::__1::vector<int, class std::__1::allocator<int> > &(initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7fb4041f5668 <col:23, col:52> col:52 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7fb4041f5820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fb4041f60d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:573:5, line:583:61> col:9 assign
| |-TemplateTypeParmDecl 0x7fb4041f5868 <line:573:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fb4041f6040 <line:574:9, line:583:61> col:9 assign 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, void>::type (_InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x7fb4041f5eb0 <col:16, col:31> col:31 __first '_InputIterator'
|   `-ParmVarDecl 0x7fb4041f5f20 <col:40, col:55> col:55 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fb4041f68e8 <line:584:5, line:593:65> col:9 assign
| |-TemplateTypeParmDecl 0x7fb4041f61c0 <line:584:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fb4041f6850 <line:585:9, line:593:65> col:9 assign 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, void>::type (_ForwardIterator, _ForwardIterator)'
|   |-ParmVarDecl 0x7fb4041f66c0 <col:16, col:33> col:33 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fb4041f6730 <col:42, col:59> col:59 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fb4041f6ae0 <line:595:5, col:51> col:10 assign 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fb4041f69e0 <col:17, col:27> col:27 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fb4041f6a50 <col:32, col:48> col:48 __u 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7fb4041f6cf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:600:43> line:599:10 assign 'void (initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7fb4041f6c28 <col:17, col:46> col:46 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7fb4041f6da0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f6e78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:605:33> line:604:20 get_allocator 'std::__1::vector<int, class std::__1::allocator<int> >::allocator_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041f6f20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f6ff8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:607:54 begin 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fb4041f70a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f7178 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:608:54 begin 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041f7220 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f7290 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:609:54 end 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fb4041f7338 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f73a8 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:610:54 end 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041f7450 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f7548 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:614:47> line:613:28 rbegin 'std::__1::vector<int, class std::__1::allocator<int> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fb4041f75f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f76e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:617:47> line:616:28 rbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041f7790 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f7800 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:620:49> line:619:28 rend 'std::__1::vector<int, class std::__1::allocator<int> >::reverse_iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fb4041f78a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f7918 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:623:49> line:622:28 rend 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041f79c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f7a30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:627:25> line:626:28 cbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041f7ad8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f7b48 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:630:23> line:629:28 cend 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041f7bf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f7c60 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:633:26> line:632:28 crbegin 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041f7d08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f7d78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:636:24> line:635:28 crend 'std::__1::vector<int, class std::__1::allocator<int> >::const_reverse_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041f7e20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f7ec8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:640:71> line:639:15 size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041f7f70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f7fe0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:643:36> line:642:15 capacity 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041f8088 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f80d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:646:48> line:645:10 empty '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041f8178 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f81e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:647:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:647:15 max_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (void) const noexcept'
|-CXXMethodDecl 0x7fb4041f8328 <line:648:5, col:31> col:10 reserve 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fb4041f82a0 <col:18, col:28> col:28 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fb4041f83d8 <line:649:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:649:10 shrink_to_fit 'void (void) noexcept'
|-CXXMethodDecl 0x7fb4041f85b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:651:71> col:47 operator[] 'std::__1::vector<int, class std::__1::allocator<int> >::reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| |-ParmVarDecl 0x7fb4041f84b0 <col:58, col:68> col:68 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fb4041f8660 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f87c0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:652:73> col:47 operator[] 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fb4041f86b8 <col:58, col:68> col:68 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fb4041f8870 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f8950 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:653:5, col:37> col:21 at 'std::__1::vector<int, class std::__1::allocator<int> >::reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fb4041f88c8 <col:24, col:34> col:34 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fb4041f8a98 <line:654:5, col:39> col:21 at 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| `-ParmVarDecl 0x7fb4041f8a10 <col:24, col:34> col:34 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fb4041f8bd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:660:5> line:656:47 front 'std::__1::vector<int, class std::__1::allocator<int> >::reference (void)'
| `-AlwaysInlineAttr 0x7fb4041f8c78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f8d40 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:665:5> line:661:47 front 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7fb4041f8de8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f8e50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:670:5> line:666:47 back 'std::__1::vector<int, class std::__1::allocator<int> >::reference (void)'
| `-AlwaysInlineAttr 0x7fb4041f8ef8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f8f60 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:675:5> line:671:47 back 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference (void) const'
| `-AlwaysInlineAttr 0x7fb4041f9008 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f90d8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:679:57> line:678:23 data 'std::__1::vector<int, class std::__1::allocator<int> >::value_type *(void) noexcept'
| `-AlwaysInlineAttr 0x7fb4041f9180 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f9288 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:682:57> line:681:23 data 'const std::__1::vector<int, class std::__1::allocator<int> >::value_type *(void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4041f9330 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f9490 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:684:65> col:36 push_back 'void (std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fb4041f9388 <col:46, col:62> col:62 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-AlwaysInlineAttr 0x7fb4041f9540 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041f9700 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:687:62> col:36 push_back 'void (std::__1::vector<int, class std::__1::allocator<int> >::value_type &&)'
| |-ParmVarDecl 0x7fb4041f95f8 <col:46, col:59> col:59 __x 'std::__1::vector<int, class std::__1::allocator<int> >::value_type &&'
| `-AlwaysInlineAttr 0x7fb4041f97b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fb4041f9a68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:689:5, line:694:49> col:19 emplace_back
| |-TemplateTypeParmDecl 0x7fb4041f97f8 <line:689:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x7fb4041f99d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:694:49> col:19 emplace_back 'void (_Args &&...)'
|   |-ParmVarDecl 0x7fb4041f9908 <col:32, col:43> col:43 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7fb4041f9ac0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fb4041f9b90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:699:19> col:10 pop_back 'void (void)'
| `-AlwaysInlineAttr 0x7fb4041f9c38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXMethodDecl 0x7fb4041f9e10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:701:5, col:67> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fb4041f9c90 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x7fb4041f9d00 <col:48, col:64> col:64 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7fb4041fa060 <line:704:5, col:64> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::value_type &&)'
| |-ParmVarDecl 0x7fb4041f9ed8 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x7fb4041f9f48 <col:48, col:61> col:61 __x 'std::__1::vector<int, class std::__1::allocator<int> >::value_type &&'
|-FunctionTemplateDecl 0x7fb4041fa448 <line:705:5, line:706:70> col:18 emplace
| |-TemplateTypeParmDecl 0x7fb4041fa118 <line:705:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x7fb4041fa3b0 <line:706:9, col:70> col:18 emplace 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _Args &&...)'
|   |-ParmVarDecl 0x7fb4041fa1b0 <col:26, col:41> col:41 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   `-ParmVarDecl 0x7fb4041fa298 <col:53, col:64> col:64 __args '_Args &&...'
|-CXXMethodDecl 0x7fb4041fa750 <line:709:5, col:82> col:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fb4041fa540 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| |-ParmVarDecl 0x7fb4041fa5b0 <col:48, col:58> col:58 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fb4041fa620 <col:63, col:79> col:79 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-FunctionTemplateDecl 0x7fb4041fb1c8 <line:710:5, line:720:88> col:9 insert
| |-TemplateTypeParmDecl 0x7fb4041fa810 <line:710:15, col:21> col:21 class depth 0 index 0 _InputIterator
| `-CXXMethodDecl 0x7fb4041fb130 <line:711:9, line:720:88> col:9 insert 'typename enable_if<__is_input_iterator<_InputIterator>::value && !__is_forward_iterator<_InputIterator>::value && is_constructible<value_type, typename iterator_traits<_InputIterator>::reference>::value, iterator>::type (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _InputIterator, _InputIterator)'
|   |-ParmVarDecl 0x7fb4041faf10 <col:16, col:31> col:31 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   |-ParmVarDecl 0x7fb4041faf80 <col:43, col:58> col:58 __first '_InputIterator'
|   `-ParmVarDecl 0x7fb4041faff0 <col:67, col:82> col:82 __last '_InputIterator'
|-FunctionTemplateDecl 0x7fb4041fbb38 <line:721:5, line:730:92> col:9 insert
| |-TemplateTypeParmDecl 0x7fb4041fb2b8 <line:721:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fb4041fbaa0 <line:722:9, line:730:92> col:9 insert 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value && is_constructible<value_type, typename iterator_traits<_ForwardIterator>::reference>::value, iterator>::type (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, _ForwardIterator, _ForwardIterator)'
|   |-ParmVarDecl 0x7fb4041fb880 <col:16, col:31> col:31 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|   |-ParmVarDecl 0x7fb4041fb8f0 <col:43, col:60> col:60 __first '_ForwardIterator'
|   `-ParmVarDecl 0x7fb4041fb960 <col:69, col:86> col:86 __last '_ForwardIterator'
|-CXXMethodDecl 0x7fb4041fbe40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:735:62> line:734:14 insert 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>)'
| |-ParmVarDecl 0x7fb4041fbc38 <col:21, col:36> col:36 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| |-ParmVarDecl 0x7fb4041fbd28 <col:48, col:77> col:77 __il 'initializer_list<std::__1::vector<int, class std::__1::allocator<int> >::value_type>':'class std::initializer_list<int>'
| `-AlwaysInlineAttr 0x7fb4041fbef8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041fc050 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:738:71> col:40 erase 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator)'
| |-ParmVarDecl 0x7fb4041fbf50 <col:46, col:61> col:61 __position 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-AlwaysInlineAttr 0x7fb4041fc100 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041fc2e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:739:5, col:65> col:14 erase 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_iterator, std::__1::vector<int, class std::__1::allocator<int> >::const_iterator)'
| |-ParmVarDecl 0x7fb4041fc158 <col:20, col:35> col:35 __first 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
| `-ParmVarDecl 0x7fb4041fc1c8 <col:44, col:59> col:59 __last 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator':'class std::__1::__wrap_iter<const int *>'
|-CXXMethodDecl 0x7fb4041fc398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:748:5> line:742:10 clear 'void (void) noexcept'
| `-AlwaysInlineAttr 0x7fb4041fc440 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041fc520 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:750:5, col:31> col:10 resize 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fb4041fc498 <col:17, col:27> col:27 __sz 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fb4041fc6e0 <line:751:5, col:52> col:10 resize 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fb4041fc5e0 <col:17, col:27> col:27 __sz 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fb4041fc650 <col:33, col:49> col:49 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7fb4041fc8b8 <line:753:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:753:10 swap 'void (class std::__1::vector<int, class std::__1::allocator<int> > &) noexcept'
| `-ParmVarDecl 0x7fb4041fc7a8 <col:15, col:21> col:22 'class std::__1::vector<int, class std::__1::allocator<int> > &'
|-CXXMethodDecl 0x7fb4041fc968 <line:761:5, col:25> col:10 __invariants '_Bool (void) const'
|-AccessSpecDecl 0x7fb4041fca10 <line:772:1, col:8> col:1 private
|-CXXMethodDecl 0x7fb4041fca38 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:773:63> col:36 __invalidate_all_iterators 'void (void)'
| `-AlwaysInlineAttr 0x7fb4041fcae0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041fcc00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:774:82> col:36 __invalidate_iterators_past 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x7fb4041fcb38 <col:64, col:72> col:72 __new_last 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7fb4041fccb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041fcd90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:775:5, col:32> col:10 allocate 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fb4041fcd08 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fb4041fce40 <line:776:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:776:10 deallocate 'void (void) noexcept'
|-CXXMethodDecl 0x7fb4041fcfc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:777:75> col:41 __recommend 'std::__1::vector<int, class std::__1::allocator<int> >::size_type (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fb4041fcef8 <col:53, col:63> col:63 __new_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fb4041fd070 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041fd150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:778:5, col:42> col:10 __construct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fb4041fd0c8 <col:29, col:39> col:39 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fb4041fd310 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:780:63> col:10 __construct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fb4041fd210 <col:29, col:39> col:39 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| |-ParmVarDecl 0x7fb4041fd280 <col:44, col:60> col:60 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
| `-AlwaysInlineAttr 0x7fb4041fd3c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-FunctionTemplateDecl 0x7fb4041fd948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:781:5, line:787:92> col:9 __construct_at_end
| |-TemplateTypeParmDecl 0x7fb4041fd410 <line:781:15, col:21> col:21 class depth 0 index 0 _ForwardIterator
| `-CXXMethodDecl 0x7fb4041fd8b0 <line:782:9, line:787:92> col:9 __construct_at_end 'typename enable_if<__is_forward_iterator<_ForwardIterator>::value, void>::type (_ForwardIterator, _ForwardIterator, std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
|   |-ParmVarDecl 0x7fb4041fd690 <col:28, col:45> col:45 __first '_ForwardIterator'
|   |-ParmVarDecl 0x7fb4041fd700 <col:54, col:71> col:71 __last '_ForwardIterator'
|   `-ParmVarDecl 0x7fb4041fd770 <col:79, col:89> col:89 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fb4041fdad0 <line:788:5, col:32> col:10 __append 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| `-ParmVarDecl 0x7fb4041fda48 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
|-CXXMethodDecl 0x7fb4041fdc90 <line:789:5, col:53> col:10 __append 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type, std::__1::vector<int, class std::__1::allocator<int> >::const_reference)'
| |-ParmVarDecl 0x7fb4041fdb90 <col:19, col:29> col:29 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-ParmVarDecl 0x7fb4041fdc00 <col:34, col:50> col:50 __x 'std::__1::vector<int, class std::__1::allocator<int> >::const_reference':'const std::__1::__vector_base<int, class std::__1::allocator<int> >::value_type &'
|-CXXMethodDecl 0x7fb4041fde68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:791:20 __make_iter 'std::__1::vector<int, class std::__1::allocator<int> >::iterator (std::__1::vector<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x7fb4041fdd58 <col:32, col:40> col:40 __p 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7fb4041fdf18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041fe078 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:793:20 __make_iter 'std::__1::vector<int, class std::__1::allocator<int> >::const_iterator (std::__1::vector<int, class std::__1::allocator<int> >::const_pointer) const noexcept'
| |-ParmVarDecl 0x7fb4041fdf70 <col:32, col:46> col:46 __p 'std::__1::vector<int, class std::__1::allocator<int> >::const_pointer':'const int *'
| `-AlwaysInlineAttr 0x7fb4041fe128 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041fe4f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:794:5, col:85> col:10 __swap_out_circular_buffer 'void (__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &)'
| `-ParmVarDecl 0x7fb4041fe3e8 <col:37, col:82> col:82 __v '__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &'
|-CXXMethodDecl 0x7fb4041fe820 <line:795:5, col:101> col:13 __swap_out_circular_buffer 'std::__1::vector<int, class std::__1::allocator<int> >::pointer (__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &, std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x7fb4041fe698 <col:40, col:85> col:85 __v '__split_buffer<std::__1::vector<int, class std::__1::allocator<int> >::value_type, std::__1::vector<int, class std::__1::allocator<int> >::allocator_type &> &'
| `-ParmVarDecl 0x7fb4041fe708 <col:90, col:98> col:98 __p 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|-CXXMethodDecl 0x7fb4041feb00 <line:796:5, col:71> col:10 __move_range 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer, std::__1::vector<int, class std::__1::allocator<int> >::pointer, std::__1::vector<int, class std::__1::allocator<int> >::pointer)'
| |-ParmVarDecl 0x7fb4041fe8e8 <col:23, col:31> col:31 __from_s 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| |-ParmVarDecl 0x7fb4041fe958 <col:41, col:49> col:49 __from_e 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-ParmVarDecl 0x7fb4041fe9c8 <col:59, col:67> col:67 __to 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
|-CXXMethodDecl 0x7fb4041fed50 <line:797:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:797:10 __move_assign 'void (class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::true_type)' noexcept-uninstantiated 0x7fb40133ea98
| |-ParmVarDecl 0x7fb4041febd0 <col:24, col:32> col:32 __c 'class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x7fb4041fec30 <col:37> col:46 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
|-CXXMethodDecl 0x7fb4041feff0 <line:799:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:799:10 __move_assign 'void (class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::false_type)' noexcept-uninstantiated 0x7fb40133ecd8
| |-ParmVarDecl 0x7fb4041fee70 <col:24, col:32> col:32 __c 'class std::__1::vector<int, class std::__1::allocator<int> > &'
| `-ParmVarDecl 0x7fb4041feed0 <col:37> col:47 'std::__1::false_type':'struct std::__1::integral_constant<_Bool, false>'
|-CXXMethodDecl 0x7fb4041ff1d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:808:5> line:802:10 __destruct_at_end 'void (std::__1::vector<int, class std::__1::allocator<int> >::pointer) noexcept'
| |-ParmVarDecl 0x7fb4041ff110 <col:28, col:36> col:36 __new_last 'std::__1::vector<int, class std::__1::allocator<int> >::pointer':'int *'
| `-AlwaysInlineAttr 0x7fb4041ff288 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fb4041ff4e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:811:5, col:62> col:31 __push_back_slow_path
| |-TemplateTypeParmDecl 0x7fb4041ff2d0 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXMethodDecl 0x7fb4041ff450 <col:26, col:62> col:31 __push_back_slow_path 'void (_Up &&)'
|   `-ParmVarDecl 0x7fb4041ff388 <col:53, col:59> col:59 __x '_Up &&'
|-FunctionTemplateDecl 0x7fb4041ff838 <line:813:5, line:814:52> col:10 __emplace_back_slow_path
| |-TemplateTypeParmDecl 0x7fb4041ff5c8 <line:813:15, col:24> col:24 class depth 0 index 0 ... _Args
| `-CXXMethodDecl 0x7fb4041ff7a0 <line:814:5, col:52> col:10 __emplace_back_slow_path 'void (_Args &&...)'
|   `-ParmVarDecl 0x7fb4041ff6d8 <col:35, col:46> col:46 __args '_Args &&...'
|-CXXMethodDecl 0x7fb4041ffad8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:835:62> line:834:10 __annotate_contiguous_container 'void (const void *, const void *, const void *, const void *) const'
| |-ParmVarDecl 0x7fb4041ff918 <col:42, col:52> col:53 'const void *'
| |-ParmVarDecl 0x7fb4041ff978 <col:55, col:65> col:66 'const void *'
| |-ParmVarDecl 0x7fb4041ff9d8 <col:68, col:78> col:79 'const void *'
| |-ParmVarDecl 0x7fb4041ffa38 <line:835:42, col:52> col:53 'const void *'
| `-AlwaysInlineAttr 0x7fb4041ffba0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041ffd00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:841:5> line:838:10 __annotate_new 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fb4041ffbf8 <col:25, col:35> col:35 __current_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fb4041ffdb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4041ffdf8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:847:5> line:844:10 __annotate_delete 'void (void) const'
| `-AlwaysInlineAttr 0x7fb4041ffea0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb404200c00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:854:5> line:850:10 __annotate_increase 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fb4041ffef8 <col:30, col:40> col:40 __n 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fb404200cb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb404200d90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:861:5> line:857:10 __annotate_shrink 'void (std::__1::vector<int, class std::__1::allocator<int> >::size_type) const'
| |-ParmVarDecl 0x7fb404200d08 <col:28, col:38> col:38 __old_size 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long'
| `-AlwaysInlineAttr 0x7fb404200e40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXRecordDecl 0x7fb404200e88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:880:5, col:12> col:12 struct __RAII_IncreaseAnnotator
`-CXXDestructorDecl 0x7fb404200f70 <line:454:28> col:28 implicit used ~vector 'void (void) noexcept' inline default
  `-CompoundStmt 0x7fb404202ca8 <col:28>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::vector" = type { %"class.std::__1::__vector_base" }
  NonVirtualBaseLLVMType:%"class.std::__1::vector" = type { %"class.std::__1::__vector_base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__atomic_base<_Bool, false>
         0 |   _Atomic(_Bool) __a_
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::atomic<_Bool>
         0 |   struct std::__1::__atomic_base<_Bool, false> (base)
         0 |     _Atomic(_Bool) __a_
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb4042049b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:890:1, line:993:1> line:891:8 struct __atomic_base definition
|-TemplateArgument type '_Bool'
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7fb404204bf0 prev 0x7fb4042049b8 <col:1, col:8> col:8 implicit struct __atomic_base
|-FieldDecl 0x7fb404204cd0 <line:893:5, col:26> col:26 __a_ '_Atomic(_Bool)' mutable
|-CXXMethodDecl 0x7fb404204d18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:907:5> line:900:10 is_lock_free '_Bool (void) const volatile noexcept'
| `-AlwaysInlineAttr 0x7fb404204de8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb404204e30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:910:82> line:909:10 is_lock_free '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb404204ed8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4042050a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:914:46> line:912:10 store 'void (_Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fb404204f30 <col:16, col:20> col:20 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb404204f90 <col:25, col:44> col:38 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fb404205160 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fb404206140 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fb4042050a8 'store' 'void (_Bool, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7fb404206118 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:913:40, line:566:35> '_Bool' '||'
|     |-BinaryOperator 0x7fb404205bd8 <line:913:40, line:565:35> '_Bool' '||'
|     | |-BinaryOperator 0x7fb404205698 <line:913:40, line:564:35> '_Bool' '=='
|     | | |-ImplicitCastExpr 0x7fb404205668 <line:913:40> 'int' <IntegralCast>
|     | | | `-ImplicitCastExpr 0x7fb404205650 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | | |   `-DeclRefExpr 0x7fb4042051a8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb404204f90 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | | `-ImplicitCastExpr 0x7fb404205680 <line:564:35> 'int' <IntegralCast>
|     | |   `-DeclRefExpr 0x7fb402005cd8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb401800b38 'memory_order_consume' 'enum std::__1::memory_order'
|     | `-BinaryOperator 0x7fb404205bb0 <line:913:40, line:565:35> '_Bool' '=='
|     |   |-ImplicitCastExpr 0x7fb404205b80 <line:913:40> 'int' <IntegralCast>
|     |   | `-ImplicitCastExpr 0x7fb404205b68 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     |   |   `-DeclRefExpr 0x7fb4042056c0 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb404204f90 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     |   `-ImplicitCastExpr 0x7fb404205b98 <line:565:35> 'int' <IntegralCast>
|     |     `-DeclRefExpr 0x7fb402005d98 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb401800b80 'memory_order_acquire' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fb4042060f0 <line:913:40, line:566:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fb4042060c0 <line:913:40> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fb4042060a8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb404205c00 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb404204f90 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fb4042060d8 <line:566:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fb402005e80 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb401800c10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fb404206338 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:918:46> line:916:10 store 'void (_Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fb4042061c0 <col:16, col:20> col:20 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb404206220 <col:25, col:44> col:38 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fb4042063f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fb4042073d0 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fb404206338 'store' 'void (_Bool, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7fb4042073a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:917:40, line:566:35> '_Bool' '||'
|     |-BinaryOperator 0x7fb404206e68 <line:917:40, line:565:35> '_Bool' '||'
|     | |-BinaryOperator 0x7fb404206928 <line:917:40, line:564:35> '_Bool' '=='
|     | | |-ImplicitCastExpr 0x7fb4042068f8 <line:917:40> 'int' <IntegralCast>
|     | | | `-ImplicitCastExpr 0x7fb4042068e0 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | | |   `-DeclRefExpr 0x7fb404206438 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb404206220 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | | `-ImplicitCastExpr 0x7fb404206910 <line:564:35> 'int' <IntegralCast>
|     | |   `-DeclRefExpr 0x7fb4020060e0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb401800b38 'memory_order_consume' 'enum std::__1::memory_order'
|     | `-BinaryOperator 0x7fb404206e40 <line:917:40, line:565:35> '_Bool' '=='
|     |   |-ImplicitCastExpr 0x7fb404206e10 <line:917:40> 'int' <IntegralCast>
|     |   | `-ImplicitCastExpr 0x7fb404206df8 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     |   |   `-DeclRefExpr 0x7fb404206950 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb404206220 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     |   `-ImplicitCastExpr 0x7fb404206e28 <line:565:35> 'int' <IntegralCast>
|     |     `-DeclRefExpr 0x7fb4020061a0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb401800b80 'memory_order_acquire' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fb404207380 <line:917:40, line:566:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fb404207350 <line:917:40> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fb404207338 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb404206e90 <col:40> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb404206220 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fb404207368 <line:566:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fb402006288 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb401800c10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fb404207548 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:922:47> line:920:9 load '_Bool (std::__1::memory_order) const volatile noexcept'
| |-ParmVarDecl 0x7fb404207440 <col:14, col:33> col:27 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fb4042075f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fb404208098 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fb404207548 'load' '_Bool (std::__1::memory_order) const volatile noexcept'
|   `-BinaryOperator 0x7fb404208070 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:921:39, line:571:35> '_Bool' '||'
|     |-BinaryOperator 0x7fb404207b30 <line:921:39, line:570:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fb404207b00 <line:921:39> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fb404207ae8 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fb404207640 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb404207440 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fb404207b18 <line:570:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fb402006470 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb401800bc8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fb404208048 <line:921:39, line:571:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fb404208018 <line:921:39> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fb404208000 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb404207b58 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb404207440 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fb404208030 <line:571:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fb402006530 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb401800c10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fb404208218 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:926:47> line:924:9 load '_Bool (std::__1::memory_order) const noexcept'
| |-ParmVarDecl 0x7fb404208108 <col:14, col:33> col:27 used __m 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fb4042082c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fb404208d68 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fb404208218 'load' '_Bool (std::__1::memory_order) const noexcept'
|   `-BinaryOperator 0x7fb404208d40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:925:39, line:571:35> '_Bool' '||'
|     |-BinaryOperator 0x7fb404208800 <line:925:39, line:570:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fb4042087d0 <line:925:39> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fb4042087b8 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fb404208310 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb404208108 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fb4042087e8 <line:570:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fb402006718 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb401800bc8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fb404208d18 <line:925:39, line:571:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fb404208ce8 <line:925:39> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fb404208cd0 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb404208828 <col:39> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb404208108 '__m' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fb404208d00 <line:571:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fb4020067d8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb401800c10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXConversionDecl 0x7fb404208e48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:928:60> col:5 operator bool '_Bool (void) const volatile noexcept'
| `-AlwaysInlineAttr 0x7fb404208ef0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConversionDecl 0x7fb404208fa8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:930:60> col:5 operator bool '_Bool (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb404209050 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb404209238 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:933:56> line:932:9 exchange '_Bool (_Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fb4042090b8 <col:18, col:22> col:22 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb404209118 <col:27, col:46> col:40 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fb4042092f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb4042094c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:936:56> line:935:9 exchange '_Bool (_Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fb404209348 <col:18, col:22> col:22 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb4042093a8 <col:27, col:46> col:40 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fb404209580 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb404209888 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:941:80> line:938:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fb404209608 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7fb404209678 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb4042096d8 <line:939:32, col:45> col:45 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fb404209738 <col:50, col:63> col:63 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fb404209950 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fb40420a3f0 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fb404209888 'compare_exchange_weak' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7fb40420a3c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:940:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fb404209e88 <line:940:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fb404209e58 <line:940:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fb404209e40 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fb404209998 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb404209738 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fb404209e70 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fb40200e9c0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb401800bc8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fb40420a3a0 <line:940:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fb40420a370 <line:940:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fb40420a358 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb404209eb0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb404209738 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fb40420a388 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fb40200ea80 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb401800c10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fb40420a6e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:946:80> line:943:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fb40420a470 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7fb40420a4e0 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb40420a540 <line:944:32, col:45> col:45 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fb40420a5a0 <col:50, col:63> col:63 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fb40420a7b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fb40420b250 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fb40420a6e8 'compare_exchange_weak' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7fb40420b228 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:945:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fb40420ace8 <line:945:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fb40420acb8 <line:945:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fb40420aca0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fb40420a7f8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb40420a5a0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fb40420acd0 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fb40200ec68 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb401800bc8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fb40420b200 <line:945:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fb40420b1d0 <line:945:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fb40420b1b8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb40420ad10 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb40420a5a0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fb40420b1e8 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fb40200ed28 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb401800c10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fb40420b4a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:951:82> line:948:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fb40420b2d0 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7fb40420b340 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb40420b3a0 <line:949:34, col:47> col:47 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fb40420b400 <col:52, col:65> col:65 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fb40420b570 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fb40420c010 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fb40420b4a8 'compare_exchange_strong' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) volatile noexcept'
|   `-BinaryOperator 0x7fb40420bfe8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:950:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fb40420baa8 <line:950:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fb40420ba78 <line:950:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fb40420ba60 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fb40420b5b8 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb40420b400 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fb40420ba90 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fb40200ef10 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb401800bc8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fb40420bfc0 <line:950:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fb40420bf90 <line:950:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fb40420bf78 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb40420bad0 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb40420b400 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fb40420bfa8 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fb40200efd0 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb401800c10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fb40420c268 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:956:82> line:953:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fb40420c090 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7fb40420c100 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb40420c160 <line:954:34, col:47> col:47 __s 'std::__1::memory_order':'enum std::__1::memory_order'
| |-ParmVarDecl 0x7fb40420c1c0 <col:52, col:65> col:65 used __f 'std::__1::memory_order':'enum std::__1::memory_order'
| |-AlwaysInlineAttr 0x7fb40420c330 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-DiagnoseIfAttr 0x7fb40420cdd0 <line:1097:20> "memory order argument to atomic operation is invalid" DT_Warning ArgDependent CXXMethod 0x7fb40420c268 'compare_exchange_strong' '_Bool (_Bool &, _Bool, std::__1::memory_order, std::__1::memory_order) noexcept'
|   `-BinaryOperator 0x7fb40420cda8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:955:48, line:576:35> '_Bool' '||'
|     |-BinaryOperator 0x7fb40420c868 <line:955:48, line:575:35> '_Bool' '=='
|     | |-ImplicitCastExpr 0x7fb40420c838 <line:955:48> 'int' <IntegralCast>
|     | | `-ImplicitCastExpr 0x7fb40420c820 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|     | |   `-DeclRefExpr 0x7fb40420c378 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb40420c1c0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|     | `-ImplicitCastExpr 0x7fb40420c850 <line:575:35> 'int' <IntegralCast>
|     |   `-DeclRefExpr 0x7fb40200f1b8 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb401800bc8 'memory_order_release' 'enum std::__1::memory_order'
|     `-BinaryOperator 0x7fb40420cd80 <line:955:48, line:576:35> '_Bool' '=='
|       |-ImplicitCastExpr 0x7fb40420cd50 <line:955:48> 'int' <IntegralCast>
|       | `-ImplicitCastExpr 0x7fb40420cd38 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' <LValueToRValue>
|       |   `-DeclRefExpr 0x7fb40420c890 <col:48> 'std::__1::memory_order':'enum std::__1::memory_order' lvalue ParmVar 0x7fb40420c1c0 '__f' 'std::__1::memory_order':'enum std::__1::memory_order'
|       `-ImplicitCastExpr 0x7fb40420cd68 <line:576:35> 'int' <IntegralCast>
|         `-DeclRefExpr 0x7fb40200f278 <col:35> 'enum std::__1::memory_order' EnumConstant 0x7fb401800c10 'memory_order_acq_rel' 'enum std::__1::memory_order'
|-CXXMethodDecl 0x7fb40420d058 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:960:80> line:958:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fb40420ce50 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7fb40420cec0 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb40420cf20 <line:959:31, col:50> col:44 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fb40420d118 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb40420d378 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:964:80> line:962:10 compare_exchange_weak '_Bool (_Bool &, _Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fb40420d170 <col:32, col:37> col:37 __e '_Bool &'
| |-ParmVarDecl 0x7fb40420d1e0 <col:42, col:46> col:46 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb40420d240 <line:963:32, col:51> col:45 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fb40420d438 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb40420d600 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:968:82> line:966:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order) volatile noexcept'
| |-ParmVarDecl 0x7fb40420d490 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7fb40420d500 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb40420d560 <line:967:31, col:50> col:44 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fb40420d6c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb40420d888 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:972:82> line:970:10 compare_exchange_strong '_Bool (_Bool &, _Bool, std::__1::memory_order) noexcept'
| |-ParmVarDecl 0x7fb40420d718 <col:34, col:39> col:39 __e '_Bool &'
| |-ParmVarDecl 0x7fb40420d788 <col:44, col:48> col:48 __d '_Bool':'_Bool'
| |-ParmVarDecl 0x7fb40420d7e8 <line:971:34, col:53> col:47 __m 'std::__1::memory_order':'enum std::__1::memory_order'
| `-AlwaysInlineAttr 0x7fb40420d948 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fb40420d9d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:976:39> col:5 __atomic_base 'void (void) noexcept' default trivial
| `-AlwaysInlineAttr 0x7fb40420da88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fb40420dbc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:982:69> col:23 used constexpr __atomic_base 'void (_Bool) noexcept'
| |-ParmVarDecl 0x7fb40420dae0 <col:37, col:41> col:41 used __d '_Bool':'_Bool'
| |-CXXCtorInitializer Field 0x7fb404204cd0 '__a_' '_Atomic(_Bool)'
| | `-ImplicitCastExpr 0x7fb40420f6e8 <col:63> '_Atomic(_Bool)' <NonAtomicToAtomic>
| |   `-ImplicitCastExpr 0x7fb40420f6d0 <col:63> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7fb40420f678 <col:63> '_Bool':'_Bool' lvalue ParmVar 0x7fb40420dae0 '__d' '_Bool':'_Bool'
| |-CompoundStmt 0x7fb4008ac9d8 <col:68, col:69>
| `-AlwaysInlineAttr 0x7fb40420dc88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fb40420ddf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:984:5, col:48> col:5 __atomic_base 'void (const struct std::__1::__atomic_base<_Bool, false> &)' delete trivial
| `-ParmVarDecl 0x7fb40420dd08 <col:19, col:38> col:39 'const struct std::__1::__atomic_base<_Bool, false> &'
|-CXXMethodDecl 0x7fb40420dfb0 <line:985:5, col:59> col:20 operator= 'struct std::__1::__atomic_base<_Bool, false> &(const struct std::__1::__atomic_base<_Bool, false> &)' delete trivial
| `-ParmVarDecl 0x7fb40420dee8 <col:30, col:49> col:50 'const struct std::__1::__atomic_base<_Bool, false> &'
|-CXXMethodDecl 0x7fb40420e130 <line:986:5, col:68> col:20 operator= 'struct std::__1::__atomic_base<_Bool, false> &(const struct std::__1::__atomic_base<_Bool, false> &) volatile' delete trivial
| `-ParmVarDecl 0x7fb40420e070 <col:30, col:49> col:50 'const struct std::__1::__atomic_base<_Bool, false> &'
`-CXXDestructorDecl 0x7fb40420f4f8 <line:891:8> col:8 implicit ~__atomic_base 'void (void)' inline default trivial noexcept-unevaluated 0x7fb40420f4f8

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__atomic_base" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__atomic_base" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb40117a0a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1083:1, line:1099:1> line:1084:8 struct atomic definition
|-public '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>'
|-TemplateArgument type '_Bool'
|-CXXRecordDecl 0x7fb40420e268 prev 0x7fb40117a0a8 <col:1, col:8> col:8 implicit struct atomic
|-TypedefDecl 0x7fb40420e608 <line:1087:5, col:32> col:32 __base '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>'
| `-TemplateSpecializationType 0x7fb40420e590 '__atomic_base<_Bool>' sugar __atomic_base
|   |-TemplateArgument type '_Bool':'_Bool'
|   `-RecordType 0x7fb404204ac0 'struct std::__1::__atomic_base<_Bool, false>'
|     `-ClassTemplateSpecialization 0x7fb4042049b8 '__atomic_base'
|-CXXConstructorDecl 0x7fb40420e6a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, line:818:33> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1089:5 atomic 'void (void)' default trivial noexcept-unevaluated 0x7fb40420e6a0
| `-AlwaysInlineAttr 0x7fb40420e788 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fb40420e8c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1091:64> col:23 used constexpr atomic 'void (_Bool) noexcept'
| |-ParmVarDecl 0x7fb40420e7e0 <col:30, col:34> col:34 used __d '_Bool':'_Bool'
| |-CXXCtorInitializer 'std::__1::atomic<_Bool>::__base':'struct std::__1::__atomic_base<_Bool, false>'
| | `-CXXConstructExpr 0x7fb40420f730 <col:51, col:61> '__atomic_base<_Bool>':'struct std::__1::__atomic_base<_Bool, false>' 'void (_Bool) noexcept'
| |   `-ImplicitCastExpr 0x7fb40420f660 <col:58> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7fb40420f5d8 <col:58> '_Bool':'_Bool' lvalue ParmVar 0x7fb40420e7e0 '__d' '_Bool':'_Bool'
| |-CompoundStmt 0x7fb401807d00 <col:63, col:64>
| `-AlwaysInlineAttr 0x7fb40420e988 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb40420eae8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1095:41> line:1094:9 operator= '_Bool (_Bool) volatile noexcept'
| |-ParmVarDecl 0x7fb40420e9e0 <col:19, col:23> col:23 __d '_Bool':'_Bool'
| `-AlwaysInlineAttr 0x7fb40420eb98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb40420ecf8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1098:41> line:1097:9 operator= '_Bool (_Bool) noexcept'
| |-ParmVarDecl 0x7fb40420ebf0 <col:19, col:23> col:23 __d '_Bool':'_Bool'
| `-AlwaysInlineAttr 0x7fb40420eda8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fb40420ee18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/atomic:1084:8> col:8 implicit atomic 'void (const struct std::__1::atomic<_Bool> &)' inline default_delete trivial noexcept-unevaluated 0x7fb40420ee18
| `-ParmVarDecl 0x7fb40420ef40 <col:8> col:8 'const struct std::__1::atomic<_Bool> &'
|-CXXConstructorDecl 0x7fb40420efd8 <col:8> col:8 implicit atomic 'void (struct std::__1::atomic<_Bool> &&)' inline default_delete trivial noexcept-unevaluated 0x7fb40420efd8
| `-ParmVarDecl 0x7fb40420f100 <col:8> col:8 'struct std::__1::atomic<_Bool> &&'
|-CXXMethodDecl 0x7fb40420f198 <col:8, <invalid sloc>> col:8 implicit operator= 'struct std::__1::atomic<_Bool> &(const struct std::__1::atomic<_Bool> &)' inline default_delete trivial noexcept-unevaluated 0x7fb40420f198
| `-ParmVarDecl 0x7fb40420f2b0 <col:8> col:8 'const struct std::__1::atomic<_Bool> &'
`-CXXMethodDecl 0x7fb40420f318 <col:8, <invalid sloc>> col:8 implicit operator= 'struct std::__1::atomic<_Bool> &(struct std::__1::atomic<_Bool> &&)' inline default_delete trivial noexcept-unevaluated 0x7fb40420f318
  `-ParmVarDecl 0x7fb40420f430 <col:8> col:8 'struct std::__1::atomic<_Bool> &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::atomic" = type { %"struct.std::__1::__atomic_base" }
  NonVirtualBaseLLVMType:%"struct.std::__1::atomic" = type { %"struct.std::__1::__atomic_base" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::thread
         0 |   std::__1::__libcpp_thread_t __t_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_t
         0 |   long __sig
         8 |   struct __darwin_pthread_handler_rec * __cleanup_stack
        16 |   char [8176] __opaque
           | [sizeof=8192, dsize=8192, align=8,
           |  nvsize=8192, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __darwin_pthread_handler_rec
         0 |   void (*)(void *) __routine
         8 |   void * __arg
        16 |   struct __darwin_pthread_handler_rec * __next
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fb401021d60 </usr/include/sys/_pthread/_pthread_types.h:57:1, line:61:1> line:57:8 struct __darwin_pthread_handler_rec definition
|-CXXRecordDecl 0x7fb401021e88 <col:1, col:8> col:8 implicit struct __darwin_pthread_handler_rec
|-FieldDecl 0x7fb4010220d0 <line:58:2, col:26> col:9 __routine 'void (*)(void *)'
|-FieldDecl 0x7fb401022130 <line:59:2, col:8> col:8 __arg 'void *'
`-FieldDecl 0x7fb401022200 <line:60:2, col:39> col:39 __next 'struct __darwin_pthread_handler_rec *'

Layout: <CGRecordLayout
  LLVMType:%struct.__darwin_pthread_handler_rec = type { void (i8*)*, i8*, %struct.__darwin_pthread_handler_rec* }
  NonVirtualBaseLLVMType:%struct.__darwin_pthread_handler_rec = type { void (i8*)*, i8*, %struct.__darwin_pthread_handler_rec* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fb401027660 </usr/include/sys/_pthread/_pthread_types.h:103:1, line:107:1> line:103:8 struct _opaque_pthread_t definition
|-CXXRecordDecl 0x7fb401027788 <col:1, col:8> col:8 implicit struct _opaque_pthread_t
|-FieldDecl 0x7fb401027838 <line:104:2, col:7> col:7 __sig 'long'
|-FieldDecl 0x7fb4010278a8 <line:105:2, col:40> col:40 __cleanup_stack 'struct __darwin_pthread_handler_rec *'
`-FieldDecl 0x7fb401027968 <line:106:2, col:32> col:7 __opaque 'char [8176]'

Layout: <CGRecordLayout
  LLVMType:%struct._opaque_pthread_t = type { i64, %struct.__darwin_pthread_handler_rec*, [8176 x i8] }
  NonVirtualBaseLLVMType:%struct._opaque_pthread_t = type { i64, %struct.__darwin_pthread_handler_rec*, [8176 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fb4018c2378 prev 0x7fb4018ba310 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:285:1, line:333:1> line:285:24 referenced class thread definition
|-VisibilityAttr 0x7fb4018c2478 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:669:46, col:70> Default
|-CXXRecordDecl 0x7fb4018c24c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:285:1, col:24> col:24 implicit referenced class thread
|-FieldDecl 0x7fb4018c2568 <line:287:5, col:23> col:23 referenced __t_ 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
|-CXXConstructorDecl 0x7fb4018c2700 <line:289:5, col:25> col:5 thread 'void (const class std::__1::thread &)'
| `-ParmVarDecl 0x7fb4018c25e8 <col:12, col:24> col:25 'const class std::__1::thread &'
|-CXXMethodDecl 0x7fb4018c28b0 <line:290:5, col:36> col:13 operator= 'class std::__1::thread &(const class std::__1::thread &)'
| `-ParmVarDecl 0x7fb4018c27c0 <col:23, col:35> col:36 'const class std::__1::thread &'
|-AccessSpecDecl 0x7fb4018c2950 <line:291:1, col:7> col:1 public
|-TypedefDecl 0x7fb4018c2988 <line:292:5, col:25> col:25 referenced id 'class std::__1::__thread_id'
| `-RecordType 0x7fb4018b7f50 'class std::__1::__thread_id'
|   `-CXXRecord 0x7fb4018b83e8 '__thread_id'
|-TypedefDecl 0x7fb4018c29f0 <line:293:5, col:31> col:31 referenced native_handle_type 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| `-TypedefType 0x7fb400dec310 'std::__1::__libcpp_thread_t' sugar
|   |-Typedef 0x7fb400de9be0 '__libcpp_thread_t'
|   `-TypedefType 0x7fb400dac690 'pthread_t' sugar
|     |-Typedef 0x7fb400daacd0 'pthread_t'
|     `-TypedefType 0x7fb400daaca0 '__darwin_pthread_t' sugar
|       |-Typedef 0x7fb401029080 '__darwin_pthread_t'
|       `-PointerType 0x7fb401029030 'struct _opaque_pthread_t *'
|         `-ElaboratedType 0x7fb401027fc0 'struct _opaque_pthread_t' sugar
|           `-RecordType 0x7fb401027700 'struct _opaque_pthread_t'
|             `-CXXRecord 0x7fb401027660 '_opaque_pthread_t'
|-CXXConstructorDecl 0x7fb4018c2aa0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:296:53> col:5 thread 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7fb4018c2568 '__t_' 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| | `-ImplicitCastExpr 0x7fb4018c4528 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__threading_support:73:29> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <NullToPointer>
| |   `-IntegerLiteral 0x7fb4018c44d8 <col:29> 'unsigned int' 0
| |-CompoundStmt 0x7fb4018c4570 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:296:52, col:53>
| |-AlwaysInlineAttr 0x7fb4018c2b48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fb4018c2b90 <col:51, col:74> Hidden
|-FunctionTemplateDecl 0x7fb4018c34b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:298:5, line:305:53> col:18 thread
| |-TemplateTypeParmDecl 0x7fb4018c2ba0 <line:298:15, col:21> col:21 referenced class depth 0 index 0 _Fp
| |-TemplateTypeParmDecl 0x7fb4018c2c08 <col:26, col:35> col:35 referenced class depth 0 index 1 ... _Args
| |-TemplateTypeParmDecl 0x7fb4018c3120 <line:299:15, line:302:18> line:299:15 class depth 0 index 2
| | `-TemplateArgument type 'typename enable_if<!is_same<typename decay<_Fp>::type, class thread>::value>::type'
| |-CXXConstructorDecl 0x7fb4018c3410 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:653:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:305:53> col:18 thread 'void (_Fp &&, _Args &&...)' inline
| | |-ParmVarDecl 0x7fb4018c3218 <col:25, col:31> col:31 __f '_Fp &&'
| | |-ParmVarDecl 0x7fb4018c32f8 <col:36, col:47> col:47 __args '_Args &&...'
| | `-VisibilityAttr 0x7fb4018c3518 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:644:40, col:63> Hidden
| `-CXXConstructorDecl 0x7fb402162020 parent 0x7fb4018c2378 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:359:1, line:373:1> line:359:9 used thread 'void (void (&&)(void))'
|   |-TemplateArgument type 'void (&)(void)'
|   |-TemplateArgument pack
|   |-TemplateArgument type 'void'
|   `-ParmVarDecl 0x7fb402161f18 <col:16, col:19> col:22 __f 'void (&&)(void)'
|-CXXDestructorDecl 0x7fb4018c35b0 <line:311:5, col:13> col:5 used ~thread 'void (void) noexcept'
|-CXXConstructorDecl 0x7fb4018c37c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:315:85> col:5 thread 'void (class std::__1::thread &&) noexcept'
| |-ParmVarDecl 0x7fb4018c36b8 <col:12, col:21> col:21 used __t 'class std::__1::thread &&'
| |-CXXCtorInitializer Field 0x7fb4018c2568 '__t_' 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *'
| | `-ImplicitCastExpr 0x7fb4018c4618 <col:43, col:47> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <LValueToRValue>
| |   `-MemberExpr 0x7fb4018c45b0 <col:43, col:47> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue .__t_ 0x7fb4018c2568
| |     `-DeclRefExpr 0x7fb4018c4588 <col:43> 'class std::__1::thread' lvalue ParmVar 0x7fb4018c36b8 '__t' 'class std::__1::thread &&'
| |-CompoundStmt 0x7fb4018c4720 <col:53, col:85>
| | `-BinaryOperator 0x7fb4018c46f8 <col:54, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__threading_support:73:29> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue '='
| |   |-MemberExpr 0x7fb4018c4688 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:315:54, col:58> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue .__t_ 0x7fb4018c2568
| |   | `-DeclRefExpr 0x7fb4018c4660 <col:54> 'class std::__1::thread' lvalue ParmVar 0x7fb4018c36b8 '__t' 'class std::__1::thread &&'
| |   `-ImplicitCastExpr 0x7fb4018c46e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__threading_support:73:29> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <NullToPointer>
| |     `-IntegerLiteral 0x7fb4018c46c0 <col:29> 'unsigned int' 0
| |-AlwaysInlineAttr 0x7fb4018c3878 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fb4018c38c0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fb4018c3a18 <col:35, line:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:317:13 operator= 'class std::__1::thread &(class std::__1::thread &&) noexcept'
| |-ParmVarDecl 0x7fb4018c3910 <col:23, col:32> col:32 __t 'class std::__1::thread &&'
| |-AlwaysInlineAttr 0x7fb4018c3ab8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fb4018c3b00 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fb4018c3c58 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:67> col:10 used swap 'void (class std::__1::thread &) noexcept'
| |-ParmVarDecl 0x7fb4018c3b50 <col:15, col:23> col:23 used __t 'class std::__1::thread &'
| |-CompoundStmt 0x7fb400e433e8 <col:38, col:67>
| | `-CallExpr 0x7fb400e433b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:65> 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type':'void'
| |   |-ImplicitCastExpr 0x7fb400e43398 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:46> 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type (*)(struct _opaque_pthread_t *&, struct _opaque_pthread_t *&) noexcept(is_nothrow_move_constructible<struct _opaque_pthread_t *>::value && is_nothrow_move_assignable<struct _opaque_pthread_t *>::value)' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7fb400e432f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:321:46> 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type (struct _opaque_pthread_t *&, struct _opaque_pthread_t *&) noexcept(is_nothrow_move_constructible<struct _opaque_pthread_t *>::value && is_nothrow_move_assignable<struct _opaque_pthread_t *>::value)' lvalue Function 0x7fb400e3fb30 'swap' 'typename enable_if<is_move_constructible<struct _opaque_pthread_t *>::value && is_move_assignable<struct _opaque_pthread_t *>::value>::type (struct _opaque_pthread_t *&, struct _opaque_pthread_t *&) noexcept(is_nothrow_move_constructible<struct _opaque_pthread_t *>::value && is_nothrow_move_assignable<struct _opaque_pthread_t *>::value)' (FunctionTemplate 0x7fb40115a6b8 'swap')
| |   |-MemberExpr 0x7fb4018c4860 <col:51> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue ->__t_ 0x7fb4018c2568
| |   | `-CXXThisExpr 0x7fb4018c4848 <col:51> 'class std::__1::thread *' this
| |   `-MemberExpr 0x7fb4018c48c0 <col:57, col:61> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue .__t_ 0x7fb4018c2568
| |     `-DeclRefExpr 0x7fb4018c4898 <col:57> 'class std::__1::thread' lvalue ParmVar 0x7fb4018c3b50 '__t' 'class std::__1::thread &'
| |-AlwaysInlineAttr 0x7fb4018c3cf8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fb4018c3d40 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fb4018c3dd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:324:76> col:10 joinable '_Bool (void) const noexcept'
| |-CompoundStmt 0x7fb400e435d8 <col:37, col:76>
| | `-ReturnStmt 0x7fb400e435c0 <col:38, col:74>
| |   `-UnaryOperator 0x7fb400e435a0 <col:45, col:74> '_Bool' prefix '!'
| |     `-CallExpr 0x7fb400e43570 <col:46, col:74> '_Bool'
| |       |-ImplicitCastExpr 0x7fb400e43558 <col:46> '_Bool (*)(const std::__1::__libcpp_thread_t *)' <FunctionToPointerDecay>
| |       | `-DeclRefExpr 0x7fb400e434d0 <col:46> '_Bool (const std::__1::__libcpp_thread_t *)' lvalue Function 0x7fb400df2a20 '__libcpp_thread_isnull' '_Bool (const std::__1::__libcpp_thread_t *)'
| |       `-UnaryOperator 0x7fb400e434b0 <col:69, col:70> 'const std::__1::__libcpp_thread_t *' prefix '&'
| |         `-MemberExpr 0x7fb400e43478 <col:70> 'const std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *const' lvalue ->__t_ 0x7fb4018c2568
| |           `-CXXThisExpr 0x7fb400e43460 <col:70> 'const class std::__1::thread *' this
| |-AlwaysInlineAttr 0x7fb4018c3e68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fb4018c3eb0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fb4018c3ee0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:325:5, col:15> col:10 used join 'void (void)'
|-CXXMethodDecl 0x7fb4018c3f98 <line:326:5, col:17> col:10 detach 'void (void)'
|-CXXMethodDecl 0x7fb4018c4108 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:328:71> col:8 get_id 'std::__1::thread::id (void) const noexcept'
| |-CompoundStmt 0x7fb400e43860 <col:33, col:71>
| | `-ReturnStmt 0x7fb400e43848 <col:34, col:69>
| |   `-ExprWithCleanups 0x7fb400e43830 <col:34, col:69> 'std::__1::thread::id':'class std::__1::__thread_id'
| |     `-CXXConstructExpr 0x7fb400e437f8 <col:34, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' 'void (class std::__1::__thread_id &&) noexcept' elidable
| |       `-MaterializeTemporaryExpr 0x7fb400e437e0 <col:41, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' xvalue
| |         `-ImplicitCastExpr 0x7fb400e437c8 <col:41, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' <ConstructorConversion>
| |           `-CXXConstructExpr 0x7fb400e43790 <col:41, col:69> 'std::__1::thread::id':'class std::__1::__thread_id' 'void (std::__1::__libcpp_thread_id)'
| |             `-CallExpr 0x7fb400e43760 <col:41, col:69> 'std::__1::__libcpp_thread_id':'struct _opaque_pthread_t *'
| |               |-ImplicitCastExpr 0x7fb400e43748 <col:41> 'std::__1::__libcpp_thread_id (*)(const std::__1::__libcpp_thread_t *)' <FunctionToPointerDecay>
| |               | `-DeclRefExpr 0x7fb400e436c0 <col:41> 'std::__1::__libcpp_thread_id (const std::__1::__libcpp_thread_t *)' lvalue Function 0x7fb400df34d8 '__libcpp_thread_get_id' 'std::__1::__libcpp_thread_id (const std::__1::__libcpp_thread_t *)'
| |               `-UnaryOperator 0x7fb400e436a0 <col:64, col:65> 'const std::__1::__libcpp_thread_t *' prefix '&'
| |                 `-MemberExpr 0x7fb400e43668 <col:65> 'const std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *const' lvalue ->__t_ 0x7fb4018c2568
| |                   `-CXXThisExpr 0x7fb400e43650 <col:65> 'const class std::__1::thread *' this
| |-AlwaysInlineAttr 0x7fb4018c41a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fb4018c41e8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7fb4018c42a8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:330:63> col:24 native_handle 'std::__1::thread::native_handle_type (void) noexcept'
| |-CompoundStmt 0x7fb400e43900 <col:50, col:63>
| | `-ReturnStmt 0x7fb400e438e8 <col:51, col:58>
| |   `-ImplicitCastExpr 0x7fb400e438d0 <col:58> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' <LValueToRValue>
| |     `-MemberExpr 0x7fb400e43898 <col:58> 'std::__1::__libcpp_thread_t':'struct _opaque_pthread_t *' lvalue ->__t_ 0x7fb4018c2568
| |       `-CXXThisExpr 0x7fb400e43880 <col:58> 'class std::__1::thread *' this
| |-AlwaysInlineAttr 0x7fb4018c4340 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-VisibilityAttr 0x7fb4018c4388 <col:51, col:74> Hidden
`-CXXMethodDecl 0x7fb4018c4400 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:332:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:758:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/thread:332:21 hardware_concurrency 'unsigned int (void) noexcept' static

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::thread" = type { %struct._opaque_pthread_t* }
  NonVirtualBaseLLVMType:%"class.std::__1::thread" = type { %struct._opaque_pthread_t* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1225:9)
         0 |   struct std::__1::_PairT __t
         0 |     size_t first
         8 |     size_t second
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1228:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__murmur2_or_cityhash<unsigned long, 64> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1190:9)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1208:9)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1303:9)
         0 |   struct _opaque_pthread_t * __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __l
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __s
         0 |       union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
         0 |     struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__raw __r
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9)
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __l
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __s
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw __r
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__rep
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:742:9) 
         0 |     struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __l
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |     struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __s
         0 |       union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:721:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__raw __r
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__split_buffer_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>
         0 |   class std::__1::allocator<int> & __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>
         0 |   struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
         0 |     int * __value_
         8 |   struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> (base)
         8 |     class std::__1::allocator<int> & __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__split_buffer<int, class std::__1::allocator<int> &>
         0 |   class std::__1::__split_buffer_common<true> (base) (empty)
         0 |   std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer __first_
         8 |   std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer __begin_
        16 |   std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer __end_
        24 |   class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> __end_cap_
        24 |     struct std::__1::__compressed_pair_elem<int *, 0, false> (base)
        24 |       int * __value_
        32 |     struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> (base)
        32 |       class std::__1::allocator<int> & __value_
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false>
         0 |   class std::__1::__thread_struct * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::default_delete<class std::__1::__thread_struct> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (empty)
         0 |   struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> >
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |     class std::__1::__thread_struct * __value_
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |     struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >
         0 |   class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |     struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |       class std::__1::__thread_struct * __value_
         0 |     struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |       struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__tuple_leaf<0, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, false>
         0 |   class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> > __value_
         0 |     class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |       struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |         class std::__1::__thread_struct * __value_
         0 |       struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |         struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__tuple_leaf<1, void (*)(void), false>
         0 |   void (*)(void) __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__tuple_impl<struct std::__1::__tuple_indices<0, 1>, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)>
         0 |   class std::__1::__tuple_leaf<0, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, false> (base)
         0 |     class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> > __value_
         0 |       class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |         struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |           class std::__1::__thread_struct * __value_
         0 |         struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |           struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
         8 |   class std::__1::__tuple_leaf<1, void (*)(void), false> (base)
         8 |     void (*)(void) __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)>
         0 |   struct std::__1::__tuple_impl<struct std::__1::__tuple_indices<0, 1>, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> __base_
         0 |     class std::__1::__tuple_leaf<0, class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, false> (base)
         0 |       class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> > __value_
         0 |         class std::__1::__compressed_pair<class std::__1::__thread_struct *, struct std::__1::default_delete<class std::__1::__thread_struct> > __ptr_
         0 |           struct std::__1::__compressed_pair_elem<class std::__1::__thread_struct *, 0, false> (base)
         0 |             class std::__1::__thread_struct * __value_
         0 |           struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::__thread_struct>, 1, true> (base) (empty)
         0 |             struct std::__1::default_delete<class std::__1::__thread_struct> (base) (empty)
         8 |     class std::__1::__tuple_leaf<1, void (*)(void), false> (base)
         8 |       void (*)(void) __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> >, 1, true> (empty)
         0 |   struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__compressed_pair_elem<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> *, 0, false>
         0 |   class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> *, struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > >
         0 |   struct std::__1::__compressed_pair_elem<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> *, 0, false> (base)
         0 |     class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> * __value_
         0 |   struct std::__1::__compressed_pair_elem<struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> >, 1, true> (base) (empty)
         0 |     struct std::__1::default_delete<class std::__1::tuple<class std::__1::unique_ptr<class std::__1::__thread_struct, struct std::__1::default_delete<class std::__1::__thread_struct> >, void (*)(void)> > (base) (empty)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::integral_constant<_Bool, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb401041208 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:503:1, line:515:1> line:504:29 struct integral_constant definition
|-TemplateArgument type '_Bool'
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7fb401043fd8 prev 0x7fb401041208 <col:1, col:29> col:29 implicit struct integral_constant
|-VarDecl 0x7fb401044080 <line:506:5, col:53> col:45 used value 'const _Bool':'const _Bool' static constexpr cinit
| `-SubstNonTypeTemplateParmExpr 0x7fb401044108 <col:53> '_Bool'
|   `-CXXBoolLiteralExpr 0x7fb4010440f0 <col:53> '_Bool' true
|-TypedefDecl 0x7fb401044198 <line:507:5, col:31> col:31 value_type '_Bool':'_Bool'
| `-SubstTemplateTypeParmType 0x7fb4010411d0 '_Bool' sugar
|   |-TemplateTypeParmType 0x7fb401040200 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fb4010401c0 '_Tp'
|   `-BuiltinType 0x7fb400833b40 '_Bool'
|-TypedefDecl 0x7fb401044200 <line:508:5, col:31> col:31 referenced type 'struct std::__1::integral_constant<_Bool, true>'
| `-RecordType 0x7fb401041310 'struct std::__1::integral_constant<_Bool, true>'
|   `-ClassTemplateSpecialization 0x7fb401041208 'integral_constant'
|-CXXConversionDecl 0x7fb4010442e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:510:79> col:27 constexpr operator bool 'std::__1::integral_constant<_Bool, true>::value_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4010443b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401044430 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:513:75> col:31 constexpr operator() 'std::__1::integral_constant<_Bool, true>::value_type (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb4010444d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fb400b4dc90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:504:29> col:29 implicit referenced constexpr integral_constant 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fb400b4dda8 <col:29> col:29 implicit constexpr integral_constant 'void (const struct std::__1::integral_constant<_Bool, true> &)' inline default trivial noexcept-unevaluated 0x7fb400b4dda8
| `-ParmVarDecl 0x7fb400b4ded0 <col:29> col:29 'const struct std::__1::integral_constant<_Bool, true> &'
|-CXXConstructorDecl 0x7fb400b4df68 <col:29> col:29 implicit used constexpr integral_constant 'void (struct std::__1::integral_constant<_Bool, true> &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7fb400b4e090 <col:29> col:29 'struct std::__1::integral_constant<_Bool, true> &&'
| `-CompoundStmt 0x7fb404250158 <col:29>
`-CXXDestructorDecl 0x7fb400b4e180 <col:29> col:29 implicit referenced ~integral_constant 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::integral_constant" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::integral_constant" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> (empty)
         0 |   struct std::__1::integral_constant<_Bool, true> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb401a1c988 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1366:1, line:1374:1> line:1367:8 struct __has_destroy definition
|-public 'integral_constant<_Bool, is_same<decltype(__has_destroy_test(declval<class allocator<int> >(), declval<int *>())), true_type>::value>':'struct std::__1::integral_constant<_Bool, true>'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-TemplateArgument type 'int *'
|-CXXRecordDecl 0x7fb401a1f878 prev 0x7fb401a1c988 <col:1, col:8> col:8 implicit struct __has_destroy
|-CXXConstructorDecl 0x7fb401a1f950 <col:8> col:8 implicit referenced constexpr __has_destroy 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fb401a1fa68 <col:8> col:8 implicit constexpr __has_destroy 'void (const struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &)' inline default trivial noexcept-unevaluated 0x7fb401a1fa68
| `-ParmVarDecl 0x7fb401a1fb90 <col:8> col:8 'const struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &'
|-CXXConstructorDecl 0x7fb401a1fc28 <col:8> col:8 implicit constexpr __has_destroy 'void (struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &&)' inline default trivial noexcept-unevaluated 0x7fb401a1fc28
| `-ParmVarDecl 0x7fb401a1fd50 <col:8> col:8 'struct std::__1::__has_destroy<class std::__1::allocator<int>, int *> &&'
`-CXXDestructorDecl 0x7fb401a1fdf0 <col:8> col:8 implicit referenced ~__has_destroy 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__has_destroy" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__has_destroy" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7fb404200e88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:880:5, line:884:5> line:880:12 struct __RAII_IncreaseAnnotator definition
|-CXXRecordDecl 0x7fb401a21cf0 prev 0x7fb404200e88 <col:5, col:12> col:12 implicit struct __RAII_IncreaseAnnotator
|-CXXConstructorDecl 0x7fb401a21f60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:882:64> col:7 used __RAII_IncreaseAnnotator 'void (const class std::__1::vector<int, class std::__1::allocator<int> > &, std::__1::vector<int, class std::__1::allocator<int> >::size_type)'
| |-ParmVarDecl 0x7fb401a21d98 <col:32, col:45> col:46 'const class std::__1::vector<int, class std::__1::allocator<int> > &'
| |-ParmVarDecl 0x7fb401a21e08 <col:48, col:60> col:58 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long' cinit
| | `-ImplicitCastExpr 0x7fb401a22540 <col:60> 'std::__1::vector<int, class std::__1::allocator<int> >::size_type':'unsigned long' <IntegralCast>
| |   `-IntegerLiteral 0x7fb4013410b8 <col:60> 'int' 1
| |-CompoundStmt 0x7fb401345928 <col:63, col:64>
| `-AlwaysInlineAttr 0x7fb401a22058 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a220a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:883:48> col:38 used __done 'void (void)'
| |-CompoundStmt 0x7fb401345940 <col:47, col:48>
| `-AlwaysInlineAttr 0x7fb401a22148 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fb401a221d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/vector:880:12> col:12 implicit constexpr __RAII_IncreaseAnnotator 'void (const struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &)' inline default trivial noexcept-unevaluated 0x7fb401a221d8
| `-ParmVarDecl 0x7fb401a22300 <col:12> col:12 'const struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &'
`-CXXConstructorDecl 0x7fb401a22398 <col:12> col:12 implicit constexpr __RAII_IncreaseAnnotator 'void (struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &&)' inline default trivial noexcept-unevaluated 0x7fb401a22398
  `-ParmVarDecl 0x7fb401a224c0 <col:12> col:12 'struct std::__1::vector<int, class std::__1::allocator<int> >::__RAII_IncreaseAnnotator &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::vector<int, std::__1::allocator<int> >::__RAII_IncreaseAnnotator" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::vector<int, std::__1::allocator<int> >::__RAII_IncreaseAnnotator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> (empty)
         0 |   struct std::__1::integral_constant<_Bool, true> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb401a24800 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1345:1, line:1354:1> line:1346:8 struct __has_construct definition
|-public 'integral_constant<_Bool, is_same<decltype(__has_construct_test(declval<class allocator<int> >(), declval<int *>(), declval<int>())), true_type>::value>':'struct std::__1::integral_constant<_Bool, true>'
|-TemplateArgument type 'class std::__1::allocator<int>'
|-TemplateArgument type 'int *'
|-TemplateArgument pack
| `-TemplateArgument type 'int'
|-CXXRecordDecl 0x7fb401a28888 prev 0x7fb401a24800 <col:1, col:8> col:8 implicit struct __has_construct
|-CXXConstructorDecl 0x7fb401a28960 <col:8> col:8 implicit referenced constexpr __has_construct 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fb401a28a78 <col:8> col:8 implicit constexpr __has_construct 'void (const struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &)' inline default trivial noexcept-unevaluated 0x7fb401a28a78
| `-ParmVarDecl 0x7fb401a28ba0 <col:8> col:8 'const struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &'
|-CXXConstructorDecl 0x7fb401a28c38 <col:8> col:8 implicit constexpr __has_construct 'void (struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &&)' inline default trivial noexcept-unevaluated 0x7fb401a28c38
| `-ParmVarDecl 0x7fb401a28d60 <col:8> col:8 'struct std::__1::__has_construct<class std::__1::allocator<int>, int *, int> &&'
`-CXXDestructorDecl 0x7fb401a28e00 <col:8> col:8 implicit referenced ~__has_construct 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__has_construct" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::__has_construct" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb40197ca68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:19:1, line:25:1> line:20:7 class __split_buffer_common definition
|-TemplateArgument integral 1
|-CXXRecordDecl 0x7fb40197cc50 prev 0x7fb40197ca68 <col:1, col:7> col:7 implicit class __split_buffer_common
|-AccessSpecDecl 0x7fb40197cce8 <line:22:1, col:10> col:1 protected
|-CXXMethodDecl 0x7fb40197cd10 <line:23:5, col:33> col:10 __throw_length_error 'void (void) const'
|-CXXMethodDecl 0x7fb40197cdb8 <line:24:5, col:33> col:10 __throw_out_of_range 'void (void) const'
|-CXXDestructorDecl 0x7fb4013d99a0 <line:20:7> col:7 implicit ~__split_buffer_common 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fb401400958 <col:7> col:7 implicit used constexpr __split_buffer_common 'void (void) noexcept' inline default trivial
| `-CompoundStmt 0x7fb401400db8 <col:7>
|-CXXConstructorDecl 0x7fb401400a68 <col:7> col:7 implicit constexpr __split_buffer_common 'void (const class std::__1::__split_buffer_common<true> &)' inline default trivial noexcept-unevaluated 0x7fb401400a68
| `-ParmVarDecl 0x7fb401400b90 <col:7> col:7 'const class std::__1::__split_buffer_common<true> &'
`-CXXConstructorDecl 0x7fb401400c28 <col:7> col:7 implicit constexpr __split_buffer_common 'void (class std::__1::__split_buffer_common<true> &&)' inline default trivial noexcept-unevaluated 0x7fb401400c28
  `-ParmVarDecl 0x7fb401400d50 <col:7> col:7 'class std::__1::__split_buffer_common<true> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__split_buffer_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__split_buffer_common" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb401a2e420 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2034:1, line:2067:1> line:2037:8 struct __compressed_pair_elem definition
|-TemplateArgument type 'class std::__1::allocator<int> &'
|-TemplateArgument integral 1
|-TemplateArgument integral 0
|-CXXRecordDecl 0x7fb401a2e6a0 prev 0x7fb401a2e420 <col:1, col:8> col:8 implicit struct __compressed_pair_elem
|-TypedefDecl 0x7fb401a2e748 <line:2038:3, col:15> col:15 _ParamT 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
| `-SubstTemplateTypeParmType 0x7fb401a2daa0 'class std::__1::allocator<int> &' sugar
|   |-TemplateTypeParmType 0x7fb400b75b80 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fb400b75b38 '_Tp'
|   `-LValueReferenceType 0x7fb4041dbd50 'class std::__1::allocator<int> &'
|     `-RecordType 0x7fb4041ce4f0 'class std::__1::allocator<int>'
|       `-ClassTemplateSpecialization 0x7fb4041ce400 'allocator'
|-TypedefDecl 0x7fb401a2e7d8 <line:2039:3, col:16> col:16 referenced reference 'class std::__1::allocator<int> &&'
| `-LValueReferenceType 0x7fb401a2e7a0 'class std::__1::allocator<int> &&'
|   `-RecordType 0x7fb4041ce4f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fb4041ce400 'allocator'
|-TypedefDecl 0x7fb401a2e840 <line:2040:3, col:22> col:22 referenced const_reference 'class std::__1::allocator<int> &&'
| `-LValueReferenceType 0x7fb401a2e7a0 'class std::__1::allocator<int> &&'
|   `-RecordType 0x7fb4041ce4f0 'class std::__1::allocator<int>'
|     `-ClassTemplateSpecialization 0x7fb4041ce400 'allocator'
|-CXXConstructorDecl 0x7fb401a2e8d8 <line:2043:3, col:52> col:13 constexpr __compressed_pair_elem 'void (void)'
|-FunctionTemplateDecl 0x7fb401a2f0b8 <line:2045:3, line:2050:44> line:2049:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fb401a2e990 <line:2045:13, col:19> col:19 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7fb401a2e9f8 <col:24, line:2047:6> line:2045:24 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<!is_same<struct __compressed_pair_elem<class allocator<int> &, 1, false>, typename decay<_Up>::type>::value>::type'
| |-CXXConstructorDecl 0x7fb401a2f010 <line:2048:3, line:2050:44> line:2049:3 constexpr __compressed_pair_elem 'void (_Up &&)'
| | `-ParmVarDecl 0x7fb401a2ef28 <col:26, col:32> col:32 __u '_Up &&'
| `-CXXConstructorDecl 0x7fb401400120 <line:2048:3, line:2050:44> line:2049:3 used constexpr __compressed_pair_elem 'void (class std::__1::allocator<int> &&)'
|   |-TemplateArgument type 'class std::__1::allocator<int> &'
|   |-TemplateArgument type 'void'
|   |-ParmVarDecl 0x7fb401400058 <col:26, col:32> col:32 used __u 'class std::__1::allocator<int> &&'
|   |-CXXCtorInitializer Field 0x7fb401a2faf8 '__value_' 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
|   | `-CallExpr 0x7fb4014007b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2050:41> 'class std::__1::allocator<int>' lvalue
|   |   |-ImplicitCastExpr 0x7fb4014007a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2050:36> 'class std::__1::allocator<int> &&(*)(typename remove_reference<class allocator<int> &>::type &) noexcept' <FunctionToPointerDecay>
|   |   | `-DeclRefExpr 0x7fb401400720 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:440:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2050:36> 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' lvalue Function 0x7fb4013f94e8 'forward' 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' (FunctionTemplate 0x7fb4010f14e0 'forward')
|   |   `-DeclRefExpr 0x7fb401400318 <col:38> 'class std::__1::allocator<int>' lvalue ParmVar 0x7fb401400058 '__u' 'class std::__1::allocator<int> &&'
|   `-CompoundStmt 0x7fb400b779c0 <col:43, col:44>
|-FunctionTemplateDecl 0x7fb401a2f6e8 <line:2052:3, line:2056:75> line:2054:3 __compressed_pair_elem
| |-TemplateTypeParmDecl 0x7fb401a2f198 <line:2052:13, col:22> col:22 class depth 0 index 0 ... _Args
| |-NonTypeTemplateParmDecl 0x7fb401a2f208 <col:29, col:39> col:39 referenced 'size_t':'unsigned long' depth 0 index 1 ... _Indexes
| `-CXXConstructorDecl 0x7fb401a2f640 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2056:75> line:2054:3 __compressed_pair_elem 'void (struct std::__1::piecewise_construct_t, tuple<_Args...>, __tuple_indices<_Indexes...>)'
|   |-ParmVarDecl 0x7fb401a2f280 <col:26> col:47 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fb401a2f3e8 <col:49, col:65> col:65 __args 'tuple<_Args...>'
|   |-ParmVarDecl 0x7fb401a2f538 <line:2055:26, col:53> col:54 '__tuple_indices<_Indexes...>'
|   `-AlwaysInlineAttr 0x7fb401a2f778 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a2f8c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2062:3, col:50> col:13 used __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>::reference (void) noexcept'
| `-CompoundStmt 0x7fb402205100 <col:31, col:50>
|   `-ReturnStmt 0x7fb4022050e8 <col:33, col:40>
|     `-MemberExpr 0x7fb4022050b0 <col:40> 'class std::__1::allocator<int>' lvalue ->__value_ 0x7fb401a2faf8
|       `-CXXThisExpr 0x7fb402205098 <col:40> 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> *' this
|-CXXMethodDecl 0x7fb401a2fa18 <line:2063:3, col:62> col:19 __get 'std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>::const_reference (void) const noexcept'
|-AccessSpecDecl 0x7fb401a2fac0 <line:2065:1, col:8> col:1 private
|-FieldDecl 0x7fb401a2faf8 <line:2066:3, col:7> col:7 referenced __value_ 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
|-CXXMethodDecl 0x7fb401a336a8 <line:2037:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &(const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &)' inline default_delete trivial noexcept-unevaluated 0x7fb401a336a8
| `-ParmVarDecl 0x7fb401a337c0 <col:8> col:8 'const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &'
|-CXXMethodDecl 0x7fb401a33858 <col:8, <invalid sloc>> col:8 implicit constexpr operator= 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &(struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&)' inline default_delete trivial noexcept-unevaluated 0x7fb401a33858
| `-ParmVarDecl 0x7fb401a33970 <col:8> col:8 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&'
|-CXXDestructorDecl 0x7fb4013d9b58 <col:8> col:8 implicit ~__compressed_pair_elem 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fb4013e1288 <col:8> col:8 implicit constexpr __compressed_pair_elem 'void (const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &)' inline default trivial noexcept-unevaluated 0x7fb4013e1288
| `-ParmVarDecl 0x7fb4013e13b0 <col:8> col:8 'const struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &'
`-CXXConstructorDecl 0x7fb4013e1418 <col:8> col:8 implicit constexpr __compressed_pair_elem 'void (struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&)' inline default trivial noexcept-unevaluated 0x7fb4013e1418
  `-ParmVarDecl 0x7fb4013e1540 <col:8> col:8 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false> &&'

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::__compressed_pair_elem.2" = type { %"class.std::__1::allocator"* }
  NonVirtualBaseLLVMType:%"struct.std::__1::__compressed_pair_elem.2" = type { %"class.std::__1::allocator"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb401a2d510 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2104:1, line:2201:1> line:2105:7 class __compressed_pair definition
|-private '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|-private '__compressed_pair_elem<class std::__1::allocator<int> &, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
|-TemplateArgument type 'int *'
|-TemplateArgument type 'class std::__1::allocator<int> &'
|-CXXRecordDecl 0x7fb401a2fba8 prev 0x7fb401a2d510 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7fb401a2ff48 <line:2107:3, col:42> col:42 _Base1 '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
| `-TemplateSpecializationType 0x7fb401a2fea0 '__compressed_pair_elem<int *, 0>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'int *':'int *'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fb400b7b400 <col:39> 'int' 0
|   `-RecordType 0x7fb4041e4920 'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|     `-ClassTemplateSpecialization 0x7fb4041e4800 '__compressed_pair_elem'
|-TypedefDecl 0x7fb401a302a8 <line:2108:3, col:42> col:42 _Base2 '__compressed_pair_elem<class std::__1::allocator<int> &, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
| `-TemplateSpecializationType 0x7fb401a30200 '__compressed_pair_elem<class std::__1::allocator<int> &, 1>' sugar __compressed_pair_elem
|   |-TemplateArgument type 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
|   |-TemplateArgument expr
|   | `-IntegerLiteral 0x7fb400b7b7a8 <col:39> 'int' 1
|   `-RecordType 0x7fb401a2e540 'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
|     `-ClassTemplateSpecialization 0x7fb401a2e420 '__compressed_pair_elem'
|-StaticAssertDecl 0x7fb401a30728 <line:2114:3, line:2117:44> line:2114:3
| |-ParenExpr 0x7fb401a30708 <col:17, col:43> '_Bool'
| | `-UnaryOperator 0x7fb401a306e8 <col:18, col:38> '_Bool' prefix '!'
| |   `-ImplicitCastExpr 0x7fb401a306d0 <col:19, col:38> '_Bool':'_Bool' <LValueToRValue>
| |     `-DeclRefExpr 0x7fb401a30698 <col:19, col:38> 'const _Bool':'const _Bool' lvalue Var 0x7fb400c46078 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7fb400b7bcd8 <line:2115:5, line:2117:5> 'const char [179]' lvalue "__compressed_pair cannot be instantated when T1 and T2 are the same type; The current implementation is NOT ABI-compatible with the previous implementation for this configuration"
|-AccessSpecDecl 0x7fb401a30760 <line:2119:1, col:7> col:1 public
|-FunctionTemplateDecl 0x7fb401a31028 <line:2121:3, line:2128:34> col:13 __compressed_pair
| |-NonTypeTemplateParmDecl 0x7fb401a30788 <line:2121:13, col:27> col:18 referenced '_Bool' depth 0 index 0 _Dummy
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fb400b7be20 <col:27> '_Bool' true
| |-TemplateTypeParmDecl 0x7fb401a307e0 <line:2122:7, line:2125:10> line:2122:7 class depth 0 index 1
| | `-TemplateArgument type 'typename enable_if<__dependent_type<is_default_constructible<int *>, _Dummy>::value && __dependent_type<is_default_constructible<class allocator<int> &>, _Dummy>::value>::type'
| `-CXXConstructorDecl 0x7fb401a30f80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2128:34> col:13 constexpr __compressed_pair 'void (void)'
|   `-AlwaysInlineAttr 0x7fb401a310a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fb401a318c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2130:3, line:2135:51> line:2134:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fb401a31178 <line:2130:13, col:19> col:19 class depth 0 index 0 _Tp
| |-NonTypeTemplateParmDecl 0x7fb401a31680 <col:24, line:2132:57> col:55 'typename enable_if<!is_same<typename decay<_Tp>::type, class __compressed_pair<int *, class allocator<int> &> >::value, _Bool>::type' depth 0 index 1
| | `-TemplateArgument expr
| |   `-CXXBoolLiteralExpr 0x7fb400b7cd40 <col:57> '_Bool' true
| `-CXXConstructorDecl 0x7fb401a31820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2135:51> line:2134:3 constexpr __compressed_pair 'void (_Tp &&)'
|   |-ParmVarDecl 0x7fb401a31738 <col:21, col:27> col:27 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fb401a31920 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fb401a31ca8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2137:3, line:2140:51> line:2139:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fb401a319f0 <line:2137:13, col:19> col:19 class depth 0 index 0 _Tp
| `-CXXConstructorDecl 0x7fb401a31c00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2140:51> line:2139:3 constexpr __compressed_pair 'void (struct std::__1::__second_tag, _Tp &&)'
|   |-ParmVarDecl 0x7fb401a31a70 <col:21> col:33 'struct std::__1::__second_tag'
|   |-ParmVarDecl 0x7fb401a31b08 <col:35, col:41> col:41 __t '_Tp &&'
|   `-AlwaysInlineAttr 0x7fb401a31d08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fb401a32158 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2142:3, line:2145:75> line:2144:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fb401a31dd8 <line:2142:13, col:19> col:19 class depth 0 index 0 _U1
| |-TemplateTypeParmDecl 0x7fb401a31e48 <col:24, col:30> col:30 class depth 0 index 1 _U2
| |-CXXConstructorDecl 0x7fb401a320b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 constexpr __compressed_pair 'void (_U1 &&, _U2 &&)'
| | |-ParmVarDecl 0x7fb401a31f18 <col:21, col:27> col:27 __t1 '_U1 &&'
| | |-ParmVarDecl 0x7fb401a31fb8 <col:33, col:39> col:39 __t2 '_U2 &&'
| | `-AlwaysInlineAttr 0x7fb401a321b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
| `-CXXConstructorDecl 0x7fb4013f8360 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2145:75> line:2144:3 used constexpr __compressed_pair 'void (nullptr_t &&, class std::__1::allocator<int> &&)'
|   |-TemplateArgument type 'nullptr_t'
|   |-TemplateArgument type 'class std::__1::allocator<int> &'
|   |-ParmVarDecl 0x7fb4013f8178 <col:21, col:27> col:27 used __t1 'nullptr_t &&'
|   |-ParmVarDecl 0x7fb4013f8248 <col:33, col:39> col:39 used __t2 'class std::__1::allocator<int> &&'
|   |-CXXCtorInitializer 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'struct std::__1::__compressed_pair_elem<int *, 0, false>'
|   | `-CXXConstructExpr 0x7fb4013f8ee0 <line:2145:9, col:39> '__compressed_pair_elem<int *, 0>':'struct std::__1::__compressed_pair_elem<int *, 0, false>' 'void (nullptr_t &&)'
|   |   `-CallExpr 0x7fb4013f8ae8 <col:16, col:38> 'nullptr_t':'nullptr_t' xvalue
|   |     |-ImplicitCastExpr 0x7fb4013f8ad0 <col:16, col:32> 'nullptr_t &&(*)(typename remove_reference<nullptr_t>::type &) noexcept' <FunctionToPointerDecay>
|   |     | `-DeclRefExpr 0x7fb4013f8a50 <col:16, col:32> 'nullptr_t &&(typename remove_reference<nullptr_t>::type &) noexcept' lvalue Function 0x7fb401a19368 'forward' 'nullptr_t &&(typename remove_reference<nullptr_t>::type &) noexcept' (FunctionTemplate 0x7fb4010f14e0 'forward')
|   |     `-DeclRefExpr 0x7fb4013f8648 <col:34> 'nullptr_t':'nullptr_t' lvalue ParmVar 0x7fb4013f8178 '__t1' 'nullptr_t &&'
|   |-CXXCtorInitializer 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>'
|   | `-CXXConstructExpr 0x7fb401400848 <col:42, col:72> '__compressed_pair_elem<class std::__1::allocator<int> &, 1>':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>' 'void (class std::__1::allocator<int> &&)'
|   |   `-CallExpr 0x7fb4013f99f0 <col:49, col:71> 'class std::__1::allocator<int>' lvalue
|   |     |-ImplicitCastExpr 0x7fb4013f99d8 <col:49, col:65> 'class std::__1::allocator<int> &&(*)(typename remove_reference<class allocator<int> &>::type &) noexcept' <FunctionToPointerDecay>
|   |     | `-DeclRefExpr 0x7fb4013f9860 <col:49, col:65> 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' lvalue Function 0x7fb4013f94e8 'forward' 'class std::__1::allocator<int> &&(typename remove_reference<class allocator<int> &>::type &) noexcept' (FunctionTemplate 0x7fb4010f14e0 'forward')
|   |     `-DeclRefExpr 0x7fb4013f9018 <col:67> 'class std::__1::allocator<int>' lvalue ParmVar 0x7fb4013f8248 '__t2' 'class std::__1::allocator<int> &&'
|   |-CompoundStmt 0x7fb400b7f9f8 <col:74, col:75>
|   `-AlwaysInlineAttr 0x7fb4013f8488 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-FunctionTemplateDecl 0x7fb401a32818 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2147:3, line:2154:75> line:2149:3 __compressed_pair
| |-TemplateTypeParmDecl 0x7fb401a32288 <line:2147:13, col:22> col:22 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7fb401a322f8 <col:30, col:39> col:39 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7fb401a32770 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2154:75> line:2149:3 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7fb401a32388 <col:21, col:43> col:43 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7fb401a324f8 <col:49, col:66> col:66 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7fb401a32668 <line:2150:21, col:38> col:38 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7fb401a32880 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a32a48 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2175:3> line:2173:30 used first 'typename _Base1::reference (void) noexcept'
| |-CompoundStmt 0x7fb4022058e8 <col:48, line:2175:3>
| | `-ReturnStmt 0x7fb4022058d0 <line:2174:5, col:46>
| |   `-CXXMemberCallExpr 0x7fb4022058a8 <col:12, col:46> 'int *':'int *' lvalue
| |     `-MemberExpr 0x7fb402205870 <col:12, col:40> '<bound member function type>' .__get 0x7fb4041e5d68
| |       `-CXXStaticCastExpr 0x7fb4022057d0 <col:12, col:38> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue static_cast<std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1 &> <NoOp>
| |         `-ImplicitCastExpr 0x7fb4022057b0 <col:33, col:34> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue <DerivedToBase (__compressed_pair_elem)>
| |           `-UnaryOperator 0x7fb402205790 <col:33, col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue prefix '*'
| |             `-CXXThisExpr 0x7fb402205778 <col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fb401a32af0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a32bf8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2180:3> line:2178:36 used first 'typename _Base1::const_reference (void) const noexcept'
| |-CompoundStmt 0x7fb4022070d8 <col:60, line:2180:3>
| | `-ReturnStmt 0x7fb4022070c0 <line:2179:5, col:52>
| |   `-CXXMemberCallExpr 0x7fb402207098 <col:12, col:52> 'int *const':'int *const' lvalue
| |     `-MemberExpr 0x7fb402207060 <col:12, col:46> '<bound member function type>' .__get 0x7fb4041e5eb8
| |       `-CXXStaticCastExpr 0x7fb402206fc0 <col:12, col:44> 'const std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'const struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue static_cast<const std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1 &> <NoOp>
| |         `-ImplicitCastExpr 0x7fb402206fa0 <col:39, col:40> 'const std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base1':'const struct std::__1::__compressed_pair_elem<int *, 0, false>' lvalue <DerivedToBase (__compressed_pair_elem)>
| |           `-UnaryOperator 0x7fb402206f80 <col:39, col:40> 'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue prefix '*'
| |             `-CXXThisExpr 0x7fb402206f68 <col:40> 'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fb401a32ca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a32de8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2185:3> line:2183:30 used second 'typename _Base2::reference (void) noexcept'
| |-CompoundStmt 0x7fb402205078 <col:49, line:2185:3>
| | `-ReturnStmt 0x7fb402205060 <line:2184:5, col:46>
| |   `-CXXMemberCallExpr 0x7fb402205038 <col:12, col:46> 'class std::__1::allocator<int>' lvalue
| |     `-MemberExpr 0x7fb402205000 <col:12, col:40> '<bound member function type>' .__get 0x7fb401a2f8c8
| |       `-CXXStaticCastExpr 0x7fb401401b30 <col:12, col:38> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>' lvalue static_cast<std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2 &> <NoOp>
| |         `-ImplicitCastExpr 0x7fb401401b10 <col:33, col:34> 'std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>::_Base2':'struct std::__1::__compressed_pair_elem<class std::__1::allocator<int> &, 1, false>' lvalue <DerivedToBase (__compressed_pair_elem)>
| |           `-UnaryOperator 0x7fb401401af0 <col:33, col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue prefix '*'
| |             `-CXXThisExpr 0x7fb401401ad8 <col:34> 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fb401a32e90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a32f98 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2190:3> line:2188:36 second 'typename _Base2::const_reference (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb401a33040 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a331e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2200:3> line:2193:8 swap 'void (class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &)' noexcept-uninstantiated 0x7fb400b7ee48
| |-ParmVarDecl 0x7fb401a330c8 <col:13, col:32> col:32 __x 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &'
| `-AlwaysInlineAttr 0x7fb401a332d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a339d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2105:7, <invalid sloc>> col:7 implicit constexpr operator= 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &(class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&)' inline default_delete trivial noexcept-unevaluated 0x7fb401a339d8
| `-ParmVarDecl 0x7fb401a33af0 <col:7> col:7 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&'
|-CXXDestructorDecl 0x7fb4013d9a78 <col:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7fb4013f1c80 <col:7> col:7 implicit constexpr __compressed_pair 'void (const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &)' inline default trivial noexcept-unevaluated 0x7fb4013f1c80
| `-ParmVarDecl 0x7fb4013f1db0 <col:7> col:7 'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &'
`-CXXConstructorDecl 0x7fb4013f7f08 <col:7> col:7 implicit constexpr __compressed_pair 'void (class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&)' inline default trivial noexcept-unevaluated 0x7fb4013f7f08
  `-ParmVarDecl 0x7fb4013f8030 <col:7> col:7 'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair.1" = type { %"struct.std::__1::__compressed_pair_elem", %"struct.std::__1::__compressed_pair_elem.2" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair.1" = type { %"struct.std::__1::__compressed_pair_elem", %"struct.std::__1::__compressed_pair_elem.2" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7fb4041fe1b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:27:1, line:164:1> line:28:8 struct __split_buffer definition
|-private '__split_buffer_common<true>':'class std::__1::__split_buffer_common<true>'
|-TemplateArgument type 'int'
|-TemplateArgument type 'class std::__1::allocator<int> &'
|-CXXRecordDecl 0x7fb401a2c258 prev 0x7fb4041fe1b8 <col:1, col:8> col:8 implicit struct __split_buffer
|-AccessSpecDecl 0x7fb401a2c2f0 <line:31:1, col:8> col:1 private
|-CXXConstructorDecl 0x7fb401a2c460 <line:32:5, col:41> col:5 __split_buffer 'void (const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &)'
| `-ParmVarDecl 0x7fb401a2c358 <col:20, col:40> col:41 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &'
|-CXXMethodDecl 0x7fb401a2c5f0 <line:33:5, col:52> col:21 operator= 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &(const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &)'
| `-ParmVarDecl 0x7fb401a2c530 <col:31, col:51> col:52 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &'
|-AccessSpecDecl 0x7fb401a2c6a0 <line:34:1, col:7> col:1 public
|-TypedefDecl 0x7fb401a2c708 <line:35:5, col:61> col:61 value_type 'int':'int'
| `-SubstTemplateTypeParmType 0x7fb401a2c6d0 'int' sugar
|   |-TemplateTypeParmType 0x7fb40197c540 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7fb40197c4f8 '_Tp'
|   `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb401a2c798 <line:36:5, col:61> col:61 allocator_type 'class std::__1::allocator<int> &':'class std::__1::allocator<int> &'
| `-SubstTemplateTypeParmType 0x7fb401a2c760 'class std::__1::allocator<int> &' sugar
|   |-TemplateTypeParmType 0x7fb40197c670 '_Allocator' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7fb40197c628 '_Allocator'
|   `-LValueReferenceType 0x7fb4041dbd50 'class std::__1::allocator<int> &'
|     `-RecordType 0x7fb4041ce4f0 'class std::__1::allocator<int>'
|       `-ClassTemplateSpecialization 0x7fb4041ce400 'allocator'
|-TypedefDecl 0x7fb401a2ccb0 <line:37:5, col:61> col:61 __alloc_rr 'typename remove_reference<allocator_type>::type':'class std::__1::allocator<int>'
| `-ElaboratedType 0x7fb401a2cc60 'typename remove_reference<allocator_type>::type' sugar
|   `-TypedefType 0x7fb401a2cc40 'std::__1::remove_reference<class std::__1::allocator<int> &>::type' sugar
|     |-Typedef 0x7fb401a2cbc8 'type'
|     `-SubstTemplateTypeParmType 0x7fb401a2ca10 'class std::__1::allocator<int>' sugar
|       |-TemplateTypeParmType 0x7fb40107a420 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fb40107a3d8 '_Tp'
|       `-RecordType 0x7fb4041ce4f0 'class std::__1::allocator<int>'
|         `-ClassTemplateSpecialization 0x7fb4041ce400 'allocator'
|-TypedefDecl 0x7fb401a2cdb8 <line:38:5, col:61> col:61 __alloc_traits 'allocator_traits<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr>':'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
| `-TemplateSpecializationType 0x7fb401a2cd40 'allocator_traits<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>'
|   `-RecordType 0x7fb4041cee90 'struct std::__1::allocator_traits<class std::__1::allocator<int> >'
|     `-ClassTemplateSpecialization 0x7fb4041ceda0 'allocator_traits'
|-TypedefDecl 0x7fb401a2ce68 <line:39:5, col:61> col:61 reference 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
| `-LValueReferenceType 0x7fb401a2ce30 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
|   `-TypedefType 0x7fb401a2ce10 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type' sugar
|     |-Typedef 0x7fb401a2c708 'value_type'
|     `-SubstTemplateTypeParmType 0x7fb401a2c6d0 'int' sugar
|       |-TemplateTypeParmType 0x7fb40197c540 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7fb40197c4f8 '_Tp'
|       `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb401a2cef8 <line:40:5, col:61> col:61 const_reference 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
| `-LValueReferenceType 0x7fb401a2cec0 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type &'
|   `-QualType 0x7fb401a2ce11 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type' const
|     `-TypedefType 0x7fb401a2ce10 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::value_type' sugar
|       |-Typedef 0x7fb401a2c708 'value_type'
|       `-SubstTemplateTypeParmType 0x7fb401a2c6d0 'int' sugar
|         |-TemplateTypeParmType 0x7fb40197c540 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7fb40197c4f8 '_Tp'
|         `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb401a2d000 <line:41:5, col:61> col:61 size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7fb401a2cfb0 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7fb4041dbe20 'std::__1::allocator_traits<class std::__1::allocator<int> >::size_type' sugar
|     |-Typedef 0x7fb4041d87b0 'size_type'
|     `-ElaboratedType 0x7fb4041d8760 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7fb4041d8740 'std::__1::__size_type<class std::__1::allocator<int>, long, true>::type' sugar
|         |-Typedef 0x7fb4041d86c0 'type'
|         `-ElaboratedType 0x7fb4041d8670 'typename class allocator<int>::size_type' sugar
|           `-TypedefType 0x7fb4041d7f50 'std::__1::allocator<int>::size_type' sugar
|             |-Typedef 0x7fb4041cf4c8 'size_type'
|             `-TypedefType 0x7fb401060810 'size_t' sugar
|               |-Typedef 0x7fb4008691b0 'size_t'
|               `-BuiltinType 0x7fb400833c80 'unsigned long'
|-TypedefDecl 0x7fb401a2d0d0 <line:42:5, col:61> col:61 difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7fb401a2d080 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7fb4041d7c70 'std::__1::allocator_traits<class std::__1::allocator<int> >::difference_type' sugar
|     |-Typedef 0x7fb4041d7c00 'difference_type'
|     `-ElaboratedType 0x7fb4041d7bb0 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7fb4041d7b90 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<int>, int *, true>::type' sugar
|         |-Typedef 0x7fb4041d7b10 'type'
|         `-ElaboratedType 0x7fb4041d7ac0 'typename class allocator<int>::difference_type' sugar
|           `-TypedefType 0x7fb4041d7370 'std::__1::allocator<int>::difference_type' sugar
|             |-Typedef 0x7fb4041cf520 'difference_type'
|             `-TypedefType 0x7fb401809950 'ptrdiff_t' sugar
|               |-Typedef 0x7fb400869140 'ptrdiff_t'
|               `-BuiltinType 0x7fb400833be0 'long'
|-TypedefDecl 0x7fb401a2d1a0 <line:43:5, col:61> col:61 pointer 'typename __alloc_traits::pointer':'int *'
| `-ElaboratedType 0x7fb401a2d150 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7fb4041d2a40 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|     |-Typedef 0x7fb4041d29d0 'pointer'
|     `-ElaboratedType 0x7fb4041d2980 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7fb4041d2960 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|         |-Typedef 0x7fb4041d28e0 'type'
|         `-ElaboratedType 0x7fb4041d2890 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|           `-TypedefType 0x7fb4041d2870 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|             |-Typedef 0x7fb4041d27f0 'type'
|             `-ElaboratedType 0x7fb4041d27a0 'typename class allocator<int>::pointer' sugar
|               `-TypedefType 0x7fb4041d01a0 'std::__1::allocator<int>::pointer' sugar
|                 |-Typedef 0x7fb4041cf5e8 'pointer'
|                 `-PointerType 0x7fb4041cf5b0 'int *'
|                   `-SubstTemplateTypeParmType 0x7fb4041cf580 'int' sugar
|                     |-TemplateTypeParmType 0x7fb400b64c60 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fb400b64c18 '_Tp'
|                     `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb401a2d270 <line:44:5, col:61> col:61 const_pointer 'typename __alloc_traits::const_pointer':'const int *'
| `-ElaboratedType 0x7fb401a2d220 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7fb4041e3950 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|     |-Typedef 0x7fb4041d37d0 'const_pointer'
|     `-ElaboratedType 0x7fb4041d3780 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7fb4041d3760 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|         |-Typedef 0x7fb4041d36e0 'type'
|         `-ElaboratedType 0x7fb4041d3690 'typename class allocator<int>::const_pointer' sugar
|           `-TypedefType 0x7fb4041d03f0 'std::__1::allocator<int>::const_pointer' sugar
|             |-Typedef 0x7fb4041cf678 'const_pointer'
|             `-PointerType 0x7fb4041cf640 'const int *'
|               `-QualType 0x7fb4041cf581 'const int' const
|                 `-SubstTemplateTypeParmType 0x7fb4041cf580 'int' sugar
|                   |-TemplateTypeParmType 0x7fb400b64c60 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7fb400b64c18 '_Tp'
|                   `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb401a2d300 <line:45:5, col:61> col:61 iterator 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
| `-TypedefType 0x7fb401a2d2d0 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer' sugar
|   |-Typedef 0x7fb401a2d1a0 'pointer'
|   `-ElaboratedType 0x7fb401a2d150 'typename __alloc_traits::pointer' sugar
|     `-TypedefType 0x7fb4041d2a40 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer' sugar
|       |-Typedef 0x7fb4041d29d0 'pointer'
|       `-ElaboratedType 0x7fb4041d2980 'typename __pointer_type<value_type, allocator_type>::type' sugar
|         `-TypedefType 0x7fb4041d2960 'std::__1::__pointer_type<int, class std::__1::allocator<int> >::type' sugar
|           |-Typedef 0x7fb4041d28e0 'type'
|           `-ElaboratedType 0x7fb4041d2890 'typename __pointer_type_imp::__pointer_type<int, typename remove_reference<class allocator<int> >::type>::type' sugar
|             `-TypedefType 0x7fb4041d2870 'std::__1::__pointer_type_imp::__pointer_type<int, class std::__1::allocator<int>, true>::type' sugar
|               |-Typedef 0x7fb4041d27f0 'type'
|               `-ElaboratedType 0x7fb4041d27a0 'typename class allocator<int>::pointer' sugar
|                 `-TypedefType 0x7fb4041d01a0 'std::__1::allocator<int>::pointer' sugar
|                   |-Typedef 0x7fb4041cf5e8 'pointer'
|                   `-PointerType 0x7fb4041cf5b0 'int *'
|                     `-SubstTemplateTypeParmType 0x7fb4041cf580 'int' sugar
|                       |-TemplateTypeParmType 0x7fb400b64c60 '_Tp' dependent depth 0 index 0
|                       | `-TemplateTypeParm 0x7fb400b64c18 '_Tp'
|                       `-BuiltinType 0x7fb400833bc0 'int'
|-TypedefDecl 0x7fb401a2d390 <line:46:5, col:61> col:61 const_iterator 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_pointer':'const int *'
| `-TypedefType 0x7fb401a2d360 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_pointer' sugar
|   |-Typedef 0x7fb401a2d270 'const_pointer'
|   `-ElaboratedType 0x7fb401a2d220 'typename __alloc_traits::const_pointer' sugar
|     `-TypedefType 0x7fb4041e3950 'std::__1::allocator_traits<class std::__1::allocator<int> >::const_pointer' sugar
|       |-Typedef 0x7fb4041d37d0 'const_pointer'
|       `-ElaboratedType 0x7fb4041d3780 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|         `-TypedefType 0x7fb4041d3760 'std::__1::__const_pointer<int, int *, class std::__1::allocator<int>, true>::type' sugar
|           |-Typedef 0x7fb4041d36e0 'type'
|           `-ElaboratedType 0x7fb4041d3690 'typename class allocator<int>::const_pointer' sugar
|             `-TypedefType 0x7fb4041d03f0 'std::__1::allocator<int>::const_pointer' sugar
|               |-Typedef 0x7fb4041cf678 'const_pointer'
|               `-PointerType 0x7fb4041cf640 'const int *'
|                 `-QualType 0x7fb4041cf581 'const int' const
|                   `-SubstTemplateTypeParmType 0x7fb4041cf580 'int' sugar
|                     |-TemplateTypeParmType 0x7fb400b64c60 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7fb400b64c18 '_Tp'
|                     `-BuiltinType 0x7fb400833bc0 'int'
|-FieldDecl 0x7fb401a2d3f8 <line:48:5, col:53> col:53 referenced __first_ 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
|-FieldDecl 0x7fb401a2d450 <line:49:5, col:53> col:53 referenced __begin_ 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
|-FieldDecl 0x7fb401a2d4a8 <line:50:5, col:53> col:53 referenced __end_ 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *'
|-FieldDecl 0x7fb401a33b78 <line:51:5, col:48> col:48 referenced __end_cap_ '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>'
|-TypedefDecl 0x7fb401a35300 <line:53:5, col:65> col:65 __alloc_ref 'typename add_lvalue_reference<allocator_type>::type':'class std::__1::allocator<int> &&'
| `-ElaboratedType 0x7fb401a352b0 'typename add_lvalue_reference<allocator_type>::type' sugar
|   `-TypedefType 0x7fb401a35290 'std::__1::add_lvalue_reference<class std::__1::allocator<int> &>::type' sugar
|     |-Typedef 0x7fb401a35210 'type'
|     `-ElaboratedType 0x7fb401a351c0 'typename __add_lvalue_reference_impl<class allocator<int> &>::type' sugar
|       `-TypedefType 0x7fb401a351a0 'std::__1::__add_lvalue_reference_impl<class std::__1::allocator<int> &, true>::type' sugar
|         |-Typedef 0x7fb401a35128 'type'
|         `-LValueReferenceType 0x7fb401a350f0 'class std::__1::allocator<int> &&'
|           `-RecordType 0x7fb4041ce4f0 'class std::__1::allocator<int>'
|             `-ClassTemplateSpecialization 0x7fb4041ce400 'allocator'
|-TypedefDecl 0x7fb401a35460 <line:54:5, col:65> col:65 __alloc_const_ref 'typename add_lvalue_reference<allocator_type>::type':'class std::__1::allocator<int> &&'
| `-ElaboratedType 0x7fb401a35410 'typename add_lvalue_reference<allocator_type>::type' sugar
|   `-TypedefType 0x7fb401a35290 'std::__1::add_lvalue_reference<class std::__1::allocator<int> &>::type' sugar
|     |-Typedef 0x7fb401a35210 'type'
|     `-ElaboratedType 0x7fb401a351c0 'typename __add_lvalue_reference_impl<class allocator<int> &>::type' sugar
|       `-TypedefType 0x7fb401a351a0 'std::__1::__add_lvalue_reference_impl<class std::__1::allocator<int> &, true>::type' sugar
|         |-Typedef 0x7fb401a35128 'type'
|         `-LValueReferenceType 0x7fb401a350f0 'class std::__1::allocator<int> &&'
|           `-RecordType 0x7fb4041ce4f0 'class std::__1::allocator<int>'
|             `-ClassTemplateSpecialization 0x7fb4041ce400 'allocator'
|-CXXMethodDecl 0x7fb401a35548 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:56:109> col:53 used __alloc 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &(void) noexcept'
| |-CompoundStmt 0x7fb401401a80 <col:81, col:109>
| | `-ReturnStmt 0x7fb401401a68 <col:82, col:107>
| |   `-CXXMemberCallExpr 0x7fb401401a40 <col:89, col:107> 'class std::__1::allocator<int>' lvalue
| |     `-MemberExpr 0x7fb401401a08 <col:89, col:100> '<bound member function type>' .second 0x7fb401a32de8
| |       `-MemberExpr 0x7fb401401960 <col:89> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue ->__end_cap_ 0x7fb401a33b78
| |         `-CXXThisExpr 0x7fb401401948 <col:89> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fb401a35618 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a356e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:57:109> col:53 __alloc 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &(void) const noexcept'
| `-AlwaysInlineAttr 0x7fb401a35790 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a35868 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:58:108> col:53 used __end_cap 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer &(void) noexcept'
| |-CompoundStmt 0x7fb402205720 <col:81, col:108>
| | `-ReturnStmt 0x7fb402205708 <col:82, col:106>
| |   `-CXXMemberCallExpr 0x7fb4022056e0 <col:89, col:106> 'int *':'int *' lvalue
| |     `-MemberExpr 0x7fb4022056a8 <col:89, col:100> '<bound member function type>' .first 0x7fb401a32a48
| |       `-MemberExpr 0x7fb402205600 <col:89> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue ->__end_cap_ 0x7fb401a33b78
| |         `-CXXThisExpr 0x7fb4022055e8 <col:89> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fb401a35910 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a359e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:59:108> col:53 used __end_cap 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer &(void) const noexcept'
| |-CompoundStmt 0x7fb402206f10 <col:81, col:108>
| | `-ReturnStmt 0x7fb402206ef8 <col:82, col:106>
| |   `-CXXMemberCallExpr 0x7fb402206ea8 <col:89, col:106> 'int *const':'int *const' lvalue
| |     `-MemberExpr 0x7fb402206e70 <col:89, col:100> '<bound member function type>' .first 0x7fb401a32bf8
| |       `-MemberExpr 0x7fb402206dc8 <col:89> 'const __compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'const class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' lvalue ->__end_cap_ 0x7fb401a33b78
| |         `-CXXThisExpr 0x7fb402206db0 <col:89> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fb401a35a90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXConstructorDecl 0x7fb401a35b20 <col:35, line:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:62:5 __split_buffer 'void (void)' noexcept-uninstantiated 0x7fb40197ecb0
| `-AlwaysInlineAttr 0x7fb401a35c20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fb401a35da0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:65:44> col:14 __split_buffer 'void (std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7fb401a35c78 <col:29, col:41> col:41 __a 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| `-AlwaysInlineAttr 0x7fb401a35e60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fb401a35fa0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:67:50> col:14 __split_buffer 'void (const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7fb401a35eb8 <col:29, col:47> col:47 __a 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| `-AlwaysInlineAttr 0x7fb401a36060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> Inherited always_inline
|-CXXConstructorDecl 0x7fb401a36310 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:308:1, line:314:1> line:68:5 used __split_buffer 'void (std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7fb401a360e0 <col:20, col:30> col:30 used __cap 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
| |-ParmVarDecl 0x7fb401a36150 <col:37, col:47> col:47 used __start 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
| |-ParmVarDecl 0x7fb401a361c0 <col:56, col:68> col:68 used __a 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| |-CXXCtorInitializer '__split_buffer_common<true>':'class std::__1::__split_buffer_common<true>'
| | `-CXXConstructExpr 0x7fb401400dd0 <col:5> '__split_buffer_common<true>':'class std::__1::__split_buffer_common<true>' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7fb401a33b78 '__end_cap_' '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>'
| | `-ExprWithCleanups 0x7fb4014008f8 <line:309:7, col:30> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>'
| |   `-CXXConstructExpr 0x7fb4014008b8 <col:7, col:30> '__compressed_pair<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer, std::__1::__split_buffer<int, class std::__1::allocator<int> &>::allocator_type>':'class std::__1::__compressed_pair<int *, class std::__1::allocator<int> &>' 'void (nullptr_t &&, class std::__1::allocator<int> &&)'
| |     |-MaterializeTemporaryExpr 0x7fb4013f84d0 <col:18> 'nullptr_t':'nullptr_t' xvalue
| |     | `-CXXNullPtrLiteralExpr 0x7fb40198fe48 <col:18> 'nullptr_t'
| |     `-DeclRefExpr 0x7fb4013e11f8 <col:27> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>' lvalue ParmVar 0x7fb401a361c0 '__a' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
| `-CompoundStmt 0x7fb401401918 <line:310:1, line:314:1>
|   |-BinaryOperator 0x7fb401401388 <line:311:5, col:74> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|   | |-MemberExpr 0x7fb401400e80 <col:5> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7fb401a2d3f8
|   | | `-CXXThisExpr 0x7fb401400e68 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   | `-ConditionalOperator 0x7fb401401358 <col:16, col:74> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer':'int *'
|   |   |-BinaryOperator 0x7fb401401038 <col:16, col:25> '_Bool' '!='
|   |   | |-ImplicitCastExpr 0x7fb401401008 <col:16> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|   |   | | `-DeclRefExpr 0x7fb401400fe0 <col:16> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7fb401a360e0 '__cap' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|   |   | `-ImplicitCastExpr 0x7fb401401020 <col:25> 'unsigned long' <IntegralCast>
|   |   |   `-IntegerLiteral 0x7fb40198ff68 <col:25> 'int' 0
|   |   |-CallExpr 0x7fb4014012f0 <col:29, col:70> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer':'int *'
|   |   | |-ImplicitCastExpr 0x7fb4014012d8 <col:29, col:45> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer (*)(std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type)' <FunctionToPointerDecay>
|   |   | | `-DeclRefExpr 0x7fb401401240 <col:29, col:45> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type)' lvalue CXXMethod 0x7fb4041dbf60 'allocate' 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type)'
|   |   | |-CXXMemberCallExpr 0x7fb4014011f0 <col:54, col:62> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>' lvalue
|   |   | | `-MemberExpr 0x7fb4014011b8 <col:54> '<bound member function type>' ->__alloc 0x7fb401a35548
|   |   | |   `-CXXThisExpr 0x7fb4014011a0 <col:54> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   |   | `-ImplicitCastExpr 0x7fb401401328 <col:65> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|   |   |   `-DeclRefExpr 0x7fb401401218 <col:65> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7fb401a360e0 '__cap' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|   |   `-ImplicitCastExpr 0x7fb401401340 <col:74> 'std::__1::allocator_traits<class std::__1::allocator<int> >::pointer':'int *' <NullToPointer>
|   |     `-CXXNullPtrLiteralExpr 0x7fb401990298 <col:74> 'nullptr_t'
|   |-BinaryOperator 0x7fb401401628 <line:312:5, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|   | |-MemberExpr 0x7fb4014013c8 <col:5> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__begin_ 0x7fb401a2d450
|   | | `-CXXThisExpr 0x7fb4014013b0 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   | `-ImplicitCastExpr 0x7fb401401610 <col:16, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|   |   `-BinaryOperator 0x7fb4014015e8 <col:16, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|   |     |-MemberExpr 0x7fb401401418 <col:16> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__end_ 0x7fb401a2d4a8
|   |     | `-CXXThisExpr 0x7fb401401400 <col:16> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   |     `-BinaryOperator 0x7fb4014015c0 <col:25, col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' '+'
|   |       |-ImplicitCastExpr 0x7fb401401590 <col:25> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|   |       | `-MemberExpr 0x7fb401401530 <col:25> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7fb401a2d3f8
|   |       |   `-CXXThisExpr 0x7fb401401518 <col:25> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   |       `-ImplicitCastExpr 0x7fb4014015a8 <col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|   |         `-DeclRefExpr 0x7fb401401568 <col:36> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7fb401a36150 '__start' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|   `-BinaryOperator 0x7fb4014018f0 <line:313:5, col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue '='
|     |-CXXMemberCallExpr 0x7fb401401730 <col:5, col:15> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue
|     | `-MemberExpr 0x7fb4014016f8 <col:5> '<bound member function type>' ->__end_cap 0x7fb401a35868
|     |   `-CXXThisExpr 0x7fb4014016e0 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     `-BinaryOperator 0x7fb4014018c8 <col:19, col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' '+'
|       |-ImplicitCastExpr 0x7fb401401898 <col:19> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|       | `-MemberExpr 0x7fb401401838 <col:19> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7fb401a2d3f8
|       |   `-CXXThisExpr 0x7fb401401820 <col:19> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|       `-ImplicitCastExpr 0x7fb4014018b0 <col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <LValueToRValue>
|         `-DeclRefExpr 0x7fb401401870 <col:30> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' lvalue ParmVar 0x7fb401a360e0 '__cap' 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|-CXXDestructorDecl 0x7fb401a36410 <line:339:1, line:344:1> line:69:5 used ~__split_buffer 'void (void) noexcept'
| `-CompoundStmt 0x7fb402205eb8 <line:340:1, line:344:1>
|   |-CXXMemberCallExpr 0x7fb402205ad8 <line:341:5, col:11> 'void'
|   | `-MemberExpr 0x7fb402205aa0 <col:5> '<bound member function type>' ->clear 0x7fb401a370e8
|   |   `-CXXThisExpr 0x7fb402205a88 <col:5> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|   `-IfStmt 0x7fb402205e80 <line:342:5, line:343:67>
|     |-<<<NULL>>>
|     |-<<<NULL>>>
|     |-ImplicitCastExpr 0x7fb402205b68 <line:342:9> '_Bool' <PointerToBoolean>
|     | `-ImplicitCastExpr 0x7fb402205b50 <col:9> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|     |   `-MemberExpr 0x7fb402205b18 <col:9> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7fb401a2d3f8
|     |     `-CXXThisExpr 0x7fb402205b00 <col:9> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     |-CallExpr 0x7fb402205e28 <line:343:9, col:67> 'void'
|     | |-ImplicitCastExpr 0x7fb402205e10 <col:9, col:25> 'void (*)(std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::pointer, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type) noexcept' <FunctionToPointerDecay>
|     | | `-DeclRefExpr 0x7fb402205bc0 <col:9, col:25> 'void (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::pointer, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type) noexcept' lvalue CXXMethod 0x7fb4041dc5d8 'deallocate' 'void (std::__1::allocator_traits<class std::__1::allocator<int> >::allocator_type &, std::__1::allocator_traits<class std::__1::allocator<int> >::pointer, std::__1::allocator_traits<class std::__1::allocator<int> >::size_type) noexcept'
|     | |-CXXMemberCallExpr 0x7fb402205cd8 <col:36, col:44> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr':'class std::__1::allocator<int>' lvalue
|     | | `-MemberExpr 0x7fb402205ca0 <col:36> '<bound member function type>' ->__alloc 0x7fb401a35548
|     | |   `-CXXThisExpr 0x7fb402205c88 <col:36> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     | |-ImplicitCastExpr 0x7fb402205e68 <col:47> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
|     | | `-MemberExpr 0x7fb402205d18 <col:47> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__first_ 0x7fb401a2d3f8
|     | |   `-CXXThisExpr 0x7fb402205d00 <col:47> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     | `-CXXMemberCallExpr 0x7fb402205da0 <col:57, col:66> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long'
|     |   `-MemberExpr 0x7fb402205d68 <col:57> '<bound member function type>' ->capacity 0x7fb401a37430
|     |     `-ImplicitCastExpr 0x7fb402205df8 <col:57> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' <NoOp>
|     |       `-CXXThisExpr 0x7fb402205d50 <col:57> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
|     `-<<<NULL>>>
|-CXXConstructorDecl 0x7fb401a36630 <line:72:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:72:5 __split_buffer 'void (struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&)' noexcept-uninstantiated 0x7fb40197f788
| `-ParmVarDecl 0x7fb401a364f8 <col:20, col:37> col:37 __c 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&'
|-CXXConstructorDecl 0x7fb401a368f0 <line:74:5, col:63> col:5 __split_buffer 'void (struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&, const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &)'
| |-ParmVarDecl 0x7fb401a36748 <col:20, col:37> col:37 __c 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&'
| `-ParmVarDecl 0x7fb401a367b8 <col:42, col:60> col:60 __a 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::__alloc_rr &'
|-CXXMethodDecl 0x7fb401a36ae0 <line:75:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:759:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:75:21 operator= 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &(struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&)' noexcept-uninstantiated 0x7fb40197fba8
| `-ParmVarDecl 0x7fb401a369c8 <col:31, col:48> col:48 __c 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> &&'
|-CXXMethodDecl 0x7fb401a36c58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:81:87> col:46 begin 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fb401a36d00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a36dc8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:82:87> col:46 begin 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb401a36e70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a36ee0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:83:85> col:46 end 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::iterator (void) noexcept'
| `-AlwaysInlineAttr 0x7fb401a36f88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a36ff8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:84:85> col:46 end 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::const_iterator (void) const noexcept'
| `-AlwaysInlineAttr 0x7fb401a370a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a370e8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:88:38> line:87:10 used clear 'void (void) noexcept'
| |-CompoundStmt 0x7fb402206060 <line:88:9, col:38>
| | `-CXXMemberCallExpr 0x7fb402206018 <col:10, col:36> 'void'
| |   |-MemberExpr 0x7fb402205fe0 <col:10> '<bound member function type>' ->__destruct_at_end 0x7fb4013d8b58
| |   | `-CXXThisExpr 0x7fb402205fc8 <col:10> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| |   `-ImplicitCastExpr 0x7fb402206048 <col:28> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
| |     `-MemberExpr 0x7fb402205f90 <col:28> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' lvalue ->__begin_ 0x7fb401a2d450
| |       `-CXXThisExpr 0x7fb402205f78 <col:28> 'struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fb401a37190 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a37230 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:89:104> col:41 size 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| `-AlwaysInlineAttr 0x7fb401a372d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a37320 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:90:81> col:36 empty '_Bool (void) const'
| `-AlwaysInlineAttr 0x7fb401a373c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a37430 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:91:113> col:41 used capacity 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| |-CompoundStmt 0x7fb402206d90 <col:58, col:113>
| | `-ReturnStmt 0x7fb402206d78 <col:59, col:111>
| |   `-CXXStaticCastExpr 0x7fb402206d48 <col:66, col:111> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' static_cast<std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type> <NoOp>
| |     `-ImplicitCastExpr 0x7fb402206d30 <col:89, col:103> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type':'unsigned long' <IntegralCast>
| |       `-BinaryOperator 0x7fb402206d08 <col:89, col:103> 'long' '-'
| |         |-ImplicitCastExpr 0x7fb402206cd8 <col:89, col:99> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
| |         | `-CXXMemberCallExpr 0x7fb402206c60 <col:89, col:99> 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *const' lvalue
| |         |   `-MemberExpr 0x7fb402206c28 <col:89> '<bound member function type>' ->__end_cap 0x7fb401a359e8
| |         |     `-CXXThisExpr 0x7fb402206c10 <col:89> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| |         `-ImplicitCastExpr 0x7fb402206cf0 <col:103> 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *' <LValueToRValue>
| |           `-MemberExpr 0x7fb402206ca0 <col:103> 'const std::__1::__split_buffer<int, class std::__1::allocator<int> &>::pointer':'int *const' lvalue ->__first_ 0x7fb401a2d3f8
| |             `-CXXThisExpr 0x7fb402206c88 <col:103> 'const struct std::__1::__split_buffer<int, class std::__1::allocator<int> &> *' this
| `-AlwaysInlineAttr 0x7fb401a374d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a37540 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:92:115> col:41 __front_spare 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| `-AlwaysInlineAttr 0x7fb401a375e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a37650 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:93:115> col:41 __back_spare 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::size_type (void) const'
| `-AlwaysInlineAttr 0x7fb401a376f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
|-CXXMethodDecl 0x7fb401a377b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__split_buffer:95:79> col:47 front 'std::__1::__split_buffer<int, class std::__1::allocator<int> &>::reference (void)'
| `-AlwaysInlineAttr 0x7fb401a37858 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:729:77> always_inline
