
*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char [8] __magic
         8 |   char [32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t [256] __runetype
      1084 |   __darwin_rune_t [256] __maplower
      2108 |   __darwin_rune_t [256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__libcpp_debug_info
         0 |   const char * __file_
         8 |   int __line_
        16 |   const char * __pred_
        24 |   const char * __msg_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::piecewise_construct_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1507:13)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1504:9)
         0 |   long double __t
         0 |   struct (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1507:13) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::allocator_arg_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __lx
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __lxx
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<wchar_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__ulx
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __lx
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __lxx
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char16_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
           | [sizeof=2, dsize=2, align=2,
           |  nvsize=2, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short
         0 |   union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |   std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__ulx
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__long __lx
         0 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __cap_
         8 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::size_type __size_
        16 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short __lxx
         0 |     union std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type __lx
         2 |     std::__1::basic_string<char16_t, struct std::__1::char_traits<char16_t>, class std::__1::allocator<char16_t> >::value_type [11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_void_pointer<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_const_void_pointer<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_copy_assignment<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__has_propagate_on_container_swap<class std::__1::allocator<char32_t> >::__two
         0 |   char __lx
         1 |   char __lxx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)
         0 |   unsigned char __size_
         0 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short
         0 |   union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |     unsigned char __size_
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |   std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__ulx
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__long __lx
         0 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __cap_
         8 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::size_type __size_
        16 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::pointer __data_
         0 |   struct std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short __lxx
         0 |     union std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type __lx
         4 |     std::__1::basic_string<char32_t, struct std::__1::char_traits<char32_t>, class std::__1::allocator<char32_t> >::value_type [5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::__two
         0 |   char [2] __lx
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >
         0 |   std::__1::chrono::duration<long long, class std::__1::ratio<1, 1> >::rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::defer_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::try_to_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::adopt_lock_t (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::__struct_double4
         0 |   double [4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::aligned_storage<24, 16>::type
         0 |   unsigned char [32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<1> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<2> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<3> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<4> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<5> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<6> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<7> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<8> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<9> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::placeholders::__ph<10> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::once_flag
         0 |   unsigned long __state_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::locale::id
         0 |   struct std::__1::once_flag __flag_
         0 |     unsigned long __state_
         8 |   int32_t __id_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__basic_string_common<true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw
         0 |   std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |     std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep
         0 |   union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |       std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>
         0 |   class std::__1::allocator<char> (base) (empty)
         0 |   struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |     union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |         std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >
         0 |   class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
         0 |     class std::__1::allocator<char> (base) (empty)
         0 |     struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |       union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |           union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |         struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |           std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<char>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > __r_
         0 |     class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> (base)
         0 |       class std::__1::allocator<char> (base) (empty)
         0 |       struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep __first_
         0 |         union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long __l
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __cap_
         8 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type __size_
        16 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short __s
         0 |             union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type __lx
         1 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23] __data_
         0 |           struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw __r
         0 |             std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::allocator<wchar_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw
         0 |   std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |       unsigned char __size_
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |     std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep
         0 |   union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |         unsigned char __size_
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |       std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2>
         0 |   class std::__1::allocator<wchar_t> (base) (empty)
         0 |   struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |     union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |           unsigned char __size_
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |         std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> >
         0 |   class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2> (base)
         0 |     class std::__1::allocator<wchar_t> (base) (empty)
         0 |     struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |       union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |           union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |             unsigned char __size_
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |         struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |           std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_string<wchar_t>
         0 |   class std::__1::__basic_string_common<true> (base) (empty)
         0 |   class std::__1::__compressed_pair<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t> > __r_
         0 |     class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep, class std::__1::allocator<wchar_t>, 2> (base)
         0 |       class std::__1::allocator<wchar_t> (base) (empty)
         0 |       struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep __first_
         0 |         union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) 
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__long __l
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __cap_
         8 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type __size_
        16 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::pointer __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short __s
         0 |             union std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) 
         0 |               unsigned char __size_
         0 |               std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type __lx
         4 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::value_type [5] __data_
         0 |           struct std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::__raw __r
         0 |             std::__1::basic_string<wchar_t, struct std::__1::char_traits<wchar_t>, class std::__1::allocator<wchar_t> >::size_type [3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::money_base::pattern
         0 |   char [4] field
           | [sizeof=4, dsize=4, align=1,
           |  nvsize=4, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::__bitset<0, 0> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::ios_base
         0 |   (ios_base vtable pointer)
         8 |   std::__1::ios_base::fmtflags __fmtflags_
        16 |   std::__1::streamsize __precision_
        24 |   std::__1::streamsize __width_
        32 |   std::__1::ios_base::iostate __rdstate_
        36 |   std::__1::ios_base::iostate __exceptions_
        40 |   void * __rdbuf_
        48 |   void * __loc_
        56 |   std::__1::ios_base::event_callback * __fn_
        64 |   int * __index_
        72 |   size_t __event_size_
        80 |   size_t __event_cap_
        88 |   long * __iarray_
        96 |   size_t __iarray_size_
       104 |   size_t __iarray_cap_
       112 |   void ** __parray_
       120 |   size_t __parray_size_
       128 |   size_t __parray_cap_
           | [sizeof=136, dsize=136, align=8,
           |  nvsize=136, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ios<char>
         0 |   class std::__1::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     std::__1::ios_base::fmtflags __fmtflags_
        16 |     std::__1::streamsize __precision_
        24 |     std::__1::streamsize __width_
        32 |     std::__1::ios_base::iostate __rdstate_
        36 |     std::__1::ios_base::iostate __exceptions_
        40 |     void * __rdbuf_
        48 |     void * __loc_
        56 |     std::__1::ios_base::event_callback * __fn_
        64 |     int * __index_
        72 |     size_t __event_size_
        80 |     size_t __event_cap_
        88 |     long * __iarray_
        96 |     size_t __iarray_size_
       104 |     size_t __iarray_cap_
       112 |     void ** __parray_
       120 |     size_t __parray_size_
       128 |     size_t __parray_cap_
       136 |   basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       144 |   std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=152, dsize=148, align=8,
           |  nvsize=148, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ostream<char>
         0 |   (basic_ostream vtable pointer)
         8 |   class std::__1::basic_ios<char> (virtual base)
         8 |     class std::__1::ios_base (primary base)
         8 |       (ios_base vtable pointer)
        16 |       std::__1::ios_base::fmtflags __fmtflags_
        24 |       std::__1::streamsize __precision_
        32 |       std::__1::streamsize __width_
        40 |       std::__1::ios_base::iostate __rdstate_
        44 |       std::__1::ios_base::iostate __exceptions_
        48 |       void * __rdbuf_
        56 |       void * __loc_
        64 |       std::__1::ios_base::event_callback * __fn_
        72 |       int * __index_
        80 |       size_t __event_size_
        88 |       size_t __event_cap_
        96 |       long * __iarray_
       104 |       size_t __iarray_size_
       112 |       size_t __iarray_cap_
       120 |       void ** __parray_
       128 |       size_t __parray_size_
       136 |       size_t __parray_cap_
       144 |     basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> * __tie_
       152 |     std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type __fill_
           | [sizeof=160, dsize=156, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f82afad9640 prev 0x7f82af9f7568 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, line:386:1> line:231:24 referenced class ios_base definition
|-VisibilityAttr 0x7f82afad9740 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7f82afad9788 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:231:1, col:24> col:24 implicit referenced class ios_base
|-AccessSpecDecl 0x7f82afad9820 <line:233:1, col:7> col:1 public
|-CXXRecordDecl 0x7f82afad9878 <line:234:5, col:33> col:33 class failure
| `-VisibilityAttr 0x7f82afad9930 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:681:47, col:71> Default
|-TypedefDecl 0x7f82afad9990 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:236:5, col:26> col:26 referenced fmtflags 'unsigned int'
| `-BuiltinType 0x7f82af032c60 'unsigned int'
|-VarDecl 0x7f82afad9a20 <line:237:5, col:41> col:27 referenced boolalpha 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afad9aa0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afad9a80 <col:41> 'int' 1
|-VarDecl 0x7f82afad9b20 <line:238:5, col:41> col:27 referenced dec 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afad9ba0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afad9b80 <col:41> 'int' 2
|-VarDecl 0x7f82afad9c20 <line:239:5, col:41> col:27 referenced fixed 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afad9ca0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afad9c80 <col:41> 'int' 4
|-VarDecl 0x7f82afad9d20 <line:240:5, col:41> col:27 referenced hex 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afad9da0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afad9d80 <col:41> 'int' 8
|-VarDecl 0x7f82afad9e20 <line:241:5, col:41> col:27 referenced internal 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afad9ea0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afad9e80 <col:41> 'int' 16
|-VarDecl 0x7f82afad9f20 <line:242:5, col:41> col:27 referenced left 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afad9fa0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afad9f80 <col:41> 'int' 32
|-VarDecl 0x7f82afada020 <line:243:5, col:41> col:27 referenced oct 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afada0a0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afada080 <col:41> 'int' 64
|-VarDecl 0x7f82afada120 <line:244:5, col:41> col:27 referenced right 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afada1a0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afada180 <col:41> 'int' 128
|-VarDecl 0x7f82afada220 <line:245:5, col:41> col:27 referenced scientific 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afada2a0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afada280 <col:41> 'int' 256
|-VarDecl 0x7f82afada320 <line:246:5, col:41> col:27 referenced showbase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afada3a0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afada380 <col:41> 'int' 512
|-VarDecl 0x7f82afada420 <line:247:5, col:41> col:27 referenced showpoint 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afada4a0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afada480 <col:41> 'int' 1024
|-VarDecl 0x7f82afada520 <line:248:5, col:41> col:27 referenced showpos 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afada5a0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afada580 <col:41> 'int' 2048
|-VarDecl 0x7f82afada620 <line:249:5, col:41> col:27 referenced skipws 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afada6a0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afada680 <col:41> 'int' 4096
|-VarDecl 0x7f82afada720 <line:250:5, col:41> col:27 referenced unitbuf 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afada7a0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afada780 <col:41> 'int' 8192
|-VarDecl 0x7f82afada820 <line:251:5, col:41> col:27 referenced uppercase 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afada8a0 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afada880 <col:41> 'int' 16384
|-VarDecl 0x7f82afada920 <line:252:5, col:56> col:27 referenced adjustfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7f82afadaa68 <col:41, col:56> 'unsigned int' '|'
|   |-BinaryOperator 0x7f82afadaa00 <col:41, col:48> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7f82afada9d0 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7f82afada980 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f82afad9f20 'left' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7f82afada9e8 <col:48> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7f82afada9a8 <col:48> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f82afada120 'right' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7f82afadaa50 <col:56> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f82afadaa28 <col:56> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f82afad9e20 'internal' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7f82afadaaf8 <line:253:5, col:53> col:27 referenced basefield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7f82afadac40 <col:41, col:53> 'unsigned int' '|'
|   |-BinaryOperator 0x7f82afadabd8 <col:41, col:47> 'unsigned int' '|'
|   | |-ImplicitCastExpr 0x7f82afadaba8 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | | `-DeclRefExpr 0x7f82afadab58 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f82afad9b20 'dec' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   | `-ImplicitCastExpr 0x7f82afadabc0 <col:47> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7f82afadab80 <col:47> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f82afada020 'oct' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7f82afadac28 <col:53> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f82afadac00 <col:53> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f82afad9d20 'hex' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-VarDecl 0x7f82afadacd0 <line:254:5, col:54> col:27 referenced floatfield 'const std::__1::ios_base::fmtflags':'const unsigned int' static cinit
| `-BinaryOperator 0x7f82afadadb0 <col:41, col:54> 'unsigned int' '|'
|   |-ImplicitCastExpr 0x7f82afadad80 <col:41> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|   | `-DeclRefExpr 0x7f82afadad30 <col:41> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f82afada220 'scientific' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|   `-ImplicitCastExpr 0x7f82afadad98 <col:54> 'std::__1::ios_base::fmtflags':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f82afadad58 <col:54> 'const std::__1::ios_base::fmtflags':'const unsigned int' lvalue Var 0x7f82afad9c20 'fixed' 'const std::__1::ios_base::fmtflags':'const unsigned int'
|-TypedefDecl 0x7f82afadae48 <line:256:5, col:26> col:26 referenced iostate 'unsigned int'
| `-BuiltinType 0x7f82af032c60 'unsigned int'
|-VarDecl 0x7f82afadaed0 <line:257:5, col:36> col:26 referenced badbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afadaf50 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afadaf30 <col:36> 'int' 1
|-VarDecl 0x7f82afadafd0 <line:258:5, col:36> col:26 referenced eofbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afadb050 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afadb030 <col:36> 'int' 2
|-VarDecl 0x7f82afadb0d0 <line:259:5, col:36> col:26 referenced failbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afadb150 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afadb130 <col:36> 'int' 4
|-VarDecl 0x7f82afadb1d0 <line:260:5, col:36> col:26 referenced goodbit 'const std::__1::ios_base::iostate':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afadb250 <col:36> 'const std::__1::ios_base::iostate':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afadb230 <col:36> 'int' 0
|-TypedefDecl 0x7f82afadb2d8 <line:262:5, col:26> col:26 referenced openmode 'unsigned int'
| `-BuiltinType 0x7f82af032c60 'unsigned int'
|-VarDecl 0x7f82afadb360 <line:263:5, col:36> col:27 app 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afadb3e0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afadb3c0 <col:36> 'int' 1
|-VarDecl 0x7f82afadb460 <line:264:5, col:36> col:27 ate 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afadb4e0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afadb4c0 <col:36> 'int' 2
|-VarDecl 0x7f82afadb560 <line:265:5, col:36> col:27 binary 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afadb5e0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afadb5c0 <col:36> 'int' 4
|-VarDecl 0x7f82afadb660 <line:266:5, col:36> col:27 referenced in 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afadb6e0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afadb6c0 <col:36> 'int' 8
|-VarDecl 0x7f82afadb760 <line:267:5, col:36> col:27 referenced out 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afadb7e0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afadb7c0 <col:36> 'int' 16
|-VarDecl 0x7f82afadb860 <line:268:5, col:36> col:27 trunc 'const std::__1::ios_base::openmode':'const unsigned int' static cinit
| `-ImplicitCastExpr 0x7f82afadb8e0 <col:36> 'const std::__1::ios_base::openmode':'const unsigned int' <IntegralCast>
|   `-IntegerLiteral 0x7f82afadb8c0 <col:36> 'int' 32
|-EnumDecl 0x7f82afadb950 <line:270:5, col:32> col:10 referenced seekdir
| |-EnumConstantDecl 0x7f82afadba10 <col:19> col:19 referenced beg 'enum std::__1::ios_base::seekdir'
| |-EnumConstantDecl 0x7f82afadba60 <col:24> col:24 referenced cur 'enum std::__1::ios_base::seekdir'
| `-EnumConstantDecl 0x7f82afadbab0 <col:29> col:29 referenced end 'enum std::__1::ios_base::seekdir'
|-TypedefDecl 0x7f82afadbb10 <line:273:5, col:26> col:26 io_state 'std::__1::ios_base::iostate':'unsigned int'
| `-TypedefType 0x7f82afadaea0 'std::__1::ios_base::iostate' sugar
|   |-Typedef 0x7f82afadae48 'iostate'
|   `-BuiltinType 0x7f82af032c60 'unsigned int'
|-TypedefDecl 0x7f82afadbb78 <line:274:5, col:26> col:26 open_mode 'std::__1::ios_base::openmode':'unsigned int'
| `-TypedefType 0x7f82afadb330 'std::__1::ios_base::openmode' sugar
|   |-Typedef 0x7f82afadb2d8 'openmode'
|   `-BuiltinType 0x7f82af032c60 'unsigned int'
|-TypedefDecl 0x7f82afadbbe0 <line:275:5, col:26> col:26 seek_dir 'enum std::__1::ios_base::seekdir'
| `-EnumType 0x7f82afadb9f0 'enum std::__1::ios_base::seekdir'
|   `-Enum 0x7f82afadb950 'seekdir'
|-TypedefDecl 0x7f82afadbcf0 <line:277:5, col:30> col:30 streamoff 'std::__1::streamoff':'long long'
| `-ElaboratedType 0x7f82afadbc80 'std::__1::streamoff' sugar
|   `-TypedefType 0x7f82b02845d0 'std::__1::streamoff' sugar
|     |-Typedef 0x7f82afa03de8 'streamoff'
|     `-BuiltinType 0x7f82af032c00 'long long'
|-TypedefDecl 0x7f82afadbdd0 <line:278:5, col:30> col:30 streampos 'std::__1::streampos':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f82afadbd60 'std::__1::streampos' sugar
|   `-TypedefType 0x7f82b0284660 'std::__1::streampos' sugar
|     |-Typedef 0x7f82afa03a18 'streampos'
|     `-TemplateSpecializationType 0x7f82afa03970 'fpos<mbstate_t>' sugar fpos
|       |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|       `-RecordType 0x7f82afa03950 'class std::__1::fpos<__mbstate_t>'
|         `-ClassTemplateSpecialization 0x7f82afa03860 'fpos'
|-CXXRecordDecl 0x7f82afadbe58 <line:281:5, col:28> col:28 class Init
| `-VisibilityAttr 0x7f82afadbf10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXMethodDecl 0x7f82afadc040 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:284:48> col:40 flags 'std::__1::ios_base::fmtflags (void) const'
| |-AlwaysInlineAttr 0x7f82afadc0d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f82afadc120 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f82afadc260 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:285:62> col:40 flags 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f82afadc170 <col:46, col:55> col:55 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f82afadc300 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f82afadc348 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f82afadc420 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:286:61> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f82afadc398 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f82afadc4c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f82afadc508 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f82afadc6e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:287:78> col:40 used setf 'std::__1::ios_base::fmtflags (std::__1::ios_base::fmtflags, std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f82afadc558 <col:45, col:54> col:54 __fmtfl 'std::__1::ios_base::fmtflags':'unsigned int'
| |-ParmVarDecl 0x7f82afadc5c8 <col:63, col:72> col:72 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f82afadc788 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f82afadc7d0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f82afadc8e0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:288:58> col:36 used unsetf 'void (std::__1::ios_base::fmtflags)'
| |-ParmVarDecl 0x7f82afadc820 <col:43, col:52> col:52 __mask 'std::__1::ios_base::fmtflags':'unsigned int'
| |-AlwaysInlineAttr 0x7f82afadc980 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f82afadc9c8 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f82afadca80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:290:54> col:42 precision 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7f82afadcb18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f82afadcb60 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f82afadcc70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:291:69> col:42 precision 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7f82afadcbb0 <col:52, col:63> col:63 __prec 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7f82afadcd10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f82afadcd58 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f82afadcdb8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:292:50> col:42 width 'std::__1::streamsize (void) const'
| |-AlwaysInlineAttr 0x7f82afadce50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f82afadce98 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f82afadcf70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:293:65> col:42 width 'std::__1::streamsize (std::__1::streamsize)'
| |-ParmVarDecl 0x7f82afadcee8 <col:48, col:59> col:59 __wide 'std::__1::streamsize':'long'
| |-AlwaysInlineAttr 0x7f82afadd010 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f82afadd058 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f82afadd100 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:296:5, col:37> col:12 referenced imbue 'class std::__1::locale (const class std::__1::locale &)'
| `-ParmVarDecl 0x7f82afadd078 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f82afadd1f0 <line:297:5, col:21> col:12 referenced getloc 'class std::__1::locale (void) const'
|-CXXMethodDecl 0x7f82afadd2b0 <line:300:5, col:23> col:16 xalloc 'int (void)' static
|-CXXMethodDecl 0x7f82afadd3f0 <line:301:5, col:28> col:11 iword 'long &(int)'
| `-ParmVarDecl 0x7f82afadd360 <col:17, col:21> col:21 __index 'int'
|-CXXMethodDecl 0x7f82afadd578 <line:302:5, col:29> col:12 pword 'void *&(int)'
| `-ParmVarDecl 0x7f82afadd4a8 <col:18, col:22> col:22 __index 'int'
|-CXXDestructorDecl 0x7f82afadd668 <line:305:5, col:23> col:13 ~ios_base 'void (void) noexcept' virtual
|-EnumDecl 0x7f82afadd708 <line:308:5, col:58> col:10 referenced event
| |-EnumConstantDecl 0x7f82afadd7c0 <col:18> col:18 referenced erase_event 'enum std::__1::ios_base::event'
| |-EnumConstantDecl 0x7f82afadd810 <col:31> col:31 imbue_event 'enum std::__1::ios_base::event'
| `-EnumConstantDecl 0x7f82afadd860 <col:44> col:44 referenced copyfmt_event 'enum std::__1::ios_base::event'
|-TypedefDecl 0x7f82afaddb30 <line:309:5, col:65> col:20 referenced event_callback 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-PointerType 0x7f82afaddac0 'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
|   `-ParenType 0x7f82afadda60 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' sugar
|     `-FunctionProtoType 0x7f82afadda10 'void (enum std::__1::ios_base::event, class std::__1::ios_base &, int)' cdecl
|       |-BuiltinType 0x7f82af032b20 'void'
|       |-EnumType 0x7f82afadd7a0 'enum std::__1::ios_base::event'
|       | `-Enum 0x7f82afadd708 'event'
|       |-LValueReferenceType 0x7f82b010fc70 'class std::__1::ios_base &'
|       | `-RecordType 0x7f82af9f7600 'class std::__1::ios_base'
|       |   `-CXXRecord 0x7f82afad9640 'ios_base'
|       `-BuiltinType 0x7f82af032bc0 'int'
|-CXXMethodDecl 0x7f82afaddd50 <line:310:5, col:60> col:10 register_callback 'void (std::__1::ios_base::event_callback, int)'
| |-ParmVarDecl 0x7f82afaddbc0 <col:28, col:43> col:43 __fn 'std::__1::ios_base::event_callback':'void (*)(enum std::__1::ios_base::event, class std::__1::ios_base &, int)'
| `-ParmVarDecl 0x7f82afaddc38 <col:49, col:53> col:53 __index 'int'
|-AccessSpecDecl 0x7f82afadddf8 <line:312:1, col:8> col:1 private
|-CXXConstructorDecl 0x7f82afaddf40 <line:313:5, col:29> col:5 ios_base 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f82afadde58 <col:14, col:28> col:29 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7f82afade0c0 <line:314:5, col:40> col:15 operator= 'class std::__1::ios_base &(const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f82afade000 <col:25, col:39> col:40 'const class std::__1::ios_base &'
|-AccessSpecDecl 0x7f82afade160 <line:316:1, col:7> col:1 public
|-CXXMethodDecl 0x7f82afade260 <line:317:5, col:51> col:17 sync_with_stdio '_Bool (_Bool)' static
| `-ParmVarDecl 0x7f82afade198 <col:33, col:47> col:38 __sync '_Bool' cinit
|   `-CXXBoolLiteralExpr 0x7f82afae0658 <col:47> '_Bool' true
|-CXXMethodDecl 0x7f82afade380 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:319:49> col:39 rdstate 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7f82afade418 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f82afade460 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f82afade540 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:320:5, col:41> col:10 used clear 'void (std::__1::ios_base::iostate)'
| `-ParmVarDecl 0x7f82afade480 <col:16, col:34> col:24 __state 'std::__1::ios_base::iostate':'unsigned int' cinit
|   `-ImplicitCastExpr 0x7f82afae0698 <col:34> 'std::__1::ios_base::iostate':'unsigned int' <LValueToRValue>
|     `-DeclRefExpr 0x7f82afae0670 <col:34> 'const std::__1::ios_base::iostate':'const unsigned int' lvalue Var 0x7f82afadb1d0 'goodbit' 'const std::__1::ios_base::iostate':'const unsigned int'
|-CXXMethodDecl 0x7f82afade6a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:321:60> col:36 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f82afade620 <col:45, col:53> col:53 __state 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7f82afade748 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f82afade790 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f82afade7f0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:323:43> col:36 good '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f82afade888 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f82afade8d0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f82afade930 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:324:42> col:36 eof '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f82afade9c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f82afadea10 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f82afadea70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:325:43> col:36 fail '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f82afadeb08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f82afadeb50 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f82afadebb0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:326:42> col:36 bad '_Bool (void) const'
| |-AlwaysInlineAttr 0x7f82afadec48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f82afadec90 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f82afadecf0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:328:52> col:39 exceptions 'std::__1::ios_base::iostate (void) const'
| |-AlwaysInlineAttr 0x7f82afaded88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f82afadedd0 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f82afadeea8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:329:64> col:36 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f82afadee20 <col:47, col:55> col:55 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7f82afadef48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f82afadef90 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f82afadefc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:331:5, col:44> col:10 __set_badbit_and_consider_rethrow 'void (void)'
|-CXXMethodDecl 0x7f82afadf078 <line:332:5, col:45> col:10 __set_failbit_and_consider_rethrow 'void (void)'
|-AccessSpecDecl 0x7f82afadf110 <line:334:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f82afadf188 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:337:16> line:336:5 ios_base 'void (void)'
| |-CompoundStmt 0x7f82afae06b0 <col:16, line:337:16>
| |-AlwaysInlineAttr 0x7f82afadf230 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-VisibilityAttr 0x7f82afadf278 <col:51, col:74> Hidden
|-CXXMethodDecl 0x7f82afadf328 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:339:5, col:25> col:10 referenced init 'void (void *)'
| `-ParmVarDecl 0x7f82afadf2a0 <col:15, col:21> col:21 __sb 'void *'
|-CXXMethodDecl 0x7f82afadf458 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:340:64> col:33 rdbuf 'void *(void) const'
| |-CompoundStmt 0x7f82afae0748 <col:47, col:64>
| | `-ReturnStmt 0x7f82afae0730 <col:48, col:55>
| |   `-ImplicitCastExpr 0x7f82afae0718 <col:55> 'void *' <LValueToRValue>
| |     `-MemberExpr 0x7f82afae06e0 <col:55> 'void *const' lvalue ->__rdbuf_ 0x7f82afae0068
| |       `-CXXThisExpr 0x7f82afae06c8 <col:55> 'const class std::__1::ios_base *' this
| |-AlwaysInlineAttr 0x7f82afadf4f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7f82afadf538 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f82afadf618 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:347:5> line:343:10 rdbuf 'void (void *)'
| |-ParmVarDecl 0x7f82afadf590 <col:16, col:22> col:22 used __sb 'void *'
| |-CompoundStmt 0x7f82afae08c8 <line:344:5, line:347:5>
| | |-BinaryOperator 0x7f82afae07f8 <line:345:9, col:20> 'void *' lvalue '='
| | | |-MemberExpr 0x7f82afae0780 <col:9> 'void *' lvalue ->__rdbuf_ 0x7f82afae0068
| | | | `-CXXThisExpr 0x7f82afae0768 <col:9> 'class std::__1::ios_base *' this
| | | `-ImplicitCastExpr 0x7f82afae07e0 <col:20> 'void *' <LValueToRValue>
| | |   `-DeclRefExpr 0x7f82afae07b8 <col:20> 'void *' lvalue ParmVar 0x7f82afadf590 '__sb' 'void *'
| | `-CXXMemberCallExpr 0x7f82afae0870 <line:346:9, col:15> 'void'
| |   |-MemberExpr 0x7f82afae0838 <col:9> '<bound member function type>' ->clear 0x7f82afade540
| |   | `-CXXThisExpr 0x7f82afae0820 <col:9> 'class std::__1::ios_base *' this
| |   `-CXXDefaultArgExpr 0x7f82afae08a8 <<invalid sloc>> 'std::__1::ios_base::iostate':'unsigned int'
| |-AlwaysInlineAttr 0x7f82afadf6b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7f82afadf700 <col:48, col:71> Hidden
|-CXXMethodDecl 0x7f82afadf7e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:349:5, col:32> col:10 referenced __call_callbacks 'void (enum std::__1::ios_base::event)'
| `-ParmVarDecl 0x7f82afadf720 <col:27> col:32 'enum std::__1::ios_base::event'
|-CXXMethodDecl 0x7f82afadf918 <line:350:5, col:33> col:10 referenced copyfmt 'void (const class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f82afadf890 <col:18, col:32> col:33 'const class std::__1::ios_base &'
|-CXXMethodDecl 0x7f82afadfa90 <line:351:5, col:24> col:10 referenced move 'void (class std::__1::ios_base &)'
| `-ParmVarDecl 0x7f82afadf9c8 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7f82afadfc08 <line:352:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:352:10 referenced swap 'void (class std::__1::ios_base &) noexcept'
| `-ParmVarDecl 0x7f82afadfb40 <col:15, col:23> col:24 'class std::__1::ios_base &'
|-CXXMethodDecl 0x7f82afadfd78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:358:5> line:355:10 referenced set_rdbuf 'void (void *)'
| |-ParmVarDecl 0x7f82afadfcf0 <col:20, col:26> col:26 used __sb 'void *'
| |-CompoundStmt 0x7f82afae09a8 <line:356:5, line:358:5>
| | `-BinaryOperator 0x7f82afae0980 <line:357:9, col:20> 'void *' lvalue '='
| |   |-MemberExpr 0x7f82afae0908 <col:9> 'void *' lvalue ->__rdbuf_ 0x7f82afae0068
| |   | `-CXXThisExpr 0x7f82afae08f0 <col:9> 'class std::__1::ios_base *' this
| |   `-ImplicitCastExpr 0x7f82afae0968 <col:20> 'void *' <LValueToRValue>
| |     `-DeclRefExpr 0x7f82afae0940 <col:20> 'void *' lvalue ParmVar 0x7f82afadfcf0 '__sb' 'void *'
| |-AlwaysInlineAttr 0x7f82afadfe18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
| `-VisibilityAttr 0x7f82afadfe60 <col:48, col:71> Hidden
|-AccessSpecDecl 0x7f82afadfe70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:360:1, col:8> col:1 private
|-FieldDecl 0x7f82afadfea8 <line:362:5, col:21> col:21 referenced __fmtflags_ 'std::__1::ios_base::fmtflags':'unsigned int'
|-FieldDecl 0x7f82afadff00 <line:363:5, col:21> col:21 referenced __precision_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7f82afadff58 <line:364:5, col:21> col:21 referenced __width_ 'std::__1::streamsize':'long'
|-FieldDecl 0x7f82afadffb0 <line:365:5, col:21> col:21 referenced __rdstate_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7f82afae0008 <line:366:5, col:21> col:21 referenced __exceptions_ 'std::__1::ios_base::iostate':'unsigned int'
|-FieldDecl 0x7f82afae0068 <line:367:5, col:21> col:21 referenced __rdbuf_ 'void *'
|-FieldDecl 0x7f82afae00c8 <line:368:5, col:21> col:21 __loc_ 'void *'
|-FieldDecl 0x7f82afae0178 <line:369:5, col:21> col:21 __fn_ 'std::__1::ios_base::event_callback *'
|-FieldDecl 0x7f82afae01d8 <line:370:5, col:21> col:21 __index_ 'int *'
|-FieldDecl 0x7f82afae0230 <line:371:5, col:21> col:21 __event_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7f82afae0288 <line:372:5, col:21> col:21 __event_cap_ 'size_t':'unsigned long'
|-VarDecl 0x7f82afae0398 <line:376:5, col:24> col:24 __xindex_ 'atomic<int>':'struct std::__1::atomic<int>' static
|-FieldDecl 0x7f82afae0410 <line:380:5, col:21> col:21 __iarray_ 'long *'
|-FieldDecl 0x7f82afae0468 <line:381:5, col:21> col:21 __iarray_size_ 'size_t':'unsigned long'
|-FieldDecl 0x7f82afae04c0 <line:382:5, col:21> col:21 __iarray_cap_ 'size_t':'unsigned long'
|-FieldDecl 0x7f82afae0520 <line:383:5, col:21> col:21 __parray_ 'void **'
|-FieldDecl 0x7f82afae0578 <line:384:5, col:21> col:21 __parray_size_ 'size_t':'unsigned long'
`-FieldDecl 0x7f82afae05d0 <line:385:5, col:21> col:21 __parray_cap_ 'size_t':'unsigned long'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f82af9fe0d8 parent 0x7f82af9f74d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:482:78> col:64 class basic_ios definition
|-public 'class std::__1::ios_base'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f82b1466fc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7f82b14670b8 prev 0x7f82af9fe0d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:583:1, col:28> col:28 implicit class basic_ios
|-AccessSpecDecl 0x7f82b1467150 <line:586:1, col:7> col:1 public
|-TypedefDecl 0x7f82b14671b8 <line:588:5, col:20> col:20 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f82b1467180 'char' sugar
|   |-TemplateTypeParmType 0x7f82afae75f0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f82afae75b0 '_CharT'
|   `-BuiltinType 0x7f82af032b60 'char'
|-TypedefDecl 0x7f82b1467248 <line:589:5, col:21> col:21 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f82b1467210 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f82afae7660 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f82afae7618 '_Traits'
|   `-RecordType 0x7f82af9fe040 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f82b028eaa8 'char_traits'
|-TypedefDecl 0x7f82b1467350 <line:591:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f82b1467300 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f82b02905f0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f82b028ee08 'int_type'
|     `-BuiltinType 0x7f82af032bc0 'int'
|-TypedefDecl 0x7f82b1467420 <line:592:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f82b14673d0 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f82b145bd40 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f82b028eed8 'pos_type'
|     `-TypedefType 0x7f82b0284660 'std::__1::streampos' sugar
|       |-Typedef 0x7f82afa03a18 'streampos'
|       `-TemplateSpecializationType 0x7f82afa03970 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f82afa03950 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f82afa03860 'fpos'
|-TypedefDecl 0x7f82b14674f0 <line:593:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f82b14674a0 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f82b145be30 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f82b028ee70 'off_type'
|     `-TypedefType 0x7f82b02845d0 'std::__1::streamoff' sugar
|       |-Typedef 0x7f82afa03de8 'streamoff'
|       `-BuiltinType 0x7f82af032c00 'long long'
|-CXXConversionDecl 0x7f82b1467548 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:605:60> col:22 operator bool '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f82b1467618 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82b1467668 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:608:69> col:32 operator! '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f82b1467710 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82b1467758 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:609:81> col:35 rdstate 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7f82b1467800 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82b14678d0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:610:91> col:32 clear 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f82b1467848 <col:38, col:56> col:46 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7f82b1467980 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82b1467a50 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:611:87> col:32 setstate 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f82b14679c8 <col:41, col:49> col:49 __state 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7f82b1467b00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82b1467b48 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:612:70> col:32 good '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f82b1467bf0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82b1467c38 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:613:69> col:32 eof '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f82b1467ce0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82b1467d28 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:614:70> col:32 fail '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f82b1467dd0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82b1467e18 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:615:69> col:32 bad '_Bool (void) const'
| `-AlwaysInlineAttr 0x7f82b1467ec0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82b1467f08 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:617:85> col:35 exceptions 'std::__1::ios_base::iostate (void) const'
| `-AlwaysInlineAttr 0x7f82b1467fb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82b1468080 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:618:95> col:32 exceptions 'void (std::__1::ios_base::iostate)'
| |-ParmVarDecl 0x7f82b1467ff8 <col:43, col:51> col:51 __iostate 'std::__1::ios_base::iostate':'unsigned int'
| `-AlwaysInlineAttr 0x7f82b1468130 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXConstructorDecl 0x7f82b14683e0 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:622:68> col:14 basic_ios 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f82b1468298 <col:24, col:64> col:64 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f82b14684a0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7f82b1468518 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:623:5, col:24> col:13 ~basic_ios 'void (void) noexcept' virtual
|-CXXMethodDecl 0x7f82b1468770 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:627:50> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7f82b1468818 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82b1468b50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:629:95> col:44 tie 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f82b1468a08 <col:48, col:87> col:87 __tiestr 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f82b1468c00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82b1468dc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:632:54> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(void) const'
| `-AlwaysInlineAttr 0x7f82b1468e68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82b14691a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:634:97> col:46 rdbuf 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *(basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f82b1469058 <col:52, col:93> col:93 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f82b1469250 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82b14693d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:636:5, col:46> col:16 copyfmt 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)'
| `-ParmVarDecl 0x7f82b1469308 <col:24, col:41> col:41 __rhs 'const class std::__1::basic_ios<char> &'
|-CXXMethodDecl 0x7f82b14694d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:639:22> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (void) const'
| `-AlwaysInlineAttr 0x7f82b1469578 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82b14696d0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:641:34> col:15 fill 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type)'
| |-ParmVarDecl 0x7f82b14695d0 <col:20, col:30> col:30 __ch 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7f82b1469780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82b1469850 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:644:37> col:12 imbue 'class std::__1::locale (const class std::__1::locale &)'
| |-ParmVarDecl 0x7f82b14697c8 <col:18, col:32> col:32 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7f82b1469900 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82b1469a90 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:647:47> col:10 narrow 'char (std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, char) const'
| |-ParmVarDecl 0x7f82b1469958 <col:17, col:27> col:27 __c 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type':'char'
| |-ParmVarDecl 0x7f82b14699b8 <col:32, col:37> col:37 __dfault 'char'
| `-AlwaysInlineAttr 0x7f82b1469b48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82b1469c50 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:649:31> col:15 widen 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type (char) const'
| |-ParmVarDecl 0x7f82b1469b90 <col:21, col:26> col:26 __c 'char'
| `-AlwaysInlineAttr 0x7f82b1469d00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-AccessSpecDecl 0x7f82b1469d48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:651:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f82b1469d90 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:654:17> line:653:5 basic_ios 'void (void)'
| `-AlwaysInlineAttr 0x7f82b1469e48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82b146a050 <line:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:656:60> col:10 init 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f82b1469f88 <col:15, col:56> col:56 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f82b146a100 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82b146a220 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:659:31> col:10 move 'void (class std::__1::basic_ios<char> &)'
| |-ParmVarDecl 0x7f82b146a158 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7f82b146a2d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82b146a420 <line:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:662:47> col:10 move 'void (class std::__1::basic_ios<char> &&)'
| |-ParmVarDecl 0x7f82b146a358 <col:15, col:27> col:27 __rhs 'class std::__1::basic_ios<char> &&'
| `-AlwaysInlineAttr 0x7f82b146a4d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82b146a5f8 <line:709:35, line:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:665:10 swap 'void (class std::__1::basic_ios<char> &) noexcept'
| |-ParmVarDecl 0x7f82b146a528 <col:15, col:26> col:26 __rhs 'class std::__1::basic_ios<char> &'
| `-AlwaysInlineAttr 0x7f82b146a6a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82b146a8b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:667:65> col:10 set_rdbuf 'void (basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *)'
| |-ParmVarDecl 0x7f82b146a7e8 <col:20, col:61> col:61 __sb 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f82b146a960 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-AccessSpecDecl 0x7f82b146a9a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ios:668:1, col:8> col:1 private
|-FieldDecl 0x7f82b146aac8 <line:669:5, col:44> col:44 __tie_ 'basic_ostream<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
|-FieldDecl 0x7f82b146ab40 <line:670:6, col:23> col:23 __fill_ 'std::__1::basic_ios<char, struct std::__1::char_traits<char> >::int_type':'int' mutable
|-CXXConstructorDecl 0x7f82b146abc8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:482:64> col:64 implicit basic_ios 'void (const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7f82b146abc8
| `-ParmVarDecl 0x7f82b146acf0 <col:64> col:64 'const class std::__1::basic_ios<char> &'
`-CXXMethodDecl 0x7f82b146ad58 <col:64, <invalid sloc>> col:64 implicit operator= 'class std::__1::basic_ios<char> &(const class std::__1::basic_ios<char> &)' inline default_delete noexcept-unevaluated 0x7f82b146ad58
  `-ParmVarDecl 0x7f82b146ae30 <col:64> col:64 'const class std::__1::basic_ios<char> &'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ios" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f82af9fed98 parent 0x7f82af9f74d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:1085:82> col:64 class basic_ostream definition
|-virtual public 'basic_ios<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ios<char>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f82afb7b858 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7f82afb7ba90 prev 0x7f82af9fed98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:151:1, col:28> col:28 implicit class basic_ostream
|-AccessSpecDecl 0x7f82afb7bb28 <line:154:1, col:7> col:1 public
|-TypedefDecl 0x7f82afb7bb60 <line:156:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f82afb7b920 'char' sugar
|   |-TemplateTypeParmType 0x7f82afb4b4d0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f82afb4b488 '_CharT'
|   `-BuiltinType 0x7f82af032b60 'char'
|-TypedefDecl 0x7f82afb7bbc8 <line:157:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f82afb7b960 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f82afb4b540 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f82afb4b4f8 '_Traits'
|   `-RecordType 0x7f82af9fe040 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f82b028eaa8 'char_traits'
|-TypedefDecl 0x7f82afb7bcd0 <line:158:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f82afb7bc80 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f82b02905f0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f82b028ee08 'int_type'
|     `-BuiltinType 0x7f82af032bc0 'int'
|-TypedefDecl 0x7f82afb7bda0 <line:159:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f82afb7bd50 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f82b145bd40 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f82b028eed8 'pos_type'
|     `-TypedefType 0x7f82b0284660 'std::__1::streampos' sugar
|       |-Typedef 0x7f82afa03a18 'streampos'
|       `-TemplateSpecializationType 0x7f82afa03970 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f82afa03950 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f82afa03860 'fpos'
|-TypedefDecl 0x7f82afb7be70 <line:160:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f82afb7be20 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f82b145be30 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f82b028ee70 'off_type'
|     `-TypedefType 0x7f82b02845d0 'std::__1::streamoff' sugar
|       |-Typedef 0x7f82afa03de8 'streamoff'
|       `-BuiltinType 0x7f82af032c00 'long long'
|-CXXConstructorDecl 0x7f82afb7c0f0 <line:163:5, line:165:25> line:164:14 basic_ostream 'void (basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)' inline
| |-ParmVarDecl 0x7f82afb7bfe8 <col:28, col:69> col:69 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
| `-AlwaysInlineAttr 0x7f82afb7c1b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXDestructorDecl 0x7f82afb7c228 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:166:5, col:28> col:13 ~basic_ostream 'void (void) noexcept' virtual
|-AccessSpecDecl 0x7f82afb7c2d8 <line:167:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f82afb7c420 <line:169:5, line:170:40> col:5 basic_ostream 'void (class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7f82afb7c338 <col:19, col:35> col:35 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7f82afb7c4e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7f82afb7c630 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:175:5, line:176:51> col:20 operator= 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &&)' inline
| |-ParmVarDecl 0x7f82afb7c568 <col:30, col:46> col:46 __rhs 'class std::__1::basic_ostream<char> &&'
| `-AlwaysInlineAttr 0x7f82afb7c6e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|-CXXMethodDecl 0x7f82afb7c800 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:178:5, line:180:55> line:179:10 swap 'void (class std::__1::basic_ostream<char> &)' inline
| |-ParmVarDecl 0x7f82afb7c738 <col:15, col:30> col:30 __rhs 'class std::__1::basic_ostream<char> &'
| `-AlwaysInlineAttr 0x7f82afb7c8b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXConstructorDecl 0x7f82afb7ca20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:183:5, col:65> col:5 basic_ostream 'void (const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7f82afb7c938 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-CXXMethodDecl 0x7f82afb7cbb0 <line:184:5, col:65> col:20 operator= 'class std::__1::basic_ostream<char> &(const class std::__1::basic_ostream<char> &)' delete
| `-ParmVarDecl 0x7f82afb7caf0 <col:30, col:51> col:51 __rhs 'const class std::__1::basic_ostream<char> &'
|-AccessSpecDecl 0x7f82afb7cc60 <line:189:1, col:7> col:1 public
|-CXXRecordDecl 0x7f82afb7cc88 <line:192:5, col:32> col:32 class sentry definition
| |-CXXRecordDecl 0x7f82afb7fb10 prev 0x7f82afb7cc88 <line:242:1, col:60> col:60 implicit class sentry
| |-FieldDecl 0x7f82afb7fba8 <line:244:5, col:10> col:10 __ok_ '_Bool'
| |-FieldDecl 0x7f82afb7fd48 <line:245:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXConstructorDecl 0x7f82afb7fed0 <line:247:5, col:25> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7f82afb7fdc8 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-CXXMethodDecl 0x7f82afb80090 <line:248:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| | `-ParmVarDecl 0x7f82afb7ffc8 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
| |-AccessSpecDecl 0x7f82afb80140 <line:250:1, col:7> col:1 public
| |-CXXConstructorDecl 0x7f82afb80350 <line:251:5, col:57> col:14 sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| | `-ParmVarDecl 0x7f82afb80268 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
| |-CXXDestructorDecl 0x7f82afb80440 <line:252:5, col:13> col:5 ~sentry 'void (void)' noexcept-unevaluated 0x7f82afb80440
| `-CXXConversionDecl 0x7f82afb804f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:256:45> col:9 operator bool '_Bool (void) const'
|   `-AlwaysInlineAttr 0x7f82afb805c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82afb7cfc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:195:5, line:197:27> line:196:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &))' inline
| |-ParmVarDecl 0x7f82afb7cec0 <col:31, col:68> col:48 __pf 'class std::__1::basic_ostream<char> &(*)(class std::__1::basic_ostream<char> &)'
| `-AlwaysInlineAttr 0x7f82afb7d070 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82afb7d550 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:199:5, line:202:34> line:200:20 operator<< 'class std::__1::basic_ostream<char> &(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &))' inline
| |-ParmVarDecl 0x7f82afb7d450 <col:31, line:201:72> col:33 __pf 'basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &(*)(basic_ios<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> &)'
| `-AlwaysInlineAttr 0x7f82afb7d600 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82afb7d750 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:204:5, line:206:34> line:205:20 operator<< 'class std::__1::basic_ostream<char> &(class std::__1::ios_base &(*)(class std::__1::ios_base &))' inline
| |-ParmVarDecl 0x7f82afb7d648 <col:31, col:58> col:43 __pf 'class std::__1::ios_base &(*)(class std::__1::ios_base &)'
| `-AlwaysInlineAttr 0x7f82afb7d800 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82afb7d910 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:208:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(_Bool)'
| `-ParmVarDecl 0x7f82afb7d848 <col:31, col:36> col:36 __n '_Bool'
|-CXXMethodDecl 0x7f82afb7da80 <line:209:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(short)'
| `-ParmVarDecl 0x7f82afb7d9c0 <col:31, col:37> col:37 __n 'short'
|-CXXMethodDecl 0x7f82afb7dbf0 <line:210:5, col:49> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned short)'
| `-ParmVarDecl 0x7f82afb7db30 <col:31, col:46> col:46 __n 'unsigned short'
|-CXXMethodDecl 0x7f82afb7dd60 <line:211:5, col:38> col:20 used operator<< 'class std::__1::basic_ostream<char> &(int)'
| `-ParmVarDecl 0x7f82afb7dca0 <col:31, col:35> col:35 __n 'int'
|-CXXMethodDecl 0x7f82afb7ded0 <line:212:5, col:47> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned int)'
| `-ParmVarDecl 0x7f82afb7de10 <col:31, col:44> col:44 __n 'unsigned int'
|-CXXMethodDecl 0x7f82afb7e040 <line:213:5, col:39> col:20 operator<< 'class std::__1::basic_ostream<char> &(long)'
| `-ParmVarDecl 0x7f82afb7df80 <col:31, col:36> col:36 __n 'long'
|-CXXMethodDecl 0x7f82afb7e1b0 <line:214:5, col:48> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long)'
| `-ParmVarDecl 0x7f82afb7e0f0 <col:31, col:45> col:45 __n 'unsigned long'
|-CXXMethodDecl 0x7f82afb7e320 <line:215:5, col:44> col:20 operator<< 'class std::__1::basic_ostream<char> &(long long)'
| `-ParmVarDecl 0x7f82afb7e260 <col:31, col:41> col:41 __n 'long long'
|-CXXMethodDecl 0x7f82afb7e490 <line:216:5, col:53> col:20 operator<< 'class std::__1::basic_ostream<char> &(unsigned long long)'
| `-ParmVarDecl 0x7f82afb7e3d0 <col:31, col:50> col:50 __n 'unsigned long long'
|-CXXMethodDecl 0x7f82afb7e600 <line:217:5, col:40> col:20 operator<< 'class std::__1::basic_ostream<char> &(float)'
| `-ParmVarDecl 0x7f82afb7e540 <col:31, col:37> col:37 __f 'float'
|-CXXMethodDecl 0x7f82afb7e770 <line:218:5, col:41> col:20 operator<< 'class std::__1::basic_ostream<char> &(double)'
| `-ParmVarDecl 0x7f82afb7e6b0 <col:31, col:38> col:38 __f 'double'
|-CXXMethodDecl 0x7f82afb7e8e0 <line:219:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(long double)'
| `-ParmVarDecl 0x7f82afb7e820 <col:31, col:43> col:43 __f 'long double'
|-CXXMethodDecl 0x7f82afb7ea50 <line:220:5, col:46> col:20 operator<< 'class std::__1::basic_ostream<char> &(const void *)'
| `-ParmVarDecl 0x7f82afb7e990 <col:31, col:43> col:43 __p 'const void *'
|-CXXMethodDecl 0x7f82afb7ed00 <line:221:5, col:76> col:20 operator<< 'class std::__1::basic_ostream<char> &(basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *)'
| `-ParmVarDecl 0x7f82afb7ebf8 <col:31, col:72> col:72 __sb 'basic_streambuf<std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::traits_type> *'
|-CXXMethodDecl 0x7f82afb7eec0 <line:224:5, col:37> col:20 put 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type)'
| `-ParmVarDecl 0x7f82afb7edc0 <col:24, col:34> col:34 __c 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type':'char'
|-CXXMethodDecl 0x7f82afb7f120 <line:225:5, col:62> col:20 write 'class std::__1::basic_ostream<char> &(const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)'
| |-ParmVarDecl 0x7f82afb7efa8 <col:26, col:43> col:43 __s 'const std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f82afb7f008 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f82afb7f230 <line:226:5, col:26> col:20 flush 'class std::__1::basic_ostream<char> &(void)'
|-CXXMethodDecl 0x7f82afb7f380 <line:229:5, line:230:20> col:14 tellp 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type (void)' inline
| `-AlwaysInlineAttr 0x7f82afb7f428 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-CXXMethodDecl 0x7f82afb7f580 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:231:5, line:232:40> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type)' inline
| |-ParmVarDecl 0x7f82afb7f480 <col:26, col:35> col:35 __pos 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-AlwaysInlineAttr 0x7f82afb7f630 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-CXXMethodDecl 0x7f82afb7f820 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:233:5, line:234:65> col:20 seekp 'class std::__1::basic_ostream<char> &(std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir)' inline
| |-ParmVarDecl 0x7f82afb7f6b0 <col:26, col:35> col:35 __off 'std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7f82afb7f710 <col:42, col:60> col:60 __dir 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-AlwaysInlineAttr 0x7f82afb7f8d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> Inherited always_inline
|-AccessSpecDecl 0x7f82afb7f920 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:236:1, col:10> col:1 protected
`-CXXConstructorDecl 0x7f82afb7f968 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:238:22> col:5 basic_ostream 'void (void)'
  `-AlwaysInlineAttr 0x7f82afb7fa20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream.base" = type { i32 (...)** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct std::__1::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1185:9)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/utility:1203:9)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >
         0 |   struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> (base) (empty)
         0 |   std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type * __sbuf_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry
         0 |   _Bool __ok_
         8 |   basic_ostream<char, struct std::__1::char_traits<char> > & __os_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f82afb7cc88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:192:5, col:32> col:32 referenced class sentry definition
|-CXXRecordDecl 0x7f82afb7fb10 prev 0x7f82afb7cc88 <line:242:1, col:60> col:60 implicit class sentry
|-FieldDecl 0x7f82afb7fba8 <line:244:5, col:10> col:10 referenced __ok_ '_Bool'
|-FieldDecl 0x7f82afb7fd48 <line:245:5, col:37> col:37 __os_ 'basic_ostream<char, struct std::__1::char_traits<char> > &'
|-CXXConstructorDecl 0x7f82afb7fed0 <line:247:5, col:25> col:5 sentry 'void (const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| `-ParmVarDecl 0x7f82afb7fdc8 <col:12, col:24> col:25 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
|-CXXMethodDecl 0x7f82afb80090 <line:248:5, col:36> col:13 operator= 'class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &(const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &)'
| `-ParmVarDecl 0x7f82afb7ffc8 <col:23, col:35> col:36 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry &'
|-AccessSpecDecl 0x7f82afb80140 <line:250:1, col:7> col:1 public
|-CXXConstructorDecl 0x7f82afb80350 <line:251:5, col:57> col:14 used sentry 'void (basic_ostream<char, struct std::__1::char_traits<char> > &)'
| `-ParmVarDecl 0x7f82afb80268 <col:21, col:53> col:53 __os 'basic_ostream<char, struct std::__1::char_traits<char> > &'
|-CXXDestructorDecl 0x7f82afb80440 <line:252:5, col:13> col:5 used ~sentry 'void (void) noexcept'
`-CXXConversionDecl 0x7f82afb804f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/ostream:256:45> col:9 used operator bool '_Bool (void) const'
  |-CompoundStmt 0x7f82afbb31e0 <col:31, col:45>
  | `-ReturnStmt 0x7f82afbb31c8 <col:32, col:39>
  |   `-ImplicitCastExpr 0x7f82afbb31b0 <col:39> '_Bool' <LValueToRValue>
  |     `-MemberExpr 0x7f82afbb3178 <col:39> 'const _Bool' lvalue ->__ok_ 0x7f82afb7fba8
  |       `-CXXThisExpr 0x7f82afbb3160 <col:39> 'const class std::__1::basic_ostream<char, struct std::__1::char_traits<char> >::sentry *' this
  `-AlwaysInlineAttr 0x7f82afb805c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream<char, std::__1::char_traits<char> >::sentry" = type { i8, %"class.std::__1::basic_ostream"* }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream<char, std::__1::char_traits<char> >::sentry" = type { i8, %"class.std::__1::basic_ostream"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f82b1088468 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:520:1, line:529:1> line:522:29 struct iterator definition
|-TemplateArgument type 'struct std::__1::output_iterator_tag'
|-TemplateArgument type 'void'
|-TemplateArgument type 'void'
|-TemplateArgument type 'void'
|-TemplateArgument type 'void'
|-CXXRecordDecl 0x7f82b1088770 prev 0x7f82b1088468 <col:1, col:29> col:29 implicit struct iterator
|-TypedefDecl 0x7f82b1088848 <line:524:5, col:24> col:24 value_type 'void':'void'
| `-SubstTemplateTypeParmType 0x7f82b1088810 'void' sugar
|   |-TemplateTypeParmType 0x7f82b10719d0 '_Tp' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f82b1071988 '_Tp'
|   `-BuiltinType 0x7f82af032b20 'void'
|-TypedefDecl 0x7f82b10888d8 <line:525:5, col:24> col:24 difference_type 'void':'void'
| `-SubstTemplateTypeParmType 0x7f82b10888a0 'void' sugar
|   |-TemplateTypeParmType 0x7f82b1071a50 '_Distance' dependent depth 0 index 2
|   | `-TemplateTypeParm 0x7f82b1071a08 '_Distance'
|   `-BuiltinType 0x7f82af032b20 'void'
|-TypedefDecl 0x7f82b1088968 <line:526:5, col:24> col:24 pointer 'void':'void'
| `-SubstTemplateTypeParmType 0x7f82b1088930 'void' sugar
|   |-TemplateTypeParmType 0x7f82b1071b00 '_Pointer' dependent depth 0 index 3
|   | `-TemplateTypeParm 0x7f82b1071ab8 '_Pointer'
|   `-BuiltinType 0x7f82af032b20 'void'
|-TypedefDecl 0x7f82b10889f8 <line:527:5, col:24> col:24 reference 'void':'void'
| `-SubstTemplateTypeParmType 0x7f82b10889c0 'void' sugar
|   |-TemplateTypeParmType 0x7f82b1071bb0 '_Reference' dependent depth 0 index 4
|   | `-TemplateTypeParm 0x7f82b1071b68 '_Reference'
|   `-BuiltinType 0x7f82af032b20 'void'
|-TypedefDecl 0x7f82b1088a88 <line:528:5, col:24> col:24 iterator_category 'struct std::__1::output_iterator_tag':'struct std::__1::output_iterator_tag'
| `-SubstTemplateTypeParmType 0x7f82b1088a50 'struct std::__1::output_iterator_tag' sugar
|   |-TemplateTypeParmType 0x7f82b1071960 '_Category' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f82b1071920 '_Category'
|   `-RecordType 0x7f82b1062d70 'struct std::__1::output_iterator_tag'
|     `-CXXRecord 0x7f82b1062cd8 'output_iterator_tag'
|-CXXDestructorDecl 0x7f82b15075f8 <line:522:29> col:29 implicit ~iterator 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f82afbb0a38 <col:29> col:29 implicit constexpr iterator 'void (const struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &)' inline default trivial noexcept-unevaluated 0x7f82afbb0a38
| `-ParmVarDecl 0x7f82afbb0b60 <col:29> col:29 'const struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &'
|-CXXConstructorDecl 0x7f82afbb0bf8 <col:29> col:29 implicit used constexpr iterator 'void (struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7f82afbb0d20 <col:29> col:29 'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &&'
| `-CompoundStmt 0x7f82afbb2a68 <col:29>
`-CXXConstructorDecl 0x7f82afbb2980 <col:29> col:29 implicit used constexpr iterator 'void (void) noexcept' inline default trivial
  `-CompoundStmt 0x7f82afbb3370 <col:29>

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::iterator" = type { i8 }
  NonVirtualBaseLLVMType:%"struct.std::__1::iterator" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::__1::locale
         0 |   class std::__1::locale::__imp * __locale_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__1::basic_streambuf<char>
         0 |   (basic_streambuf vtable pointer)
         8 |   class std::__1::locale __loc_
         8 |     class std::__1::locale::__imp * __locale_
        16 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __binp_
        24 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __ninp_
        32 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __einp_
        40 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __bout_
        48 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __nout_
        56 |   std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type * __eout_
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f82b141d268 prev 0x7f82b141cab8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:62:1, line:123:1> line:62:24 referenced class locale definition
|-VisibilityAttr 0x7f82b141d368 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7f82b141d3b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:62:1, col:24> col:24 implicit referenced class locale
|-AccessSpecDecl 0x7f82b141d448 <line:64:1, col:7> col:1 public
|-CXXRecordDecl 0x7f82b141d4a0 <line:66:5, col:28> col:28 referenced class facet
| `-VisibilityAttr 0x7f82b141d560 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-CXXRecordDecl 0x7f82b141d5d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:67:5, col:28> col:28 referenced class id
| `-VisibilityAttr 0x7f82b141d690 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:649:46, col:70> Default
|-TypedefDecl 0x7f82b141d6f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:69:5, col:17> col:17 referenced category 'int'
| `-BuiltinType 0x7f82af032bc0 'int'
|-VarDecl 0x7f82b141d780 <line:70:5, line:71:20> col:9 none 'const std::__1::locale::category':'const int' static cinit
| `-IntegerLiteral 0x7f82b141d7e0 <col:20> 'int' 0
|-VarDecl 0x7f82b141d868 <line:70:5, /usr/include/xlocale.h:45:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:72:9 referenced collate 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7f82b141d930 </usr/include/xlocale.h:45:27, col:34> 'int'
|   `-BinaryOperator 0x7f82b141d908 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7f82b141d8c8 <col:28> 'int' 1
|     `-IntegerLiteral 0x7f82b141d8e8 <col:33> 'int' 0
|-VarDecl 0x7f82b141d9b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:46:32> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:73:9 referenced ctype 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7f82b141da80 </usr/include/xlocale.h:46:25, col:32> 'int'
|   `-BinaryOperator 0x7f82b141da58 <col:26, col:31> 'int' '<<'
|     |-IntegerLiteral 0x7f82b141da18 <col:26> 'int' 1
|     `-IntegerLiteral 0x7f82b141da38 <col:31> 'int' 1
|-VarDecl 0x7f82b141db08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:48:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:74:9 referenced monetary 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7f82b141dbd0 </usr/include/xlocale.h:48:27, col:34> 'int'
|   `-BinaryOperator 0x7f82b141dba8 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7f82b141db68 <col:28> 'int' 1
|     `-IntegerLiteral 0x7f82b141db88 <col:33> 'int' 3
|-VarDecl 0x7f82b141dc58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:49:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:75:9 referenced numeric 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7f82b141dd20 </usr/include/xlocale.h:49:27, col:34> 'int'
|   `-BinaryOperator 0x7f82b141dcf8 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7f82b141dcb8 <col:28> 'int' 1
|     `-IntegerLiteral 0x7f82b141dcd8 <col:33> 'int' 4
|-VarDecl 0x7f82b141dda8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:50:31> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:76:9 referenced time 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7f82b141de70 </usr/include/xlocale.h:50:24, col:31> 'int'
|   `-BinaryOperator 0x7f82b141de48 <col:25, col:30> 'int' '<<'
|     |-IntegerLiteral 0x7f82b141de08 <col:25> 'int' 1
|     `-IntegerLiteral 0x7f82b141de28 <col:30> 'int' 5
|-VarDecl 0x7f82b141def8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, /usr/include/xlocale.h:47:34> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:77:9 referenced messages 'const std::__1::locale::category':'const int' static cinit
| `-ParenExpr 0x7f82b141dfc0 </usr/include/xlocale.h:47:27, col:34> 'int'
|   `-BinaryOperator 0x7f82b141df98 <col:28, col:33> 'int' '<<'
|     |-IntegerLiteral 0x7f82b141df58 <col:28> 'int' 1
|     `-IntegerLiteral 0x7f82b141df78 <col:33> 'int' 2
|-VarDecl 0x7f82b141e048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:70:5, line:78:61> col:9 all 'const std::__1::locale::category':'const int' static cinit
| `-BinaryOperator 0x7f82b141e2c8 <col:15, col:61> 'int' '|'
|   |-BinaryOperator 0x7f82b141e260 <col:15, col:54> 'int' '|'
|   | |-BinaryOperator 0x7f82b141e1f8 <col:15, col:44> 'int' '|'
|   | | |-BinaryOperator 0x7f82b141e190 <col:15, col:33> 'int' '|'
|   | | | |-BinaryOperator 0x7f82b141e128 <col:15, col:25> 'int' '|'
|   | | | | |-ImplicitCastExpr 0x7f82b141e0f8 <col:15> 'std::__1::locale::category':'int' <LValueToRValue>
|   | | | | | `-DeclRefExpr 0x7f82b141e0a8 <col:15> 'const std::__1::locale::category':'const int' lvalue Var 0x7f82b141d868 'collate' 'const std::__1::locale::category':'const int'
|   | | | | `-ImplicitCastExpr 0x7f82b141e110 <col:25> 'std::__1::locale::category':'int' <LValueToRValue>
|   | | | |   `-DeclRefExpr 0x7f82b141e0d0 <col:25> 'const std::__1::locale::category':'const int' lvalue Var 0x7f82b141d9b8 'ctype' 'const std::__1::locale::category':'const int'
|   | | | `-ImplicitCastExpr 0x7f82b141e178 <col:33> 'std::__1::locale::category':'int' <LValueToRValue>
|   | | |   `-DeclRefExpr 0x7f82b141e150 <col:33> 'const std::__1::locale::category':'const int' lvalue Var 0x7f82b141db08 'monetary' 'const std::__1::locale::category':'const int'
|   | | `-ImplicitCastExpr 0x7f82b141e1e0 <col:44> 'std::__1::locale::category':'int' <LValueToRValue>
|   | |   `-DeclRefExpr 0x7f82b141e1b8 <col:44> 'const std::__1::locale::category':'const int' lvalue Var 0x7f82b141dc58 'numeric' 'const std::__1::locale::category':'const int'
|   | `-ImplicitCastExpr 0x7f82b141e248 <col:54> 'std::__1::locale::category':'int' <LValueToRValue>
|   |   `-DeclRefExpr 0x7f82b141e220 <col:54> 'const std::__1::locale::category':'const int' lvalue Var 0x7f82b141dda8 'time' 'const std::__1::locale::category':'const int'
|   `-ImplicitCastExpr 0x7f82b141e2b0 <col:61> 'std::__1::locale::category':'int' <LValueToRValue>
|     `-DeclRefExpr 0x7f82b141e288 <col:61> 'const std::__1::locale::category':'const int' lvalue Var 0x7f82b141def8 'messages' 'const std::__1::locale::category':'const int'
|-CXXConstructorDecl 0x7f82b141e400 <line:81:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:81:5 locale 'void (void) noexcept'
|-CXXConstructorDecl 0x7f82b141e5c8 <line:82:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:82:5 referenced locale 'void (const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7f82b141e4b8 <col:12, col:24> col:25 'const class std::__1::locale &'
|-CXXConstructorDecl 0x7f82b141e718 <line:83:5, col:32> col:14 locale 'void (const char *)'
| `-ParmVarDecl 0x7f82b141e690 <col:21, col:31> col:32 'const char *'
|-CXXConstructorDecl 0x7f82b141e860 <line:84:5, col:34> col:14 locale 'void (const std::__1::string &)'
| `-ParmVarDecl 0x7f82b141e7d8 <col:21, col:33> col:34 'const std::__1::string &'
|-CXXConstructorDecl 0x7f82b141eb40 <line:85:5, col:48> col:5 locale 'void (const class std::__1::locale &, const char *, std::__1::locale::category)'
| |-ParmVarDecl 0x7f82b141e920 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f82b141e998 <col:27, col:37> col:38 'const char *'
| `-ParmVarDecl 0x7f82b141ea08 <col:40> col:48 'std::__1::locale::category':'int'
|-CXXConstructorDecl 0x7f82b141ee20 <line:86:5, col:50> col:5 locale 'void (const class std::__1::locale &, const std::__1::string &, std::__1::locale::category)'
| |-ParmVarDecl 0x7f82b141ec10 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f82b141ec80 <col:27, col:39> col:40 'const std::__1::string &'
| `-ParmVarDecl 0x7f82b141ecf0 <col:42> col:50 'std::__1::locale::category':'int'
|-FunctionTemplateDecl 0x7f82b141f1f8 <line:87:5, line:88:64> col:35 locale
| |-TemplateTypeParmDecl 0x7f82b141eee0 <line:87:15, col:21> col:21 referenced class depth 0 index 0 _Facet
| `-CXXConstructorDecl 0x7f82b141f150 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:88:64> col:35 locale 'void (const class std::__1::locale &, _Facet *)'
|   |-ParmVarDecl 0x7f82b141efa0 <col:42, col:54> col:55 'const class std::__1::locale &'
|   |-ParmVarDecl 0x7f82b141f038 <col:57, col:63> col:64 '_Facet *'
|   |-AlwaysInlineAttr 0x7f82b141f258 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|   `-VisibilityAttr 0x7f82b141f2a0 <col:51, col:74> Hidden
|-CXXConstructorDecl 0x7f82b141f4d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:89:5, col:50> col:5 locale 'void (const class std::__1::locale &, const class std::__1::locale &, std::__1::locale::category)'
| |-ParmVarDecl 0x7f82b141f2c0 <col:12, col:24> col:25 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f82b141f330 <col:27, col:39> col:40 'const class std::__1::locale &'
| `-ParmVarDecl 0x7f82b141f3a0 <col:42> col:50 'std::__1::locale::category':'int'
|-CXXDestructorDecl 0x7f82b141f5e0 <line:91:5, col:13> col:5 used ~locale 'void (void) noexcept'
|-CXXMethodDecl 0x7f82b141f798 <line:93:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:93:19 operator= 'const class std::__1::locale &(const class std::__1::locale &) noexcept'
| `-ParmVarDecl 0x7f82b141f690 <col:29, col:41> col:42 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7f82b141fa88 <line:95:5, line:97:37> col:14 combine
| |-TemplateTypeParmDecl 0x7f82b141f838 <line:95:15, col:21> col:21 class depth 0 index 0 _Facet
| `-CXXMethodDecl 0x7f82b141f9f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:97:37> col:14 combine 'class std::__1::locale (const class std::__1::locale &) const' inline
|   |-ParmVarDecl 0x7f82b141f900 <col:22, col:34> col:35 'const class std::__1::locale &'
|   `-VisibilityAttr 0x7f82b141fae0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:624:40, col:63> Hidden
|-CXXMethodDecl 0x7f82b141fb48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:100:5, col:19> col:12 name 'std::__1::string (void) const'
|-CXXMethodDecl 0x7f82b141fcb0 <line:101:5, col:36> col:10 used operator== '_Bool (const class std::__1::locale &) const'
| `-ParmVarDecl 0x7f82b141fbf0 <col:21, col:33> col:34 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f82b141fde8 <line:102:5, col:70> col:10 operator!= '_Bool (const class std::__1::locale &) const'
| |-ParmVarDecl 0x7f82b141fd60 <col:21, col:35> col:35 used __y 'const class std::__1::locale &'
| `-CompoundStmt 0x7f82b142c510 <col:46, col:70>
|   `-ReturnStmt 0x7f82b142c4f8 <col:47, col:68>
|     `-UnaryOperator 0x7f82b142c4d8 <col:54, col:68> '_Bool' prefix '!'
|       `-ParenExpr 0x7f82b142c4b8 <col:55, col:68> '_Bool'
|         `-CXXOperatorCallExpr 0x7f82b142c470 <col:56, col:65> '_Bool'
|           |-ImplicitCastExpr 0x7f82b142c458 <col:62> '_Bool (*)(const class std::__1::locale &) const' <FunctionToPointerDecay>
|           | `-DeclRefExpr 0x7f82b142c400 <col:62> '_Bool (const class std::__1::locale &) const' lvalue CXXMethod 0x7f82b141fcb0 'operator==' '_Bool (const class std::__1::locale &) const'
|           |-UnaryOperator 0x7f82b1421720 <col:56, col:57> 'const class std::__1::locale' lvalue prefix '*'
|           | `-CXXThisExpr 0x7f82b1421708 <col:57> 'const class std::__1::locale *' this
|           `-DeclRefExpr 0x7f82b1421740 <col:65> 'const class std::__1::locale' lvalue ParmVar 0x7f82b141fd60 '__y' 'const class std::__1::locale &'
|-FunctionTemplateDecl 0x7f82b1420578 <line:103:5, line:106:73> line:105:12 operator()
| |-TemplateTypeParmDecl 0x7f82b141fe88 <line:103:15, col:21> col:21 referenced class depth 0 index 0 _CharT
| |-TemplateTypeParmDecl 0x7f82b141fef8 <col:29, col:35> col:35 referenced class depth 0 index 1 _Traits
| |-TemplateTypeParmDecl 0x7f82b141ff68 <col:44, col:50> col:50 referenced class depth 0 index 2 _Allocator
| `-CXXMethodDecl 0x7f82b14204e0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:633:60, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:106:73> line:105:12 operator() '_Bool (const basic_string<_CharT, _Traits, _Allocator> &, const basic_string<_CharT, _Traits, _Allocator> &) const' inline
|   |-ParmVarDecl 0x7f82b14201d0 <col:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   |-ParmVarDecl 0x7f82b14203d0 <line:106:23, col:70> col:71 'const basic_string<_CharT, _Traits, _Allocator> &'
|   `-VisibilityAttr 0x7f82b14205d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:624:40, col:63> Hidden
|-CXXMethodDecl 0x7f82b14206f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:109:5, col:39> col:19 global 'class std::__1::locale (const class std::__1::locale &)' static
| `-ParmVarDecl 0x7f82b1420630 <col:26, col:38> col:39 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f82b14207e0 <line:110:5, col:34> col:26 classic 'const class std::__1::locale &(void)' static
|-AccessSpecDecl 0x7f82b1420878 <line:112:1, col:8> col:1 private
|-CXXRecordDecl 0x7f82b14208a0 <line:113:5, col:11> col:11 referenced class __imp
|-FieldDecl 0x7f82b1420998 <line:114:5, col:12> col:12 __locale_ 'class std::__1::locale::__imp *'
|-CXXMethodDecl 0x7f82b1420be0 <line:116:5, col:52> col:10 referenced __install_ctor 'void (const class std::__1::locale &, class std::__1::locale::facet *, long)'
| |-ParmVarDecl 0x7f82b14209f0 <col:25, col:37> col:38 'const class std::__1::locale &'
| |-ParmVarDecl 0x7f82b1420a88 <col:40, col:45> col:46 'class std::__1::locale::facet *'
| `-ParmVarDecl 0x7f82b1420b00 <col:48> col:52 'long'
|-CXXMethodDecl 0x7f82b1420d10 <line:117:5, col:29> col:20 __global 'class std::__1::locale &(void)' static
|-CXXMethodDecl 0x7f82b1420eb0 <line:118:5, col:25> col:10 referenced has_facet '_Bool (class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7f82b1420de8 <col:20, col:22> col:23 'class std::__1::locale::id &'
|-CXXMethodDecl 0x7f82b1421050 <line:119:5, col:33> col:18 used use_facet 'const class std::__1::locale::facet *(class std::__1::locale::id &) const'
| `-ParmVarDecl 0x7f82b1420f60 <col:28, col:30> col:31 'class std::__1::locale::id &'
|-FriendDecl 0x7f82b1421378 <line:121:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:121:41
| `-FunctionTemplateDecl 0x7f82b14212b8 parent 0x7f82b141ca20 prev 0x7f82b141ce50 <col:5, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:121:41 has_facet
|   |-TemplateTypeParmDecl 0x7f82b14210f0 <col:15, col:21> col:21 class depth 0 index 0 _Facet
|   `-FunctionDecl 0x7f82b1421210 parent 0x7f82b141ca20 prev 0x7f82b141cdb8 <col:29, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:738:21> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:121:41 has_facet '_Bool (const class std::__1::locale &) noexcept'
|     |-ParmVarDecl 0x7f82b1421180 <col:51, col:63> col:64 'const class std::__1::locale &'
|     |-AlwaysInlineAttr 0x7f82b1421358 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
|     `-VisibilityAttr 0x7f82b1421368 <col:51, col:74> Inherited Hidden
`-FriendDecl 0x7f82b1421698 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__locale:122:5, col:73> col:50
  `-FunctionTemplateDecl 0x7f82b14215d8 parent 0x7f82b141ca20 prev 0x7f82b141d188 <col:5, col:73> col:50 use_facet
    |-TemplateTypeParmDecl 0x7f82b14213b0 <col:15, col:21> col:21 referenced class depth 0 index 0 _Facet
    |-FunctionDecl 0x7f82b1421530 parent 0x7f82b141ca20 prev 0x7f82b141d0f0 <col:29, col:73> col:50 use_facet 'const _Facet &(const class std::__1::locale &)'
    | |-ParmVarDecl 0x7f82b1421440 <col:60, col:72> col:73 'const class std::__1::locale &'
    | |-AlwaysInlineAttr 0x7f82b1421678 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> Inherited always_inline
    | `-VisibilityAttr 0x7f82b1421688 <col:51, col:74> Inherited Hidden
    `-Function 0x7f82afbb44a0 'use_facet' 'const class std::__1::ctype<char> &(const class std::__1::locale &)'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  NonVirtualBaseLLVMType:%"class.std::__1::locale" = type { %"class.std::__1::locale::__imp"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f82af9fe7b8 parent 0x7f82af9f74d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:479:84> col:64 class basic_streambuf definition
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-VisibilityAttr 0x7f82b145b968 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7f82b145ba28 prev 0x7f82af9fe7b8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:122:1, col:28> col:28 implicit class basic_streambuf
|-AccessSpecDecl 0x7f82b145bac0 <line:124:1, col:7> col:1 public
|-TypedefDecl 0x7f82b145bb28 <line:126:5, col:44> col:44 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f82b145baf0 'char' sugar
|   |-TemplateTypeParmType 0x7f82b1440b00 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f82b1440ab8 '_CharT'
|   `-BuiltinType 0x7f82af032b60 'char'
|-TypedefDecl 0x7f82b145bbb8 <line:127:5, col:44> col:44 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f82b145bb80 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f82b1440b70 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f82b1440b28 '_Traits'
|   `-RecordType 0x7f82af9fe040 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f82b028eaa8 'char_traits'
|-TypedefDecl 0x7f82b145bcc0 <line:128:5, col:44> col:44 int_type 'typename traits_type::int_type':'int'
| `-ElaboratedType 0x7f82b145bc70 'typename traits_type::int_type' sugar
|   `-TypedefType 0x7f82b02905f0 'std::__1::char_traits<char>::int_type' sugar
|     |-Typedef 0x7f82b028ee08 'int_type'
|     `-BuiltinType 0x7f82af032bc0 'int'
|-TypedefDecl 0x7f82b145bdb0 <line:129:5, col:44> col:44 pos_type 'typename traits_type::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ElaboratedType 0x7f82b145bd60 'typename traits_type::pos_type' sugar
|   `-TypedefType 0x7f82b145bd40 'std::__1::char_traits<char>::pos_type' sugar
|     |-Typedef 0x7f82b028eed8 'pos_type'
|     `-TypedefType 0x7f82b0284660 'std::__1::streampos' sugar
|       |-Typedef 0x7f82afa03a18 'streampos'
|       `-TemplateSpecializationType 0x7f82afa03970 'fpos<mbstate_t>' sugar fpos
|         |-TemplateArgument type 'mbstate_t':'__mbstate_t'
|         `-RecordType 0x7f82afa03950 'class std::__1::fpos<__mbstate_t>'
|           `-ClassTemplateSpecialization 0x7f82afa03860 'fpos'
|-TypedefDecl 0x7f82b145bea0 <line:130:5, col:44> col:44 off_type 'typename traits_type::off_type':'long long'
| `-ElaboratedType 0x7f82b145be50 'typename traits_type::off_type' sugar
|   `-TypedefType 0x7f82b145be30 'std::__1::char_traits<char>::off_type' sugar
|     |-Typedef 0x7f82b028ee70 'off_type'
|     `-TypedefType 0x7f82b02845d0 'std::__1::streamoff' sugar
|       |-Typedef 0x7f82afa03de8 'streamoff'
|       `-BuiltinType 0x7f82af032c00 'long long'
|-CXXDestructorDecl 0x7f82b145bf28 <line:132:5, col:30> col:13 ~basic_streambuf 'void (void)' virtual noexcept-unevaluated 0x7f82b145bf28
|-CXXMethodDecl 0x7f82b145c060 <line:135:5, line:141:5> line:136:12 pubimbue 'class std::__1::locale (const class std::__1::locale &)' inline
| |-ParmVarDecl 0x7f82b145bfd8 <col:21, col:35> col:35 __loc 'const class std::__1::locale &'
| `-AlwaysInlineAttr 0x7f82b145c138 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82b145c180 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:143:5, line:144:44> col:12 getloc 'class std::__1::locale (void) const' inline
| `-AlwaysInlineAttr 0x7f82b145c228 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82b145c440 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:147:5, line:149:32> line:148:22 pubsetbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f82b145c2c8 <col:32, col:43> col:43 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f82b145c328 <col:48, col:59> col:59 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f82b145c4f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82b145c780 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:151:5, line:154:46> line:152:14 referenced pubseekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7f82b145c590 <col:25, col:34> col:34 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7f82b145c5f0 <col:41, col:59> col:59 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| |-ParmVarDecl 0x7f82b145c650 <line:153:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7f82b145c840 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82b145ca10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:156:5, line:159:38> line:157:14 referenced pubseekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' inline
| |-ParmVarDecl 0x7f82b145c898 <col:25, col:34> col:34 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| |-ParmVarDecl 0x7f82b145c8f8 <line:158:25, col:79> col:44 __which 'class ios_base::openmode':'unsigned int'
| `-AlwaysInlineAttr 0x7f82b145cac8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82b145cb10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:161:5, line:162:36> col:9 referenced pubsync 'int (void)' inline
| `-AlwaysInlineAttr 0x7f82b145cbb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82b145cc00 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:166:5, line:171:5> line:167:16 in_avail 'std::__1::streamsize (void)' inline
| `-AlwaysInlineAttr 0x7f82b145cca8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82b145cd60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:173:5, line:178:5> line:174:14 snextc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f82b145ce08 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82b145ce70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:180:5, line:185:5> line:181:14 sbumpc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f82b145cf18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82b145cf80 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:187:5, line:192:5> line:188:14 sgetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f82b145d028 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82b145d1f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:194:5, line:196:32> line:195:16 referenced sgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f82b145d080 <col:22, col:33> col:33 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f82b145d0e0 <col:38, col:49> col:49 __n 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f82b145d2a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82b145d3c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:199:5, line:204:5> line:200:14 sputbackc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7f82b145d300 <col:24, col:34> col:34 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7f82b145d470 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82b145d4d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:206:5, line:211:5> line:207:14 sungetc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' inline
| `-AlwaysInlineAttr 0x7f82b145d580 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82b145d660 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:214:5, line:220:5> line:215:14 sputc 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type)' inline
| |-ParmVarDecl 0x7f82b145d5d8 <col:20, col:30> col:30 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type':'char'
| `-AlwaysInlineAttr 0x7f82b145d710 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82b145d910 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:222:5, line:224:32> line:223:16 used sputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' inline
| |-ParmVarDecl 0x7f82b145d798 <col:22, col:39> col:39 used __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f82b145d7f8 <col:44, col:55> col:55 used __n 'std::__1::streamsize':'long'
| |-CompoundStmt 0x7f82afbb6c40 <line:224:5, col:32>
| | `-ReturnStmt 0x7f82afbb6c28 <col:7, col:29>
| |   `-CXXMemberCallExpr 0x7f82afbb6bc0 <col:14, col:29> 'std::__1::streamsize':'long'
| |     |-MemberExpr 0x7f82afbb6b38 <col:14> '<bound member function type>' ->xsputn 0x7f82b145fdb0
| |     | `-CXXThisExpr 0x7f82afbb6b20 <col:14> 'class std::__1::basic_streambuf<char> *' this
| |     |-ImplicitCastExpr 0x7f82afbb6bf8 <col:21> 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *' <LValueToRValue>
| |     | `-DeclRefExpr 0x7f82afbb6b70 <col:21> 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *' lvalue ParmVar 0x7f82b145d798 '__s' 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |     `-ImplicitCastExpr 0x7f82afbb6c10 <col:26> 'std::__1::streamsize':'long' <LValueToRValue>
| |       `-DeclRefExpr 0x7f82afbb6b98 <col:26> 'std::__1::streamsize':'long' lvalue ParmVar 0x7f82b145d7f8 '__n' 'std::__1::streamsize':'long'
| `-AlwaysInlineAttr 0x7f82b145d9c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-AccessSpecDecl 0x7f82b145da10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:226:1, col:10> col:1 protected
|-CXXConstructorDecl 0x7f82b145da78 <line:227:5, col:21> col:5 basic_streambuf 'void (void)'
|-CXXConstructorDecl 0x7f82b145dc50 <line:228:5, col:49> col:5 basic_streambuf 'void (const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7f82b145db68 <col:21, col:44> col:44 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7f82b145de10 <line:229:5, col:60> col:22 operator= 'class std::__1::basic_streambuf<char> &(const class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7f82b145dd48 <col:32, col:55> col:55 __rhs 'const class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7f82b145df90 <line:230:5, col:37> col:10 swap 'void (class std::__1::basic_streambuf<char> &)'
| `-ParmVarDecl 0x7f82b145ded0 <col:15, col:32> col:32 __rhs 'class std::__1::basic_streambuf<char> &'
|-CXXMethodDecl 0x7f82b145e0c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:233:68> col:38 eback 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f82b145e168 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82b145e1d0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:234:68> col:38 gptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f82b145e278 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82b145e2e0 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:235:68> col:38 egptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f82b145e388 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82b145e458 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:237:5, line:238:43> col:10 gbump 'void (int)' inline
| |-ParmVarDecl 0x7f82b145e3d0 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7f82b145e508 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82b145e770 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:240:5, line:245:5> line:241:10 setg 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7f82b145e560 <col:15, col:26> col:26 __gbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f82b145e5d0 <col:34, col:45> col:45 __gnext 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f82b145e640 <col:54, col:65> col:65 __gend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7f82b145e830 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82b145e898 <line:717:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:248:68> col:38 pbase 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f82b145e940 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82b145e9a8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:249:68> col:38 pptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f82b145ea50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82b145eab8 <col:32, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:250:68> col:38 epptr 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *(void) const'
| `-AlwaysInlineAttr 0x7f82b145eb60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:717:74> always_inline
|-CXXMethodDecl 0x7f82b145ec30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:252:5, line:253:43> col:10 pbump 'void (int)' inline
| |-ParmVarDecl 0x7f82b145eba8 <col:16, col:20> col:20 __n 'int'
| `-AlwaysInlineAttr 0x7f82b145ece0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82b145eec0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:255:5, line:259:5> line:256:10 setp 'void (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *)' inline
| |-ParmVarDecl 0x7f82b145ed38 <col:15, col:26> col:26 __pbeg 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| |-ParmVarDecl 0x7f82b145eda8 <col:34, col:45> col:45 __pend 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-AlwaysInlineAttr 0x7f82b145ef78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:725:95> always_inline
|-CXXMethodDecl 0x7f82b145f048 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/streambuf:263:5, col:43> col:18 imbue 'void (const class std::__1::locale &)' virtual
| `-ParmVarDecl 0x7f82b145efc0 <col:24, col:38> col:38 __loc 'const class std::__1::locale &'
|-CXXMethodDecl 0x7f82b145f1f8 <line:266:5, col:67> col:30 setbuf 'class std::__1::basic_streambuf<char> *(std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7f82b145f108 <col:37, col:48> col:48 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f82b145f168 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f82b145f418 <line:267:5, line:268:87> line:267:22 seekoff 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type, class ios_base::seekdir, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7f82b145f2c0 <col:30, col:39> col:39 __off 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::off_type':'long long'
| |-ParmVarDecl 0x7f82b145f320 <col:46, col:64> col:64 __way 'class ios_base::seekdir':'enum std::__1::ios_base::seekdir'
| `-ParmVarDecl 0x7f82b145f380 <line:268:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f82b145f5d8 <line:269:5, line:270:87> line:269:22 seekpos 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type, class ios_base::openmode)' virtual
| |-ParmVarDecl 0x7f82b145f4e8 <col:30, col:39> col:39 __sp 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::pos_type':'class std::__1::fpos<__mbstate_t>'
| `-ParmVarDecl 0x7f82b145f548 <line:270:30, col:84> col:49 __which 'class ios_base::openmode':'unsigned int'
|-CXXMethodDecl 0x7f82b145f690 <line:271:5, col:22> col:17 sync 'int (void)' virtual
|-CXXMethodDecl 0x7f82b145f738 <line:274:5, col:34> col:24 showmanyc 'std::__1::streamsize (void)' virtual
|-CXXMethodDecl 0x7f82b145f8e0 <line:275:5, col:61> col:24 xsgetn 'std::__1::streamsize (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7f82b145f7f0 <col:31, col:42> col:42 __s 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f82b145f850 <col:47, col:58> col:58 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f82b145f9b8 <line:276:5, col:32> col:22 underflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7f82b145fa80 <line:277:5, col:28> col:22 uflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (void)' virtual
|-CXXMethodDecl 0x7f82b145fc00 <line:280:5, col:65> col:22 pbackfail 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7f82b145fb38 <col:32, col:64> col:41 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-CXXMethodDecl 0x7f82b145fdb0 <line:283:5, col:67> col:24 used xsputn 'std::__1::streamsize (const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *, std::__1::streamsize)' virtual
| |-ParmVarDecl 0x7f82b145fcc0 <col:31, col:48> col:48 __s 'const std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
| `-ParmVarDecl 0x7f82b145fd20 <col:53, col:64> col:64 __n 'std::__1::streamsize':'long'
|-CXXMethodDecl 0x7f82b145ff00 <line:284:5, col:64> col:22 overflow 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type (std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type)' virtual
| `-ParmVarDecl 0x7f82b145fe78 <col:31, col:63> col:40 __c 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::int_type':'int'
|-AccessSpecDecl 0x7f82b145ffb0 <line:286:1, col:8> col:1 private
|-FieldDecl 0x7f82b145ffd8 <line:287:5, col:12> col:12 __loc_ 'class std::__1::locale'
|-FieldDecl 0x7f82b1460030 <line:288:5, col:16> col:16 __binp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f82b1460088 <line:289:5, col:16> col:16 __ninp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f82b14600e0 <line:290:5, col:16> col:16 __einp_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f82b1460138 <line:291:5, col:16> col:16 __bout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
|-FieldDecl 0x7f82b1460190 <line:292:5, col:16> col:16 __nout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'
`-FieldDecl 0x7f82b14601e8 <line:293:5, col:16> col:16 __eout_ 'std::__1::basic_streambuf<char, struct std::__1::char_traits<char> >::char_type *'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_streambuf" = type { i32 (...)**, %"class.std::__1::locale", i8*, i8*, i8*, i8*, i8*, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f82b0510e58 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:998:1, line:1037:1> line:999:28 class ostreambuf_iterator definition
|-public 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-CXXRecordDecl 0x7f82afbaf070 prev 0x7f82b0510e58 <col:1, col:28> col:28 implicit class ostreambuf_iterator
|-AccessSpecDecl 0x7f82afbaf108 <line:1002:1, col:7> col:1 public
|-TypedefDecl 0x7f82afbaf168 <line:1003:5, col:45> col:45 char_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f82afbaf130 'char' sugar
|   |-TemplateTypeParmType 0x7f82b010df00 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f82b010dec0 '_CharT'
|   `-BuiltinType 0x7f82af032b60 'char'
|-TypedefDecl 0x7f82afbaf1f8 <line:1004:5, col:45> col:45 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f82afbaf1c0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f82b010df70 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f82b010df28 '_Traits'
|   `-RecordType 0x7f82af9fe040 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f82b028eaa8 'char_traits'
|-TypedefDecl 0x7f82afbaf318 <line:1005:5, col:45> col:45 streambuf_type 'basic_streambuf<char, struct std::__1::char_traits<char> >':'class std::__1::basic_streambuf<char>'
| `-TemplateSpecializationType 0x7f82afbaf270 'basic_streambuf<char, struct std::__1::char_traits<char> >' sugar basic_streambuf
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7f82af9fe8c0 'class std::__1::basic_streambuf<char>'
|     `-ClassTemplateSpecialization 0x7f82af9fe7b8 'basic_streambuf'
|-TypedefDecl 0x7f82afbaf438 <line:1006:5, col:45> col:45 ostream_type 'basic_ostream<char, struct std::__1::char_traits<char> >':'class std::__1::basic_ostream<char>'
| `-TemplateSpecializationType 0x7f82afbaf390 'basic_ostream<char, struct std::__1::char_traits<char> >' sugar basic_ostream
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7f82af9feea0 'class std::__1::basic_ostream<char>'
|     `-ClassTemplateSpecialization 0x7f82af9fed98 'basic_ostream'
|-AccessSpecDecl 0x7f82afbaf490 <line:1007:1, col:8> col:1 private
|-FieldDecl 0x7f82afbaf518 <line:1008:5, col:21> col:21 referenced __sbuf_ 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
|-AccessSpecDecl 0x7f82afbaf560 <line:1009:1, col:7> col:1 public
|-CXXConstructorDecl 0x7f82afbaf6f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1011:33> line:1010:31 used ostreambuf_iterator 'void (std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type &) noexcept'
| |-ParmVarDecl 0x7f82afbaf5e8 <col:51, col:65> col:65 used __s 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type &'
| |-CXXCtorInitializer 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>'
| | `-CXXConstructExpr 0x7f82afbb3388 <col:31> 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7f82afbaf518 '__sbuf_' 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
| | `-CXXMemberCallExpr 0x7f82afbb32d0 <line:1011:19, col:29> 'basic_streambuf<std::__1::basic_ios<char, struct std::__1::char_traits<char> >::char_type, std::__1::basic_ios<char, struct std::__1::char_traits<char> >::traits_type> *'
| |   `-MemberExpr 0x7f82afbb3298 <col:19, col:23> '<bound member function type>' .rdbuf 0x7f82b1468dc0
| |     `-ImplicitCastExpr 0x7f82afbb32f8 <col:19> 'const class std::__1::basic_ios<char>' lvalue <UncheckedDerivedToBase (virtual basic_ios)>
| |       `-DeclRefExpr 0x7f82afbb3200 <col:19> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type':'class std::__1::basic_ostream<char>' lvalue ParmVar 0x7f82afbaf5e8 '__s' 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::ostream_type &'
| |-CompoundStmt 0x7f82b01101a8 <col:32, col:33>
| `-AlwaysInlineAttr 0x7f82afbaf7e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f82afbaf928 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1013:25> line:1012:31 ostreambuf_iterator 'void (std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *) noexcept'
| |-ParmVarDecl 0x7f82afbaf840 <col:51, col:67> col:67 __s 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
| `-AlwaysInlineAttr 0x7f82afbaf9e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82afbafb70 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1019:9> line:1014:52 operator= 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(char)'
| |-ParmVarDecl 0x7f82afbafa68 <col:62, col:69> col:69 __c 'char':'char'
| `-AlwaysInlineAttr 0x7f82afbafc20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82afbafcc0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1020:82> col:52 operator* 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(void)'
| `-AlwaysInlineAttr 0x7f82afbafd68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82afbafdd0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1021:82> col:52 operator++ 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(void)'
| `-AlwaysInlineAttr 0x7f82afbafe78 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82afbaff80 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1022:82> col:52 operator++ 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &(int)'
| |-ParmVarDecl 0x7f82afbafec0 <col:63> col:66 'int'
| `-AlwaysInlineAttr 0x7f82afbb0030 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82afbb0078 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1023:82> col:36 used failed '_Bool (void) const noexcept'
| |-CompoundStmt 0x7f82afbbc128 <col:61, col:82>
| | `-ReturnStmt 0x7f82afbbc110 <col:62, col:80>
| |   `-BinaryOperator 0x7f82afbbc0e8 <col:69, col:80> '_Bool' '=='
| |     |-ImplicitCastExpr 0x7f82afbbc0b8 <col:69> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' <LValueToRValue>
| |     | `-MemberExpr 0x7f82afbbc080 <col:69> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *const' lvalue ->__sbuf_ 0x7f82afbaf518
| |     |   `-CXXThisExpr 0x7f82afbbc068 <col:69> 'const class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > *' this
| |     `-ImplicitCastExpr 0x7f82afbbc0d0 <col:80> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' <NullToPointer>
| |       `-IntegerLiteral 0x7f82b0110878 <col:80> 'int' 0
| `-AlwaysInlineAttr 0x7f82afbb0120 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FriendDecl 0x7f82afbb0960 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:1029:5, line:1035:47> line:1033:5
| `-FunctionTemplateDecl 0x7f82afbb0830 parent 0x7f82b10629e8 prev 0x7f82b04f1040 <line:1029:5, line:1035:47> line:1033:5 __pad_and_output
|   |-TemplateTypeParmDecl 0x7f82afbb0168 <line:1029:15, col:21> col:21 class depth 0 index 0 _Ch
|   |-TemplateTypeParmDecl 0x7f82afbb01d8 <col:26, col:32> col:32 class depth 0 index 1 _Tr
|   |-FunctionDecl 0x7f82afbb0758 parent 0x7f82b10629e8 prev 0x7f82b04f0fa8 <line:1030:5, line:1035:47> line:1033:5 __pad_and_output 'ostreambuf_iterator<_Ch, _Tr> (ostreambuf_iterator<_Ch, _Tr>, const _Ch *, const _Ch *, const _Ch *, class std::__1::ios_base &, _Ch)'
|   | |-ParmVarDecl 0x7f82afbb03b8 <col:22, col:52> col:52 __s 'ostreambuf_iterator<_Ch, _Tr>'
|   | |-ParmVarDecl 0x7f82afbb0458 <line:1034:22, col:33> col:33 __ob 'const _Ch *'
|   | |-ParmVarDecl 0x7f82afbb04c8 <col:39, col:50> col:50 __op 'const _Ch *'
|   | |-ParmVarDecl 0x7f82afbb0538 <col:56, col:67> col:67 __oe 'const _Ch *'
|   | |-ParmVarDecl 0x7f82afbb0598 <line:1035:22, col:32> col:32 __iob 'class std::__1::ios_base &'
|   | |-ParmVarDecl 0x7f82afbb0608 <col:39, col:43> col:43 __fl '_Ch'
|   | `-VisibilityAttr 0x7f82afbb08c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:624:40, col:63> Inherited Hidden
|   `-Function 0x7f82afbb2638 '__pad_and_output' 'ostreambuf_iterator<char, struct std::__1::char_traits<char> > (ostreambuf_iterator<char, struct std::__1::char_traits<char> >, const char *, const char *, const char *, class std::__1::ios_base &, char)'
|-CXXConstructorDecl 0x7f82afbb0d88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iterator:999:28> col:28 implicit constexpr ostreambuf_iterator 'void (const class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &)' inline default trivial noexcept-unevaluated 0x7f82afbb0d88
| `-ParmVarDecl 0x7f82afbb0eb0 <col:28> col:28 'const class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &'
|-CXXConstructorDecl 0x7f82afbb0f48 <col:28> col:28 implicit used constexpr ostreambuf_iterator 'void (class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7f82afbb1070 <col:28> col:28 used 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&'
| |-CXXCtorInitializer 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>'
| | `-CXXConstructExpr 0x7f82afbb2a80 <col:28> 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>' 'void (struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void> &&) noexcept'
| |   `-ImplicitCastExpr 0x7f82afbb2960 <col:28> 'iterator<struct std::__1::output_iterator_tag, void, void, void, void>':'struct std::__1::iterator<struct std::__1::output_iterator_tag, void, void, void, void>' xvalue <UncheckedDerivedToBase (iterator)>
| |     `-CXXStaticCastExpr 0x7f82afbb2930 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' xvalue static_cast<class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&> <NoOp>
| |       `-DeclRefExpr 0x7f82afbb28f8 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' lvalue ParmVar 0x7f82afbb1070 '' 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&'
| |-CXXCtorInitializer Field 0x7f82afbaf518 '__sbuf_' 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *'
| | `-ImplicitCastExpr 0x7f82afbb2c78 <col:28> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' <LValueToRValue>
| |   `-MemberExpr 0x7f82afbb2c28 <col:28> 'std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >::streambuf_type *' xvalue .__sbuf_ 0x7f82afbaf518
| |     `-CXXStaticCastExpr 0x7f82afbb2bf8 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' xvalue static_cast<class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&> <NoOp>
| |       `-DeclRefExpr 0x7f82afbb2bc0 <col:28> 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> >' lvalue ParmVar 0x7f82afbb1070 '' 'class std::__1::ostreambuf_iterator<char, struct std::__1::char_traits<char> > &&'
| `-CompoundStmt 0x7f82afbb2cc8 <col:28>
`-CXXDestructorDecl 0x7f82afbb1110 <col:28> col:28 implicit referenced ~ostreambuf_iterator 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ostreambuf_iterator" = type { %"class.std::__1::basic_streambuf"* }
  NonVirtualBaseLLVMType:%"class.std::__1::ostreambuf_iterator" = type { %"class.std::__1::basic_streambuf"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f82af22fc48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:583:90> col:64 class __basic_string_common definition
|-TemplateArgument integral 1
|-VisibilityAttr 0x7f82af22fdd8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7f82af22fe88 prev 0x7f82af22fc48 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:558:1, col:28> col:28 implicit class __basic_string_common
|-AccessSpecDecl 0x7f82af22ff20 <line:560:1, col:10> col:1 protected
|-CXXMethodDecl 0x7f82af22ff48 <line:561:22, col:50> col:27 used __throw_length_error 'void (void) const'
| `-CXX11NoReturnAttr 0x7f82af230018 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:313:30> Inherited
|-CXXMethodDecl 0x7f82af230060 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:562:22, col:50> col:27 __throw_out_of_range 'void (void) const'
| `-CXX11NoReturnAttr 0x7f82af230108 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:313:30> Inherited
|-CXXDestructorDecl 0x7f82b02c1290 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:583:64> col:64 implicit ~__basic_string_common 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f82b05d40b8 <col:64> col:64 implicit used constexpr __basic_string_common 'void (void) noexcept' inline default trivial
| `-CompoundStmt 0x7f82b05d4518 <col:64>
|-CXXConstructorDecl 0x7f82b05d41c8 <col:64> col:64 implicit constexpr __basic_string_common 'void (const class std::__1::__basic_string_common<true> &)' inline default trivial noexcept-unevaluated 0x7f82b05d41c8
| `-ParmVarDecl 0x7f82b05d42f0 <col:64> col:64 'const class std::__1::__basic_string_common<true> &'
`-CXXConstructorDecl 0x7f82b05d4388 <col:64> col:64 implicit constexpr __basic_string_common 'void (class std::__1::__basic_string_common<true> &&)' inline default trivial noexcept-unevaluated 0x7f82b05d4388
  `-ParmVarDecl 0x7f82b05d44b0 <col:64> col:64 'class std::__1::__basic_string_common<true> &&'

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::__basic_string_common" = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f82af9ff388 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/iosfwd:101:1, col:52> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1759:28 class allocator definition
|-TemplateArgument type 'char'
|-CXXRecordDecl 0x7f82af32b548 prev 0x7f82af9ff388 <col:1, col:28> col:28 implicit class allocator
|-AccessSpecDecl 0x7f82af32b5e0 <line:1761:1, col:7> col:1 public
|-TypedefDecl 0x7f82af32b608 <line:1762:5, col:31> col:31 referenced size_type 'size_t':'unsigned long'
| `-TypedefType 0x7f82af8dd580 'size_t' sugar
|   |-Typedef 0x7f82af0673b0 'size_t'
|   `-BuiltinType 0x7f82af032c80 'unsigned long'
|-TypedefDecl 0x7f82af32b660 <line:1763:5, col:31> col:31 referenced difference_type 'ptrdiff_t':'long'
| `-TypedefType 0x7f82b106d9c0 'ptrdiff_t' sugar
|   |-Typedef 0x7f82af067340 'ptrdiff_t'
|   `-BuiltinType 0x7f82af032be0 'long'
|-TypedefDecl 0x7f82af32b728 <line:1764:5, col:31> col:31 referenced pointer 'char *'
| `-PointerType 0x7f82af32b6f0 'char *'
|   `-SubstTemplateTypeParmType 0x7f82af32b6c0 'char' sugar
|     |-TemplateTypeParmType 0x7f82af128d30 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f82af128ce8 '_Tp'
|     `-BuiltinType 0x7f82af032b60 'char'
|-TypedefDecl 0x7f82af32b7b8 <line:1765:5, col:31> col:31 referenced const_pointer 'const char *'
| `-PointerType 0x7f82af32b780 'const char *'
|   `-QualType 0x7f82af32b6c1 'const char' const
|     `-SubstTemplateTypeParmType 0x7f82af32b6c0 'char' sugar
|       |-TemplateTypeParmType 0x7f82af128d30 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f82af128ce8 '_Tp'
|       `-BuiltinType 0x7f82af032b60 'char'
|-TypedefDecl 0x7f82af32b848 <line:1766:5, col:31> col:31 reference 'char &'
| `-LValueReferenceType 0x7f82af32b810 'char &'
|   `-SubstTemplateTypeParmType 0x7f82af32b6c0 'char' sugar
|     |-TemplateTypeParmType 0x7f82af128d30 '_Tp' dependent depth 0 index 0
|     | `-TemplateTypeParm 0x7f82af128ce8 '_Tp'
|     `-BuiltinType 0x7f82af032b60 'char'
|-TypedefDecl 0x7f82af32b8d8 <line:1767:5, col:31> col:31 const_reference 'const char &'
| `-LValueReferenceType 0x7f82af32b8a0 'const char &'
|   `-QualType 0x7f82af32b6c1 'const char' const
|     `-SubstTemplateTypeParmType 0x7f82af32b6c0 'char' sugar
|       |-TemplateTypeParmType 0x7f82af128d30 '_Tp' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f82af128ce8 '_Tp'
|       `-BuiltinType 0x7f82af032b60 'char'
|-TypedefDecl 0x7f82af32b940 <line:1768:5, col:31> col:31 referenced value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f82af32b6c0 'char' sugar
|   |-TemplateTypeParmType 0x7f82af128d30 '_Tp' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f82af128ce8 '_Tp'
|   `-BuiltinType 0x7f82af032b60 'char'
|-TypedefDecl 0x7f82af32b998 <line:1770:5, col:23> col:23 referenced propagate_on_container_move_assignment 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7f82b001f740 'std::__1::true_type' sugar
|   |-Typedef 0x7f82b001e048 'true_type'
|   `-TemplateSpecializationType 0x7f82b001df30 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7f82b001dd98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:522:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7f82b001dd80 <line:525:31> '_Bool' true
|     `-RecordType 0x7f82b001df10 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7f82b001de08 'integral_constant'
|-TypedefDecl 0x7f82af32b9f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1771:5, col:23> col:23 referenced is_always_equal 'std::__1::true_type':'struct std::__1::integral_constant<_Bool, true>'
| `-TypedefType 0x7f82b001f740 'std::__1::true_type' sugar
|   |-Typedef 0x7f82b001e048 'true_type'
|   `-TemplateSpecializationType 0x7f82b001df30 'integral_constant<_Bool, (true)>' sugar integral_constant
|     |-TemplateArgument type '_Bool'
|     |-TemplateArgument expr
|     | `-ParenExpr 0x7f82b001dd98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/type_traits:522:59, col:63> '_Bool'
|     |   `-CXXBoolLiteralExpr 0x7f82b001dd80 <line:525:31> '_Bool' true
|     `-RecordType 0x7f82b001df10 'struct std::__1::integral_constant<_Bool, true>'
|       `-ClassTemplateSpecialization 0x7f82b001de08 'integral_constant'
|-ClassTemplateDecl 0x7f82af32bb68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1773:5, col:33> col:33 rebind
| |-TemplateTypeParmDecl 0x7f82af32ba48 <col:15, col:21> col:21 class depth 0 index 0 _Up
| `-CXXRecordDecl 0x7f82af32bad0 <col:26, col:33> col:33 struct rebind
|-CXXConstructorDecl 0x7f82af32bdb8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1775:54> col:31 used allocator 'void (void) noexcept'
| |-CompoundStmt 0x7f82af12b410 <col:53, col:54>
| `-AlwaysInlineAttr 0x7f82af32be98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f82af32c1f0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:5, col:96> col:52 allocator
| |-TemplateTypeParmDecl 0x7f82af32bee0 <col:15, col:21> col:21 class depth 0 index 0 _Up
| |-CXXConstructorDecl 0x7f82af32c148 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:96> col:52 allocator 'void (const allocator<_Up> &) noexcept'
| | |-ParmVarDecl 0x7f82af32c020 <col:62, col:82> col:83 'const allocator<_Up> &'
| | `-AlwaysInlineAttr 0x7f82af32c248 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
| `-CXXConstructorDecl 0x7f82b02c96b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1776:96> col:52 allocator 'void (const allocator<char> &) noexcept'
|   |-TemplateArgument type 'char'
|   |-ParmVarDecl 0x7f82b02c95f0 <col:62, col:82> col:83 'const allocator<char> &'
|   `-AlwaysInlineAttr 0x7f82b02c97c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82af32c478 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1778:39> line:1777:39 address 'std::__1::allocator<char>::pointer (std::__1::allocator<char>::reference) const noexcept'
| |-ParmVarDecl 0x7f82af32c370 <col:47, col:57> col:57 __x 'std::__1::allocator<char>::reference':'char &'
| `-AlwaysInlineAttr 0x7f82af32c528 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82af32c6c8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1780:39> line:1779:45 address 'std::__1::allocator<char>::const_pointer (std::__1::allocator<char>::const_reference) const noexcept'
| |-ParmVarDecl 0x7f82af32c5c0 <col:53, col:69> col:69 __x 'std::__1::allocator<char>::const_reference':'const char &'
| `-AlwaysInlineAttr 0x7f82af32c778 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82af32c930 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1787:9> line:1781:39 used allocate 'std::__1::allocator<char>::pointer (std::__1::allocator::size_type, allocator<void>::const_pointer)'
| |-ParmVarDecl 0x7f82af32c7c0 <col:48, col:58> col:58 used __n 'std::__1::allocator::size_type':'unsigned long'
| |-ParmVarDecl 0x7f82af32c820 <col:63, col:96> col:94 'allocator<void>::const_pointer':'const void *' cinit
| | `-ImplicitCastExpr 0x7f82b05e4ff8 <col:96> 'allocator<void>::const_pointer':'const void *' <NullToPointer>
| |   `-IntegerLiteral 0x7f82af12b3d8 <col:96> 'int' 0
| |-CompoundStmt 0x7f82b05e53b0 <line:1782:9, line:1787:9>
| | |-IfStmt 0x7f82b05e5240 <line:1783:9, line:1785:71>
| | | |-<<<NULL>>>
| | | |-<<<NULL>>>
| | | |-BinaryOperator 0x7f82b05e51b8 <line:1783:13, col:28> '_Bool' '>'
| | | | |-ImplicitCastExpr 0x7f82b05e51a0 <col:13> 'std::__1::allocator::size_type':'unsigned long' <LValueToRValue>
| | | | | `-DeclRefExpr 0x7f82b05e50e8 <col:13> 'std::__1::allocator::size_type':'unsigned long' lvalue ParmVar 0x7f82af32c7c0 '__n' 'std::__1::allocator::size_type':'unsigned long'
| | | | `-CXXMemberCallExpr 0x7f82b05e5160 <col:19, col:28> 'std::__1::allocator::size_type':'unsigned long'
| | | |   `-MemberExpr 0x7f82b05e5128 <col:19> '<bound member function type>' ->max_size 0x7f82af32cc78
| | | |     `-ImplicitCastExpr 0x7f82b05e5188 <col:19> 'const class std::__1::allocator<char> *' <NoOp>
| | | |       `-CXXThisExpr 0x7f82b05e5110 <col:19> 'class std::__1::allocator<char> *' this
| | | |-CallExpr 0x7f82b05e51f8 <line:1784:13, line:1785:71> 'void'
| | | | |-ImplicitCastExpr 0x7f82b05e51e0 <line:1784:13> 'void (*)(const char *)' <FunctionToPointerDecay>
| | | | | `-DeclRefExpr 0x7f82af12b930 <col:13> 'void (const char *)' lvalue Function 0x7f82b11472c0 '__throw_length_error' 'void (const char *)'
| | | | `-ImplicitCastExpr 0x7f82b05e5228 <col:34, line:1785:34> 'const char *' <ArrayToPointerDecay>
| | | |   `-StringLiteral 0x7f82af12b8b8 <line:1784:34, line:1785:34> 'const char [68]' lvalue "allocator<T>::allocate(size_t n) 'n' exceeds maximum supported size"
| | | `-<<<NULL>>>
| | `-ReturnStmt 0x7f82b05e5398 <line:1786:9, col:73>
| |   `-CXXStaticCastExpr 0x7f82b05e5368 <col:16, col:73> 'std::__1::allocator<char>::pointer':'char *' static_cast<std::__1::allocator<char>::pointer> <BitCast>
| |     `-CallExpr 0x7f82b05e5338 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1786:72> 'void *'
| |       |-ImplicitCastExpr 0x7f82b05e5320 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1786:44> 'void *(*)(size_t)' <FunctionToPointerDecay>
| |       | `-DeclRefExpr 0x7f82af12ba50 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1786:44> 'void *(size_t)' lvalue Function 0x7f82b00fd3a0 '__allocate' 'void *(size_t)'
| |       `-BinaryOperator 0x7f82b05e52f8 <col:55, col:71> 'unsigned long' '*'
| |         |-ImplicitCastExpr 0x7f82b05e52e0 <col:55> 'std::__1::allocator::size_type':'unsigned long' <LValueToRValue>
| |         | `-DeclRefExpr 0x7f82b05e5288 <col:55> 'std::__1::allocator::size_type':'unsigned long' lvalue ParmVar 0x7f82af32c7c0 '__n' 'std::__1::allocator::size_type':'unsigned long'
| |         `-UnaryExprOrTypeTraitExpr 0x7f82b05e52c0 <col:61, col:71> 'unsigned long' sizeof 'char':'char'
| `-AlwaysInlineAttr 0x7f82af32c9e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82af32cb78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:49> line:1788:36 used deallocate 'void (std::__1::allocator<char>::pointer, std::__1::allocator::size_type) noexcept'
| |-ParmVarDecl 0x7f82af32ca40 <col:47, col:55> col:55 used __p 'std::__1::allocator<char>::pointer':'char *'
| |-ParmVarDecl 0x7f82af32caa0 <col:60> col:69 'std::__1::allocator::size_type':'unsigned long'
| |-CompoundStmt 0x7f82b05e6a60 <line:1789:9, col:49>
| | `-CallExpr 0x7f82b05e6a30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:47> 'void'
| |   |-ImplicitCastExpr 0x7f82b05e6a18 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:17> 'void (*)(void *)' <FunctionToPointerDecay>
| |   | `-DeclRefExpr 0x7f82af12bc40 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:412:15, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1789:17> 'void (void *)' lvalue Function 0x7f82b0100030 '__libcpp_deallocate' 'void (void *)'
| |   `-CStyleCastExpr 0x7f82b05e69f0 <col:37, col:44> 'void *' <NoOp>
| |     `-ImplicitCastExpr 0x7f82b05e69d8 <col:44> 'void *' <BitCast>
| |       `-ImplicitCastExpr 0x7f82b05e69c0 <col:44> 'std::__1::allocator<char>::pointer':'char *' <LValueToRValue>
| |         `-DeclRefExpr 0x7f82b05e6998 <col:44> 'std::__1::allocator<char>::pointer':'char *' lvalue ParmVar 0x7f82af32ca40 '__p' 'std::__1::allocator<char>::pointer':'char *'
| `-AlwaysInlineAttr 0x7f82af32cc30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82af32cc78 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1791:45> line:1790:41 used max_size 'std::__1::allocator::size_type (void) const noexcept'
| |-CompoundStmt 0x7f82b05dc0d8 <line:1791:9, col:45>
| | `-ReturnStmt 0x7f82b05dc0c0 <col:10, col:43>
| |   `-BinaryOperator 0x7f82b05dc098 <col:17, col:43> 'unsigned long' '/'
| |     |-CXXFunctionalCastExpr 0x7f82b05dc040 <col:17, col:29> 'std::__1::allocator::size_type':'unsigned long' functional cast to std::__1::allocator::size_type <NoOp>
| |     | `-ImplicitCastExpr 0x7f82b05dc028 <col:27, col:28> 'std::__1::allocator::size_type':'unsigned long' <IntegralCast>
| |     |   `-UnaryOperator 0x7f82af12bd78 <col:27, col:28> 'int' prefix '~'
| |     |     `-IntegerLiteral 0x7f82af12bd58 <col:28> 'int' 0
| |     `-UnaryExprOrTypeTraitExpr 0x7f82b05dc078 <col:33, col:43> 'unsigned long' sizeof 'char':'char'
| `-AlwaysInlineAttr 0x7f82af32cd20 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f82af32d148 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1793:5, line:1799:9> line:1796:9 construct
| |-TemplateTypeParmDecl 0x7f82af32cd68 <line:1793:15, col:21> col:21 class depth 0 index 0 _Up
| |-TemplateTypeParmDecl 0x7f82af32cdd8 <col:26, col:35> col:35 class depth 0 index 1 ... _Args
| `-CXXMethodDecl 0x7f82af32d0b0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1799:9> line:1796:9 construct 'void (_Up *, _Args &&...)'
|   |-ParmVarDecl 0x7f82af32cea8 <col:19, col:24> col:24 __p '_Up *'
|   |-ParmVarDecl 0x7f82af32cf98 <col:29, col:40> col:40 __args '_Args &&...'
|   `-AlwaysInlineAttr 0x7f82af32d1a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82af32d390 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1853:70> col:36 destroy 'void (std::__1::allocator<char>::pointer)'
| |-ParmVarDecl 0x7f82af32d288 <col:44, col:52> col:52 __p 'std::__1::allocator<char>::pointer':'char *'
| `-AlwaysInlineAttr 0x7f82af32d440 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f82b02bfe98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:1759:28> col:28 implicit constexpr allocator 'void (const class std::__1::allocator<char> &)' inline default trivial noexcept-unevaluated 0x7f82b02bfe98
| `-ParmVarDecl 0x7f82b02bff80 <col:28> col:28 'const class std::__1::allocator<char> &'
|-CXXConstructorDecl 0x7f82b02c0018 <col:28> col:28 implicit used constexpr allocator 'void (class std::__1::allocator<char> &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7f82b02c0140 <col:28> col:28 'class std::__1::allocator<char> &&'
| `-CompoundStmt 0x7f82b05e80f0 <col:28>
`-CXXDestructorDecl 0x7f82b02c1528 <col:28> col:28 implicit referenced ~allocator 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::allocator" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::__1::allocator.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f82af34ba10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:699:5, line:704:5> line:699:12 struct __long definition
|-CXXRecordDecl 0x7f82af34be88 prev 0x7f82af34ba10 <col:5, col:12> col:12 implicit struct __long
|-FieldDecl 0x7f82af34bf50 <line:701:9, col:19> col:19 referenced __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7f82af34bfa8 <line:702:9, col:19> col:19 referenced __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-FieldDecl 0x7f82af34c000 <line:703:9, col:19> col:19 referenced __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
|-CXXDestructorDecl 0x7f82b02c16e8 <line:699:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f82b05d4be8 <col:12> col:12 implicit constexpr __long 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &)' inline default trivial noexcept-unevaluated 0x7f82b05d4be8
| `-ParmVarDecl 0x7f82b05d4d10 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &'
|-CXXConstructorDecl 0x7f82b05d4da8 <col:12> col:12 implicit constexpr __long 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7f82b05d4ed0 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &&'
`-CXXConstructorDecl 0x7f82b05d67c8 <col:12> col:12 implicit __long 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" = type { i64, i64, i8* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f82af34c8c8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9, line:723:9> line:719:9 union definition
|-FieldDecl 0x7f82af34e668 <line:721:13, col:27> col:27 referenced __size_ 'unsigned char'
|-FieldDecl 0x7f82af34e6c0 <line:722:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-CXXDestructorDecl 0x7f82b02c1a68 <line:719:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f82b05d4fd8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &)' inline default trivial noexcept-unevaluated 0x7f82b05d4fd8
| `-ParmVarDecl 0x7f82b05d5100 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &'
|-CXXConstructorDecl 0x7f82b05d5198 <col:9> col:9 implicit constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7f82b05d52c0 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&'
`-CXXConstructorDecl 0x7f82b05d6b48 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon.0 = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f82af34c3e8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:717:5, line:725:5> line:717:12 struct __short definition
|-CXXRecordDecl 0x7f82af34c830 prev 0x7f82af34c3e8 <col:5, col:12> col:12 implicit struct __short
|-CXXRecordDecl 0x7f82af34c8c8 <line:719:9, line:723:9> line:719:9 union definition
| |-FieldDecl 0x7f82af34e668 <line:721:13, col:27> col:27 referenced __size_ 'unsigned char'
| |-FieldDecl 0x7f82af34e6c0 <line:722:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-CXXDestructorDecl 0x7f82b02c1a68 <line:719:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7f82b05d4fd8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &)' inline default trivial noexcept-unevaluated 0x7f82b05d4fd8
| | `-ParmVarDecl 0x7f82b05d5100 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &'
| |-CXXConstructorDecl 0x7f82b05d5198 <col:9> col:9 implicit constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&) noexcept' inline default trivial
| | `-ParmVarDecl 0x7f82b05d52c0 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&'
| `-CXXConstructorDecl 0x7f82b05d6b48 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial
|-FieldDecl 0x7f82af34e728 <col:9> col:9 implicit referenced 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
|-IndirectFieldDecl 0x7f82af34e780 <line:721:27> col:27 implicit __size_ 'unsigned char'
| |-Field 0x7f82af34e728 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| `-Field 0x7f82af34e668 '__size_' 'unsigned char'
|-IndirectFieldDecl 0x7f82af34e7d0 <line:722:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-Field 0x7f82af34e728 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| `-Field 0x7f82af34e6c0 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|-FieldDecl 0x7f82af34e898 <line:724:9, col:37> col:20 referenced __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
|-CXXDestructorDecl 0x7f82b02c17c8 <line:717:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f82b05d5328 <col:12> col:12 implicit constexpr __short 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &)' inline default trivial noexcept-unevaluated 0x7f82b05d5328
| `-ParmVarDecl 0x7f82b05d5450 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &'
|-CXXConstructorDecl 0x7f82b05d54e8 <col:12> col:12 implicit constexpr __short 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7f82b05d5610 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &&'
`-CXXConstructorDecl 0x7f82b05d68a8 <col:12> col:12 implicit __short 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__short" = type { %union.anon.0, [23 x i8] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f82af34eca0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:733:5, line:736:5> line:733:12 struct __raw definition
|-CXXRecordDecl 0x7f82af3513a0 prev 0x7f82af34eca0 <col:5, col:12> col:12 implicit struct __raw
|-FieldDecl 0x7f82af3514f8 <line:735:9, col:36> col:19 referenced __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
|-CXXDestructorDecl 0x7f82b02c18a8 <line:733:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f82b05d56c8 <col:12> col:12 implicit constexpr __raw 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &)' inline default trivial noexcept-unevaluated 0x7f82b05d56c8
| `-ParmVarDecl 0x7f82b05d57f0 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &'
|-CXXConstructorDecl 0x7f82b05d5888 <col:12> col:12 implicit constexpr __raw 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &&) noexcept' inline default trivial
| `-ParmVarDecl 0x7f82b05d59b0 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &&'
`-CXXConstructorDecl 0x7f82b05d6988 <col:12> col:12 implicit __raw 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__raw" = type { [3 x i64] }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f82af3510f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9, line:745:9> line:740:9 union definition
|-FieldDecl 0x7f82af351288 <line:742:13, col:21> col:21 referenced __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-FieldDecl 0x7f82af3512e0 <line:743:13, col:21> col:21 referenced __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-FieldDecl 0x7f82af351560 <line:744:13, col:21> col:21 referenced __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
|-CXXDestructorDecl 0x7f82b02c1988 <line:740:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f82b05d46b8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &)' inline default trivial noexcept-unevaluated 0x7f82b05d46b8
| `-ParmVarDecl 0x7f82b05d47e0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &'
|-CXXConstructorDecl 0x7f82b05d4878 <col:9> col:9 implicit used constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7f82b05d49a0 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&'
| `-CompoundStmt 0x7f82b05e82d0 <col:9>
`-CXXConstructorDecl 0x7f82b05d6a68 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%union.anon = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__long" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x7f82af34ed70 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:738:5, line:746:5> line:738:12 struct __rep definition
|-CXXRecordDecl 0x7f82af351060 prev 0x7f82af34ed70 <col:5, col:12> col:12 implicit struct __rep
|-CXXRecordDecl 0x7f82af3510f8 <line:740:9, line:745:9> line:740:9 union definition
| |-FieldDecl 0x7f82af351288 <line:742:13, col:21> col:21 referenced __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-FieldDecl 0x7f82af3512e0 <line:743:13, col:21> col:21 referenced __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-FieldDecl 0x7f82af351560 <line:744:13, col:21> col:21 referenced __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-CXXDestructorDecl 0x7f82b02c1988 <line:740:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7f82b05d46b8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &)' inline default trivial noexcept-unevaluated 0x7f82b05d46b8
| | `-ParmVarDecl 0x7f82b05d47e0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &'
| |-CXXConstructorDecl 0x7f82b05d4878 <col:9> col:9 implicit used constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept' inline default trivial
| | |-ParmVarDecl 0x7f82b05d49a0 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&'
| | `-CompoundStmt 0x7f82b05e82d0 <col:9>
| `-CXXConstructorDecl 0x7f82b05d6a68 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial
|-FieldDecl 0x7f82af3515c8 <col:9> col:9 implicit referenced 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
|-IndirectFieldDecl 0x7f82af351620 <line:742:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-Field 0x7f82af3515c8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| `-Field 0x7f82af351288 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|-IndirectFieldDecl 0x7f82af351670 <line:743:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-Field 0x7f82af3515c8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| `-Field 0x7f82af3512e0 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-IndirectFieldDecl 0x7f82af3516c0 <line:744:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-Field 0x7f82af3515c8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| `-Field 0x7f82af351560 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
|-CXXDestructorDecl 0x7f82b02c1608 <line:738:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f82b05d4a08 <col:12> col:12 implicit constexpr __rep 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &)' inline default trivial noexcept-unevaluated 0x7f82b05d4a08
| `-ParmVarDecl 0x7f82b05d4b30 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
|-CXXConstructorDecl 0x7f82b05d5a48 <col:12> col:12 implicit used constexpr __rep 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&) noexcept' inline default trivial
| |-ParmVarDecl 0x7f82b05d5b70 <col:12> col:12 used 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&'
| |-CXXCtorInitializer Field 0x7f82af3515c8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | `-CXXConstructExpr 0x7f82b05e82e8 <col:12> 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)' 'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept'
| |   `-MemberExpr 0x7f82b05e8298 <col:12> 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)' xvalue . 0x7f82af3515c8
| |     `-CXXStaticCastExpr 0x7f82b05e8268 <col:12> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' xvalue static_cast<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&> <NoOp>
| |       `-DeclRefExpr 0x7f82b05e8230 <col:12> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue ParmVar 0x7f82b05d5b70 '' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&'
| `-CompoundStmt 0x7f82b05e8350 <col:12>
`-CXXConstructorDecl 0x7f82b05d66e0 <col:12> col:12 implicit referenced __rep 'void (void) noexcept' inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  NonVirtualBaseLLVMType:%"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" = type { %union.anon }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f82af352e68 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2209:1, line:2264:1> line:2210:7 class __libcpp_compressed_pair_imp definition
|-private 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-TemplateArgument integral 2
|-CXXRecordDecl 0x7f82af353288 prev 0x7f82af352e68 <col:1, col:7> col:7 implicit class __libcpp_compressed_pair_imp
|-AccessSpecDecl 0x7f82af353320 <line:2213:1, col:8> col:1 private
|-FieldDecl 0x7f82af353358 <line:2214:5, col:9> col:9 referenced __first_ 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-AccessSpecDecl 0x7f82af3533a0 <line:2215:1, col:7> col:1 public
|-TypedefDecl 0x7f82af3533d8 <line:2216:5, col:17> col:17 referenced _T1_param 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-SubstTemplateTypeParmType 0x7f82af353110 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|   |-TemplateTypeParmType 0x7f82af148980 '_T1' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f82af148940 '_T1'
|   `-RecordType 0x7f82af34ee10 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|     `-CXXRecord 0x7f82af34ed70 '__rep'
|-TypedefDecl 0x7f82af353440 <line:2217:5, col:17> col:17 referenced _T2_param 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7f82af353150 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7f82af1489f0 '_T2' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f82af1489a8 '_T2'
|   `-RecordType 0x7f82af9ff470 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7f82af9ff388 'allocator'
|-TypedefDecl 0x7f82af353930 <line:2219:5, col:51> col:51 referenced _T1_reference 'typename remove_reference<struct __rep>::type &'
| `-LValueReferenceType 0x7f82af3538e0 'typename remove_reference<struct __rep>::type &'
|   `-ElaboratedType 0x7f82af353880 'typename remove_reference<struct __rep>::type' sugar
|     `-TypedefType 0x7f82af353860 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|       |-Typedef 0x7f82af3537e8 'type'
|       `-SubstTemplateTypeParmType 0x7f82af3537b0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|         |-TemplateTypeParmType 0x7f82b0056ef0 '_Tp' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7f82b0056eb0 '_Tp'
|         `-RecordType 0x7f82af34ee10 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|           `-CXXRecord 0x7f82af34ed70 '__rep'
|-TypedefDecl 0x7f82af3539c8 <line:2220:5, col:57> col:57 referenced _T2_reference 'class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7f82af353990 'class std::__1::allocator<char> &'
|   `-SubstTemplateTypeParmType 0x7f82af353150 'class std::__1::allocator<char>' sugar
|     |-TemplateTypeParmType 0x7f82af1489f0 '_T2' dependent depth 0 index 1
|     | `-TemplateTypeParm 0x7f82af1489a8 '_T2'
|     `-RecordType 0x7f82af9ff470 'class std::__1::allocator<char>'
|       `-ClassTemplateSpecialization 0x7f82af9ff388 'allocator'
|-TypedefDecl 0x7f82af353b80 <line:2222:5, col:57> col:57 referenced _T1_const_reference 'const typename remove_reference<struct __rep>::type &'
| `-LValueReferenceType 0x7f82af353b30 'const typename remove_reference<struct __rep>::type &'
|   `-QualType 0x7f82af353ad1 'const typename remove_reference<struct __rep>::type' const
|     `-ElaboratedType 0x7f82af353ad0 'typename remove_reference<struct __rep>::type' sugar
|       `-TypedefType 0x7f82af353860 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|         |-Typedef 0x7f82af3537e8 'type'
|         `-SubstTemplateTypeParmType 0x7f82af3537b0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|           |-TemplateTypeParmType 0x7f82b0056ef0 '_Tp' dependent depth 0 index 0
|           | `-TemplateTypeParm 0x7f82b0056eb0 '_Tp'
|           `-RecordType 0x7f82af34ee10 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|             `-CXXRecord 0x7f82af34ed70 '__rep'
|-TypedefDecl 0x7f82af353c18 <line:2223:5, col:63> col:63 referenced _T2_const_reference 'const class std::__1::allocator<char> &'
| `-LValueReferenceType 0x7f82af353be0 'const class std::__1::allocator<char> &'
|   `-QualType 0x7f82af353151 'const class std::__1::allocator<char>' const
|     `-SubstTemplateTypeParmType 0x7f82af353150 'class std::__1::allocator<char>' sugar
|       |-TemplateTypeParmType 0x7f82af1489f0 '_T2' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x7f82af1489a8 '_T2'
|       `-RecordType 0x7f82af9ff470 'class std::__1::allocator<char>'
|         `-ClassTemplateSpecialization 0x7f82af9ff388 'allocator'
|-CXXConstructorDecl 0x7f82af353cb0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2225:76> col:31 used __libcpp_compressed_pair_imp 'void (void)'
| |-CXXCtorInitializer 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| | `-CXXConstructExpr 0x7f82b05d6c80 <col:31> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' 'void (void) noexcept'
| |-CXXCtorInitializer Field 0x7f82af353358 '__first_' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| | `-CXXConstructExpr 0x7f82b05d6c28 <col:64, col:73> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' 'void (void) noexcept' zeroing
| |-CompoundStmt 0x7f82af14d908 <col:75, col:76>
| `-AlwaysInlineAttr 0x7f82af353d98 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f82af353f30 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2227:54> line:2226:40 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param)'
| |-ParmVarDecl 0x7f82af353e10 <col:69, col:79> col:79 __t1 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-AlwaysInlineAttr 0x7f82af353ff0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f82af354190 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2229:61> line:2228:40 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param)'
| |-ParmVarDecl 0x7f82af354070 <col:69, col:79> col:79 __t2 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7f82af354250 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f82af354460 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2233:92> line:2230:31 __libcpp_compressed_pair_imp 'void (std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param, std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param)' noexcept-uninstantiated 0x7f82af14bd88
| |-ParmVarDecl 0x7f82af3542a8 <col:60, col:70> col:70 __t1 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| |-ParmVarDecl 0x7f82af354318 <col:76, col:86> col:86 __t2 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7f82af354580 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f82af354f88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2237:5, line:2247:14> line:2239:9 __libcpp_compressed_pair_imp
| |-TemplateTypeParmDecl 0x7f82af3545c8 <line:2237:15, col:24> col:24 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7f82af354638 <col:32, col:41> col:41 class depth 0 index 1 ... _Args2
| |-NonTypeTemplateParmDecl 0x7f82af3546a8 <col:49, col:59> col:59 referenced 'size_t':'unsigned long' depth 0 index 2 ... _I1
| |-NonTypeTemplateParmDecl 0x7f82af354700 <col:64, col:74> col:74 referenced 'size_t':'unsigned long' depth 0 index 3 ... _I2
| `-CXXConstructorDecl 0x7f82af354ee0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2247:14> line:2239:9 __libcpp_compressed_pair_imp 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>, __tuple_indices<_I1...>, __tuple_indices<_I2...>)'
|   |-ParmVarDecl 0x7f82af354788 <col:38> col:59 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f82af3548f8 <line:2240:38, col:55> col:55 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7f82af354a68 <line:2241:38, col:55> col:55 __second_args 'tuple<_Args2...>'
|   |-ParmVarDecl 0x7f82af354bb8 <line:2242:38, col:60> col:61 '__tuple_indices<_I1...>'
|   |-ParmVarDecl 0x7f82af354d58 <line:2243:38, col:60> col:61 '__tuple_indices<_I2...>'
|   `-AlwaysInlineAttr 0x7f82af355000 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82af355178 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2251:92> col:51 used first 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_reference (void) noexcept'
| |-CompoundStmt 0x7f82b05dcab0 <col:75, col:92>
| | `-ReturnStmt 0x7f82b05dca98 <col:76, col:83>
| |   `-MemberExpr 0x7f82b05dca60 <col:83> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue ->__first_ 0x7f82af353358
| |     `-CXXThisExpr 0x7f82b05dca48 <col:83> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7f82af355220 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82af355318 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2252:92> col:51 used first 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_const_reference (void) const noexcept'
| |-CompoundStmt 0x7f82b05e6840 <col:75, col:92>
| | `-ReturnStmt 0x7f82b05e6828 <col:76, col:83>
| |   `-MemberExpr 0x7f82b05e67f0 <col:83> 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue ->__first_ 0x7f82af353358
| |     `-CXXThisExpr 0x7f82b05e67d8 <col:83> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7f82af3553c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82af3554b8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2254:90> col:51 used second 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_reference (void) noexcept'
| |-CompoundStmt 0x7f82b05e4ef0 <col:76, col:90>
| | `-ReturnStmt 0x7f82b05e4ed8 <col:77, col:85>
| |   `-ImplicitCastExpr 0x7f82b05e4eb8 <col:84, col:85> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' lvalue <DerivedToBase (allocator)>
| |     `-UnaryOperator 0x7f82b05e4e98 <col:84, col:85> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue prefix '*'
| |       `-CXXThisExpr 0x7f82b05e4e80 <col:85> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7f82af355560 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82af355658 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2255:90> col:51 used second 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_const_reference (void) const noexcept'
| |-CompoundStmt 0x7f82b05dc4f8 <col:76, col:90>
| | `-ReturnStmt 0x7f82b05dc4e0 <col:77, col:85>
| |   `-ImplicitCastExpr 0x7f82b05dc4c0 <col:84, col:85> 'const class std::__1::allocator<char>':'const class std::__1::allocator<char>' lvalue <DerivedToBase (allocator)>
| |     `-UnaryOperator 0x7f82b05dc4a0 <col:84, col:85> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue prefix '*'
| |       `-CXXThisExpr 0x7f82b05dc488 <col:85> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' this
| `-AlwaysInlineAttr 0x7f82af355700 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82af3558a0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2263:5> line:2257:36 swap 'void (class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &)' noexcept-uninstantiated 0x7f82af14d188
| |-ParmVarDecl 0x7f82af355788 <col:41, col:71> col:71 __x 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &'
| `-AlwaysInlineAttr 0x7f82af355998 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7f82b02c1448 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2210:7> col:7 implicit ~__libcpp_compressed_pair_imp 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f82b05d5bd8 <col:7> col:7 implicit constexpr __libcpp_compressed_pair_imp 'void (const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &)' inline default trivial noexcept-unevaluated 0x7f82b05d5bd8
| `-ParmVarDecl 0x7f82b05d5d00 <col:7> col:7 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &'
`-CXXConstructorDecl 0x7f82b05d5dd0 <col:7> col:7 implicit used constexpr __libcpp_compressed_pair_imp 'void (class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&) noexcept' inline default trivial
  |-ParmVarDecl 0x7f82b05d5f00 <col:7> col:7 used 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&'
  |-CXXCtorInitializer 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
  | `-CXXConstructExpr 0x7f82b05e8108 <col:7> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' 'void (class std::__1::allocator<char> &&) noexcept'
  |   `-ImplicitCastExpr 0x7f82b05e8098 <col:7> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' xvalue <UncheckedDerivedToBase (allocator)>
  |     `-CXXStaticCastExpr 0x7f82b05e8068 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' xvalue static_cast<class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&> <NoOp>
  |       `-DeclRefExpr 0x7f82b05e8030 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue ParmVar 0x7f82b05d5f00 '' 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&'
  |-CXXCtorInitializer Field 0x7f82af353358 '__first_' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
  | `-CXXConstructExpr 0x7f82b05e8368 <col:7> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&) noexcept'
  |   `-MemberExpr 0x7f82b05e81e0 <col:7> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' xvalue .__first_ 0x7f82af353358
  |     `-CXXStaticCastExpr 0x7f82b05e81b0 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' xvalue static_cast<class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&> <NoOp>
  |       `-DeclRefExpr 0x7f82b05e8178 <col:7> 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' lvalue ParmVar 0x7f82b05d5f00 '' 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&'
  `-CompoundStmt 0x7f82b05e83d8 <col:7>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__libcpp_compressed_pair_imp" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  NonVirtualBaseLLVMType:%"class.std::__1::__libcpp_compressed_pair_imp" = type { %"struct.std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >::__rep" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f82af34ee60 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2317:1, line:2363:1> line:2318:7 class __compressed_pair definition
|-private '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
|-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-CXXRecordDecl 0x7f82af355a30 prev 0x7f82af34ee60 <col:1, col:7> col:7 implicit class __compressed_pair
|-TypedefDecl 0x7f82af356498 <line:2321:5, col:52> col:52 base '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
| `-TemplateSpecializationType 0x7f82af3563f0 '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >' sugar __libcpp_compressed_pair_imp
|   |-TemplateArgument type 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|   |-TemplateArgument type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
|   `-RecordType 0x7f82af352f80 'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
|     `-ClassTemplateSpecialization 0x7f82af352e68 '__libcpp_compressed_pair_imp'
|-AccessSpecDecl 0x7f82af3564f0 <line:2322:1, col:7> col:1 public
|-TypedefDecl 0x7f82af358600 <line:2323:5, col:38> col:38 _T1_param 'typename base::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-ElaboratedType 0x7f82af356580 'typename base::_T1_param' sugar
|   `-TypedefType 0x7f82af353de0 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_param' sugar
|     |-Typedef 0x7f82af3533d8 '_T1_param'
|     `-SubstTemplateTypeParmType 0x7f82af353110 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|       |-TemplateTypeParmType 0x7f82af148980 '_T1' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f82af148940 '_T1'
|       `-RecordType 0x7f82af34ee10 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|         `-CXXRecord 0x7f82af34ed70 '__rep'
|-TypedefDecl 0x7f82af3586d0 <line:2324:5, col:38> col:38 _T2_param 'typename base::_T2_param':'class std::__1::allocator<char>'
| `-ElaboratedType 0x7f82af358680 'typename base::_T2_param' sugar
|   `-TypedefType 0x7f82af354040 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_param' sugar
|     |-Typedef 0x7f82af353440 '_T2_param'
|     `-SubstTemplateTypeParmType 0x7f82af353150 'class std::__1::allocator<char>' sugar
|       |-TemplateTypeParmType 0x7f82af1489f0 '_T2' dependent depth 0 index 1
|       | `-TemplateTypeParm 0x7f82af1489a8 '_T2'
|       `-RecordType 0x7f82af9ff470 'class std::__1::allocator<char>'
|         `-ClassTemplateSpecialization 0x7f82af9ff388 'allocator'
|-TypedefDecl 0x7f82af3587a0 <line:2326:5, col:42> col:42 _T1_reference 'typename base::_T1_reference':'typename remove_reference<struct __rep>::type &'
| `-ElaboratedType 0x7f82af358750 'typename base::_T1_reference' sugar
|   `-TypedefType 0x7f82af3550d0 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_reference' sugar
|     |-Typedef 0x7f82af353930 '_T1_reference'
|     `-LValueReferenceType 0x7f82af3538e0 'typename remove_reference<struct __rep>::type &'
|       `-ElaboratedType 0x7f82af353880 'typename remove_reference<struct __rep>::type' sugar
|         `-TypedefType 0x7f82af353860 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|           |-Typedef 0x7f82af3537e8 'type'
|           `-SubstTemplateTypeParmType 0x7f82af3537b0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|             |-TemplateTypeParmType 0x7f82b0056ef0 '_Tp' dependent depth 0 index 0
|             | `-TemplateTypeParm 0x7f82b0056eb0 '_Tp'
|             `-RecordType 0x7f82af34ee10 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|               `-CXXRecord 0x7f82af34ed70 '__rep'
|-TypedefDecl 0x7f82af358870 <line:2327:5, col:42> col:42 _T2_reference 'typename base::_T2_reference':'class std::__1::allocator<char> &'
| `-ElaboratedType 0x7f82af358820 'typename base::_T2_reference' sugar
|   `-TypedefType 0x7f82af355410 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_reference' sugar
|     |-Typedef 0x7f82af3539c8 '_T2_reference'
|     `-LValueReferenceType 0x7f82af353990 'class std::__1::allocator<char> &'
|       `-SubstTemplateTypeParmType 0x7f82af353150 'class std::__1::allocator<char>' sugar
|         |-TemplateTypeParmType 0x7f82af1489f0 '_T2' dependent depth 0 index 1
|         | `-TemplateTypeParm 0x7f82af1489a8 '_T2'
|         `-RecordType 0x7f82af9ff470 'class std::__1::allocator<char>'
|           `-ClassTemplateSpecialization 0x7f82af9ff388 'allocator'
|-TypedefDecl 0x7f82af358940 <line:2329:5, col:48> col:48 _T1_const_reference 'typename base::_T1_const_reference':'const typename remove_reference<struct __rep>::type &'
| `-ElaboratedType 0x7f82af3588f0 'typename base::_T1_const_reference' sugar
|   `-TypedefType 0x7f82af355270 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T1_const_reference' sugar
|     |-Typedef 0x7f82af353b80 '_T1_const_reference'
|     `-LValueReferenceType 0x7f82af353b30 'const typename remove_reference<struct __rep>::type &'
|       `-QualType 0x7f82af353ad1 'const typename remove_reference<struct __rep>::type' const
|         `-ElaboratedType 0x7f82af353ad0 'typename remove_reference<struct __rep>::type' sugar
|           `-TypedefType 0x7f82af353860 'std::__1::remove_reference<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep>::type' sugar
|             |-Typedef 0x7f82af3537e8 'type'
|             `-SubstTemplateTypeParmType 0x7f82af3537b0 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' sugar
|               |-TemplateTypeParmType 0x7f82b0056ef0 '_Tp' dependent depth 0 index 0
|               | `-TemplateTypeParm 0x7f82b0056eb0 '_Tp'
|               `-RecordType 0x7f82af34ee10 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
|                 `-CXXRecord 0x7f82af34ed70 '__rep'
|-TypedefDecl 0x7f82af358a10 <line:2330:5, col:48> col:48 _T2_const_reference 'typename base::_T2_const_reference':'const class std::__1::allocator<char> &'
| `-ElaboratedType 0x7f82af3589c0 'typename base::_T2_const_reference' sugar
|   `-TypedefType 0x7f82af3555b0 'std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>::_T2_const_reference' sugar
|     |-Typedef 0x7f82af353c18 '_T2_const_reference'
|     `-LValueReferenceType 0x7f82af353be0 'const class std::__1::allocator<char> &'
|       `-QualType 0x7f82af353151 'const class std::__1::allocator<char>' const
|         `-SubstTemplateTypeParmType 0x7f82af353150 'class std::__1::allocator<char>' sugar
|           |-TemplateTypeParmType 0x7f82af1489f0 '_T2' dependent depth 0 index 1
|           | `-TemplateTypeParm 0x7f82af1489a8 '_T2'
|           `-RecordType 0x7f82af9ff470 'class std::__1::allocator<char>'
|             `-ClassTemplateSpecialization 0x7f82af9ff388 'allocator'
|-CXXConstructorDecl 0x7f82af358aa8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2332:52> col:31 used __compressed_pair 'void (void)'
| |-CXXCtorInitializer '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
| | `-CXXConstructExpr 0x7f82b05d65f0 <col:31> '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' 'void (void)'
| |-CompoundStmt 0x7f82b1803c30 <col:51, col:52>
| `-AlwaysInlineAttr 0x7f82af358b88 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f82af358ce0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2334:50> line:2333:40 __compressed_pair 'void (std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param)'
| |-ParmVarDecl 0x7f82af358c00 <col:58, col:68> col:68 __t1 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| `-AlwaysInlineAttr 0x7f82af358da0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f82af358f00 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2336:50> line:2335:40 __compressed_pair 'void (std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param)'
| |-ParmVarDecl 0x7f82af358e20 <col:58, col:68> col:68 __t2 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7f82af358fc0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXConstructorDecl 0x7f82af359180 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2338:83> line:2337:31 __compressed_pair 'void (std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param, std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param)'
| |-ParmVarDecl 0x7f82af359018 <col:49, col:59> col:59 __t1 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_param':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep'
| |-ParmVarDecl 0x7f82af359088 <col:65, col:75> col:75 __t2 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_param':'class std::__1::allocator<char>'
| `-AlwaysInlineAttr 0x7f82af359248 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-FunctionTemplateDecl 0x7f82af359868 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2342:5, line:2349:14> line:2344:9 __compressed_pair
| |-TemplateTypeParmDecl 0x7f82af359290 <line:2342:15, col:24> col:24 class depth 0 index 0 ... _Args1
| |-TemplateTypeParmDecl 0x7f82af3592f8 <col:32, col:41> col:41 class depth 0 index 1 ... _Args2
| `-CXXConstructorDecl 0x7f82af3597c0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2349:14> line:2344:9 __compressed_pair 'void (struct std::__1::piecewise_construct_t, tuple<_Args1...>, tuple<_Args2...>)'
|   |-ParmVarDecl 0x7f82af359388 <col:27, col:49> col:49 __pc 'struct std::__1::piecewise_construct_t'
|   |-ParmVarDecl 0x7f82af3594f8 <col:55, col:72> col:72 __first_args 'tuple<_Args1...>'
|   |-ParmVarDecl 0x7f82af359668 <line:2345:55, col:72> col:72 __second_args 'tuple<_Args2...>'
|   `-AlwaysInlineAttr 0x7f82af3598d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82af359a18 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2353:97> col:51 used first 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_reference (void) noexcept'
| |-CompoundStmt 0x7f82b05dca28 <col:75, col:97>
| | `-ReturnStmt 0x7f82b05dca10 <col:76, col:95>
| |   `-CXXMemberCallExpr 0x7f82b05dc9c8 <col:83, col:95> 'typename remove_reference<struct __rep>::type':'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue
| |     `-MemberExpr 0x7f82b05dc978 <col:83, col:89> '<bound member function type>' ->first 0x7f82af355178
| |       `-ImplicitCastExpr 0x7f82b05dc9f0 <col:83> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |         `-CXXThisExpr 0x7f82b05dc960 <col:83> 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7f82af359ac0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82af359b88 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2354:97> col:51 used first 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T1_const_reference (void) const noexcept'
| |-CompoundStmt 0x7f82b05e67b8 <col:75, col:97>
| | `-ReturnStmt 0x7f82b05e67a0 <col:76, col:95>
| |   `-CXXMemberCallExpr 0x7f82b05e6740 <col:83, col:95> 'const typename remove_reference<struct __rep>::type':'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue
| |     `-MemberExpr 0x7f82b05e66f0 <col:83, col:89> '<bound member function type>' ->first 0x7f82af355318
| |       `-ImplicitCastExpr 0x7f82b05e6788 <col:83> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' <NoOp>
| |         `-ImplicitCastExpr 0x7f82b05e6768 <col:83> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |           `-CXXThisExpr 0x7f82b05e66d8 <col:83> 'const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7f82af359c30 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82af359cf8 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2356:99> col:51 used second 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_reference (void) noexcept'
| |-CompoundStmt 0x7f82b05e4e60 <col:76, col:99>
| | `-ReturnStmt 0x7f82b05e4e48 <col:77, col:97>
| |   `-CXXMemberCallExpr 0x7f82b05e4e00 <col:84, col:97> 'class std::__1::allocator<char>':'class std::__1::allocator<char>' lvalue
| |     `-MemberExpr 0x7f82b05e4db0 <col:84, col:90> '<bound member function type>' ->second 0x7f82af3554b8
| |       `-ImplicitCastExpr 0x7f82b05e4e28 <col:84> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |         `-CXXThisExpr 0x7f82b05e4d98 <col:84> 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7f82af359da0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82af359e68 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2357:99> col:51 used second 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::_T2_const_reference (void) const noexcept'
| |-CompoundStmt 0x7f82b05dc468 <col:76, col:99>
| | `-ReturnStmt 0x7f82b05dc450 <col:77, col:97>
| |   `-CXXMemberCallExpr 0x7f82b05dc398 <col:84, col:97> 'const class std::__1::allocator<char>':'const class std::__1::allocator<char>' lvalue
| |     `-MemberExpr 0x7f82b05dc348 <col:84, col:90> '<bound member function type>' ->second 0x7f82af355658
| |       `-ImplicitCastExpr 0x7f82b05dc438 <col:84> 'const class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> *' <NoOp>
| |         `-ImplicitCastExpr 0x7f82b05dc418 <col:84> 'std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >::base *' <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
| |           `-CXXThisExpr 0x7f82b05dc330 <col:84> 'const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > *' this
| `-AlwaysInlineAttr 0x7f82af359f10 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXMethodDecl 0x7f82af35a0b0 <col:35, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2362:26> line:2359:36 swap 'void (class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &)' noexcept-uninstantiated 0x7f82b1803858
| |-ParmVarDecl 0x7f82af359f98 <col:41, col:60> col:60 __x 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &'
| `-AlwaysInlineAttr 0x7f82af35a1a8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
|-CXXDestructorDecl 0x7f82b02c1368 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/memory:2318:7> col:7 implicit ~__compressed_pair 'void (void) noexcept' inline default trivial
|-CXXConstructorDecl 0x7f82b05d5f68 <col:7> col:7 implicit constexpr __compressed_pair 'void (const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &)' inline default trivial noexcept-unevaluated 0x7f82b05d5f68
| `-ParmVarDecl 0x7f82b05d6090 <col:7> col:7 'const class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &'
`-CXXConstructorDecl 0x7f82b05d6128 <col:7> col:7 implicit used constexpr __compressed_pair 'void (class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &&) noexcept' inline default trivial
  |-ParmVarDecl 0x7f82b05d6250 <col:7> col:7 used 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &&'
  |-CXXCtorInitializer '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>'
  | `-CXXConstructExpr 0x7f82b05e83f0 <col:7> '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' 'void (class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2> &&) noexcept'
  |   `-ImplicitCastExpr 0x7f82b05e8010 <col:7> '__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >':'class std::__1::__libcpp_compressed_pair_imp<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char>, 2>' xvalue <UncheckedDerivedToBase (__libcpp_compressed_pair_imp)>
  |     `-CXXStaticCastExpr 0x7f82b05e7fe0 <col:7> 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >' xvalue static_cast<class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &&> <NoOp>
  |       `-DeclRefExpr 0x7f82b05e7fa8 <col:7> 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >' lvalue ParmVar 0x7f82b05d6250 '' 'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> > &&'
  `-CompoundStmt 0x7f82b05e84c0 <col:7>

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::__compressed_pair" = type { %"class.std::__1::__libcpp_compressed_pair_imp" }
  NonVirtualBaseLLVMType:%"class.std::__1::__compressed_pair" = type { %"class.std::__1::__libcpp_compressed_pair_imp" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: ClassTemplateSpecializationDecl 0x7f82afa04638 parent 0x7f82af9f74d0 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:851:38, /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:4036:81> col:64 class basic_string definition
|-private '__basic_string_common<true>':'class std::__1::__basic_string_common<true>'
|-TemplateArgument type 'char'
|-TemplateArgument type 'struct std::__1::char_traits<char>'
|-TemplateArgument type 'class std::__1::allocator<char>'
|-VisibilityAttr 0x7f82b03e6978 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:697:62, col:86> Default
|-CXXRecordDecl 0x7f82af32ac48 prev 0x7f82afa04638 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:633:1, col:28> col:28 implicit class basic_string
|-AccessSpecDecl 0x7f82af32ace0 <line:636:1, col:7> col:1 public
|-TypedefDecl 0x7f82af32ad18 <line:637:5, col:58> col:58 __self 'class std::__1::basic_string<char>'
| `-RecordType 0x7f82afa04750 'class std::__1::basic_string<char>'
|   `-ClassTemplateSpecialization 0x7f82afa04638 'basic_string'
|-TypedefDecl 0x7f82af32ae98 <line:638:5, col:58> col:58 __self_view 'basic_string_view<char, struct std::__1::char_traits<char> >':'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
| `-TemplateSpecializationType 0x7f82af32adf0 'basic_string_view<char, struct std::__1::char_traits<char> >' sugar basic_string_view
|   |-TemplateArgument type 'char':'char'
|   |-TemplateArgument type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
|   `-RecordType 0x7f82af1f0140 'class std::__1::basic_string_view<char, struct std::__1::char_traits<char> >'
|     `-ClassTemplateSpecialization 0x7f82af1f0038 'basic_string_view'
|-TypedefDecl 0x7f82af32af00 <line:639:5, col:58> col:58 traits_type 'struct std::__1::char_traits<char>':'struct std::__1::char_traits<char>'
| `-SubstTemplateTypeParmType 0x7f82af32adb0 'struct std::__1::char_traits<char>' sugar
|   |-TemplateTypeParmType 0x7f82af232d60 '_Traits' dependent depth 0 index 1
|   | `-TemplateTypeParm 0x7f82af232d18 '_Traits'
|   `-RecordType 0x7f82af9fe040 'struct std::__1::char_traits<char>'
|     `-ClassTemplateSpecialization 0x7f82b028eaa8 'char_traits'
|-TypedefDecl 0x7f82af32af68 <line:640:5, col:58> col:58 referenced value_type 'char':'char'
| `-SubstTemplateTypeParmType 0x7f82af32ad70 'char' sugar
|   |-TemplateTypeParmType 0x7f82af232cf0 '_CharT' dependent depth 0 index 0
|   | `-TemplateTypeParm 0x7f82af232cb0 '_CharT'
|   `-BuiltinType 0x7f82af032b60 'char'
|-TypedefDecl 0x7f82af32aff8 <line:641:5, col:58> col:58 allocator_type 'class std::__1::allocator<char>':'class std::__1::allocator<char>'
| `-SubstTemplateTypeParmType 0x7f82af32afc0 'class std::__1::allocator<char>' sugar
|   |-TemplateTypeParmType 0x7f82af232dd0 '_Allocator' dependent depth 0 index 2
|   | `-TemplateTypeParm 0x7f82af232d88 '_Allocator'
|   `-RecordType 0x7f82af9ff470 'class std::__1::allocator<char>'
|     `-ClassTemplateSpecialization 0x7f82af9ff388 'allocator'
|-TypedefDecl 0x7f82af32b208 <line:642:5, col:58> col:58 __alloc_traits 'allocator_traits<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>':'struct std::__1::allocator_traits<class std::__1::allocator<char> >'
| `-TemplateSpecializationType 0x7f82af32b190 'allocator_traits<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>' sugar allocator_traits
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type':'class std::__1::allocator<char>'
|   `-RecordType 0x7f82af32b170 'struct std::__1::allocator_traits<class std::__1::allocator<char> >'
|     `-ClassTemplateSpecialization 0x7f82af32b080 'allocator_traits'
|-TypedefDecl 0x7f82af34a750 <line:643:5, col:58> col:58 size_type 'typename __alloc_traits::size_type':'unsigned long'
| `-ElaboratedType 0x7f82af34a700 'typename __alloc_traits::size_type' sugar
|   `-TypedefType 0x7f82af3419b0 'std::__1::allocator_traits<class std::__1::allocator<char> >::size_type' sugar
|     |-Typedef 0x7f82af3394c0 'size_type'
|     `-ElaboratedType 0x7f82af339470 'typename __size_type<allocator_type, difference_type>::type' sugar
|       `-TypedefType 0x7f82af339450 'std::__1::__size_type<class std::__1::allocator<char>, long, true>::type' sugar
|         |-Typedef 0x7f82af3393d0 'type'
|         `-ElaboratedType 0x7f82af339380 'typename class allocator<char>::size_type' sugar
|           `-TypedefType 0x7f82af338820 'std::__1::allocator<char>::size_type' sugar
|             |-Typedef 0x7f82af32b608 'size_type'
|             `-TypedefType 0x7f82af8dd580 'size_t' sugar
|               |-Typedef 0x7f82af0673b0 'size_t'
|               `-BuiltinType 0x7f82af032c80 'unsigned long'
|-TypedefDecl 0x7f82af34a820 <line:644:5, col:58> col:58 difference_type 'typename __alloc_traits::difference_type':'long'
| `-ElaboratedType 0x7f82af34a7d0 'typename __alloc_traits::difference_type' sugar
|   `-TypedefType 0x7f82af337b40 'std::__1::allocator_traits<class std::__1::allocator<char> >::difference_type' sugar
|     |-Typedef 0x7f82af337ad0 'difference_type'
|     `-ElaboratedType 0x7f82af337a80 'typename __alloc_traits_difference_type<allocator_type, pointer>::type' sugar
|       `-TypedefType 0x7f82af337a60 'std::__1::__alloc_traits_difference_type<class std::__1::allocator<char>, char *, true>::type' sugar
|         |-Typedef 0x7f82af3379e0 'type'
|         `-ElaboratedType 0x7f82af337990 'typename class allocator<char>::difference_type' sugar
|           `-TypedefType 0x7f82af336e30 'std::__1::allocator<char>::difference_type' sugar
|             |-Typedef 0x7f82af32b660 'difference_type'
|             `-TypedefType 0x7f82b106d9c0 'ptrdiff_t' sugar
|               |-Typedef 0x7f82af067340 'ptrdiff_t'
|               `-BuiltinType 0x7f82af032be0 'long'
|-TypedefDecl 0x7f82af34a8d8 <line:645:5, col:58> col:58 reference 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
| `-LValueReferenceType 0x7f82af34a8a0 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
|   `-TypedefType 0x7f82af34a880 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' sugar
|     |-Typedef 0x7f82af32af68 'value_type'
|     `-SubstTemplateTypeParmType 0x7f82af32ad70 'char' sugar
|       |-TemplateTypeParmType 0x7f82af232cf0 '_CharT' dependent depth 0 index 0
|       | `-TemplateTypeParm 0x7f82af232cb0 '_CharT'
|       `-BuiltinType 0x7f82af032b60 'char'
|-TypedefDecl 0x7f82af34a968 <line:646:5, col:58> col:58 const_reference 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
| `-LValueReferenceType 0x7f82af34a930 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type &'
|   `-QualType 0x7f82af34a881 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' const
|     `-TypedefType 0x7f82af34a880 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type' sugar
|       |-Typedef 0x7f82af32af68 'value_type'
|       `-SubstTemplateTypeParmType 0x7f82af32ad70 'char' sugar
|         |-TemplateTypeParmType 0x7f82af232cf0 '_CharT' dependent depth 0 index 0
|         | `-TemplateTypeParm 0x7f82af232cb0 '_CharT'
|         `-BuiltinType 0x7f82af032b60 'char'
|-TypedefDecl 0x7f82af34aa30 <line:647:5, col:58> col:58 pointer 'typename __alloc_traits::pointer':'char *'
| `-ElaboratedType 0x7f82af34a9e0 'typename __alloc_traits::pointer' sugar
|   `-TypedefType 0x7f82af32f090 'std::__1::allocator_traits<class std::__1::allocator<char> >::pointer' sugar
|     |-Typedef 0x7f82af32f020 'pointer'
|     `-ElaboratedType 0x7f82af32efd0 'typename __pointer_type<value_type, allocator_type>::type' sugar
|       `-TypedefType 0x7f82af32efb0 'std::__1::__pointer_type<char, class std::__1::allocator<char> >::type' sugar
|         |-Typedef 0x7f82af32ef30 'type'
|         `-ElaboratedType 0x7f82af32eee0 'typename __pointer_type_imp::__pointer_type<char, typename remove_reference<class allocator<char> >::type>::type' sugar
|           `-TypedefType 0x7f82af32eec0 'std::__1::__pointer_type_imp::__pointer_type<char, class std::__1::allocator<char>, true>::type' sugar
|             |-Typedef 0x7f82af32ee40 'type'
|             `-ElaboratedType 0x7f82af32edf0 'typename class allocator<char>::pointer' sugar
|               `-TypedefType 0x7f82af32c320 'std::__1::allocator<char>::pointer' sugar
|                 |-Typedef 0x7f82af32b728 'pointer'
|                 `-PointerType 0x7f82af32b6f0 'char *'
|                   `-SubstTemplateTypeParmType 0x7f82af32b6c0 'char' sugar
|                     |-TemplateTypeParmType 0x7f82af128d30 '_Tp' dependent depth 0 index 0
|                     | `-TemplateTypeParm 0x7f82af128ce8 '_Tp'
|                     `-BuiltinType 0x7f82af032b60 'char'
|-TypedefDecl 0x7f82af34ab20 <line:648:5, col:58> col:58 const_pointer 'typename __alloc_traits::const_pointer':'const char *'
| `-ElaboratedType 0x7f82af34aad0 'typename __alloc_traits::const_pointer' sugar
|   `-TypedefType 0x7f82af34aab0 'std::__1::allocator_traits<class std::__1::allocator<char> >::const_pointer' sugar
|     |-Typedef 0x7f82af3309b0 'const_pointer'
|     `-ElaboratedType 0x7f82af330960 'typename __const_pointer<value_type, pointer, allocator_type>::type' sugar
|       `-TypedefType 0x7f82af330940 'std::__1::__const_pointer<char, char *, class std::__1::allocator<char>, true>::type' sugar
|         |-Typedef 0x7f82af3308c0 'type'
|         `-ElaboratedType 0x7f82af330870 'typename class allocator<char>::const_pointer' sugar
|           `-TypedefType 0x7f82af32c570 'std::__1::allocator<char>::const_pointer' sugar
|             |-Typedef 0x7f82af32b7b8 'const_pointer'
|             `-PointerType 0x7f82af32b780 'const char *'
|               `-QualType 0x7f82af32b6c1 'const char' const
|                 `-SubstTemplateTypeParmType 0x7f82af32b6c0 'char' sugar
|                   |-TemplateTypeParmType 0x7f82af128d30 '_Tp' dependent depth 0 index 0
|                   | `-TemplateTypeParm 0x7f82af128ce8 '_Tp'
|                   `-BuiltinType 0x7f82af032b60 'char'
|-StaticAssertDecl 0x7f82af34ac80 <line:650:5, col:92> col:5
| |-DeclRefExpr 0x7f82af34ac30 <col:19, col:39> 'const _Bool':'const _Bool' lvalue Var 0x7f82af15b2b8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f82af233d68 <col:46> 'const char [45]' lvalue "Character type of basic_string must be a POD"
|-StaticAssertDecl 0x7f82af34aec0 <line:651:5, line:652:74> line:651:5
| |-ParenExpr 0x7f82af34ae88 <col:19, col:75> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7f82af34ae50 <col:20, col:70> 'const _Bool':'const _Bool' lvalue Var 0x7f82af15b2b8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f82af234030 <line:652:19> 'const char [54]' lvalue "traits_type::char_type must be the same type as CharT"
|-StaticAssertDecl 0x7f82af34b0d0 <line:653:5, line:654:74> line:653:5
| |-ParenExpr 0x7f82af34b098 <col:19, col:83> 'const _Bool':'const _Bool' lvalue
| | `-DeclRefExpr 0x7f82af34b060 <col:20, col:78> 'const _Bool':'const _Bool' lvalue Var 0x7f82af15b2b8 'value' 'const _Bool':'const _Bool'
| `-StringLiteral 0x7f82af234370 <line:654:19> 'const char [54]' lvalue "Allocator::value_type must be same type as value_type"
|-TypedefDecl 0x7f82af34b2c8 <line:659:5, col:58> col:58 iterator '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer>':'class std::__1::__wrap_iter<char *>'
| `-TemplateSpecializationType 0x7f82af34b250 '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
|   `-RecordType 0x7f82af34b230 'class std::__1::__wrap_iter<char *>'
|     `-ClassTemplateSpecialization 0x7f82af34b140 '__wrap_iter'
|-TypedefDecl 0x7f82af34b4d8 <line:660:5, col:58> col:58 const_iterator '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer>':'class std::__1::__wrap_iter<const char *>'
| `-TemplateSpecializationType 0x7f82af34b460 '__wrap_iter<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer>' sugar __wrap_iter
|   |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_pointer':'const char *'
|   `-RecordType 0x7f82af34b440 'class std::__1::__wrap_iter<const char *>'
|     `-ClassTemplateSpecialization 0x7f82af34b350 '__wrap_iter'
|-TypedefDecl 0x7f82af34b730 <line:662:5, col:59> col:59 reverse_iterator 'std::__1::reverse_iterator<iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<char *> >'
| `-ElaboratedType 0x7f82af34b6c0 'std::__1::reverse_iterator<iterator>' sugar
|   `-TemplateSpecializationType 0x7f82af34b670 'reverse_iterator<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::iterator':'class std::__1::__wrap_iter<char *>'
|     `-RecordType 0x7f82af34b650 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<char *> >'
|       `-ClassTemplateSpecialization 0x7f82af34b560 'reverse_iterator'
|-TypedefDecl 0x7f82af34b990 <line:663:5, col:59> col:59 const_reverse_iterator 'std::__1::reverse_iterator<const_iterator>':'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const char *> >'
| `-ElaboratedType 0x7f82af34b920 'std::__1::reverse_iterator<const_iterator>' sugar
|   `-TemplateSpecializationType 0x7f82af34b8d0 'reverse_iterator<std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator>' sugar reverse_iterator
|     |-TemplateArgument type 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::const_iterator':'class std::__1::__wrap_iter<const char *>'
|     `-RecordType 0x7f82af34b8b0 'class std::__1::reverse_iterator<class std::__1::__wrap_iter<const char *> >'
|       `-ClassTemplateSpecialization 0x7f82af34b7c0 'reverse_iterator'
|-AccessSpecDecl 0x7f82af34b9e8 <line:665:1, col:8> col:1 private
|-CXXRecordDecl 0x7f82af34ba10 <line:699:5, line:704:5> line:699:12 struct __long definition
| |-CXXRecordDecl 0x7f82af34be88 prev 0x7f82af34ba10 <col:5, col:12> col:12 implicit struct __long
| |-FieldDecl 0x7f82af34bf50 <line:701:9, col:19> col:19 referenced __cap_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-FieldDecl 0x7f82af34bfa8 <line:702:9, col:19> col:19 referenced __size_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
| |-FieldDecl 0x7f82af34c000 <line:703:9, col:19> col:19 referenced __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::pointer':'char *'
| |-CXXDestructorDecl 0x7f82b02c16e8 <line:699:12> col:12 implicit ~__long 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7f82b05d4be8 <col:12> col:12 implicit constexpr __long 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &)' inline default trivial noexcept-unevaluated 0x7f82b05d4be8
| | `-ParmVarDecl 0x7f82b05d4d10 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &'
| |-CXXConstructorDecl 0x7f82b05d4da8 <col:12> col:12 implicit constexpr __long 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &&) noexcept' inline default trivial
| | `-ParmVarDecl 0x7f82b05d4ed0 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long &&'
| `-CXXConstructorDecl 0x7f82b05d67c8 <col:12> col:12 implicit __long 'void (void) noexcept' inline default trivial
|-EnumDecl 0x7f82af34bae0 <line:710:5> col:5
| `-EnumConstantDecl 0x7f82af34bbb0 <col:11, col:26> col:11 referenced __short_mask 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:710:5)'
|   `-ImplicitCastExpr 0x7f82af34bc00 <col:26> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7f82af234f30 <col:26> 'int' 1
|-EnumDecl 0x7f82af34bc18 <line:711:5> col:5
| `-EnumConstantDecl 0x7f82af34bce0 <col:11, col:26> col:11 referenced __long_mask 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:711:5)'
|   `-ImplicitCastExpr 0x7f82af34bd30 <col:26> 'unsigned int' <IntegralCast>
|     `-IntegerLiteral 0x7f82af235060 <col:26> 'unsigned long' 1
|-EnumDecl 0x7f82af34bd48 <line:714:5> col:5
| `-EnumConstantDecl 0x7f82af34c380 <col:11, line:715:65> line:714:11 referenced __min_cap 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:714:5)'
|   `-ImplicitCastExpr 0x7f82af34c3d0 <col:23, line:715:65> 'unsigned int' <IntegralCast>
|     `-ConditionalOperator 0x7f82af34c280 <line:714:23, line:715:65> 'unsigned long'
|       |-BinaryOperator 0x7f82af34c158 <line:714:23, col:65> '_Bool' '>'
|       | |-BinaryOperator 0x7f82af34c118 <col:23, col:61> 'unsigned long' '/'
|       | | |-ParenExpr 0x7f82af34c0c8 <col:23, col:42> 'unsigned long'
|       | | | `-BinaryOperator 0x7f82af34c0a0 <col:24, col:41> 'unsigned long' '-'
|       | | |   |-UnaryExprOrTypeTraitExpr 0x7f82af34c068 <col:24, col:37> 'unsigned long' sizeof 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|       | | |   `-ImplicitCastExpr 0x7f82af34c088 <col:41> 'unsigned long' <IntegralCast>
|       | | |     `-IntegerLiteral 0x7f82af2351c0 <col:41> 'int' 1
|       | | `-UnaryExprOrTypeTraitExpr 0x7f82af34c0f8 <col:44, col:61> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|       | `-ImplicitCastExpr 0x7f82af34c140 <col:65> 'unsigned long' <IntegralCast>
|       |   `-IntegerLiteral 0x7f82af235298 <col:65> 'int' 2
|       |-BinaryOperator 0x7f82af34c240 <line:715:23, col:61> 'unsigned long' '/'
|       | |-ParenExpr 0x7f82af34c1f0 <col:23, col:42> 'unsigned long'
|       | | `-BinaryOperator 0x7f82af34c1c8 <col:24, col:41> 'unsigned long' '-'
|       | |   |-UnaryExprOrTypeTraitExpr 0x7f82af34c190 <col:24, col:37> 'unsigned long' sizeof 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
|       | |   `-ImplicitCastExpr 0x7f82af34c1b0 <col:41> 'unsigned long' <IntegralCast>
|       | |     `-IntegerLiteral 0x7f82af235328 <col:41> 'int' 1
|       | `-UnaryExprOrTypeTraitExpr 0x7f82af34c220 <col:44, col:61> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
|       `-ImplicitCastExpr 0x7f82af34c268 <col:65> 'unsigned long' <IntegralCast>
|         `-IntegerLiteral 0x7f82af235400 <col:65> 'int' 2
|-CXXRecordDecl 0x7f82af34c3e8 <line:717:5, line:725:5> line:717:12 struct __short definition
| |-CXXRecordDecl 0x7f82af34c830 prev 0x7f82af34c3e8 <col:5, col:12> col:12 implicit struct __short
| |-CXXRecordDecl 0x7f82af34c8c8 <line:719:9, line:723:9> line:719:9 union definition
| | |-FieldDecl 0x7f82af34e668 <line:721:13, col:27> col:27 referenced __size_ 'unsigned char'
| | |-FieldDecl 0x7f82af34e6c0 <line:722:13, col:24> col:24 __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| | |-CXXDestructorDecl 0x7f82b02c1a68 <line:719:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| | |-CXXConstructorDecl 0x7f82b05d4fd8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &)' inline default trivial noexcept-unevaluated 0x7f82b05d4fd8
| | | `-ParmVarDecl 0x7f82b05d5100 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &'
| | |-CXXConstructorDecl 0x7f82b05d5198 <col:9> col:9 implicit constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&) noexcept' inline default trivial
| | | `-ParmVarDecl 0x7f82b05d52c0 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9) &&'
| | `-CXXConstructorDecl 0x7f82b05d6b48 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial
| |-FieldDecl 0x7f82af34e728 <col:9> col:9 implicit referenced 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| |-IndirectFieldDecl 0x7f82af34e780 <line:721:27> col:27 implicit __size_ 'unsigned char'
| | |-Field 0x7f82af34e728 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| | `-Field 0x7f82af34e668 '__size_' 'unsigned char'
| |-IndirectFieldDecl 0x7f82af34e7d0 <line:722:24> col:24 implicit __lx 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| | |-Field 0x7f82af34e728 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:719:9)'
| | `-Field 0x7f82af34e6c0 '__lx' 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type':'char'
| |-FieldDecl 0x7f82af34e898 <line:724:9, col:37> col:20 referenced __data_ 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::value_type [23]'
| |-CXXDestructorDecl 0x7f82b02c17c8 <line:717:12> col:12 implicit ~__short 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7f82b05d5328 <col:12> col:12 implicit constexpr __short 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &)' inline default trivial noexcept-unevaluated 0x7f82b05d5328
| | `-ParmVarDecl 0x7f82b05d5450 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &'
| |-CXXConstructorDecl 0x7f82b05d54e8 <col:12> col:12 implicit constexpr __short 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &&) noexcept' inline default trivial
| | `-ParmVarDecl 0x7f82b05d5610 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short &&'
| `-CXXConstructorDecl 0x7f82b05d68a8 <col:12> col:12 implicit __short 'void (void) noexcept' inline default trivial
|-CXXRecordDecl 0x7f82af34c4b0 <line:729:5, col:44> col:11 union __ulx definition
| |-CXXRecordDecl 0x7f82af34c6c8 prev 0x7f82af34c4b0 <col:5, col:11> col:11 implicit union __ulx
| |-FieldDecl 0x7f82af34c770 <col:17, col:24> col:24 __lx 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| `-FieldDecl 0x7f82af34e900 <col:30, col:38> col:38 __lxx 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
|-EnumDecl 0x7f82af34c580 <line:731:5> col:5
| `-EnumConstantDecl 0x7f82af34ec38 <col:11, col:55> col:11 referenced __n_words 'enum std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:731:5)'
|   `-ImplicitCastExpr 0x7f82af34ec88 <col:23, col:55> 'unsigned int' <IntegralCast>
|     `-BinaryOperator 0x7f82af34e9b8 <col:23, col:55> 'unsigned long' '/'
|       |-UnaryExprOrTypeTraitExpr 0x7f82af34e968 <col:23, col:35> 'unsigned long' sizeof 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__ulx'
|       `-UnaryExprOrTypeTraitExpr 0x7f82af34e998 <col:39, col:55> 'unsigned long' sizeof 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'unsigned long'
|-CXXRecordDecl 0x7f82af34eca0 <line:733:5, line:736:5> line:733:12 struct __raw definition
| |-CXXRecordDecl 0x7f82af3513a0 prev 0x7f82af34eca0 <col:5, col:12> col:12 implicit struct __raw
| |-FieldDecl 0x7f82af3514f8 <line:735:9, col:36> col:19 referenced __words 'std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type [3]'
| |-CXXDestructorDecl 0x7f82b02c18a8 <line:733:12> col:12 implicit ~__raw 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7f82b05d56c8 <col:12> col:12 implicit constexpr __raw 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &)' inline default trivial noexcept-unevaluated 0x7f82b05d56c8
| | `-ParmVarDecl 0x7f82b05d57f0 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &'
| |-CXXConstructorDecl 0x7f82b05d5888 <col:12> col:12 implicit constexpr __raw 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &&) noexcept' inline default trivial
| | `-ParmVarDecl 0x7f82b05d59b0 <col:12> col:12 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw &&'
| `-CXXConstructorDecl 0x7f82b05d6988 <col:12> col:12 implicit __raw 'void (void) noexcept' inline default trivial
|-CXXRecordDecl 0x7f82af34ed70 <line:738:5, line:746:5> line:738:12 struct __rep definition
| |-CXXRecordDecl 0x7f82af351060 prev 0x7f82af34ed70 <col:5, col:12> col:12 implicit struct __rep
| |-CXXRecordDecl 0x7f82af3510f8 <line:740:9, line:745:9> line:740:9 union definition
| | |-FieldDecl 0x7f82af351288 <line:742:13, col:21> col:21 referenced __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| | |-FieldDecl 0x7f82af3512e0 <line:743:13, col:21> col:21 referenced __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| | |-FieldDecl 0x7f82af351560 <line:744:13, col:21> col:21 referenced __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| | |-CXXDestructorDecl 0x7f82b02c1988 <line:740:9> col:9 implicit ~ 'void (void) noexcept' inline default trivial
| | |-CXXConstructorDecl 0x7f82b05d46b8 <col:9> col:9 implicit constexpr  'void (const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &)' inline default trivial noexcept-unevaluated 0x7f82b05d46b8
| | | `-ParmVarDecl 0x7f82b05d47e0 <col:9> col:9 'const union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &'
| | |-CXXConstructorDecl 0x7f82b05d4878 <col:9> col:9 implicit used constexpr  'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept' inline default trivial
| | | |-ParmVarDecl 0x7f82b05d49a0 <col:9> col:9 'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&'
| | | `-CompoundStmt 0x7f82b05e82d0 <col:9>
| | `-CXXConstructorDecl 0x7f82b05d6a68 <col:9> col:9 implicit  'void (void) noexcept' inline default trivial
| |-FieldDecl 0x7f82af3515c8 <col:9> col:9 implicit referenced 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| |-IndirectFieldDecl 0x7f82af351620 <line:742:21> col:21 implicit __l 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| | |-Field 0x7f82af3515c8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | `-Field 0x7f82af351288 '__l' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__long'
| |-IndirectFieldDecl 0x7f82af351670 <line:743:21> col:21 implicit __s 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| | |-Field 0x7f82af3515c8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | `-Field 0x7f82af3512e0 '__s' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__short'
| |-IndirectFieldDecl 0x7f82af3516c0 <line:744:21> col:21 implicit __r 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| | |-Field 0x7f82af3515c8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | `-Field 0x7f82af351560 '__r' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__raw'
| |-CXXDestructorDecl 0x7f82b02c1608 <line:738:12> col:12 implicit ~__rep 'void (void) noexcept' inline default trivial
| |-CXXConstructorDecl 0x7f82b05d4a08 <col:12> col:12 implicit constexpr __rep 'void (const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &)' inline default trivial noexcept-unevaluated 0x7f82b05d4a08
| | `-ParmVarDecl 0x7f82b05d4b30 <col:12> col:12 'const struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &'
| |-CXXConstructorDecl 0x7f82b05d5a48 <col:12> col:12 implicit used constexpr __rep 'void (struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&) noexcept' inline default trivial
| | |-ParmVarDecl 0x7f82b05d5b70 <col:12> col:12 used 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&'
| | |-CXXCtorInitializer Field 0x7f82af3515c8 '' 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)'
| | | `-CXXConstructExpr 0x7f82b05e82e8 <col:12> 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)' 'void (union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9) &&) noexcept'
| | |   `-MemberExpr 0x7f82b05e8298 <col:12> 'union (anonymous union at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)':'union std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep::(anonymous at /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:740:9)' xvalue . 0x7f82af3515c8
| | |     `-CXXStaticCastExpr 0x7f82b05e8268 <col:12> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' xvalue static_cast<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&> <NoOp>
| | |       `-DeclRefExpr 0x7f82b05e8230 <col:12> 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep' lvalue ParmVar 0x7f82b05d5b70 '' 'struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep &&'
| | `-CompoundStmt 0x7f82b05e8350 <col:12>
| `-CXXConstructorDecl 0x7f82b05d66e0 <col:12> col:12 implicit referenced __rep 'void (void) noexcept' inline default trivial
|-FieldDecl 0x7f82af35a210 <line:748:5, col:46> col:46 referenced __r_ '__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::allocator_type>':'class std::__1::__compressed_pair<struct std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::__rep, class std::__1::allocator<char> >'
|-AccessSpecDecl 0x7f82af35a258 <line:750:1, col:7> col:1 public
|-VarDecl 0x7f82af35a290 <line:751:5, col:36> col:28 npos 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'const unsigned long' static cinit
| `-ImplicitCastExpr 0x7f82af35a300 <col:35, col:36> 'const std::__1::basic_string<char, struct std::__1::char_traits<char>, class std::__1::allocator<char> >::size_type':'const unsigned long' <IntegralCast>
|   `-UnaryOperator 0x7f82af236a10 <col:35, col:36> 'int' prefix '-'
|     `-IntegerLiteral 0x7f82af2369f0 <col:36> 'int' 1
|-CXXConstructorDecl 0x7f82af35a3d8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:35, line:739:35> /usr/local/Cellar/llvm/5.0.0/include/c++/v1/string:753:31 referenced basic_string 'void (void) noexcept(is_nothrow_default_constructible<allocator_type>::value)'
| `-AlwaysInlineAttr 0x7f82af35a4f8 </usr/local/Cellar/llvm/5.0.0/include/c++/v1/__config:709:77> always_inline
